#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Alcove_corner_small_banister_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function alcove_corner_small_banister_BP.alcove_corner_small_banister_BP_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct Alcove_corner_small_banister_BP_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B48[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B49[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Alcove_corner_small_banister_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Alcove_corner_small_banister_BP_C_UserConstructionScript");
static_assert(sizeof(Alcove_corner_small_banister_BP_C_UserConstructionScript) == 0x000028, "Wrong size on Alcove_corner_small_banister_BP_C_UserConstructionScript");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x000000, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000008, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000010, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000011, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1) == 0x000014, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000020, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_3) == 0x000021, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Alcove_corner_small_banister_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_4) == 0x000022, "Member 'Alcove_corner_small_banister_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");

}

