#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Alcove_corner_gardens_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function alcove_corner_gardens_BP.alcove_corner_gardens_BP_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct Alcove_corner_gardens_BP_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue_2; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C9[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_2;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_5;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_6;              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_7;              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39CA[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_3;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_8;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Alcove_corner_gardens_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Alcove_corner_gardens_BP_C_UserConstructionScript");
static_assert(sizeof(Alcove_corner_gardens_BP_C_UserConstructionScript) == 0x000048, "Wrong size on Alcove_corner_gardens_BP_C_UserConstructionScript");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x000000, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000008, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000010, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000011, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000012, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_3) == 0x000013, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1) == 0x000014, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue_2) == 0x000018, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000028, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_4) == 0x000030, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_5) == 0x000031, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_6) == 0x000032, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_7) == 0x000033, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_3) == 0x000038, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Alcove_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_8) == 0x000040, "Member 'Alcove_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_8' has a wrong offset!");

}

