#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimGraphRuntime

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimGraphRuntime.BlendSpaceLibrary.ConvertToBlendSpace
// 0x0028 (0x0028 - 0x0000)
struct BlendSpaceLibrary_ConvertToBlendSpace final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1314[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpaceReference                   ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpaceLibrary_ConvertToBlendSpace) == 0x000008, "Wrong alignment on BlendSpaceLibrary_ConvertToBlendSpace");
static_assert(sizeof(BlendSpaceLibrary_ConvertToBlendSpace) == 0x000028, "Wrong size on BlendSpaceLibrary_ConvertToBlendSpace");
static_assert(offsetof(BlendSpaceLibrary_ConvertToBlendSpace, Node) == 0x000000, "Member 'BlendSpaceLibrary_ConvertToBlendSpace::Node' has a wrong offset!");
static_assert(offsetof(BlendSpaceLibrary_ConvertToBlendSpace, Result) == 0x000010, "Member 'BlendSpaceLibrary_ConvertToBlendSpace::Result' has a wrong offset!");
static_assert(offsetof(BlendSpaceLibrary_ConvertToBlendSpace, ReturnValue) == 0x000018, "Member 'BlendSpaceLibrary_ConvertToBlendSpace::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpaceLibrary.ConvertToBlendSpacePure
// 0x0028 (0x0028 - 0x0000)
struct BlendSpaceLibrary_ConvertToBlendSpacePure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FBlendSpaceReference                   BlendSpace;                                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1315[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlendSpaceLibrary_ConvertToBlendSpacePure) == 0x000008, "Wrong alignment on BlendSpaceLibrary_ConvertToBlendSpacePure");
static_assert(sizeof(BlendSpaceLibrary_ConvertToBlendSpacePure) == 0x000028, "Wrong size on BlendSpaceLibrary_ConvertToBlendSpacePure");
static_assert(offsetof(BlendSpaceLibrary_ConvertToBlendSpacePure, Node) == 0x000000, "Member 'BlendSpaceLibrary_ConvertToBlendSpacePure::Node' has a wrong offset!");
static_assert(offsetof(BlendSpaceLibrary_ConvertToBlendSpacePure, BlendSpace) == 0x000010, "Member 'BlendSpaceLibrary_ConvertToBlendSpacePure::BlendSpace' has a wrong offset!");
static_assert(offsetof(BlendSpaceLibrary_ConvertToBlendSpacePure, Result) == 0x000020, "Member 'BlendSpaceLibrary_ConvertToBlendSpacePure::Result' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpaceLibrary.GetFilteredPosition
// 0x0028 (0x0028 - 0x0000)
struct BlendSpaceLibrary_GetFilteredPosition final
{
public:
	struct FBlendSpaceReference                   BlendSpace;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpaceLibrary_GetFilteredPosition) == 0x000008, "Wrong alignment on BlendSpaceLibrary_GetFilteredPosition");
static_assert(sizeof(BlendSpaceLibrary_GetFilteredPosition) == 0x000028, "Wrong size on BlendSpaceLibrary_GetFilteredPosition");
static_assert(offsetof(BlendSpaceLibrary_GetFilteredPosition, BlendSpace) == 0x000000, "Member 'BlendSpaceLibrary_GetFilteredPosition::BlendSpace' has a wrong offset!");
static_assert(offsetof(BlendSpaceLibrary_GetFilteredPosition, ReturnValue) == 0x000010, "Member 'BlendSpaceLibrary_GetFilteredPosition::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpaceLibrary.GetPosition
// 0x0028 (0x0028 - 0x0000)
struct BlendSpaceLibrary_GetPosition final
{
public:
	struct FBlendSpaceReference                   BlendSpace;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpaceLibrary_GetPosition) == 0x000008, "Wrong alignment on BlendSpaceLibrary_GetPosition");
static_assert(sizeof(BlendSpaceLibrary_GetPosition) == 0x000028, "Wrong size on BlendSpaceLibrary_GetPosition");
static_assert(offsetof(BlendSpaceLibrary_GetPosition, BlendSpace) == 0x000000, "Member 'BlendSpaceLibrary_GetPosition::BlendSpace' has a wrong offset!");
static_assert(offsetof(BlendSpaceLibrary_GetPosition, ReturnValue) == 0x000010, "Member 'BlendSpaceLibrary_GetPosition::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpaceLibrary.SnapToPosition
// 0x0028 (0x0028 - 0x0000)
struct BlendSpaceLibrary_SnapToPosition final
{
public:
	struct FBlendSpaceReference                   BlendSpace;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                NewPosition;                                       // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpaceLibrary_SnapToPosition) == 0x000008, "Wrong alignment on BlendSpaceLibrary_SnapToPosition");
static_assert(sizeof(BlendSpaceLibrary_SnapToPosition) == 0x000028, "Wrong size on BlendSpaceLibrary_SnapToPosition");
static_assert(offsetof(BlendSpaceLibrary_SnapToPosition, BlendSpace) == 0x000000, "Member 'BlendSpaceLibrary_SnapToPosition::BlendSpace' has a wrong offset!");
static_assert(offsetof(BlendSpaceLibrary_SnapToPosition, NewPosition) == 0x000010, "Member 'BlendSpaceLibrary_SnapToPosition::NewPosition' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.ConvertToAnimationStateMachine
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_ConvertToAnimationStateMachine final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimationStateMachineReference        AnimationState;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1316[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationStateMachineLibrary_ConvertToAnimationStateMachine) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_ConvertToAnimationStateMachine");
static_assert(sizeof(AnimationStateMachineLibrary_ConvertToAnimationStateMachine) == 0x000028, "Wrong size on AnimationStateMachineLibrary_ConvertToAnimationStateMachine");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateMachine, Node) == 0x000000, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateMachine::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateMachine, AnimationState) == 0x000010, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateMachine::AnimationState' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateMachine, Result) == 0x000020, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateMachine::Result' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.ConvertToAnimationStateMachinePure
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimationStateMachineReference        AnimationState;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1317[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure");
static_assert(sizeof(AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure) == 0x000028, "Wrong size on AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure, Node) == 0x000000, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure, AnimationState) == 0x000010, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure::AnimationState' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure, Result) == 0x000020, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateMachinePure::Result' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.ConvertToAnimationStateResult
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_ConvertToAnimationStateResult final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimationStateResultReference         AnimationState;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1318[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationStateMachineLibrary_ConvertToAnimationStateResult) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_ConvertToAnimationStateResult");
static_assert(sizeof(AnimationStateMachineLibrary_ConvertToAnimationStateResult) == 0x000028, "Wrong size on AnimationStateMachineLibrary_ConvertToAnimationStateResult");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateResult, Node) == 0x000000, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateResult::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateResult, AnimationState) == 0x000010, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateResult::AnimationState' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateResult, Result) == 0x000020, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateResult::Result' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.ConvertToAnimationStateResultPure
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_ConvertToAnimationStateResultPure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimationStateResultReference         AnimationState;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1319[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationStateMachineLibrary_ConvertToAnimationStateResultPure) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_ConvertToAnimationStateResultPure");
static_assert(sizeof(AnimationStateMachineLibrary_ConvertToAnimationStateResultPure) == 0x000028, "Wrong size on AnimationStateMachineLibrary_ConvertToAnimationStateResultPure");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateResultPure, Node) == 0x000000, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateResultPure::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateResultPure, AnimationState) == 0x000010, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateResultPure::AnimationState' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_ConvertToAnimationStateResultPure, Result) == 0x000020, "Member 'AnimationStateMachineLibrary_ConvertToAnimationStateResultPure::Result' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.GetRelevantAnimTimeRemaining
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimationStateResultReference         Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131A[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining");
static_assert(sizeof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining) == 0x000028, "Wrong size on AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining");
static_assert(offsetof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining, UpdateContext) == 0x000000, "Member 'AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining::UpdateContext' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining, Node) == 0x000010, "Member 'AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining, ReturnValue) == 0x000020, "Member 'AnimationStateMachineLibrary_GetRelevantAnimTimeRemaining::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.GetRelevantAnimTimeRemainingFraction
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimationStateResultReference         Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131B[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction");
static_assert(sizeof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction) == 0x000028, "Wrong size on AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction");
static_assert(offsetof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction, UpdateContext) == 0x000000, "Member 'AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction::UpdateContext' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction, Node) == 0x000010, "Member 'AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction, ReturnValue) == 0x000020, "Member 'AnimationStateMachineLibrary_GetRelevantAnimTimeRemainingFraction::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.GetState
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_GetState final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimationStateMachineReference        Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimationStateMachineLibrary_GetState) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_GetState");
static_assert(sizeof(AnimationStateMachineLibrary_GetState) == 0x000028, "Wrong size on AnimationStateMachineLibrary_GetState");
static_assert(offsetof(AnimationStateMachineLibrary_GetState, UpdateContext) == 0x000000, "Member 'AnimationStateMachineLibrary_GetState::UpdateContext' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_GetState, Node) == 0x000010, "Member 'AnimationStateMachineLibrary_GetState::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_GetState, ReturnValue) == 0x000020, "Member 'AnimationStateMachineLibrary_GetState::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.IsStateBlendingIn
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_IsStateBlendingIn final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimationStateResultReference         Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131C[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationStateMachineLibrary_IsStateBlendingIn) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_IsStateBlendingIn");
static_assert(sizeof(AnimationStateMachineLibrary_IsStateBlendingIn) == 0x000028, "Wrong size on AnimationStateMachineLibrary_IsStateBlendingIn");
static_assert(offsetof(AnimationStateMachineLibrary_IsStateBlendingIn, UpdateContext) == 0x000000, "Member 'AnimationStateMachineLibrary_IsStateBlendingIn::UpdateContext' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_IsStateBlendingIn, Node) == 0x000010, "Member 'AnimationStateMachineLibrary_IsStateBlendingIn::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_IsStateBlendingIn, ReturnValue) == 0x000020, "Member 'AnimationStateMachineLibrary_IsStateBlendingIn::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.IsStateBlendingOut
// 0x0028 (0x0028 - 0x0000)
struct AnimationStateMachineLibrary_IsStateBlendingOut final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimationStateResultReference         Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131D[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationStateMachineLibrary_IsStateBlendingOut) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_IsStateBlendingOut");
static_assert(sizeof(AnimationStateMachineLibrary_IsStateBlendingOut) == 0x000028, "Wrong size on AnimationStateMachineLibrary_IsStateBlendingOut");
static_assert(offsetof(AnimationStateMachineLibrary_IsStateBlendingOut, UpdateContext) == 0x000000, "Member 'AnimationStateMachineLibrary_IsStateBlendingOut::UpdateContext' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_IsStateBlendingOut, Node) == 0x000010, "Member 'AnimationStateMachineLibrary_IsStateBlendingOut::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_IsStateBlendingOut, ReturnValue) == 0x000020, "Member 'AnimationStateMachineLibrary_IsStateBlendingOut::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimationStateMachineLibrary.SetState
// 0x0048 (0x0048 - 0x0000)
struct AnimationStateMachineLibrary_SetState final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimationStateMachineReference        Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   TargetState;                                       // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETransitionLogicType                          BlendType;                                         // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131E[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          BlendProfile;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlphaBlendOption                             AlphaBlendOption;                                  // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131F[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CustomBlendCurve;                                  // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimationStateMachineLibrary_SetState) == 0x000008, "Wrong alignment on AnimationStateMachineLibrary_SetState");
static_assert(sizeof(AnimationStateMachineLibrary_SetState) == 0x000048, "Wrong size on AnimationStateMachineLibrary_SetState");
static_assert(offsetof(AnimationStateMachineLibrary_SetState, UpdateContext) == 0x000000, "Member 'AnimationStateMachineLibrary_SetState::UpdateContext' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_SetState, Node) == 0x000010, "Member 'AnimationStateMachineLibrary_SetState::Node' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_SetState, TargetState) == 0x000020, "Member 'AnimationStateMachineLibrary_SetState::TargetState' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_SetState, Duration) == 0x000028, "Member 'AnimationStateMachineLibrary_SetState::Duration' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_SetState, BlendType) == 0x00002C, "Member 'AnimationStateMachineLibrary_SetState::BlendType' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_SetState, BlendProfile) == 0x000030, "Member 'AnimationStateMachineLibrary_SetState::BlendProfile' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_SetState, AlphaBlendOption) == 0x000038, "Member 'AnimationStateMachineLibrary_SetState::AlphaBlendOption' has a wrong offset!");
static_assert(offsetof(AnimationStateMachineLibrary_SetState, CustomBlendCurve) == 0x000040, "Member 'AnimationStateMachineLibrary_SetState::CustomBlendCurve' has a wrong offset!");

// Function AnimGraphRuntime.AnimExecutionContextLibrary.ConvertToComponentSpacePoseContext
// 0x0028 (0x0028 - 0x0000)
struct AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext final
{
public:
	struct FAnimExecutionContext                  Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EAnimExecutionContextConversionResult         Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1320[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimComponentSpacePoseContext         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext) == 0x000008, "Wrong alignment on AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext");
static_assert(sizeof(AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext) == 0x000028, "Wrong size on AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext, Context) == 0x000000, "Member 'AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext::Context' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext, Result) == 0x000010, "Member 'AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext::Result' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext, ReturnValue) == 0x000018, "Member 'AnimExecutionContextLibrary_ConvertToComponentSpacePoseContext::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimExecutionContextLibrary.ConvertToInitializationContext
// 0x0028 (0x0028 - 0x0000)
struct AnimExecutionContextLibrary_ConvertToInitializationContext final
{
public:
	struct FAnimExecutionContext                  Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EAnimExecutionContextConversionResult         Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1321[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimInitializationContext             ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimExecutionContextLibrary_ConvertToInitializationContext) == 0x000008, "Wrong alignment on AnimExecutionContextLibrary_ConvertToInitializationContext");
static_assert(sizeof(AnimExecutionContextLibrary_ConvertToInitializationContext) == 0x000028, "Wrong size on AnimExecutionContextLibrary_ConvertToInitializationContext");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToInitializationContext, Context) == 0x000000, "Member 'AnimExecutionContextLibrary_ConvertToInitializationContext::Context' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToInitializationContext, Result) == 0x000010, "Member 'AnimExecutionContextLibrary_ConvertToInitializationContext::Result' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToInitializationContext, ReturnValue) == 0x000018, "Member 'AnimExecutionContextLibrary_ConvertToInitializationContext::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimExecutionContextLibrary.ConvertToPoseContext
// 0x0028 (0x0028 - 0x0000)
struct AnimExecutionContextLibrary_ConvertToPoseContext final
{
public:
	struct FAnimExecutionContext                  Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EAnimExecutionContextConversionResult         Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1322[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPoseContext                       ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimExecutionContextLibrary_ConvertToPoseContext) == 0x000008, "Wrong alignment on AnimExecutionContextLibrary_ConvertToPoseContext");
static_assert(sizeof(AnimExecutionContextLibrary_ConvertToPoseContext) == 0x000028, "Wrong size on AnimExecutionContextLibrary_ConvertToPoseContext");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToPoseContext, Context) == 0x000000, "Member 'AnimExecutionContextLibrary_ConvertToPoseContext::Context' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToPoseContext, Result) == 0x000010, "Member 'AnimExecutionContextLibrary_ConvertToPoseContext::Result' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToPoseContext, ReturnValue) == 0x000018, "Member 'AnimExecutionContextLibrary_ConvertToPoseContext::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimExecutionContextLibrary.ConvertToUpdateContext
// 0x0028 (0x0028 - 0x0000)
struct AnimExecutionContextLibrary_ConvertToUpdateContext final
{
public:
	struct FAnimExecutionContext                  Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EAnimExecutionContextConversionResult         Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1323[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimUpdateContext                     ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimExecutionContextLibrary_ConvertToUpdateContext) == 0x000008, "Wrong alignment on AnimExecutionContextLibrary_ConvertToUpdateContext");
static_assert(sizeof(AnimExecutionContextLibrary_ConvertToUpdateContext) == 0x000028, "Wrong size on AnimExecutionContextLibrary_ConvertToUpdateContext");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToUpdateContext, Context) == 0x000000, "Member 'AnimExecutionContextLibrary_ConvertToUpdateContext::Context' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToUpdateContext, Result) == 0x000010, "Member 'AnimExecutionContextLibrary_ConvertToUpdateContext::Result' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_ConvertToUpdateContext, ReturnValue) == 0x000018, "Member 'AnimExecutionContextLibrary_ConvertToUpdateContext::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimExecutionContextLibrary.GetAnimInstance
// 0x0018 (0x0018 - 0x0000)
struct AnimExecutionContextLibrary_GetAnimInstance final
{
public:
	struct FAnimExecutionContext                  Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAnimInstance*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimExecutionContextLibrary_GetAnimInstance) == 0x000008, "Wrong alignment on AnimExecutionContextLibrary_GetAnimInstance");
static_assert(sizeof(AnimExecutionContextLibrary_GetAnimInstance) == 0x000018, "Wrong size on AnimExecutionContextLibrary_GetAnimInstance");
static_assert(offsetof(AnimExecutionContextLibrary_GetAnimInstance, Context) == 0x000000, "Member 'AnimExecutionContextLibrary_GetAnimInstance::Context' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_GetAnimInstance, ReturnValue) == 0x000010, "Member 'AnimExecutionContextLibrary_GetAnimInstance::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimExecutionContextLibrary.GetAnimNodeReference
// 0x0020 (0x0020 - 0x0000)
struct AnimExecutionContextLibrary_GetAnimNodeReference final
{
public:
	class UAnimInstance*                          Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1324[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeReference                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimExecutionContextLibrary_GetAnimNodeReference) == 0x000008, "Wrong alignment on AnimExecutionContextLibrary_GetAnimNodeReference");
static_assert(sizeof(AnimExecutionContextLibrary_GetAnimNodeReference) == 0x000020, "Wrong size on AnimExecutionContextLibrary_GetAnimNodeReference");
static_assert(offsetof(AnimExecutionContextLibrary_GetAnimNodeReference, Instance) == 0x000000, "Member 'AnimExecutionContextLibrary_GetAnimNodeReference::Instance' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_GetAnimNodeReference, Param_Index) == 0x000008, "Member 'AnimExecutionContextLibrary_GetAnimNodeReference::Param_Index' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_GetAnimNodeReference, ReturnValue) == 0x000010, "Member 'AnimExecutionContextLibrary_GetAnimNodeReference::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimExecutionContextLibrary.GetCurrentWeight
// 0x0018 (0x0018 - 0x0000)
struct AnimExecutionContextLibrary_GetCurrentWeight final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1325[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimExecutionContextLibrary_GetCurrentWeight) == 0x000008, "Wrong alignment on AnimExecutionContextLibrary_GetCurrentWeight");
static_assert(sizeof(AnimExecutionContextLibrary_GetCurrentWeight) == 0x000018, "Wrong size on AnimExecutionContextLibrary_GetCurrentWeight");
static_assert(offsetof(AnimExecutionContextLibrary_GetCurrentWeight, Context) == 0x000000, "Member 'AnimExecutionContextLibrary_GetCurrentWeight::Context' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_GetCurrentWeight, ReturnValue) == 0x000010, "Member 'AnimExecutionContextLibrary_GetCurrentWeight::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.AnimExecutionContextLibrary.GetDeltaTime
// 0x0018 (0x0018 - 0x0000)
struct AnimExecutionContextLibrary_GetDeltaTime final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1326[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimExecutionContextLibrary_GetDeltaTime) == 0x000008, "Wrong alignment on AnimExecutionContextLibrary_GetDeltaTime");
static_assert(sizeof(AnimExecutionContextLibrary_GetDeltaTime) == 0x000018, "Wrong size on AnimExecutionContextLibrary_GetDeltaTime");
static_assert(offsetof(AnimExecutionContextLibrary_GetDeltaTime, Context) == 0x000000, "Member 'AnimExecutionContextLibrary_GetDeltaTime::Context' has a wrong offset!");
static_assert(offsetof(AnimExecutionContextLibrary_GetDeltaTime, ReturnValue) == 0x000010, "Member 'AnimExecutionContextLibrary_GetDeltaTime::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.ConvertToBlendSpacePlayer
// 0x0028 (0x0028 - 0x0000)
struct BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1327[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReference             ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer");
static_assert(sizeof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer) == 0x000028, "Wrong size on BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer");
static_assert(offsetof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer, Node) == 0x000000, "Member 'BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer::Node' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer, Result) == 0x000010, "Member 'BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer::Result' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer, ReturnValue) == 0x000018, "Member 'BlendSpacePlayerLibrary_ConvertToBlendSpacePlayer::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.ConvertToBlendSpacePlayerPure
// 0x0028 (0x0028 - 0x0000)
struct BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1328[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure");
static_assert(sizeof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure) == 0x000028, "Wrong size on BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure");
static_assert(offsetof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure, Node) == 0x000000, "Member 'BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure::Node' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure, BlendSpacePlayer) == 0x000010, "Member 'BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure, Result) == 0x000020, "Member 'BlendSpacePlayerLibrary_ConvertToBlendSpacePlayerPure::Result' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.GetBlendSpace
// 0x0018 (0x0018 - 0x0000)
struct BlendSpacePlayerLibrary_GetBlendSpace final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UBlendSpace*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpacePlayerLibrary_GetBlendSpace) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_GetBlendSpace");
static_assert(sizeof(BlendSpacePlayerLibrary_GetBlendSpace) == 0x000018, "Wrong size on BlendSpacePlayerLibrary_GetBlendSpace");
static_assert(offsetof(BlendSpacePlayerLibrary_GetBlendSpace, BlendSpacePlayer) == 0x000000, "Member 'BlendSpacePlayerLibrary_GetBlendSpace::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_GetBlendSpace, ReturnValue) == 0x000010, "Member 'BlendSpacePlayerLibrary_GetBlendSpace::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.GetLoop
// 0x0018 (0x0018 - 0x0000)
struct BlendSpacePlayerLibrary_GetLoop final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1329[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlendSpacePlayerLibrary_GetLoop) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_GetLoop");
static_assert(sizeof(BlendSpacePlayerLibrary_GetLoop) == 0x000018, "Wrong size on BlendSpacePlayerLibrary_GetLoop");
static_assert(offsetof(BlendSpacePlayerLibrary_GetLoop, BlendSpacePlayer) == 0x000000, "Member 'BlendSpacePlayerLibrary_GetLoop::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_GetLoop, ReturnValue) == 0x000010, "Member 'BlendSpacePlayerLibrary_GetLoop::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.GetPlayRate
// 0x0018 (0x0018 - 0x0000)
struct BlendSpacePlayerLibrary_GetPlayRate final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132A[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlendSpacePlayerLibrary_GetPlayRate) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_GetPlayRate");
static_assert(sizeof(BlendSpacePlayerLibrary_GetPlayRate) == 0x000018, "Wrong size on BlendSpacePlayerLibrary_GetPlayRate");
static_assert(offsetof(BlendSpacePlayerLibrary_GetPlayRate, BlendSpacePlayer) == 0x000000, "Member 'BlendSpacePlayerLibrary_GetPlayRate::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_GetPlayRate, ReturnValue) == 0x000010, "Member 'BlendSpacePlayerLibrary_GetPlayRate::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.GetPosition
// 0x0028 (0x0028 - 0x0000)
struct BlendSpacePlayerLibrary_GetPosition final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpacePlayerLibrary_GetPosition) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_GetPosition");
static_assert(sizeof(BlendSpacePlayerLibrary_GetPosition) == 0x000028, "Wrong size on BlendSpacePlayerLibrary_GetPosition");
static_assert(offsetof(BlendSpacePlayerLibrary_GetPosition, BlendSpacePlayer) == 0x000000, "Member 'BlendSpacePlayerLibrary_GetPosition::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_GetPosition, ReturnValue) == 0x000010, "Member 'BlendSpacePlayerLibrary_GetPosition::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.GetStartPosition
// 0x0018 (0x0018 - 0x0000)
struct BlendSpacePlayerLibrary_GetStartPosition final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132B[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlendSpacePlayerLibrary_GetStartPosition) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_GetStartPosition");
static_assert(sizeof(BlendSpacePlayerLibrary_GetStartPosition) == 0x000018, "Wrong size on BlendSpacePlayerLibrary_GetStartPosition");
static_assert(offsetof(BlendSpacePlayerLibrary_GetStartPosition, BlendSpacePlayer) == 0x000000, "Member 'BlendSpacePlayerLibrary_GetStartPosition::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_GetStartPosition, ReturnValue) == 0x000010, "Member 'BlendSpacePlayerLibrary_GetStartPosition::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.SetBlendSpace
// 0x0028 (0x0028 - 0x0000)
struct BlendSpacePlayerLibrary_SetBlendSpace final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UBlendSpace*                            BlendSpace;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlendSpacePlayerReference             ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpacePlayerLibrary_SetBlendSpace) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_SetBlendSpace");
static_assert(sizeof(BlendSpacePlayerLibrary_SetBlendSpace) == 0x000028, "Wrong size on BlendSpacePlayerLibrary_SetBlendSpace");
static_assert(offsetof(BlendSpacePlayerLibrary_SetBlendSpace, BlendSpacePlayer) == 0x000000, "Member 'BlendSpacePlayerLibrary_SetBlendSpace::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetBlendSpace, BlendSpace) == 0x000010, "Member 'BlendSpacePlayerLibrary_SetBlendSpace::BlendSpace' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetBlendSpace, ReturnValue) == 0x000018, "Member 'BlendSpacePlayerLibrary_SetBlendSpace::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.SetBlendSpaceWithInertialBlending
// 0x0040 (0x0040 - 0x0000)
struct BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UBlendSpace*                            BlendSpace;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReference             ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending");
static_assert(sizeof(BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending) == 0x000040, "Wrong size on BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending");
static_assert(offsetof(BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending, UpdateContext) == 0x000000, "Member 'BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending::UpdateContext' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending, BlendSpacePlayer) == 0x000010, "Member 'BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending, BlendSpace) == 0x000020, "Member 'BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending::BlendSpace' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending, BlendTime) == 0x000028, "Member 'BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending::BlendTime' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending, ReturnValue) == 0x000030, "Member 'BlendSpacePlayerLibrary_SetBlendSpaceWithInertialBlending::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.SetLoop
// 0x0028 (0x0028 - 0x0000)
struct BlendSpacePlayerLibrary_SetLoop final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReference             ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpacePlayerLibrary_SetLoop) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_SetLoop");
static_assert(sizeof(BlendSpacePlayerLibrary_SetLoop) == 0x000028, "Wrong size on BlendSpacePlayerLibrary_SetLoop");
static_assert(offsetof(BlendSpacePlayerLibrary_SetLoop, BlendSpacePlayer) == 0x000000, "Member 'BlendSpacePlayerLibrary_SetLoop::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetLoop, bLoop) == 0x000010, "Member 'BlendSpacePlayerLibrary_SetLoop::bLoop' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetLoop, ReturnValue) == 0x000018, "Member 'BlendSpacePlayerLibrary_SetLoop::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.SetPlayRate
// 0x0028 (0x0028 - 0x0000)
struct BlendSpacePlayerLibrary_SetPlayRate final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReference             ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlendSpacePlayerLibrary_SetPlayRate) == 0x000008, "Wrong alignment on BlendSpacePlayerLibrary_SetPlayRate");
static_assert(sizeof(BlendSpacePlayerLibrary_SetPlayRate) == 0x000028, "Wrong size on BlendSpacePlayerLibrary_SetPlayRate");
static_assert(offsetof(BlendSpacePlayerLibrary_SetPlayRate, BlendSpacePlayer) == 0x000000, "Member 'BlendSpacePlayerLibrary_SetPlayRate::BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetPlayRate, PlayRate) == 0x000010, "Member 'BlendSpacePlayerLibrary_SetPlayRate::PlayRate' has a wrong offset!");
static_assert(offsetof(BlendSpacePlayerLibrary_SetPlayRate, ReturnValue) == 0x000018, "Member 'BlendSpacePlayerLibrary_SetPlayRate::ReturnValue' has a wrong offset!");

// Function AnimGraphRuntime.BlendSpacePlayerLibrary.SetResetPlayTimeWhenBlendSpaceChanges
// 0x0028 (0x0028 - 0x0000)
struct BlendSpacePlayerLibrary_SetResetPlayTimeWhenBlendSpaceChanges final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
