#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncLoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.GetIsEnableLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen) == 0x000001, "Wrong alignment on AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen");
static_assert(sizeof(AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen) == 0x000001, "Wrong size on AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen");
static_assert(offsetof(AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen, ReturnValue) == 0x000000, "Member 'AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen::ReturnValue' has a wrong offset!");

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.SetDisplayBackgroundIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex final
{
public:
	int32                                         BackgroundIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex) == 0x000004, "Wrong alignment on AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex");
static_assert(sizeof(AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex) == 0x000004, "Wrong size on AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex");
static_assert(offsetof(AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex, BackgroundIndex) == 0x000000, "Member 'AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex::BackgroundIndex' has a wrong offset!");

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.SetDisplayMovieIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayMovieIndex final
{
public:
	int32                                         MovieIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadingScreenLibrary_SetDisplayMovieIndex) == 0x000004, "Wrong alignment on AsyncLoadingScreenLibrary_SetDisplayMovieIndex");
static_assert(sizeof(AsyncLoadingScreenLibrary_SetDisplayMovieIndex) == 0x000004, "Wrong size on AsyncLoadingScreenLibrary_SetDisplayMovieIndex");
static_assert(offsetof(AsyncLoadingScreenLibrary_SetDisplayMovieIndex, MovieIndex) == 0x000000, "Member 'AsyncLoadingScreenLibrary_SetDisplayMovieIndex::MovieIndex' has a wrong offset!");

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.SetDisplayTipTextIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayTipTextIndex final
{
public:
	int32                                         TipTextIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadingScreenLibrary_SetDisplayTipTextIndex) == 0x000004, "Wrong alignment on AsyncLoadingScreenLibrary_SetDisplayTipTextIndex");
static_assert(sizeof(AsyncLoadingScreenLibrary_SetDisplayTipTextIndex) == 0x000004, "Wrong size on AsyncLoadingScreenLibrary_SetDisplayTipTextIndex");
static_assert(offsetof(AsyncLoadingScreenLibrary_SetDisplayTipTextIndex, TipTextIndex) == 0x000000, "Member 'AsyncLoadingScreenLibrary_SetDisplayTipTextIndex::TipTextIndex' has a wrong offset!");

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.SetEnableLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct AsyncLoadingScreenLibrary_SetEnableLoadingScreen final
{
public:
	bool                                          bIsEnableLoadingScreen;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadingScreenLibrary_SetEnableLoadingScreen) == 0x000001, "Wrong alignment on AsyncLoadingScreenLibrary_SetEnableLoadingScreen");
static_assert(sizeof(AsyncLoadingScreenLibrary_SetEnableLoadingScreen) == 0x000001, "Wrong size on AsyncLoadingScreenLibrary_SetEnableLoadingScreen");
static_assert(offsetof(AsyncLoadingScreenLibrary_SetEnableLoadingScreen, bIsEnableLoadingScreen) == 0x000000, "Member 'AsyncLoadingScreenLibrary_SetEnableLoadingScreen::bIsEnableLoadingScreen' has a wrong offset!");

}

