#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BulkHead

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_BulkHead.B_BulkHead_C.UserConstructionScript
// 0x0320 (0x0320 - 0x0000)
struct B_BulkHead_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3931[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3932[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3933[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3934[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3935[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0148(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0230(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_BulkHead_C_UserConstructionScript) == 0x000010, "Wrong alignment on B_BulkHead_C_UserConstructionScript");
static_assert(sizeof(B_BulkHead_C_UserConstructionScript) == 0x000320, "Wrong size on B_BulkHead_C_UserConstructionScript");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_Clamp_ReturnValue) == 0x000008, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, Temp_struct_Variable) == 0x000020, "Member 'B_BulkHead_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000080, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000088, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_GetSocketTransform_ReturnValue) == 0x000090, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000F0, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x0000F8, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x000110, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000128, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000140, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000148, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000230, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000318, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, K2Node_SwitchInteger_CmpSuccess) == 0x000319, "Member 'B_BulkHead_C_UserConstructionScript::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_BulkHead_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_3) == 0x00031A, "Member 'B_BulkHead_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");

}

