#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Cable

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Cable.B_Cable_C
// 0x0038 (0x02D0 - 0x0298)
class AB_Cable_C final : public AActor
{
public:
	class USplineComponent*                       Spline;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentDistance;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfSegments;                                  // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3929[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RealLeangth;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Recieve_Decals;                                    // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Cable_C">();
	}
	static class AB_Cable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Cable_C>();
	}
};
static_assert(alignof(AB_Cable_C) == 0x000008, "Wrong alignment on AB_Cable_C");
static_assert(sizeof(AB_Cable_C) == 0x0002D0, "Wrong size on AB_Cable_C");
static_assert(offsetof(AB_Cable_C, Spline) == 0x000298, "Member 'AB_Cable_C::Spline' has a wrong offset!");
static_assert(offsetof(AB_Cable_C, DefaultSceneRoot) == 0x0002A0, "Member 'AB_Cable_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_Cable_C, CurrentDistance) == 0x0002A8, "Member 'AB_Cable_C::CurrentDistance' has a wrong offset!");
static_assert(offsetof(AB_Cable_C, NumberOfSegments) == 0x0002B0, "Member 'AB_Cable_C::NumberOfSegments' has a wrong offset!");
static_assert(offsetof(AB_Cable_C, RealLeangth) == 0x0002B8, "Member 'AB_Cable_C::RealLeangth' has a wrong offset!");
static_assert(offsetof(AB_Cable_C, Scale) == 0x0002C0, "Member 'AB_Cable_C::Scale' has a wrong offset!");
static_assert(offsetof(AB_Cable_C, Recieve_Decals) == 0x0002C8, "Member 'AB_Cable_C::Recieve_Decals' has a wrong offset!");

}

