#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ModularRoof

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_ModularRoof.B_ModularRoof_C
// 0x0048 (0x02E0 - 0x0298)
class AB_ModularRoof_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Dimension1;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Dimension2;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RealDimension1;                                    // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RealDimension2;                                    // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaterialType;                                      // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C6[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Overwrite_Material;                                // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_ModularRoof_C">();
	}
	static class AB_ModularRoof_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_ModularRoof_C>();
	}
};
static_assert(alignof(AB_ModularRoof_C) == 0x000008, "Wrong alignment on AB_ModularRoof_C");
static_assert(sizeof(AB_ModularRoof_C) == 0x0002E0, "Wrong size on AB_ModularRoof_C");
static_assert(offsetof(AB_ModularRoof_C, DefaultSceneRoot) == 0x000298, "Member 'AB_ModularRoof_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_ModularRoof_C, Dimension1) == 0x0002A0, "Member 'AB_ModularRoof_C::Dimension1' has a wrong offset!");
static_assert(offsetof(AB_ModularRoof_C, Dimension2) == 0x0002A8, "Member 'AB_ModularRoof_C::Dimension2' has a wrong offset!");
static_assert(offsetof(AB_ModularRoof_C, RealDimension1) == 0x0002B0, "Member 'AB_ModularRoof_C::RealDimension1' has a wrong offset!");
static_assert(offsetof(AB_ModularRoof_C, RealDimension2) == 0x0002B8, "Member 'AB_ModularRoof_C::RealDimension2' has a wrong offset!");
static_assert(offsetof(AB_ModularRoof_C, Materials) == 0x0002C0, "Member 'AB_ModularRoof_C::Materials' has a wrong offset!");
static_assert(offsetof(AB_ModularRoof_C, MaterialType) == 0x0002D0, "Member 'AB_ModularRoof_C::MaterialType' has a wrong offset!");
static_assert(offsetof(AB_ModularRoof_C, Overwrite_Material) == 0x0002D8, "Member 'AB_ModularRoof_C::Overwrite_Material' has a wrong offset!");

}

