#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SatelliteDish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_SatelliteDish.B_SatelliteDish_C.UserConstructionScript
// 0x03A0 (0x03A0 - 0x0000)
struct B_SatelliteDish_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C4[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C5[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x02B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SatelliteDish_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_SatelliteDish_C_UserConstructionScript");
static_assert(sizeof(B_SatelliteDish_C_UserConstructionScript) == 0x0003A0, "Wrong size on B_SatelliteDish_C_UserConstructionScript");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000008, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000010, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000014, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000020, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000028, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000030, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000038, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_GetLocalBounds_Min) == 0x000040, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_GetLocalBounds_Max) == 0x000058, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000070, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000078, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000080, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000088, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x0000B0, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000C8, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001B0, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue_1) == 0x000298, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0002B0, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000398, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_SatelliteDish_C_UserConstructionScript, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00039C, "Member 'B_SatelliteDish_C_UserConstructionScript::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

