#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bay_tree01_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass bay_tree01_BP.bay_tree01_BP_C
// 0x0020 (0x02B8 - 0x0298)
class Abay_tree01_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   bay_tree01_StaticMeshComponent0;                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bay_tree5_StaticMeshComponent0;                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bay_tree01_BP_C">();
	}
	static class Abay_tree01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abay_tree01_BP_C>();
	}
};
static_assert(alignof(Abay_tree01_BP_C) == 0x000008, "Wrong alignment on Abay_tree01_BP_C");
static_assert(sizeof(Abay_tree01_BP_C) == 0x0002B8, "Wrong size on Abay_tree01_BP_C");
static_assert(offsetof(Abay_tree01_BP_C, bay_tree01_StaticMeshComponent0) == 0x000298, "Member 'Abay_tree01_BP_C::bay_tree01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(Abay_tree01_BP_C, bay_tree5_StaticMeshComponent0) == 0x0002A0, "Member 'Abay_tree01_BP_C::bay_tree5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(Abay_tree01_BP_C, SharedRoot) == 0x0002A8, "Member 'Abay_tree01_BP_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(Abay_tree01_BP_C, Stream) == 0x0002B0, "Member 'Abay_tree01_BP_C::Stream' has a wrong offset!");

}

