#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BFL_CustomFunctions

#include "Basic.hpp"

#include "SteamCorePro_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "E_ChoosenChar_structs.hpp"
#include "InputCore_structs.hpp"
#include "S_CharColor_structs.hpp"


namespace SDK::Params
{

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.ConvertTimeToTextFormat
// 0x00F0 (0x00F0 - 0x0000)
struct BFL_CustomFunctions_C_ConvertTimeToTextFormat final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMod_Remainder;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_FMod_Remainder_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue_1;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
};
static_assert(alignof(BFL_CustomFunctions_C_ConvertTimeToTextFormat) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_ConvertTimeToTextFormat");
static_assert(sizeof(BFL_CustomFunctions_C_ConvertTimeToTextFormat) == 0x0000F0, "Wrong size on BFL_CustomFunctions_C_ConvertTimeToTextFormat");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, Time) == 0x000000, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::Time' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, __WorldContext) == 0x000008, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, ReturnValue) == 0x000010, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_FMod_Remainder) == 0x000030, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_FMod_ReturnValue) == 0x000038, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Round_ReturnValue) == 0x00003C, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000040, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_FMod_Remainder_1) == 0x000058, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_FMod_Remainder_1' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_FMod_ReturnValue_1) == 0x000060, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_FMod_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Round_ReturnValue_1) == 0x000064, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000068, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000078, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000098, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B8, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C8, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_ConvertTimeToTextFormat, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'BFL_CustomFunctions_C_ConvertTimeToTextFormat::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.FindPlayerStart
// 0x0040 (0x0040 - 0x0000)
struct BFL_CustomFunctions_C_FindPlayerStart final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Start;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStart*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStart*                           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_FindPlayerStart) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_FindPlayerStart");
static_assert(sizeof(BFL_CustomFunctions_C_FindPlayerStart) == 0x000040, "Wrong size on BFL_CustomFunctions_C_FindPlayerStart");
static_assert(offsetof(BFL_CustomFunctions_C_FindPlayerStart, __WorldContext) == 0x000000, "Member 'BFL_CustomFunctions_C_FindPlayerStart::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_FindPlayerStart, ReturnValue) == 0x000008, "Member 'BFL_CustomFunctions_C_FindPlayerStart::ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_FindPlayerStart, Start) == 0x000010, "Member 'BFL_CustomFunctions_C_FindPlayerStart::Start' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_FindPlayerStart, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'BFL_CustomFunctions_C_FindPlayerStart::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_FindPlayerStart, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BFL_CustomFunctions_C_FindPlayerStart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_FindPlayerStart, CallFunc_Array_Get_Item) == 0x000030, "Member 'BFL_CustomFunctions_C_FindPlayerStart::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_FindPlayerStart, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'BFL_CustomFunctions_C_FindPlayerStart::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetChainByCharacters
// 0x0068 (0x0068 - 0x0000)
struct BFL_CustomFunctions_C_GetChainByCharacters final
{
public:
	class APawn*                                  Player01;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Player02;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NewChain_C*                         Array_Element;                                     // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_NewChain_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NewChain_C*                         CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedChars_AttachedChars;           // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358E[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358F[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetChainByCharacters) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetChainByCharacters");
static_assert(sizeof(BFL_CustomFunctions_C_GetChainByCharacters) == 0x000068, "Wrong size on BFL_CustomFunctions_C_GetChainByCharacters");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, Player01) == 0x000000, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::Player01' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, Player02) == 0x000008, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::Player02' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, __WorldContext) == 0x000010, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, Array_Element) == 0x000018, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::Array_Element' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, ReturnValue) == 0x000020, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_Array_Get_Item) == 0x000040, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_GetAttachedChars_AttachedChars) == 0x000048, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_GetAttachedChars_AttachedChars' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_Array_Contains_ReturnValue) == 0x000058, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_Array_Contains_ReturnValue_1) == 0x000059, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_Less_IntInt_ReturnValue) == 0x000061, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainByCharacters, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BFL_CustomFunctions_C_GetChainByCharacters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetChainsByCharacter
// 0x0070 (0x0070 - 0x0000)
struct BFL_CustomFunctions_C_GetChainsByCharacter final
{
public:
	const class AActor*                           ItemToFind;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_NewChain_C*>                 Array1;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<class ABP_NewChain_C*>                 Array;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABP_NewChain_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NewChain_C*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedChars_AttachedChars;           // 0x0050(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3590[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetChainsByCharacter) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetChainsByCharacter");
static_assert(sizeof(BFL_CustomFunctions_C_GetChainsByCharacter) == 0x000070, "Wrong size on BFL_CustomFunctions_C_GetChainsByCharacter");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, ItemToFind) == 0x000000, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::ItemToFind' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, __WorldContext) == 0x000008, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, Array1) == 0x000010, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::Array1' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, Array) == 0x000020, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::Array' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, CallFunc_Array_Get_Item) == 0x000048, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, CallFunc_GetAttachedChars_AttachedChars) == 0x000050, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::CallFunc_GetAttachedChars_AttachedChars' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, CallFunc_Array_Contains_ReturnValue) == 0x000064, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, CallFunc_Less_IntInt_ReturnValue) == 0x000065, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetChainsByCharacter, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'BFL_CustomFunctions_C_GetChainsByCharacter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetCharacterColor
// 0x0068 (0x0068 - 0x0000)
struct BFL_CustomFunctions_C_GetCharacterColor final
{
public:
	E_ChoosenChar                                 Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3591[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3592[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3593[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CharColor                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0014)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetCharacterColor) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetCharacterColor");
static_assert(sizeof(BFL_CustomFunctions_C_GetCharacterColor) == 0x000068, "Wrong size on BFL_CustomFunctions_C_GetCharacterColor");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, Character) == 0x000000, "Member 'BFL_CustomFunctions_C_GetCharacterColor::Character' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, __WorldContext) == 0x000008, "Member 'BFL_CustomFunctions_C_GetCharacterColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, Color) == 0x000010, "Member 'BFL_CustomFunctions_C_GetCharacterColor::Color' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BFL_CustomFunctions_C_GetCharacterColor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BFL_CustomFunctions_C_GetCharacterColor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BFL_CustomFunctions_C_GetCharacterColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'BFL_CustomFunctions_C_GetCharacterColor::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BFL_CustomFunctions_C_GetCharacterColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, CallFunc_Array_Get_Item) == 0x000044, "Member 'BFL_CustomFunctions_C_GetCharacterColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BFL_CustomFunctions_C_GetCharacterColor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BFL_CustomFunctions_C_GetCharacterColor::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000064, "Member 'BFL_CustomFunctions_C_GetCharacterColor::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetCharacterColor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000065, "Member 'BFL_CustomFunctions_C_GetCharacterColor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetDevMode
// 0x0030 (0x0030 - 0x0000)
struct BFL_CustomFunctions_C_GetDevMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          DevMode;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3594[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDevMode_DevMode;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetDevMode) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetDevMode");
static_assert(sizeof(BFL_CustomFunctions_C_GetDevMode) == 0x000030, "Wrong size on BFL_CustomFunctions_C_GetDevMode");
static_assert(offsetof(BFL_CustomFunctions_C_GetDevMode, __WorldContext) == 0x000000, "Member 'BFL_CustomFunctions_C_GetDevMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetDevMode, DevMode) == 0x000008, "Member 'BFL_CustomFunctions_C_GetDevMode::DevMode' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetDevMode, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BFL_CustomFunctions_C_GetDevMode::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetDevMode, K2Node_DynamicCast_AsBPI_Game_Instance) == 0x000018, "Member 'BFL_CustomFunctions_C_GetDevMode::K2Node_DynamicCast_AsBPI_Game_Instance' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetDevMode, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BFL_CustomFunctions_C_GetDevMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetDevMode, CallFunc_GetDevMode_DevMode) == 0x000029, "Member 'BFL_CustomFunctions_C_GetDevMode::CallFunc_GetDevMode_DevMode' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetInputKeyByName
// 0x0250 (0x0250 - 0x0000)
struct BFL_CustomFunctions_C_GetInputKeyByName final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3595[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Current_Key;                                       // 0x0018(0x0018)(Parm, OutParm, HasGetValueTypeHash)
	struct FPlayerKeyMapping                      FoundMap;                                          // 0x0030(0x0090)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3596[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_GetUserSettings_self_CastInput;           // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputUserSettings*             CallFunc_GetUserSettings_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3597[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedPlayerMappableKeyProfile*      CallFunc_GetCurrentKeyProfile_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FKeyMappingRow>      CallFunc_GetPlayerMappingRows_ReturnValue;         // 0x00F8(0x0050)(ConstParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3598[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyMappingRow                         CallFunc_Map_Find_Value;                           // 0x0150(0x0050)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3599[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPlayerKeyMapping>              CallFunc_Set_ToArray_Result;                       // 0x01A8(0x0010)(ReferenceParm)
	struct FPlayerKeyMapping                      CallFunc_Array_Get_Item;                           // 0x01B8(0x0090)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetInputKeyByName) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetInputKeyByName");
static_assert(sizeof(BFL_CustomFunctions_C_GetInputKeyByName) == 0x000250, "Wrong size on BFL_CustomFunctions_C_GetInputKeyByName");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, Key) == 0x000000, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::Key' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, __WorldContext) == 0x000008, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, ReturnValue) == 0x000010, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, Current_Key) == 0x000018, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::Current_Key' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, FoundMap) == 0x000030, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::FoundMap' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000C0, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_GetUserSettings_self_CastInput) == 0x0000D0, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_GetUserSettings_self_CastInput' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_GetUserSettings_ReturnValue) == 0x0000E0, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_GetCurrentKeyProfile_ReturnValue) == 0x0000F0, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_GetCurrentKeyProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_GetPlayerMappingRows_ReturnValue) == 0x0000F8, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_GetPlayerMappingRows_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, Temp_int_Loop_Counter_Variable) == 0x000148, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_Map_Find_Value) == 0x000150, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_Map_Find_ReturnValue) == 0x0001A0, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_Add_IntInt_ReturnValue) == 0x0001A4, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_Set_ToArray_Result) == 0x0001A8, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_Array_Length_ReturnValue) == 0x000248, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_Less_IntInt_ReturnValue) == 0x00024C, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputKeyByName, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00024D, "Member 'BFL_CustomFunctions_C_GetInputKeyByName::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetInputLagMode
// 0x0030 (0x0030 - 0x0000)
struct BFL_CustomFunctions_C_GetInputLagMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359A[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputLagMode_ReturnValue;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetInputLagMode) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetInputLagMode");
static_assert(sizeof(BFL_CustomFunctions_C_GetInputLagMode) == 0x000030, "Wrong size on BFL_CustomFunctions_C_GetInputLagMode");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputLagMode, __WorldContext) == 0x000000, "Member 'BFL_CustomFunctions_C_GetInputLagMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputLagMode, ReturnValue) == 0x000008, "Member 'BFL_CustomFunctions_C_GetInputLagMode::ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputLagMode, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BFL_CustomFunctions_C_GetInputLagMode::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputLagMode, K2Node_DynamicCast_AsBPI_Game_Instance) == 0x000018, "Member 'BFL_CustomFunctions_C_GetInputLagMode::K2Node_DynamicCast_AsBPI_Game_Instance' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputLagMode, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BFL_CustomFunctions_C_GetInputLagMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetInputLagMode, CallFunc_GetInputLagMode_ReturnValue) == 0x000029, "Member 'BFL_CustomFunctions_C_GetInputLagMode::CallFunc_GetInputLagMode_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetLocalMultiplayer
// 0x0030 (0x0030 - 0x0000)
struct BFL_CustomFunctions_C_GetLocalMultiplayer final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayerMode_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetLocalMultiplayer) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetLocalMultiplayer");
static_assert(sizeof(BFL_CustomFunctions_C_GetLocalMultiplayer) == 0x000030, "Wrong size on BFL_CustomFunctions_C_GetLocalMultiplayer");
static_assert(offsetof(BFL_CustomFunctions_C_GetLocalMultiplayer, __WorldContext) == 0x000000, "Member 'BFL_CustomFunctions_C_GetLocalMultiplayer::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetLocalMultiplayer, ReturnValue) == 0x000008, "Member 'BFL_CustomFunctions_C_GetLocalMultiplayer::ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetLocalMultiplayer, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BFL_CustomFunctions_C_GetLocalMultiplayer::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetLocalMultiplayer, K2Node_DynamicCast_AsBPI_Game_Instance) == 0x000018, "Member 'BFL_CustomFunctions_C_GetLocalMultiplayer::K2Node_DynamicCast_AsBPI_Game_Instance' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetLocalMultiplayer, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BFL_CustomFunctions_C_GetLocalMultiplayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetLocalMultiplayer, CallFunc_GetLocalMultiplayerMode_ReturnValue) == 0x000029, "Member 'BFL_CustomFunctions_C_GetLocalMultiplayer::CallFunc_GetLocalMultiplayerMode_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetNumPlayers
// 0x0050 (0x0050 - 0x0000)
struct BFL_CustomFunctions_C_GetNumPlayers final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance;            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359E[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayersInSession_PlayersInSession;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359F[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetNumPlayers) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetNumPlayers");
static_assert(sizeof(BFL_CustomFunctions_C_GetNumPlayers) == 0x000050, "Wrong size on BFL_CustomFunctions_C_GetNumPlayers");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, __WorldContext) == 0x000000, "Member 'BFL_CustomFunctions_C_GetNumPlayers::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, ReturnValue) == 0x000008, "Member 'BFL_CustomFunctions_C_GetNumPlayers::ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BFL_CustomFunctions_C_GetNumPlayers::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BFL_CustomFunctions_C_GetNumPlayers::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BFL_CustomFunctions_C_GetNumPlayers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, K2Node_DynamicCast_AsBPI_Game_Instance) == 0x000028, "Member 'BFL_CustomFunctions_C_GetNumPlayers::K2Node_DynamicCast_AsBPI_Game_Instance' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BFL_CustomFunctions_C_GetNumPlayers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, CallFunc_GetPlayersInSession_PlayersInSession) == 0x00003C, "Member 'BFL_CustomFunctions_C_GetNumPlayers::CallFunc_GetPlayersInSession_PlayersInSession' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BFL_CustomFunctions_C_GetNumPlayers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x000044, "Member 'BFL_CustomFunctions_C_GetNumPlayers::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetNumPlayers, CallFunc_SelectInt_ReturnValue) == 0x000048, "Member 'BFL_CustomFunctions_C_GetNumPlayers::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetPlayerCount
// 0x0020 (0x0020 - 0x0000)
struct BFL_CustomFunctions_C_GetPlayerCount final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BFL_CustomFunctions_C_GetPlayerCount) == 0x000008, "Wrong alignment on BFL_CustomFunctions_C_GetPlayerCount");
static_assert(sizeof(BFL_CustomFunctions_C_GetPlayerCount) == 0x000020, "Wrong size on BFL_CustomFunctions_C_GetPlayerCount");
static_assert(offsetof(BFL_CustomFunctions_C_GetPlayerCount, __WorldContext) == 0x000000, "Member 'BFL_CustomFunctions_C_GetPlayerCount::__WorldContext' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetPlayerCount, ReturnValue) == 0x000008, "Member 'BFL_CustomFunctions_C_GetPlayerCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetPlayerCount, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BFL_CustomFunctions_C_GetPlayerCount::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BFL_CustomFunctions_C_GetPlayerCount, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BFL_CustomFunctions_C_GetPlayerCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BFL_CustomFunctions.BFL_CustomFunctions_C.GetPlayerStartByTag
// 0x0058 (0x0058 - 0x0000)
struct BFL_CustomFunctions_C_GetPlayerStartByTag final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A1[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStart*                           Start;                                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A2[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStart*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	class APlayerStart*                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
