#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlockStopWay_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BlockStopWay_BP.BlockStopWay_BP_C
// 0x0078 (0x0310 - 0x0298)
class ABlockStopWay_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_VinceSync_C*                         C_VinceSync;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Block_01;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_F855CF414306AC773A76E09773DB9997; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_F855CF414306AC773A76E09773DB9997; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3B[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        InitialDistanceAlpha;                              // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         InitialTimelinePosition;                           // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3C[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               BlockRot;                                          // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          EnableOffset;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3D3D[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Offset;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        InitialDistance;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BlockStopWay_BP(int32 EntryPoint);
	double NewDistanceWithOffset(double Param_Offset);
	void PlayMove();
	void ReceiveBeginPlay();
	void SetInitialLocationByDistance(double Distance, class USceneComponent* Mesh);
	void SpawnRopes();
	void SpawnSpheresAtPoints();
	void StopBlock();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlockStopWay_BP_C">();
	}
	static class ABlockStopWay_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABlockStopWay_BP_C>();
	}
};
static_assert(alignof(ABlockStopWay_BP_C) == 0x000008, "Wrong alignment on ABlockStopWay_BP_C");
static_assert(sizeof(ABlockStopWay_BP_C) == 0x000310, "Wrong size on ABlockStopWay_BP_C");
static_assert(offsetof(ABlockStopWay_BP_C, UberGraphFrame) == 0x000298, "Member 'ABlockStopWay_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, C_VinceSync) == 0x0002A0, "Member 'ABlockStopWay_BP_C::C_VinceSync' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, SM_Block_01) == 0x0002A8, "Member 'ABlockStopWay_BP_C::SM_Block_01' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, Spline) == 0x0002B0, "Member 'ABlockStopWay_BP_C::Spline' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABlockStopWay_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, Timeline_NewTrack_0_F855CF414306AC773A76E09773DB9997) == 0x0002C0, "Member 'ABlockStopWay_BP_C::Timeline_NewTrack_0_F855CF414306AC773A76E09773DB9997' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, Timeline__Direction_F855CF414306AC773A76E09773DB9997) == 0x0002C4, "Member 'ABlockStopWay_BP_C::Timeline__Direction_F855CF414306AC773A76E09773DB9997' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, Timeline) == 0x0002C8, "Member 'ABlockStopWay_BP_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, InitialDistanceAlpha) == 0x0002D0, "Member 'ABlockStopWay_BP_C::InitialDistanceAlpha' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, InitialTimelinePosition) == 0x0002D8, "Member 'ABlockStopWay_BP_C::InitialTimelinePosition' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, BlockRot) == 0x0002E0, "Member 'ABlockStopWay_BP_C::BlockRot' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, EnableOffset) == 0x0002F8, "Member 'ABlockStopWay_BP_C::EnableOffset' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, Offset) == 0x000300, "Member 'ABlockStopWay_BP_C::Offset' has a wrong offset!");
static_assert(offsetof(ABlockStopWay_BP_C, InitialDistance) == 0x000308, "Member 'ABlockStopWay_BP_C::InitialDistance' has a wrong offset!");

}

