#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlockStopWay_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BlockStopWay_BP.BlockStopWay_BP_C.ExecuteUbergraph_BlockStopWay_BP
// 0x0238 (0x0238 - 0x0000)
struct BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3E[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3F[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0120(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_NewDistanceWithOffset_ReturnValue;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_InitialTimelinePosition_ImplicitCast; // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetInitialLocationByDistance_Distance_ImplicitCast; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP) == 0x000008, "Wrong alignment on BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP");
static_assert(sizeof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP) == 0x000238, "Wrong size on BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, EntryPoint) == 0x000000, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_GetSplineLength_ReturnValue) == 0x000004, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000010, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000030, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000118, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000120, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_NewDistanceWithOffset_ReturnValue) == 0x000208, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_NewDistanceWithOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_SelectFloat_ReturnValue) == 0x000210, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000218, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_Lerp_B_ImplicitCast) == 0x000220, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000228, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, K2Node_VariableSet_InitialTimelinePosition_ImplicitCast) == 0x00022C, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::K2Node_VariableSet_InitialTimelinePosition_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP, CallFunc_SetInitialLocationByDistance_Distance_ImplicitCast) == 0x000230, "Member 'BlockStopWay_BP_C_ExecuteUbergraph_BlockStopWay_BP::CallFunc_SetInitialLocationByDistance_Distance_ImplicitCast' has a wrong offset!");

// Function BlockStopWay_BP.BlockStopWay_BP_C.NewDistanceWithOffset
// 0x0038 (0x0038 - 0x0000)
struct BlockStopWay_BP_C_NewDistanceWithOffset final
{
public:
	double                                        Param_Offset;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D40[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlockStopWay_BP_C_NewDistanceWithOffset) == 0x000008, "Wrong alignment on BlockStopWay_BP_C_NewDistanceWithOffset");
static_assert(sizeof(BlockStopWay_BP_C_NewDistanceWithOffset) == 0x000038, "Wrong size on BlockStopWay_BP_C_NewDistanceWithOffset");
static_assert(offsetof(BlockStopWay_BP_C_NewDistanceWithOffset, Param_Offset) == 0x000000, "Member 'BlockStopWay_BP_C_NewDistanceWithOffset::Param_Offset' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_NewDistanceWithOffset, ReturnValue) == 0x000008, "Member 'BlockStopWay_BP_C_NewDistanceWithOffset::ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_NewDistanceWithOffset, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'BlockStopWay_BP_C_NewDistanceWithOffset::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_NewDistanceWithOffset, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BlockStopWay_BP_C_NewDistanceWithOffset::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_NewDistanceWithOffset, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'BlockStopWay_BP_C_NewDistanceWithOffset::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_NewDistanceWithOffset, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BlockStopWay_BP_C_NewDistanceWithOffset::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_NewDistanceWithOffset, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'BlockStopWay_BP_C_NewDistanceWithOffset::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function BlockStopWay_BP.BlockStopWay_BP_C.SetInitialLocationByDistance
// 0x0130 (0x0130 - 0x0000)
struct BlockStopWay_BP_C_SetInitialLocationByDistance final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D41[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_MapRangeClamped_OutRangeB_ImplicitCast;   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlockStopWay_BP_C_SetInitialLocationByDistance) == 0x000008, "Wrong alignment on BlockStopWay_BP_C_SetInitialLocationByDistance");
static_assert(sizeof(BlockStopWay_BP_C_SetInitialLocationByDistance) == 0x000130, "Wrong size on BlockStopWay_BP_C_SetInitialLocationByDistance");
static_assert(offsetof(BlockStopWay_BP_C_SetInitialLocationByDistance, Distance) == 0x000000, "Member 'BlockStopWay_BP_C_SetInitialLocationByDistance::Distance' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SetInitialLocationByDistance, Mesh) == 0x000008, "Member 'BlockStopWay_BP_C_SetInitialLocationByDistance::Mesh' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SetInitialLocationByDistance, CallFunc_GetSplineLength_ReturnValue) == 0x000010, "Member 'BlockStopWay_BP_C_SetInitialLocationByDistance::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SetInitialLocationByDistance, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'BlockStopWay_BP_C_SetInitialLocationByDistance::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SetInitialLocationByDistance, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000020, "Member 'BlockStopWay_BP_C_SetInitialLocationByDistance::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SetInitialLocationByDistance, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000038, "Member 'BlockStopWay_BP_C_SetInitialLocationByDistance::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SetInitialLocationByDistance, CallFunc_MapRangeClamped_OutRangeB_ImplicitCast) == 0x000120, "Member 'BlockStopWay_BP_C_SetInitialLocationByDistance::CallFunc_MapRangeClamped_OutRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SetInitialLocationByDistance, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000128, "Member 'BlockStopWay_BP_C_SetInitialLocationByDistance::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function BlockStopWay_BP.BlockStopWay_BP_C.SpawnRopes
// 0x02F0 (0x02F0 - 0x0000)
struct BlockStopWay_BP_C_SpawnRopes final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D42[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D43[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlockStopWay_BP_C_SpawnRopes) == 0x000010, "Wrong alignment on BlockStopWay_BP_C_SpawnRopes");
static_assert(sizeof(BlockStopWay_BP_C_SpawnRopes) == 0x0002F0, "Wrong size on BlockStopWay_BP_C_SpawnRopes");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, Temp_int_Variable) == 0x000000, "Member 'BlockStopWay_BP_C_SpawnRopes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, Temp_int_Variable_1) == 0x000004, "Member 'BlockStopWay_BP_C_SpawnRopes::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, Temp_struct_Variable) == 0x000020, "Member 'BlockStopWay_BP_C_SpawnRopes::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000080, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_AddComponent_ReturnValue) == 0x000098, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x0000A0, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000B8, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_Vector_Distance_ReturnValue) == 0x0001A0, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_GetTangentAtSplinePoint_ReturnValue) == 0x0001A8, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_GetTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001C0, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001C8, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_MakeVector_ReturnValue) == 0x0001E0, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001F8, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0002E0, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnRopes, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002E4, "Member 'BlockStopWay_BP_C_SpawnRopes::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BlockStopWay_BP.BlockStopWay_BP_C.SpawnSpheresAtPoints
// 0x0190 (0x0190 - 0x0000)
struct BlockStopWay_BP_C_SpawnSpheresAtPoints final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D44[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D45[0xC];                                     // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D46[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlockStopWay_BP_C_SpawnSpheresAtPoints) == 0x000010, "Wrong alignment on BlockStopWay_BP_C_SpawnSpheresAtPoints");
static_assert(sizeof(BlockStopWay_BP_C_SpawnSpheresAtPoints) == 0x000190, "Wrong size on BlockStopWay_BP_C_SpawnSpheresAtPoints");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, Temp_int_Variable) == 0x000000, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000008, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000098, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000A0, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, CallFunc_Subtract_IntInt_ReturnValue) == 0x000188, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_SpawnSpheresAtPoints, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00018C, "Member 'BlockStopWay_BP_C_SpawnSpheresAtPoints::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BlockStopWay_BP.BlockStopWay_BP_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct BlockStopWay_BP_C_UserConstructionScript final
{
public:
	double                                        CallFunc_NewDistanceWithOffset_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BlockStopWay_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on BlockStopWay_BP_C_UserConstructionScript");
static_assert(sizeof(BlockStopWay_BP_C_UserConstructionScript) == 0x0000F0, "Wrong size on BlockStopWay_BP_C_UserConstructionScript");
static_assert(offsetof(BlockStopWay_BP_C_UserConstructionScript, CallFunc_NewDistanceWithOffset_ReturnValue) == 0x000000, "Member 'BlockStopWay_BP_C_UserConstructionScript::CallFunc_NewDistanceWithOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlockStopWay_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000008, "Member 'BlockStopWay_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

