#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoxWayManager_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function BoxWayManager_BP.BoxWayManager_BP_C.ExecuteUbergraph_BoxWayManager_BP
// 0x0008 (0x0008 - 0x0000)
struct BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP) == 0x000004, "Wrong alignment on BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP");
static_assert(sizeof(BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP) == 0x000008, "Wrong size on BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP");
static_assert(offsetof(BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP, EntryPoint) == 0x000000, "Member 'BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP, CallFunc_HasAuthority_ReturnValue_2) == 0x000006, "Member 'BoxWayManager_BP_C_ExecuteUbergraph_BoxWayManager_BP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");

// Function BoxWayManager_BP.BoxWayManager_BP_C.GetBoxes
// 0x0070 (0x0070 - 0x0000)
struct BoxWayManager_BP_C_GetBoxes final
{
public:
	TArray<class AStaticMeshActor*>               NewLocalVar1;                                      // 0x0000(0x0010)(Parm, OutParm)
	TArray<class AStaticMeshActor*>               NewLocalVar;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC1[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC2[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC3[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC4[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BoxWayManager_BP_C_GetBoxes) == 0x000008, "Wrong alignment on BoxWayManager_BP_C_GetBoxes");
static_assert(sizeof(BoxWayManager_BP_C_GetBoxes) == 0x000070, "Wrong size on BoxWayManager_BP_C_GetBoxes");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, NewLocalVar1) == 0x000000, "Member 'BoxWayManager_BP_C_GetBoxes::NewLocalVar1' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, NewLocalVar) == 0x000010, "Member 'BoxWayManager_BP_C_GetBoxes::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BoxWayManager_BP_C_GetBoxes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BoxWayManager_BP_C_GetBoxes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BoxWayManager_BP_C_GetBoxes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000030, "Member 'BoxWayManager_BP_C_GetBoxes::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BoxWayManager_BP_C_GetBoxes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, CallFunc_Array_Get_Item) == 0x000048, "Member 'BoxWayManager_BP_C_GetBoxes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BoxWayManager_BP_C_GetBoxes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, K2Node_DynamicCast_AsStatic_Mesh_Actor) == 0x000058, "Member 'BoxWayManager_BP_C_GetBoxes::K2Node_DynamicCast_AsStatic_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BoxWayManager_BP_C_GetBoxes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'BoxWayManager_BP_C_GetBoxes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_GetBoxes, CallFunc_ActorHasTag_ReturnValue) == 0x000068, "Member 'BoxWayManager_BP_C_GetBoxes::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");

// Function BoxWayManager_BP.BoxWayManager_BP_C.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct BoxWayManager_BP_C_IsActivated final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BoxWayManager_BP_C_IsActivated) == 0x000001, "Wrong alignment on BoxWayManager_BP_C_IsActivated");
static_assert(sizeof(BoxWayManager_BP_C_IsActivated) == 0x000001, "Wrong size on BoxWayManager_BP_C_IsActivated");
static_assert(offsetof(BoxWayManager_BP_C_IsActivated, Activated) == 0x000000, "Member 'BoxWayManager_BP_C_IsActivated::Activated' has a wrong offset!");

// Function BoxWayManager_BP.BoxWayManager_BP_C.OnRep_Visible
// 0x0020 (0x0020 - 0x0000)
struct BoxWayManager_BP_C_OnRep_Visible final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BoxWayManager_BP_C_OnRep_Visible) == 0x000008, "Wrong alignment on BoxWayManager_BP_C_OnRep_Visible");
static_assert(sizeof(BoxWayManager_BP_C_OnRep_Visible) == 0x000020, "Wrong size on BoxWayManager_BP_C_OnRep_Visible");
static_assert(offsetof(BoxWayManager_BP_C_OnRep_Visible, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BoxWayManager_BP_C_OnRep_Visible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_OnRep_Visible, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BoxWayManager_BP_C_OnRep_Visible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_OnRep_Visible, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BoxWayManager_BP_C_OnRep_Visible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_OnRep_Visible, CallFunc_Array_Get_Item) == 0x000010, "Member 'BoxWayManager_BP_C_OnRep_Visible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_OnRep_Visible, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BoxWayManager_BP_C_OnRep_Visible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoxWayManager_BP_C_OnRep_Visible, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BoxWayManager_BP_C_OnRep_Visible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

