#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoxWayManager_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BoxWayManager_BP.BoxWayManager_BP_C
// 0x0038 (0x02D0 - 0x0298)
class ABoxWayManager_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AStaticMeshActor*>               Boxes;                                             // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	bool                                          Visible;                                           // 0x02C8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BoxWayManager_BP(int32 EntryPoint);
	void GetBoxes(TArray<class AStaticMeshActor*>* NewLocalVar1);
	void IsActivated(bool* Activated);
	void OnRep_Visible();
	void Pushed();
	void ReceiveBeginPlay();
	void Released();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BoxWayManager_BP_C">();
	}
	static class ABoxWayManager_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoxWayManager_BP_C>();
	}
};
static_assert(alignof(ABoxWayManager_BP_C) == 0x000008, "Wrong alignment on ABoxWayManager_BP_C");
static_assert(sizeof(ABoxWayManager_BP_C) == 0x0002D0, "Wrong size on ABoxWayManager_BP_C");
static_assert(offsetof(ABoxWayManager_BP_C, UberGraphFrame) == 0x000298, "Member 'ABoxWayManager_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABoxWayManager_BP_C, Box) == 0x0002A0, "Member 'ABoxWayManager_BP_C::Box' has a wrong offset!");
static_assert(offsetof(ABoxWayManager_BP_C, Billboard) == 0x0002A8, "Member 'ABoxWayManager_BP_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABoxWayManager_BP_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABoxWayManager_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABoxWayManager_BP_C, Boxes) == 0x0002B8, "Member 'ABoxWayManager_BP_C::Boxes' has a wrong offset!");
static_assert(offsetof(ABoxWayManager_BP_C, Visible) == 0x0002C8, "Member 'ABoxWayManager_BP_C::Visible' has a wrong offset!");

}

