#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArrowThrower

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ArrowThrower.BP_ArrowThrower_C.ExecuteUbergraph_BP_ArrowThrower
// 0x0080 (0x0080 - 0x0000)
struct BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB6[0x9];                                     // 0x0007(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ThrowedBullet_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower) == 0x000010, "Wrong alignment on BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower");
static_assert(sizeof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower) == 0x000080, "Wrong size on BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower");
static_assert(offsetof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower, EntryPoint) == 0x000000, "Member 'BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BP_ArrowThrower_C_ExecuteUbergraph_BP_ArrowThrower::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_ArrowThrower.BP_ArrowThrower_C.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct BP_ArrowThrower_C_IsActivated final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArrowThrower_C_IsActivated) == 0x000001, "Wrong alignment on BP_ArrowThrower_C_IsActivated");
static_assert(sizeof(BP_ArrowThrower_C_IsActivated) == 0x000001, "Wrong size on BP_ArrowThrower_C_IsActivated");
static_assert(offsetof(BP_ArrowThrower_C_IsActivated, Activated) == 0x000000, "Member 'BP_ArrowThrower_C_IsActivated::Activated' has a wrong offset!");

}

