#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Attractor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Attractor.BP_Attractor_C.BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36BB[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Attractor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Attractor.BP_Attractor_C.BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36BC[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Attractor.BP_Attractor_C.BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Attractor_C_BndEvt__BP_Attractor_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Attractor.BP_Attractor_C.ExecuteUbergraph_BP_Attractor
// 0x03A8 (0x03A8 - 0x0000)
struct BP_Attractor_C_ExecuteUbergraph_BP_Attractor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36BD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36BE[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36BF[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0048(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C0[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C1[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C2[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C3[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C4[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C5[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C6[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0208(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C7[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C8[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C9[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36CA[0x6];                                     // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      CallFunc_GetCapsuleComponent_Capsule;              // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_2;              // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36CB[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor) == 0x000008, "Wrong alignment on BP_Attractor_C_ExecuteUbergraph_BP_Attractor");
static_assert(sizeof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor) == 0x0003A8, "Wrong size on BP_Attractor_C_ExecuteUbergraph_BP_Attractor");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, EntryPoint) == 0x000000, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed) == 0x000008, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x000028, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000030, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherComp_2) == 0x000038, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x000040, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000044, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000048, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_AsPawn) == 0x000130, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Array_AddUnique_ReturnValue) == 0x00013C, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Array_Get_Item) == 0x000140, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_AsBPI_Character) == 0x000150, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000168, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, Temp_int_Loop_Counter_Variable_1) == 0x000180, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000188, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000190, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000198, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0001A0, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A8, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001AC, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001B0, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x0001C8, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Vector_Distance_ReturnValue) == 0x0001E0, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001E8, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherActor) == 0x0001F0, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherComp) == 0x0001F8, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000200, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_bFromSweep) == 0x000204, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_ComponentBoundEvent_SweepResult) == 0x000208, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_MapRangeClamped_ReturnValue) == 0x0002F0, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_AsPawn_1) == 0x0002F8, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_AsPawn_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_bSuccess_2) == 0x000300, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000308, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000310, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000328, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x00032C, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Array_Get_Item_1) == 0x000330, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Array_Length_ReturnValue_1) == 0x000338, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_AsBPI_Character_1) == 0x000340, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_AsBPI_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_bSuccess_3) == 0x000350, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Less_IntInt_ReturnValue_1) == 0x000351, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_GetCapsuleComponent_Capsule) == 0x000358, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_GetCapsuleComponent_Capsule' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_AsBPI_Character_2) == 0x000360, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_AsBPI_Character_2' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, K2Node_DynamicCast_bSuccess_4) == 0x000370, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_GetForwardVector_ReturnValue) == 0x000378, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attractor_C_ExecuteUbergraph_BP_Attractor, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000390, "Member 'BP_Attractor_C_ExecuteUbergraph_BP_Attractor::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

// Function BP_Attractor.BP_Attractor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Attractor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Attractor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Attractor_C_ReceiveTick");
static_assert(sizeof(BP_Attractor_C_ReceiveTick) == 0x000004, "Wrong size on BP_Attractor_C_ReceiveTick");
static_assert(offsetof(BP_Attractor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Attractor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

