#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AsiaTurningStones

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AsiaTurningStones.BP_AsiaTurningStones_C.ExecuteUbergraph_BP_AsiaTurningStones
// 0x0180 (0x0180 - 0x0000)
struct BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA4[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA5[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0088(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones) == 0x000008, "Wrong alignment on BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones");
static_assert(sizeof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones) == 0x000180, "Wrong size on BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, EntryPoint) == 0x000000, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_HasAuthority_ReturnValue) == 0x00002C, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed) == 0x000050, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_SelectFloat_ReturnValue) == 0x000060, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_MakeRotator_ReturnValue) == 0x000070, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000088, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000178, "Member 'BP_AsiaTurningStones_C_ExecuteUbergraph_BP_AsiaTurningStones::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_AsiaTurningStones.BP_AsiaTurningStones_C.OnRep_RepZ
// 0x0100 (0x0100 - 0x0000)
struct BP_AsiaTurningStones_C_OnRep_RepZ final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0018(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AsiaTurningStones_C_OnRep_RepZ) == 0x000008, "Wrong alignment on BP_AsiaTurningStones_C_OnRep_RepZ");
static_assert(sizeof(BP_AsiaTurningStones_C_OnRep_RepZ) == 0x000100, "Wrong size on BP_AsiaTurningStones_C_OnRep_RepZ");
static_assert(offsetof(BP_AsiaTurningStones_C_OnRep_RepZ, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'BP_AsiaTurningStones_C_OnRep_RepZ::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AsiaTurningStones_C_OnRep_RepZ, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000018, "Member 'BP_AsiaTurningStones_C_OnRep_RepZ::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function BP_AsiaTurningStones.BP_AsiaTurningStones_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AsiaTurningStones_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AsiaTurningStones_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AsiaTurningStones_C_ReceiveTick");
static_assert(sizeof(BP_AsiaTurningStones_C_ReceiveTick) == 0x000004, "Wrong size on BP_AsiaTurningStones_C_ReceiveTick");
static_assert(offsetof(BP_AsiaTurningStones_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AsiaTurningStones_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

