#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArrowThrower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArrowThrower.BP_ArrowThrower_C
// 0x0020 (0x02B8 - 0x0298)
class ABP_ArrowThrower_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ArrowThrower(int32 EntryPoint);
	void IsActivated(bool* Activated);
	void Pushed();
	void Released();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ArrowThrower_C">();
	}
	static class ABP_ArrowThrower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ArrowThrower_C>();
	}
};
static_assert(alignof(ABP_ArrowThrower_C) == 0x000008, "Wrong alignment on ABP_ArrowThrower_C");
static_assert(sizeof(ABP_ArrowThrower_C) == 0x0002B8, "Wrong size on ABP_ArrowThrower_C");
static_assert(offsetof(ABP_ArrowThrower_C, UberGraphFrame) == 0x000298, "Member 'ABP_ArrowThrower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ArrowThrower_C, Scene) == 0x0002A0, "Member 'ABP_ArrowThrower_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_ArrowThrower_C, StaticMesh) == 0x0002A8, "Member 'ABP_ArrowThrower_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ArrowThrower_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_ArrowThrower_C::DefaultSceneRoot' has a wrong offset!");

}

