#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AssetLoadingNotifier

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AssetLoadingNotifier.BP_AssetLoadingNotifier_C
// 0x0020 (0x02B8 - 0x0298)
class ABP_AssetLoadingNotifier_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          LevelLoaded;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             LoadedLevel;                                       // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void LoadedLevel__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AssetLoadingNotifier_C">();
	}
	static class ABP_AssetLoadingNotifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AssetLoadingNotifier_C>();
	}
};
static_assert(alignof(ABP_AssetLoadingNotifier_C) == 0x000008, "Wrong alignment on ABP_AssetLoadingNotifier_C");
static_assert(sizeof(ABP_AssetLoadingNotifier_C) == 0x0002B8, "Wrong size on ABP_AssetLoadingNotifier_C");
static_assert(offsetof(ABP_AssetLoadingNotifier_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_AssetLoadingNotifier_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AssetLoadingNotifier_C, LevelLoaded) == 0x0002A0, "Member 'ABP_AssetLoadingNotifier_C::LevelLoaded' has a wrong offset!");
static_assert(offsetof(ABP_AssetLoadingNotifier_C, LoadedLevel) == 0x0002A8, "Member 'ABP_AssetLoadingNotifier_C::LoadedLevel' has a wrong offset!");

}

