#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ButtonOrderManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ButtonOrderManager.BP_ButtonOrderManager_C
// 0x0038 (0x02D0 - 0x0298)
class ABP_ButtonOrderManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABPC_OrderButton_C*>             OrderButtons;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	int32                                         Order;                                             // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A7[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ActorToTrigger;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ButtonOrderManager(int32 EntryPoint);
	void ReceiveOrderButton(int32 Param_Order);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ButtonOrderManager_C">();
	}
	static class ABP_ButtonOrderManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ButtonOrderManager_C>();
	}
};
static_assert(alignof(ABP_ButtonOrderManager_C) == 0x000008, "Wrong alignment on ABP_ButtonOrderManager_C");
static_assert(sizeof(ABP_ButtonOrderManager_C) == 0x0002D0, "Wrong size on ABP_ButtonOrderManager_C");
static_assert(offsetof(ABP_ButtonOrderManager_C, UberGraphFrame) == 0x000298, "Member 'ABP_ButtonOrderManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ButtonOrderManager_C, Billboard) == 0x0002A0, "Member 'ABP_ButtonOrderManager_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_ButtonOrderManager_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_ButtonOrderManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ButtonOrderManager_C, OrderButtons) == 0x0002B0, "Member 'ABP_ButtonOrderManager_C::OrderButtons' has a wrong offset!");
static_assert(offsetof(ABP_ButtonOrderManager_C, Order) == 0x0002C0, "Member 'ABP_ButtonOrderManager_C::Order' has a wrong offset!");
static_assert(offsetof(ABP_ButtonOrderManager_C, ActorToTrigger) == 0x0002C8, "Member 'ABP_ButtonOrderManager_C::ActorToTrigger' has a wrong offset!");

}

