#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Balancoire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Balancoire.BP_Balancoire_C
// 0x0040 (0x02D8 - 0x0298)
class ABP_Balancoire_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Fence_ChainLink_Post_01;                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_367C66BC40CA60B8833C1A87ABC67177; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_367C66BC40CA60B8833C1A87ABC67177; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E92[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Inverse;                                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E93[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RepPosition;                                       // 0x02D4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void ExecuteUbergraph_BP_Balancoire(int32 EntryPoint);
	void OnRep_RepPosition();
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Balancoire_C">();
	}
	static class ABP_Balancoire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Balancoire_C>();
	}
};
static_assert(alignof(ABP_Balancoire_C) == 0x000008, "Wrong alignment on ABP_Balancoire_C");
static_assert(sizeof(ABP_Balancoire_C) == 0x0002D8, "Wrong size on ABP_Balancoire_C");
static_assert(offsetof(ABP_Balancoire_C, UberGraphFrame) == 0x000298, "Member 'ABP_Balancoire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, SM_Fence_ChainLink_Post_01) == 0x0002A0, "Member 'ABP_Balancoire_C::SM_Fence_ChainLink_Post_01' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, Cylinder) == 0x0002A8, "Member 'ABP_Balancoire_C::Cylinder' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, StaticMesh) == 0x0002B0, "Member 'ABP_Balancoire_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Balancoire_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, Timeline_NewTrack_0_367C66BC40CA60B8833C1A87ABC67177) == 0x0002C0, "Member 'ABP_Balancoire_C::Timeline_NewTrack_0_367C66BC40CA60B8833C1A87ABC67177' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, Timeline__Direction_367C66BC40CA60B8833C1A87ABC67177) == 0x0002C4, "Member 'ABP_Balancoire_C::Timeline__Direction_367C66BC40CA60B8833C1A87ABC67177' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, Timeline) == 0x0002C8, "Member 'ABP_Balancoire_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, Inverse) == 0x0002D0, "Member 'ABP_Balancoire_C::Inverse' has a wrong offset!");
static_assert(offsetof(ABP_Balancoire_C, RepPosition) == 0x0002D4, "Member 'ABP_Balancoire_C::RepPosition' has a wrong offset!");

}

