#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Brazier_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Brazier_01.BP_Brazier_01_C
// 0x0050 (0x02E8 - 0x0298)
class ABP_Brazier_01_C final : public AActor
{
public:
	class UParticleSystemComponent*               P_Fire1;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ChainsLinear05;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ChainsLinear04;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ChainsLinear03;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ChainsLinear02;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ChainsLinear01;                                 // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Brazier01_01;                                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Fire_Enable;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Brazier_01_C">();
	}
	static class ABP_Brazier_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Brazier_01_C>();
	}
};
static_assert(alignof(ABP_Brazier_01_C) == 0x000008, "Wrong alignment on ABP_Brazier_01_C");
static_assert(sizeof(ABP_Brazier_01_C) == 0x0002E8, "Wrong size on ABP_Brazier_01_C");
static_assert(offsetof(ABP_Brazier_01_C, P_Fire1) == 0x000298, "Member 'ABP_Brazier_01_C::P_Fire1' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, PointLight) == 0x0002A0, "Member 'ABP_Brazier_01_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, SM_ChainsLinear05) == 0x0002A8, "Member 'ABP_Brazier_01_C::SM_ChainsLinear05' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, SM_ChainsLinear04) == 0x0002B0, "Member 'ABP_Brazier_01_C::SM_ChainsLinear04' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, SM_ChainsLinear03) == 0x0002B8, "Member 'ABP_Brazier_01_C::SM_ChainsLinear03' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, SM_ChainsLinear02) == 0x0002C0, "Member 'ABP_Brazier_01_C::SM_ChainsLinear02' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, SM_ChainsLinear01) == 0x0002C8, "Member 'ABP_Brazier_01_C::SM_ChainsLinear01' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, SM_Brazier01_01) == 0x0002D0, "Member 'ABP_Brazier_01_C::SM_Brazier01_01' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_Brazier_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Brazier_01_C, Fire_Enable) == 0x0002E0, "Member 'ABP_Brazier_01_C::Fire_Enable' has a wrong offset!");

}

