#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Balancoire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Balancoire.BP_Balancoire_C.ExecuteUbergraph_BP_Balancoire
// 0x0138 (0x0138 - 0x0000)
struct BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E94[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E95[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E96[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0040(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire) == 0x000008, "Wrong alignment on BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire");
static_assert(sizeof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire) == 0x000138, "Wrong size on BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, EntryPoint) == 0x000000, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, CallFunc_RLerp_ReturnValue) == 0x000008, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000040, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, CallFunc_SelectFloat_ReturnValue) == 0x000128, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, CallFunc_GetPlaybackPosition_ReturnValue) == 0x000130, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire, CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast) == 0x000134, "Member 'BP_Balancoire_C_ExecuteUbergraph_BP_Balancoire::CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast' has a wrong offset!");

// Function BP_Balancoire.BP_Balancoire_C.OnRep_RepPosition
// 0x0001 (0x0001 - 0x0000)
struct BP_Balancoire_C_OnRep_RepPosition final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Balancoire_C_OnRep_RepPosition) == 0x000001, "Wrong alignment on BP_Balancoire_C_OnRep_RepPosition");
static_assert(sizeof(BP_Balancoire_C_OnRep_RepPosition) == 0x000001, "Wrong size on BP_Balancoire_C_OnRep_RepPosition");
static_assert(offsetof(BP_Balancoire_C_OnRep_RepPosition, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_Balancoire_C_OnRep_RepPosition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

