#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ButtonEvent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ButtonEvent.BP_ButtonEvent_C.CheckButtons
// 0x0060 (0x0060 - 0x0000)
struct BP_ButtonEvent_C_CheckButtons final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385B[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VisibleButtons;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalCount;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_BP_C*                           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385D[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385E[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385F[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_BP_C*                           CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ButtonEvent_C_CheckButtons) == 0x000008, "Wrong alignment on BP_ButtonEvent_C_CheckButtons");
static_assert(sizeof(BP_ButtonEvent_C_CheckButtons) == 0x000060, "Wrong size on BP_ButtonEvent_C_CheckButtons");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, Pressed) == 0x000000, "Member 'BP_ButtonEvent_C_CheckButtons::Pressed' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, ReturnValue) == 0x000001, "Member 'BP_ButtonEvent_C_CheckButtons::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, VisibleButtons) == 0x000004, "Member 'BP_ButtonEvent_C_CheckButtons::VisibleButtons' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, LocalCount) == 0x000008, "Member 'BP_ButtonEvent_C_CheckButtons::LocalCount' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_ButtonEvent_C_CheckButtons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, Temp_int_Variable) == 0x000010, "Member 'BP_ButtonEvent_C_CheckButtons::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ButtonEvent_C_CheckButtons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_ButtonEvent_C_CheckButtons::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'BP_ButtonEvent_C_CheckButtons::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, Temp_int_Variable_1) == 0x000028, "Member 'BP_ButtonEvent_C_CheckButtons::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Add_IntInt_ReturnValue_3) == 0x000048, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_CheckButtons, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00005D, "Member 'BP_ButtonEvent_C_CheckButtons::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_ButtonEvent.BP_ButtonEvent_C.ExecuteUbergraph_BP_ButtonEvent
// 0x0058 (0x0058 - 0x0000)
struct BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3860[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AButton_BP_C*                           CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckButtons_ReturnValue;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3861[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ButtonEvent_C>    K2Node_DynamicCast_AsBPI_Button_Event;             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3862[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ButtonEvent_C>    K2Node_DynamicCast_AsBPI_Button_Event_1;           // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent) == 0x000008, "Wrong alignment on BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent");
static_assert(sizeof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent) == 0x000058, "Wrong size on BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, EntryPoint) == 0x000000, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, CallFunc_Array_IsEmpty_ReturnValue) == 0x000020, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, CallFunc_Less_IntInt_ReturnValue) == 0x000021, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, CallFunc_CheckButtons_ReturnValue) == 0x000022, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::CallFunc_CheckButtons_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, K2Node_DynamicCast_AsBPI_Button_Event) == 0x000028, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::K2Node_DynamicCast_AsBPI_Button_Event' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, K2Node_DynamicCast_AsBPI_Button_Event_1) == 0x000040, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::K2Node_DynamicCast_AsBPI_Button_Event_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_ButtonEvent_C_ExecuteUbergraph_BP_ButtonEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_ButtonEvent.BP_ButtonEvent_C.UserConstructionScript
// 0x0088 (0x0088 - 0x0000)
struct BP_ButtonEvent_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3863[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3864[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_BP_C*                           CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3865[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ButtonEvent_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ButtonEvent_C_UserConstructionScript");
static_assert(sizeof(BP_ButtonEvent_C_UserConstructionScript) == 0x000088, "Wrong size on BP_ButtonEvent_C_UserConstructionScript");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ButtonEvent_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ButtonEvent_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ButtonEvent_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_ButtonEvent_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'BP_ButtonEvent_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000040, "Member 'BP_ButtonEvent_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_ButtonEvent_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_ButtonEvent_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_ButtonEvent_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ButtonEvent_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000070, "Member 'BP_ButtonEvent_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");

}

