#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Candles_Cluster_02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Candles_Cluster_02.BP_Candles_Cluster_02_C
// 0x0078 (0x0310 - 0x0298)
class ABP_Candles_Cluster_02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_WaxCandle01_011;                                // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_010;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ww1;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_09;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_08;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_07;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_06;                                 // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ww;                                                // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_05;                                 // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_04;                                 // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_03;                                 // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_02;                                 // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WaxCandle01_01;                                 // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Candles_Cluster_02_C">();
	}
	static class ABP_Candles_Cluster_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Candles_Cluster_02_C>();
	}
};
static_assert(alignof(ABP_Candles_Cluster_02_C) == 0x000008, "Wrong alignment on ABP_Candles_Cluster_02_C");
static_assert(sizeof(ABP_Candles_Cluster_02_C) == 0x000310, "Wrong size on ABP_Candles_Cluster_02_C");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_011) == 0x000298, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_011' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_010) == 0x0002A0, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_010' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, Ww1) == 0x0002A8, "Member 'ABP_Candles_Cluster_02_C::Ww1' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_09) == 0x0002B0, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_09' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_08) == 0x0002B8, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_08' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_07) == 0x0002C0, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_07' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_06) == 0x0002C8, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_06' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, Ww) == 0x0002D0, "Member 'ABP_Candles_Cluster_02_C::Ww' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_05) == 0x0002D8, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_05' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_04) == 0x0002E0, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_04' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, PointLight) == 0x0002E8, "Member 'ABP_Candles_Cluster_02_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_03) == 0x0002F0, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_03' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_02) == 0x0002F8, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_02' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, SM_WaxCandle01_01) == 0x000300, "Member 'ABP_Candles_Cluster_02_C::SM_WaxCandle01_01' has a wrong offset!");
static_assert(offsetof(ABP_Candles_Cluster_02_C, DefaultSceneRoot) == 0x000308, "Member 'ABP_Candles_Cluster_02_C::DefaultSceneRoot' has a wrong offset!");

}

