#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarGate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CarGate.BP_CarGate_C
// 0x0060 (0x02F8 - 0x0298)
class ABP_CarGate_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_CorrugatedFence_01;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_04;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_03;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_02;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_9BA98A8A40E9977FF3F66A9ACD711587; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_9BA98A8A40E9977FF3F66A9ACD711587; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3849[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Cars;                                              // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	bool                                          bOpen;                                             // 0x02F0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void CheckOpen();
	void Close();
	void CloseGate();
	void CountOccupedCars(int32* Count);
	void ExecuteUbergraph_BP_CarGate(int32 EntryPoint);
	void OnRep_bOpen();
	void OpenGate();
	void ResetOpen();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CarGate_C">();
	}
	static class ABP_CarGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CarGate_C>();
	}
};
static_assert(alignof(ABP_CarGate_C) == 0x000008, "Wrong alignment on ABP_CarGate_C");
static_assert(sizeof(ABP_CarGate_C) == 0x0002F8, "Wrong size on ABP_CarGate_C");
static_assert(offsetof(ABP_CarGate_C, UberGraphFrame) == 0x000298, "Member 'ABP_CarGate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, SM_CorrugatedFence_01) == 0x0002A0, "Member 'ABP_CarGate_C::SM_CorrugatedFence_01' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, SM_CorrugatedFence_04) == 0x0002A8, "Member 'ABP_CarGate_C::SM_CorrugatedFence_04' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, SM_CorrugatedFence_03) == 0x0002B0, "Member 'ABP_CarGate_C::SM_CorrugatedFence_03' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, SM_CorrugatedFence_02) == 0x0002B8, "Member 'ABP_CarGate_C::SM_CorrugatedFence_02' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, Sphere) == 0x0002C0, "Member 'ABP_CarGate_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_CarGate_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, Timeline_0_NewTrack_0_9BA98A8A40E9977FF3F66A9ACD711587) == 0x0002D0, "Member 'ABP_CarGate_C::Timeline_0_NewTrack_0_9BA98A8A40E9977FF3F66A9ACD711587' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, Timeline_0__Direction_9BA98A8A40E9977FF3F66A9ACD711587) == 0x0002D4, "Member 'ABP_CarGate_C::Timeline_0__Direction_9BA98A8A40E9977FF3F66A9ACD711587' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, Timeline_0) == 0x0002D8, "Member 'ABP_CarGate_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, Cars) == 0x0002E0, "Member 'ABP_CarGate_C::Cars' has a wrong offset!");
static_assert(offsetof(ABP_CarGate_C, bOpen) == 0x0002F0, "Member 'ABP_CarGate_C::bOpen' has a wrong offset!");

}

