#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Colonne

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Colonne.BP_Colonne_C
// 0x0018 (0x02B0 - 0x0298)
class ABP_Colonne_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Marble;                                            // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Colonne_C">();
	}
	static class ABP_Colonne_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Colonne_C>();
	}
};
static_assert(alignof(ABP_Colonne_C) == 0x000008, "Wrong alignment on ABP_Colonne_C");
static_assert(sizeof(ABP_Colonne_C) == 0x0002B0, "Wrong size on ABP_Colonne_C");
static_assert(offsetof(ABP_Colonne_C, StaticMesh) == 0x000298, "Member 'ABP_Colonne_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Colonne_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_Colonne_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Colonne_C, Marble) == 0x0002A8, "Member 'ABP_Colonne_C::Marble' has a wrong offset!");

}

