#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomPlayerStart

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomPlayerStart.BP_CustomPlayerStart_C
// 0x0038 (0x02D0 - 0x0298)
class ABP_CustomPlayerStart_C final : public AActor
{
public:
	class UCapsuleComponent*                      Capsule4;                                          // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule3;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule2;                                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule1;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	bool GetPlayerStartFromIndex(int32 Param_Index, struct FTransform* Transform);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CustomPlayerStart_C">();
	}
	static class ABP_CustomPlayerStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CustomPlayerStart_C>();
	}
};
static_assert(alignof(ABP_CustomPlayerStart_C) == 0x000008, "Wrong alignment on ABP_CustomPlayerStart_C");
static_assert(sizeof(ABP_CustomPlayerStart_C) == 0x0002D0, "Wrong size on ABP_CustomPlayerStart_C");
static_assert(offsetof(ABP_CustomPlayerStart_C, Capsule4) == 0x000298, "Member 'ABP_CustomPlayerStart_C::Capsule4' has a wrong offset!");
static_assert(offsetof(ABP_CustomPlayerStart_C, Capsule3) == 0x0002A0, "Member 'ABP_CustomPlayerStart_C::Capsule3' has a wrong offset!");
static_assert(offsetof(ABP_CustomPlayerStart_C, Capsule2) == 0x0002A8, "Member 'ABP_CustomPlayerStart_C::Capsule2' has a wrong offset!");
static_assert(offsetof(ABP_CustomPlayerStart_C, Capsule1) == 0x0002B0, "Member 'ABP_CustomPlayerStart_C::Capsule1' has a wrong offset!");
static_assert(offsetof(ABP_CustomPlayerStart_C, Arrow) == 0x0002B8, "Member 'ABP_CustomPlayerStart_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_CustomPlayerStart_C, Capsule) == 0x0002C0, "Member 'ABP_CustomPlayerStart_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_CustomPlayerStart_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_CustomPlayerStart_C::DefaultSceneRoot' has a wrong offset!");

}

