#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Chain.BP_Chain_C.AdaptCosmeticChain
// 0x0150 (0x0150 - 0x0000)
struct BP_Chain_C_AdaptCosmeticChain final
{
public:
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D04[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMiddleLocation_ReturnValue;            // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Get_Chain_Output;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMiddleLocation_ReturnValue_1;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast;         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_AdaptCosmeticChain) == 0x000008, "Wrong alignment on BP_Chain_C_AdaptCosmeticChain");
static_assert(sizeof(BP_Chain_C_AdaptCosmeticChain) == 0x000150, "Wrong size on BP_Chain_C_AdaptCosmeticChain");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_Divide_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_GetMiddleLocation_ReturnValue) == 0x000010, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_GetMiddleLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_Get_Chain_Output) == 0x000028, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_Get_Chain_Output' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_GetMiddleLocation_ReturnValue_1) == 0x000030, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_GetMiddleLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_VInterpTo_ReturnValue) == 0x000048, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000060, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AdaptCosmeticChain, CallFunc_VInterpTo_DeltaTime_ImplicitCast) == 0x000148, "Member 'BP_Chain_C_AdaptCosmeticChain::CallFunc_VInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.AddCaspule
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Chain_C_AddCaspule final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideInGame;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D05[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_AddCaspule) == 0x000010, "Wrong alignment on BP_Chain_C_AddCaspule");
static_assert(sizeof(BP_Chain_C_AddCaspule) == 0x0000A0, "Wrong size on BP_Chain_C_AddCaspule");
static_assert(offsetof(BP_Chain_C_AddCaspule, Param_Index) == 0x000000, "Member 'BP_Chain_C_AddCaspule::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCaspule, HideInGame) == 0x000004, "Member 'BP_Chain_C_AddCaspule::HideInGame' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCaspule, ReturnValue) == 0x000008, "Member 'BP_Chain_C_AddCaspule::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCaspule, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000010, "Member 'BP_Chain_C_AddCaspule::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCaspule, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_Chain_C_AddCaspule::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCaspule, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_Chain_C_AddCaspule::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCaspule, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'BP_Chain_C_AddCaspule::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCaspule, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'BP_Chain_C_AddCaspule::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.AddChainConstraint
// 0x0190 (0x0190 - 0x0000)
struct BP_Chain_C_AddChainConstraint final
{
public:
	class UPrimitiveComponent*                    Component1;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component2;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            Const;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D06[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Chain_C_AddChainConstraint) == 0x000010, "Wrong alignment on BP_Chain_C_AddChainConstraint");
static_assert(sizeof(BP_Chain_C_AddChainConstraint) == 0x000190, "Wrong size on BP_Chain_C_AddChainConstraint");
static_assert(offsetof(BP_Chain_C_AddChainConstraint, Component1) == 0x000000, "Member 'BP_Chain_C_AddChainConstraint::Component1' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddChainConstraint, Component2) == 0x000008, "Member 'BP_Chain_C_AddChainConstraint::Component2' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddChainConstraint, Location) == 0x000010, "Member 'BP_Chain_C_AddChainConstraint::Location' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddChainConstraint, Const) == 0x000028, "Member 'BP_Chain_C_AddChainConstraint::Const' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddChainConstraint, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_Chain_C_AddChainConstraint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddChainConstraint, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'BP_Chain_C_AddChainConstraint::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddChainConstraint, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'BP_Chain_C_AddChainConstraint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddChainConstraint, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000A0, "Member 'BP_Chain_C_AddChainConstraint::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.AddCubeSocket
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Chain_C_AddCubeSocket final
{
public:
	struct FVector                                Relative_Transform_Location;                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewHidden;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D07[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D08[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D09[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_AddCubeSocket) == 0x000010, "Wrong alignment on BP_Chain_C_AddCubeSocket");
static_assert(sizeof(BP_Chain_C_AddCubeSocket) == 0x0000A0, "Wrong size on BP_Chain_C_AddCubeSocket");
static_assert(offsetof(BP_Chain_C_AddCubeSocket, Relative_Transform_Location) == 0x000000, "Member 'BP_Chain_C_AddCubeSocket::Relative_Transform_Location' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCubeSocket, NewHidden) == 0x000018, "Member 'BP_Chain_C_AddCubeSocket::NewHidden' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCubeSocket, ReturnValue) == 0x000020, "Member 'BP_Chain_C_AddCubeSocket::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCubeSocket, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_Chain_C_AddCubeSocket::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCubeSocket, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'BP_Chain_C_AddCubeSocket::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddCubeSocket, CallFunc_AddComponent_ReturnValue) == 0x000098, "Member 'BP_Chain_C_AddCubeSocket::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.AddFakeChain
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Chain_C_AddFakeChain final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Start;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0B[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetFakeChain_Output;                      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Get_Chain_Output;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_AddFakeChain) == 0x000010, "Wrong alignment on BP_Chain_C_AddFakeChain");
static_assert(sizeof(BP_Chain_C_AddFakeChain) == 0x0000E0, "Wrong size on BP_Chain_C_AddFakeChain");
static_assert(offsetof(BP_Chain_C_AddFakeChain, Param_Index) == 0x000000, "Member 'BP_Chain_C_AddFakeChain::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, Start) == 0x000004, "Member 'BP_Chain_C_AddFakeChain::Start' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'BP_Chain_C_AddFakeChain::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_Chain_C_AddFakeChain::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_Chain_C_AddFakeChain::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_Conv_StringToName_ReturnValue) == 0x00002C, "Member 'BP_Chain_C_AddFakeChain::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_GetFakeChain_Output) == 0x000038, "Member 'BP_Chain_C_AddFakeChain::CallFunc_GetFakeChain_Output' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, K2Node_MakeArray_Array) == 0x000040, "Member 'BP_Chain_C_AddFakeChain::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_Chain_C_AddFakeChain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_Get_Chain_Output) == 0x000058, "Member 'BP_Chain_C_AddFakeChain::CallFunc_Get_Chain_Output' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_Chain_C_AddFakeChain::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_AddComponent_ReturnValue) == 0x0000C0, "Member 'BP_Chain_C_AddFakeChain::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_AddFakeChain, CallFunc_GetSocketLocation_ReturnValue) == 0x0000C8, "Member 'BP_Chain_C_AddFakeChain::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.AddImpulseOnSocket
// 0x0008 (0x0008 - 0x0000)
struct BP_Chain_C_AddImpulseOnSocket final
{
public:
	class UPrimitiveComponent*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_AddImpulseOnSocket) == 0x000008, "Wrong alignment on BP_Chain_C_AddImpulseOnSocket");
static_assert(sizeof(BP_Chain_C_AddImpulseOnSocket) == 0x000008, "Wrong size on BP_Chain_C_AddImpulseOnSocket");
static_assert(offsetof(BP_Chain_C_AddImpulseOnSocket, Target) == 0x000000, "Member 'BP_Chain_C_AddImpulseOnSocket::Target' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.Adjust Chains Location
// 0x0200 (0x0200 - 0x0000)
struct BP_Chain_C_Adjust_Chains_Location final
{
public:
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0018(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0118(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Chain_C_Adjust_Chains_Location) == 0x000008, "Wrong alignment on BP_Chain_C_Adjust_Chains_Location");
static_assert(sizeof(BP_Chain_C_Adjust_Chains_Location) == 0x000200, "Wrong size on BP_Chain_C_Adjust_Chains_Location");
static_assert(offsetof(BP_Chain_C_Adjust_Chains_Location, CallFunc_GetSocketLocation_ReturnValue) == 0x000000, "Member 'BP_Chain_C_Adjust_Chains_Location::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_Adjust_Chains_Location, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000018, "Member 'BP_Chain_C_Adjust_Chains_Location::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_Adjust_Chains_Location, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000100, "Member 'BP_Chain_C_Adjust_Chains_Location::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_Adjust_Chains_Location, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000118, "Member 'BP_Chain_C_Adjust_Chains_Location::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.Bounce
// 0x0018 (0x0018 - 0x0000)
struct BP_Chain_C_Bounce final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_Bounce) == 0x000008, "Wrong alignment on BP_Chain_C_Bounce");
static_assert(sizeof(BP_Chain_C_Bounce) == 0x000018, "Wrong size on BP_Chain_C_Bounce");
static_assert(offsetof(BP_Chain_C_Bounce, Velocity) == 0x000000, "Member 'BP_Chain_C_Bounce::Velocity' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.CalculateChainDistance
// 0x0098 (0x0098 - 0x0000)
struct BP_Chain_C_CalculateChainDistance final
{
public:
	double                                        Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Addition;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue;           // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0D[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0E[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0F[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_CalculateChainDistance) == 0x000008, "Wrong alignment on BP_Chain_C_CalculateChainDistance");
static_assert(sizeof(BP_Chain_C_CalculateChainDistance) == 0x000098, "Wrong size on BP_Chain_C_CalculateChainDistance");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, Result) == 0x000000, "Member 'BP_Chain_C_CalculateChainDistance::Result' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, Addition) == 0x000008, "Member 'BP_Chain_C_CalculateChainDistance::Addition' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Chain_C_CalculateChainDistance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_Chain_C_CalculateChainDistance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_GetComponentsByTag_ReturnValue) == 0x000020, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000068, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_Vector_Distance_ReturnValue) == 0x000088, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CalculateChainDistance, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_Chain_C_CalculateChainDistance::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.CanFollow
// 0x0018 (0x0018 - 0x0000)
struct BP_Chain_C_CanFollow final
{
public:
	class UActorComponent*                        Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D10[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_CanFollow) == 0x000008, "Wrong alignment on BP_Chain_C_CanFollow");
static_assert(sizeof(BP_Chain_C_CanFollow) == 0x000018, "Wrong size on BP_Chain_C_CanFollow");
static_assert(offsetof(BP_Chain_C_CanFollow, Self2) == 0x000000, "Member 'BP_Chain_C_CanFollow::Self2' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CanFollow, ReturnValue) == 0x000008, "Member 'BP_Chain_C_CanFollow::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CanFollow, CallFunc_Array_Get_Item) == 0x00000C, "Member 'BP_Chain_C_CanFollow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_CanFollow, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000014, "Member 'BP_Chain_C_CanFollow::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.DissolveChain
// 0x0010 (0x0010 - 0x0000)
struct BP_Chain_C_DissolveChain final
{
public:
	double                                        PlayRate;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlaySound;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chain_C_DissolveChain) == 0x000008, "Wrong alignment on BP_Chain_C_DissolveChain");
static_assert(sizeof(BP_Chain_C_DissolveChain) == 0x000010, "Wrong size on BP_Chain_C_DissolveChain");
static_assert(offsetof(BP_Chain_C_DissolveChain, PlayRate) == 0x000000, "Member 'BP_Chain_C_DissolveChain::PlayRate' has a wrong offset!");
static_assert(offsetof(BP_Chain_C_DissolveChain, PlaySound) == 0x000008, "Member 'BP_Chain_C_DissolveChain::PlaySound' has a wrong offset!");

// Function BP_Chain.BP_Chain_C.ExecuteUbergraph_BP_Chain
// 0x0AA8 (0x0AA8 - 0x0000)
struct BP_Chain_C_ExecuteUbergraph_BP_Chain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SnapTips;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D11[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Velocity;                             // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_PlayRate;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlaySound;                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D12[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Impulse;                              // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Character;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Target;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Character;                      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Loc_1;                                // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D13[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Loc;                                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0190(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_NewDensity;                           // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D14[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_NewChainMass;                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Human;                                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D15[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index;                                // 0x028C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Char;                                 // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D16[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Puller;                               // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x02C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D17[0x3];                                     // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D18[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_NewWeight;                            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D19[0x3];                                     // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1A[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetFakeChainSocket_Socket;                // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1B[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetFakeChainSocket_Socket_1;              // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1C[0x2];                                     // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Get_Chain_Output;                         // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1D[0x3];                                     // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Get_Chain_Output_1;                       // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            CallFunc_Array_Get_Item;                           // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1E[0x7];                                     // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1F[0x3];                                     // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Density;                        // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Mass_in_Kg;                     // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Get_Chain_Output_2;                       // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue_1;   // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D20[0x6];                                     // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x0500(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x05E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_3;     // 0x0600(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IBPI_ChainAttachment_C> K2Node_DynamicCast_AsBPI_Chain_Attachment;         // 0x06E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D21[0x7];                                     // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ChainAttachment_C> K2Node_DynamicCast_AsBPI_Chain_Attachment_1;       // 0x0700(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D22[0x7];                                     // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetAttachedComponent_Comp;                // 0x0718(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetAttachedComponent_Comp_1;              // 0x0720(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_2;              // 0x0728(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D23[0x7];                                     // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_3;              // 0x0740(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D24[0x7];                                     // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_4;              // 0x0758(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D25[0x7];                                     // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_5;              // 0x0770(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D26[0x2];                                     // 0x0782(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D27[0x4];                                     // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Get_Chain_Output_3;                       // 0x0790(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D28[0x3];                                     // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D29[0x7];                                     // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_CubeSocket;                           // 0x07A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetFirstSphere_Output;                    // 0x07B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2A[0x7];                                     // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x07C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_4;     // 0x07D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x08C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_5;     // 0x08D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ACubeToPlayerConstraint_C*              CallFunc_TrySpawnCubeToPlayerConstraint_Constraint; // 0x09C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACubeToPlayerConstraint_C*              CallFunc_TrySpawnCubeToPlayerConstraint_Constraint_1; // 0x09C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x09D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x09E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACubeToPlayerConstraint_C*              CallFunc_TrySpawnCubeToPlayerConstraint_Constraint_2; // 0x0A00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACubeToPlayerConstraint_C*              CallFunc_TrySpawnCubeToPlayerConstraint_Constraint_3; // 0x0A08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ChainAttachment_C> K2Node_DynamicCast_AsBPI_Chain_Attachment_2;       // 0x0A10(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0A20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2B[0x7];                                     // 0x0A21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetAttachedComponent_Comp_2;              // 0x0A28(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ChainAttachment_C> K2Node_DynamicCast_AsBPI_Chain_Attachment_3;       // 0x0A30(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2C[0x7];                                     // 0x0A41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetLastSphere_Output;                     // 0x0A48(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetAttachedComponent_Comp_3;              // 0x0A50(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculateChainDistance_Result;            // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2D[0x4];                                     // 0x0A64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue;           // 0x0A68(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0A78(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0A80(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
