#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Candles_02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Candles_02.BP_Candles_02_C
// 0x0070 (0x0308 - 0x0298)
class ABP_Candles_02_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                New_Location;                                      // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Default_Location;                                  // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Light_On;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C85[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollection*           MPCTOD;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Parameter_Name;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Candles_02(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Toggle();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Candles_02_C">();
	}
	static class ABP_Candles_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Candles_02_C>();
	}
};
static_assert(alignof(ABP_Candles_02_C) == 0x000008, "Wrong alignment on ABP_Candles_02_C");
static_assert(sizeof(ABP_Candles_02_C) == 0x000308, "Wrong size on ABP_Candles_02_C");
static_assert(offsetof(ABP_Candles_02_C, UberGraphFrame) == 0x000298, "Member 'ABP_Candles_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, ParticleSystem) == 0x0002A0, "Member 'ABP_Candles_02_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, Candle) == 0x0002A8, "Member 'ABP_Candles_02_C::Candle' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, PointLight) == 0x0002B0, "Member 'ABP_Candles_02_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Candles_02_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, New_Location) == 0x0002C0, "Member 'ABP_Candles_02_C::New_Location' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, Default_Location) == 0x0002D8, "Member 'ABP_Candles_02_C::Default_Location' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, Light_On) == 0x0002F0, "Member 'ABP_Candles_02_C::Light_On' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, MPCTOD) == 0x0002F8, "Member 'ABP_Candles_02_C::MPCTOD' has a wrong offset!");
static_assert(offsetof(ABP_Candles_02_C, Parameter_Name) == 0x000300, "Member 'ABP_Candles_02_C::Parameter_Name' has a wrong offset!");

}

