#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarRespawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CarRespawner.BP_CarRespawner_C.BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_CarRespawner_C_BndEvt__BP_CarRespawner_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_CarRespawner.BP_CarRespawner_C.ExecuteUbergraph_BP_CarRespawner
// 0x0068 (0x0068 - 0x0000)
struct BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383B[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Vehicle_C>        K2Node_DynamicCast_AsBPI_Vehicle;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383C[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Vehicle_C>        K2Node_DynamicCast_AsBPI_Vehicle_1;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCarVisible_Visible;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383D[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomCar_C*                        K2Node_DynamicCast_AsBP_Custom_Car;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner) == 0x000008, "Wrong alignment on BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner");
static_assert(sizeof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner) == 0x000068, "Wrong size on BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, EntryPoint) == 0x000000, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_DynamicCast_AsBPI_Vehicle) == 0x000028, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_DynamicCast_AsBPI_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, CallFunc_Array_Contains_ReturnValue) == 0x000039, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_DynamicCast_AsBPI_Vehicle_1) == 0x000040, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_DynamicCast_AsBPI_Vehicle_1' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, CallFunc_IsCarVisible_Visible) == 0x000052, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::CallFunc_IsCarVisible_Visible' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_DynamicCast_AsBP_Custom_Car) == 0x000058, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_DynamicCast_AsBP_Custom_Car' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BP_CarRespawner_C_ExecuteUbergraph_BP_CarRespawner::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_CarRespawner.BP_CarRespawner_C.Init
// 0x0090 (0x0090 - 0x0000)
struct BP_CarRespawner_C_Init final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383F[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarRespawner_C_Init) == 0x000010, "Wrong alignment on BP_CarRespawner_C_Init");
static_assert(sizeof(BP_CarRespawner_C_Init) == 0x000090, "Wrong size on BP_CarRespawner_C_Init");
static_assert(offsetof(BP_CarRespawner_C_Init, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_CarRespawner_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_Init, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_CarRespawner_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_CarRespawner_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_Init, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_CarRespawner_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_CarRespawner_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_Init, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_CarRespawner_C_Init::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarRespawner_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_CarRespawner_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

