#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomPlayerStart

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomPlayerStart.BP_CustomPlayerStart_C.GetPlayerStartFromIndex
// 0x00F0 (0x00F0 - 0x0000)
struct BP_CustomPlayerStart_C_GetPlayerStartFromIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EAE[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EAF[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCapsuleComponent*>              K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCapsuleComponent*                      CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex) == 0x000010, "Wrong alignment on BP_CustomPlayerStart_C_GetPlayerStartFromIndex");
static_assert(sizeof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex) == 0x0000F0, "Wrong size on BP_CustomPlayerStart_C_GetPlayerStartFromIndex");
static_assert(offsetof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex, Param_Index) == 0x000000, "Member 'BP_CustomPlayerStart_C_GetPlayerStartFromIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex, Transform) == 0x000010, "Member 'BP_CustomPlayerStart_C_GetPlayerStartFromIndex::Transform' has a wrong offset!");
static_assert(offsetof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex, ReturnValue) == 0x000070, "Member 'BP_CustomPlayerStart_C_GetPlayerStartFromIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex, CallFunc_InRange_IntInt_ReturnValue) == 0x000071, "Member 'BP_CustomPlayerStart_C_GetPlayerStartFromIndex::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_CustomPlayerStart_C_GetPlayerStartFromIndex::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_CustomPlayerStart_C_GetPlayerStartFromIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomPlayerStart_C_GetPlayerStartFromIndex, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000090, "Member 'BP_CustomPlayerStart_C_GetPlayerStartFromIndex::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");

}

