#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chimney

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Chimney.BP_Chimney_C
// 0x0048 (0x02E0 - 0x0298)
class ABP_Chimney_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Chimney;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Impulse_Z;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          PlayImpulseSound;                                  // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          PlayFanSound;                                      // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__BP_Chimney_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_Chimney(int32 EntryPoint);
	void ImpulseAll();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Chimney_C">();
	}
	static class ABP_Chimney_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Chimney_C>();
	}
};
static_assert(alignof(ABP_Chimney_C) == 0x000008, "Wrong alignment on ABP_Chimney_C");
static_assert(sizeof(ABP_Chimney_C) == 0x0002E0, "Wrong size on ABP_Chimney_C");
static_assert(offsetof(ABP_Chimney_C, UberGraphFrame) == 0x000298, "Member 'ABP_Chimney_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, Audio) == 0x0002A0, "Member 'ABP_Chimney_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, Box) == 0x0002A8, "Member 'ABP_Chimney_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, PS_Chimney) == 0x0002B0, "Member 'ABP_Chimney_C::PS_Chimney' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, ParticleSystem) == 0x0002B8, "Member 'ABP_Chimney_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, StaticMesh) == 0x0002C0, "Member 'ABP_Chimney_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Chimney_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, Impulse_Z) == 0x0002D0, "Member 'ABP_Chimney_C::Impulse_Z' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, PlayImpulseSound) == 0x0002D8, "Member 'ABP_Chimney_C::PlayImpulseSound' has a wrong offset!");
static_assert(offsetof(ABP_Chimney_C, PlayFanSound) == 0x0002D9, "Member 'ABP_Chimney_C::PlayFanSound' has a wrong offset!");

}

