#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Catapult

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Catapult.BP_Catapult_C.ExecuteUbergraph_BP_Catapult
// 0x0540 (0x0540 - 0x0000)
struct BP_Catapult_C_ExecuteUbergraph_BP_Catapult final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C58[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C59[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0068(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_2;    // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5A[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5B[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x01F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5C[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x02E0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5D[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5E[0x6];                                     // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x0318(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5F[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_1;    // 0x0348(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetPlayerCount_ReturnValue;               // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C60[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ChainPhysics_C>   K2Node_DynamicCast_AsBPI_Chain_Physics;            // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C61[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C62[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C63[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Optimise;                             // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C64[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateTurn_TurnRate;                      // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0420(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0510(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C65[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_RepYaw_ImplicitCast;            // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult) == 0x000008, "Wrong alignment on BP_Catapult_C_ExecuteUbergraph_BP_Catapult");
static_assert(sizeof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult) == 0x000540, "Wrong size on BP_Catapult_C_ExecuteUbergraph_BP_Catapult");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, EntryPoint) == 0x000000, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000011, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_HasAuthority_ReturnValue) == 0x000012, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, Temp_bool_Has_Been_Initd_Variable) == 0x000013, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, Temp_bool_IsClosed_Variable) == 0x000020, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000028, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_MakeRotator_ReturnValue) == 0x000050, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000068, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000150, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_K2_GetComponentRotation_ReturnValue_2) == 0x000168, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_K2_GetComponentRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Roll_1) == 0x000180, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Pitch_1) == 0x000184, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Yaw_1) == 0x000188, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_MakeRotator_ReturnValue_1) == 0x000190, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001A8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_RInterpTo_ReturnValue) == 0x0001B0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Roll_2) == 0x0001C8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Pitch_2) == 0x0001CC, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_BreakRotator_Yaw_2) == 0x0001D0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_MakeRotator_ReturnValue_2) == 0x0001D8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x0001F0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_HasAuthority_ReturnValue_1) == 0x0002D8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_GetAllActorsWithInterface_OutActors) == 0x0002E0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Array_Get_Item) == 0x0002F0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Array_Length_ReturnValue) == 0x0002F8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_DynamicCast_AsBPI_Character) == 0x000300, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_DynamicCast_bSuccess) == 0x000310, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Less_IntInt_ReturnValue) == 0x000311, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_DynamicCast_AsBPI_Character_1) == 0x000318, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_DynamicCast_AsBPI_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_DynamicCast_bSuccess_1) == 0x000328, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_GetForwardVector_ReturnValue) == 0x000330, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_GetAllActorsWithInterface_OutActors_1) == 0x000348, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_GetAllActorsWithInterface_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_GetPlayerCount_ReturnValue) == 0x000358, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_GetPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Array_Get_Item_1) == 0x000360, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000368, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_DynamicCast_AsBPI_Chain_Physics) == 0x000370, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_DynamicCast_AsBPI_Chain_Physics' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_DynamicCast_bSuccess_2) == 0x000380, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_MapRangeClamped_ReturnValue) == 0x000388, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Array_Length_ReturnValue_1) == 0x000390, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000398, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003A0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003A8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_Event_Optimise) == 0x0003C0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_Event_Optimise' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0003C8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0003E0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_UpdateTurn_TurnRate) == 0x0003E8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_UpdateTurn_TurnRate' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0003F0, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0003F8, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_MakeRotator_ReturnValue_3) == 0x000400, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000418, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000420, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_FInterpTo_ReturnValue) == 0x000508, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000510, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_Array_IsEmpty_ReturnValue) == 0x000520, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, K2Node_VariableSet_RepYaw_ImplicitCast) == 0x000528, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::K2Node_VariableSet_RepYaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000530, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x000534, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_ExecuteUbergraph_BP_Catapult, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x000538, "Member 'BP_Catapult_C_ExecuteUbergraph_BP_Catapult::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.GetBoxArray
// 0x0020 (0x0020 - 0x0000)
struct BP_Catapult_C_GetBoxArray final
{
public:
	TArray<class UBoxComponent*>                  Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UBoxComponent*>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Catapult_C_GetBoxArray) == 0x000008, "Wrong alignment on BP_Catapult_C_GetBoxArray");
static_assert(sizeof(BP_Catapult_C_GetBoxArray) == 0x000020, "Wrong size on BP_Catapult_C_GetBoxArray");
static_assert(offsetof(BP_Catapult_C_GetBoxArray, Array) == 0x000000, "Member 'BP_Catapult_C_GetBoxArray::Array' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_GetBoxArray, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_Catapult_C_GetBoxArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.GetLeftBoxes
// 0x0020 (0x0020 - 0x0000)
struct BP_Catapult_C_GetLeftBoxes final
{
public:
	TArray<class UBoxComponent*>                  Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UBoxComponent*>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Catapult_C_GetLeftBoxes) == 0x000008, "Wrong alignment on BP_Catapult_C_GetLeftBoxes");
static_assert(sizeof(BP_Catapult_C_GetLeftBoxes) == 0x000020, "Wrong size on BP_Catapult_C_GetLeftBoxes");
static_assert(offsetof(BP_Catapult_C_GetLeftBoxes, Array) == 0x000000, "Member 'BP_Catapult_C_GetLeftBoxes::Array' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_GetLeftBoxes, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_Catapult_C_GetLeftBoxes::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.GetRightBoxes
// 0x0020 (0x0020 - 0x0000)
struct BP_Catapult_C_GetRightBoxes final
{
public:
	TArray<class UBoxComponent*>                  Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UBoxComponent*>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Catapult_C_GetRightBoxes) == 0x000008, "Wrong alignment on BP_Catapult_C_GetRightBoxes");
static_assert(sizeof(BP_Catapult_C_GetRightBoxes) == 0x000020, "Wrong size on BP_Catapult_C_GetRightBoxes");
static_assert(offsetof(BP_Catapult_C_GetRightBoxes, Array) == 0x000000, "Member 'BP_Catapult_C_GetRightBoxes::Array' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_GetRightBoxes, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_Catapult_C_GetRightBoxes::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct BP_Catapult_C_IsActivated final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Catapult_C_IsActivated) == 0x000001, "Wrong alignment on BP_Catapult_C_IsActivated");
static_assert(sizeof(BP_Catapult_C_IsActivated) == 0x000001, "Wrong size on BP_Catapult_C_IsActivated");
static_assert(offsetof(BP_Catapult_C_IsActivated, Activated) == 0x000000, "Member 'BP_Catapult_C_IsActivated::Activated' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.IsPlayerPushing
// 0x0050 (0x0050 - 0x0000)
struct BP_Catapult_C_IsPlayerPushing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C66[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBoxComponent*>                  CallFunc_GetBoxArray_Array;                        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBoxComponent*                          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C67[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C68[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Catapult_C_IsPlayerPushing) == 0x000008, "Wrong alignment on BP_Catapult_C_IsPlayerPushing");
static_assert(sizeof(BP_Catapult_C_IsPlayerPushing) == 0x000050, "Wrong size on BP_Catapult_C_IsPlayerPushing");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, ReturnValue) == 0x000000, "Member 'BP_Catapult_C_IsPlayerPushing::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Catapult_C_IsPlayerPushing::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Catapult_C_IsPlayerPushing::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Catapult_C_IsPlayerPushing::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, CallFunc_GetBoxArray_Array) == 0x000010, "Member 'BP_Catapult_C_IsPlayerPushing::CallFunc_GetBoxArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Catapult_C_IsPlayerPushing::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Catapult_C_IsPlayerPushing::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000030, "Member 'BP_Catapult_C_IsPlayerPushing::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_Catapult_C_IsPlayerPushing::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'BP_Catapult_C_IsPlayerPushing::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsPlayerPushing, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'BP_Catapult_C_IsPlayerPushing::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.IsSomeoneInside
// 0x0040 (0x0040 - 0x0000)
struct BP_Catapult_C_IsSomeoneInside final
{
public:
	TArray<class UBoxComponent*>                  Boxes;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C69[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C6A[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Catapult_C_IsSomeoneInside) == 0x000008, "Wrong alignment on BP_Catapult_C_IsSomeoneInside");
static_assert(sizeof(BP_Catapult_C_IsSomeoneInside) == 0x000040, "Wrong size on BP_Catapult_C_IsSomeoneInside");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, Boxes) == 0x000000, "Member 'BP_Catapult_C_IsSomeoneInside::Boxes' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, ReturnValue) == 0x000010, "Member 'BP_Catapult_C_IsSomeoneInside::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_Catapult_C_IsSomeoneInside::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_Catapult_C_IsSomeoneInside::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_Catapult_C_IsSomeoneInside::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Catapult_C_IsSomeoneInside::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000028, "Member 'BP_Catapult_C_IsSomeoneInside::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Catapult_C_IsSomeoneInside::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, CallFunc_Array_IsEmpty_ReturnValue) == 0x000039, "Member 'BP_Catapult_C_IsSomeoneInside::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_IsSomeoneInside, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_Catapult_C_IsSomeoneInside::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.Optimise
// 0x0001 (0x0001 - 0x0000)
struct BP_Catapult_C_Optimise final
{
public:
	bool                                          Param_Optimise;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Catapult_C_Optimise) == 0x000001, "Wrong alignment on BP_Catapult_C_Optimise");
static_assert(sizeof(BP_Catapult_C_Optimise) == 0x000001, "Wrong size on BP_Catapult_C_Optimise");
static_assert(offsetof(BP_Catapult_C_Optimise, Param_Optimise) == 0x000000, "Member 'BP_Catapult_C_Optimise::Param_Optimise' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Catapult_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Catapult_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Catapult_C_ReceiveTick");
static_assert(sizeof(BP_Catapult_C_ReceiveTick) == 0x000004, "Wrong size on BP_Catapult_C_ReceiveTick");
static_assert(offsetof(BP_Catapult_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Catapult_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.UpdateTurn
// 0x0040 (0x0040 - 0x0000)
struct BP_Catapult_C_UpdateTurn final
{
public:
	double                                        TurnRate;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewLocalVar;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBoxComponent*>                  CallFunc_GetLeftBoxes_Array;                       // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UBoxComponent*>                  CallFunc_GetRightBoxes_Array;                      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsSomeoneInside_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomeoneInside_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C6B[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Catapult_C_UpdateTurn) == 0x000008, "Wrong alignment on BP_Catapult_C_UpdateTurn");
static_assert(sizeof(BP_Catapult_C_UpdateTurn) == 0x000040, "Wrong size on BP_Catapult_C_UpdateTurn");
static_assert(offsetof(BP_Catapult_C_UpdateTurn, TurnRate) == 0x000000, "Member 'BP_Catapult_C_UpdateTurn::TurnRate' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_UpdateTurn, NewLocalVar) == 0x000008, "Member 'BP_Catapult_C_UpdateTurn::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_UpdateTurn, CallFunc_GetLeftBoxes_Array) == 0x000010, "Member 'BP_Catapult_C_UpdateTurn::CallFunc_GetLeftBoxes_Array' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_UpdateTurn, CallFunc_GetRightBoxes_Array) == 0x000020, "Member 'BP_Catapult_C_UpdateTurn::CallFunc_GetRightBoxes_Array' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_UpdateTurn, CallFunc_IsSomeoneInside_ReturnValue) == 0x000030, "Member 'BP_Catapult_C_UpdateTurn::CallFunc_IsSomeoneInside_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_UpdateTurn, CallFunc_IsSomeoneInside_ReturnValue_1) == 0x000031, "Member 'BP_Catapult_C_UpdateTurn::CallFunc_IsSomeoneInside_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Catapult_C_UpdateTurn, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_Catapult_C_UpdateTurn::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Catapult.BP_Catapult_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_Catapult_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Catapult_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_Catapult_C_UserConstructionScript");
static_assert(sizeof(BP_Catapult_C_UserConstructionScript) == 0x000001, "Wrong size on BP_Catapult_C_UserConstructionScript");
static_assert(offsetof(BP_Catapult_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'BP_Catapult_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

