#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarEnd

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CarEnd.BP_CarEnd_C.BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384E[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_CarEnd_C_BndEvt__BP_CarEnd_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_CarEnd.BP_CarEnd_C.ExecuteUbergraph_BP_CarEnd
// 0x0168 (0x0168 - 0x0000)
struct BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CustomCar_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3850[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3851[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomCar_C*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Vehicle_C>        K2Node_DynamicCast_AsBPI_Vehicle;                  // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3852[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3853[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0070(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_CustomCar_C*                        K2Node_DynamicCast_AsBP_Custom_Car;                // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd) == 0x000008, "Wrong alignment on BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd");
static_assert(sizeof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd) == 0x000168, "Wrong size on BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, EntryPoint) == 0x000000, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, CallFunc_HasAuthority_ReturnValue) == 0x00002C, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_DynamicCast_AsBPI_Vehicle) == 0x000038, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_DynamicCast_AsBPI_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000050, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_ComponentBoundEvent_OtherActor) == 0x000058, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_ComponentBoundEvent_OtherComp) == 0x000060, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000068, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_ComponentBoundEvent_bFromSweep) == 0x00006C, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_ComponentBoundEvent_SweepResult) == 0x000070, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_DynamicCast_AsBP_Custom_Car) == 0x000158, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_DynamicCast_AsBP_Custom_Car' has a wrong offset!");
static_assert(offsetof(BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'BP_CarEnd_C_ExecuteUbergraph_BP_CarEnd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

