#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Candles_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Candles_02.BP_Candles_02_C.ExecuteUbergraph_BP_Candles_02
// 0x01D0 (0x01D0 - 0x0000)
struct BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0068(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C86[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C87[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02) == 0x000008, "Wrong alignment on BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02");
static_assert(sizeof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02) == 0x0001D0, "Wrong size on BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, EntryPoint) == 0x000000, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_RandomUnitVector_ReturnValue) == 0x000020, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_VLerp_ReturnValue) == 0x000038, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000068, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_RandomFloatInRange_ReturnValue) == 0x000150, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_BreakVector_X) == 0x000158, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_BreakVector_Y) == 0x000160, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_BreakVector_Z) == 0x000168, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_Add_VectorVector_ReturnValue) == 0x000170, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_BreakVector_X_1) == 0x000188, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_BreakVector_Y_1) == 0x000190, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_BreakVector_Z_1) == 0x000198, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_MakeVector_ReturnValue) == 0x0001A0, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_GetScalarParameterValue_ReturnValue) == 0x0001B8, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001BC, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_Delay_Duration_ImplicitCast) == 0x0001C0, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001C8, "Member 'BP_Candles_02_C_ExecuteUbergraph_BP_Candles_02::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Candles_02.BP_Candles_02_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Candles_02_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Candles_02_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Candles_02_C_ReceiveTick");
static_assert(sizeof(BP_Candles_02_C_ReceiveTick) == 0x000004, "Wrong size on BP_Candles_02_C_ReceiveTick");
static_assert(offsetof(BP_Candles_02_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Candles_02_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Candles_02.BP_Candles_02_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_Candles_02_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C88[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Candles_02_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Candles_02_C_UserConstructionScript");
static_assert(sizeof(BP_Candles_02_C_UserConstructionScript) == 0x000020, "Wrong size on BP_Candles_02_C_UserConstructionScript");
static_assert(offsetof(BP_Candles_02_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_Candles_02_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Candles_02_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_Candles_02_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

}

