#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CosmeticChain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CosmeticChain.BP_CosmeticChain_C.AddConstraint
// 0x0090 (0x0090 - 0x0000)
struct BP_CosmeticChain_C_AddConstraint final
{
public:
	struct FVector                                RelativeTransform_Location;                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CosmeticChain_C_AddConstraint) == 0x000010, "Wrong alignment on BP_CosmeticChain_C_AddConstraint");
static_assert(sizeof(BP_CosmeticChain_C_AddConstraint) == 0x000090, "Wrong size on BP_CosmeticChain_C_AddConstraint");
static_assert(offsetof(BP_CosmeticChain_C_AddConstraint, RelativeTransform_Location) == 0x000000, "Member 'BP_CosmeticChain_C_AddConstraint::RelativeTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_AddConstraint, ReturnValue) == 0x000018, "Member 'BP_CosmeticChain_C_AddConstraint::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_AddConstraint, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_CosmeticChain_C_AddConstraint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_AddConstraint, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'BP_CosmeticChain_C_AddConstraint::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function BP_CosmeticChain.BP_CosmeticChain_C.AutoDestroy
// 0x0001 (0x0001 - 0x0000)
struct BP_CosmeticChain_C_AutoDestroy final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CosmeticChain_C_AutoDestroy) == 0x000001, "Wrong alignment on BP_CosmeticChain_C_AutoDestroy");
static_assert(sizeof(BP_CosmeticChain_C_AutoDestroy) == 0x000001, "Wrong size on BP_CosmeticChain_C_AutoDestroy");
static_assert(offsetof(BP_CosmeticChain_C_AutoDestroy, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_CosmeticChain_C_AutoDestroy::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CosmeticChain.BP_CosmeticChain_C.CalculateDistance
// 0x0080 (0x0080 - 0x0000)
struct BP_CosmeticChain_C_CalculateDistance final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Total;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PreviousMaillon;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CosmeticChain_C_CalculateDistance) == 0x000008, "Wrong alignment on BP_CosmeticChain_C_CalculateDistance");
static_assert(sizeof(BP_CosmeticChain_C_CalculateDistance) == 0x000080, "Wrong size on BP_CosmeticChain_C_CalculateDistance");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, Distance) == 0x000000, "Member 'BP_CosmeticChain_C_CalculateDistance::Distance' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, Total) == 0x000008, "Member 'BP_CosmeticChain_C_CalculateDistance::Total' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, PreviousMaillon) == 0x000010, "Member 'BP_CosmeticChain_C_CalculateDistance::PreviousMaillon' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_CosmeticChain_C_CalculateDistance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_CosmeticChain_C_CalculateDistance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000058, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_Vector_Distance_ReturnValue) == 0x000070, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_CalculateDistance, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_CosmeticChain_C_CalculateDistance::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_CosmeticChain.BP_CosmeticChain_C.DetectDesyncWithTrueChain
// 0x0278 (0x0278 - 0x0000)
struct BP_CosmeticChain_C_DetectDesyncWithTrueChain final
{
public:
	double                                        MaillonAlpha;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Desync;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1F[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          CallFunc_GetPawnArray_Array;                       // 0x00A0(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x00B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F20[0x1];                                     // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F21[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F22[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CosmeticChain_C_DetectDesyncWithTrueChain) == 0x000008, "Wrong alignment on BP_CosmeticChain_C_DetectDesyncWithTrueChain");
static_assert(sizeof(BP_CosmeticChain_C_DetectDesyncWithTrueChain) == 0x000278, "Wrong size on BP_CosmeticChain_C_DetectDesyncWithTrueChain");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, MaillonAlpha) == 0x000000, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::MaillonAlpha' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, Desync) == 0x000008, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::Desync' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_FTrunc_ReturnValue_1) == 0x00003C, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000068, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_GetGameState_ReturnValue) == 0x000080, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, K2Node_DynamicCast_AsBPI_Gamestate) == 0x000088, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_GetPawnArray_Array) == 0x0000A0, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_GetPawnArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_SphereTraceSingle_OutHit) == 0x0000B0, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_SphereTraceSingle_ReturnValue) == 0x000198, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_bBlockingHit) == 0x000199, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_bInitialOverlap) == 0x00019A, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_Time) == 0x00019C, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_Distance) == 0x0001A0, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_Location) == 0x0001A8, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_ImpactPoint) == 0x0001C0, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_Normal) == 0x0001D8, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F0, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_PhysMat) == 0x000208, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_HitActor) == 0x000210, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_HitComponent) == 0x000218, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_HitBoneName) == 0x000220, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_BoneName) == 0x000228, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_HitItem) == 0x000230, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_ElementIndex) == 0x000234, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_FaceIndex) == 0x000238, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_TraceStart) == 0x000240, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_BreakHitResult_TraceEnd) == 0x000258, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, CallFunc_GetCollisionResponseToChannel_ReturnValue) == 0x000270, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::CallFunc_GetCollisionResponseToChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_DetectDesyncWithTrueChain, K2Node_SwitchEnum_CmpSuccess) == 0x000271, "Member 'BP_CosmeticChain_C_DetectDesyncWithTrueChain::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CosmeticChain.BP_CosmeticChain_C.Dissolve
// 0x0004 (0x0004 - 0x0000)
struct BP_CosmeticChain_C_Dissolve final
{
public:
	float                                         TL_Rate;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CosmeticChain_C_Dissolve) == 0x000004, "Wrong alignment on BP_CosmeticChain_C_Dissolve");
static_assert(sizeof(BP_CosmeticChain_C_Dissolve) == 0x000004, "Wrong size on BP_CosmeticChain_C_Dissolve");
static_assert(offsetof(BP_CosmeticChain_C_Dissolve, TL_Rate) == 0x000000, "Member 'BP_CosmeticChain_C_Dissolve::TL_Rate' has a wrong offset!");

// Function BP_CosmeticChain.BP_CosmeticChain_C.ExecuteUbergraph_BP_CosmeticChain
// 0x03B8 (0x03B8 - 0x0000)
struct BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F23[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F24[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F25[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ChainAttachment_C> K2Node_DynamicCast_AsBPI_Chain_Attachment;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F26[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetCosmeticSocket_Comp;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ChainAttachment_C> K2Node_DynamicCast_AsBPI_Chain_Attachment_1;       // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F27[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetCosmeticSocket_Comp_1;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0098(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F28[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F29[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2A[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2B[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2C[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TL_Rate;                        // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2D[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2E[0x3];                                     // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2F[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F30[0x3];                                     // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F31[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_5;                         // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F32[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x02A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F33[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_6;                         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F34[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain) == 0x000008, "Wrong alignment on BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain");
static_assert(sizeof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain) == 0x0003B8, "Wrong size on BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, EntryPoint) == 0x000000, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Array_Index_Variable_2) == 0x00002C, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Loop_Counter_Variable_2) == 0x000030, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Array_Index_Variable_3) == 0x000038, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, K2Node_DynamicCast_AsBPI_Chain_Attachment) == 0x000040, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::K2Node_DynamicCast_AsBPI_Chain_Attachment' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_GetCosmeticSocket_Comp) == 0x000058, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_GetCosmeticSocket_Comp' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, K2Node_DynamicCast_AsBPI_Chain_Attachment_1) == 0x000060, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::K2Node_DynamicCast_AsBPI_Chain_Attachment_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000078, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_GetCosmeticSocket_Comp_1) == 0x000090, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_GetCosmeticSocket_Comp_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000098, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000180, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000188, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_FindLookAtRotation_ReturnValue) == 0x0001A0, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0001BC, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Loop_Counter_Variable_3) == 0x0001C0, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, K2Node_Event_DeltaSeconds) == 0x0001C4, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Less_IntInt_ReturnValue) == 0x0001C8, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001CC, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Loop_Counter_Variable_4) == 0x0001D0, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001E0, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Length_ReturnValue_1) == 0x0001E4, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001E8, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001F0, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, K2Node_CustomEvent_TL_Rate) == 0x0001F4, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::K2Node_CustomEvent_TL_Rate' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, Temp_int_Array_Index_Variable_4) == 0x0001F8, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Get_Item_1) == 0x000200, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Get_Item_2) == 0x000208, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Length_ReturnValue_2) == 0x000210, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Less_IntInt_ReturnValue_2) == 0x000214, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Get_Item_3) == 0x000218, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_IsValid_ReturnValue) == 0x000220, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000228, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Get_Item_4) == 0x000240, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000248, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Length_ReturnValue_3) == 0x000260, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Less_IntInt_ReturnValue_3) == 0x000264, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Add_ReturnValue) == 0x000268, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Get_Item_5) == 0x000270, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_IsPlaying_ReturnValue) == 0x000288, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_VLerp_ReturnValue) == 0x000290, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0002A8, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Length_ReturnValue_4) == 0x000390, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Array_Get_Item_6) == 0x000398, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Less_IntInt_ReturnValue_4) == 0x0003A0, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0003A8, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0003B0, "Member 'BP_CosmeticChain_C_ExecuteUbergraph_BP_CosmeticChain::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_CosmeticChain.BP_CosmeticChain_C.Pulling
// 0x0098 (0x0098 - 0x0000)
struct BP_CosmeticChain_C_Pulling final
{
public:
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F35[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHandLocation_Location;                 // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F36[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
