#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomCar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ChoosenChar_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomCar.BP_CustomCar_C.AddImpulseToVehicle
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomCar_C_AddImpulseToVehicle final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_AddImpulseToVehicle) == 0x000008, "Wrong alignment on BP_CustomCar_C_AddImpulseToVehicle");
static_assert(sizeof(BP_CustomCar_C_AddImpulseToVehicle) == 0x000018, "Wrong size on BP_CustomCar_C_AddImpulseToVehicle");
static_assert(offsetof(BP_CustomCar_C_AddImpulseToVehicle, Impulse) == 0x000000, "Member 'BP_CustomCar_C_AddImpulseToVehicle::Impulse' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.AdditionalGravity
// 0x0050 (0x0050 - 0x0000)
struct BP_CustomCar_C_AdditionalGravity final
{
public:
	bool                                          CallFunc_IsDriverEmpty_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3509[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_AdditionalGravity) == 0x000008, "Wrong alignment on BP_CustomCar_C_AdditionalGravity");
static_assert(sizeof(BP_CustomCar_C_AdditionalGravity) == 0x000050, "Wrong size on BP_CustomCar_C_AdditionalGravity");
static_assert(offsetof(BP_CustomCar_C_AdditionalGravity, CallFunc_IsDriverEmpty_ReturnValue) == 0x000000, "Member 'BP_CustomCar_C_AdditionalGravity::CallFunc_IsDriverEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AdditionalGravity, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000001, "Member 'BP_CustomCar_C_AdditionalGravity::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AdditionalGravity, CallFunc_GetUpVector_ReturnValue) == 0x000008, "Member 'BP_CustomCar_C_AdditionalGravity::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AdditionalGravity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000020, "Member 'BP_CustomCar_C_AdditionalGravity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AdditionalGravity, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_CustomCar_C_AdditionalGravity::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.AddPassengerCloth
// 0x00D0 (0x00D0 - 0x0000)
struct BP_CustomCar_C_AddPassengerCloth final
{
public:
	class USkeletalMesh*                          NewMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomMat;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_350A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          NewMeshLocal;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 NewClothLocal;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMeshLocal;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_350B[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_AddPassengerCloth) == 0x000010, "Wrong alignment on BP_CustomCar_C_AddPassengerCloth");
static_assert(sizeof(BP_CustomCar_C_AddPassengerCloth) == 0x0000D0, "Wrong size on BP_CustomCar_C_AddPassengerCloth");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, NewMesh) == 0x000000, "Member 'BP_CustomCar_C_AddPassengerCloth::NewMesh' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, Color) == 0x000008, "Member 'BP_CustomCar_C_AddPassengerCloth::Color' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, CustomMat) == 0x000018, "Member 'BP_CustomCar_C_AddPassengerCloth::CustomMat' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, SkeletalMesh) == 0x000020, "Member 'BP_CustomCar_C_AddPassengerCloth::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, Material) == 0x000028, "Member 'BP_CustomCar_C_AddPassengerCloth::Material' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, NewMeshLocal) == 0x000030, "Member 'BP_CustomCar_C_AddPassengerCloth::NewMeshLocal' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, NewClothLocal) == 0x000038, "Member 'BP_CustomCar_C_AddPassengerCloth::NewClothLocal' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, SkeletalMeshLocal) == 0x000040, "Member 'BP_CustomCar_C_AddPassengerCloth::SkeletalMeshLocal' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_CustomCar_C_AddPassengerCloth::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, CallFunc_AddComponent_ReturnValue) == 0x0000B0, "Member 'BP_CustomCar_C_AddPassengerCloth::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, CallFunc_GetMaterial_ReturnValue) == 0x0000B8, "Member 'BP_CustomCar_C_AddPassengerCloth::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C0, "Member 'BP_CustomCar_C_AddPassengerCloth::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AddPassengerCloth, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000C8, "Member 'BP_CustomCar_C_AddPassengerCloth::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.AutoFlipCar
// 0x0288 (0x0288 - 0x0000)
struct BP_CustomCar_C_AutoFlipCar final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	EDrawDebugTrace                               CallFunc_TraceVisibility_Result;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDriverEmpty_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_350C[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_350D[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_350E[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0198(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_AutoFlipCar) == 0x000008, "Wrong alignment on BP_CustomCar_C_AutoFlipCar");
static_assert(sizeof(BP_CustomCar_C_AutoFlipCar) == 0x000288, "Wrong size on BP_CustomCar_C_AutoFlipCar");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, Temp_object_Variable) == 0x000000, "Member 'BP_CustomCar_C_AutoFlipCar::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_TraceVisibility_Result) == 0x000010, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_TraceVisibility_Result' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_IsDriverEmpty_ReturnValue) == 0x000011, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_IsDriverEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000030, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000048, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_SphereTraceSingle_OutHit) == 0x000050, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_SphereTraceSingle_ReturnValue) == 0x000138, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000140, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_BreakRotator_Roll) == 0x000158, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_BreakRotator_Pitch) == 0x00015C, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_BreakRotator_Yaw) == 0x000160, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_MakeRotator_ReturnValue) == 0x000168, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_RInterpTo_ReturnValue) == 0x000180, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000198, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_AutoFlipCar, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x000280, "Member 'BP_CustomCar_C_AutoFlipCar::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.CalculateVelocity
// 0x0068 (0x0068 - 0x0000)
struct BP_CustomCar_C_CalculateVelocity final
{
public:
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_CalculateVelocity) == 0x000008, "Wrong alignment on BP_CustomCar_C_CalculateVelocity");
static_assert(sizeof(BP_CustomCar_C_CalculateVelocity) == 0x000068, "Wrong size on BP_CustomCar_C_CalculateVelocity");
static_assert(offsetof(BP_CustomCar_C_CalculateVelocity, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'BP_CustomCar_C_CalculateVelocity::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CalculateVelocity, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_CustomCar_C_CalculateVelocity::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CalculateVelocity, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_CustomCar_C_CalculateVelocity::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CalculateVelocity, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'BP_CustomCar_C_CalculateVelocity::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CalculateVelocity, CallFunc_Divide_VectorVector_ReturnValue) == 0x000050, "Member 'BP_CustomCar_C_CalculateVelocity::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.CanBeUsed
// 0x0002 (0x0002 - 0x0000)
struct BP_CustomCar_C_CanBeUsed final
{
public:
	bool                                          Param_CanBeUsed;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDriverEmpty_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_CanBeUsed) == 0x000001, "Wrong alignment on BP_CustomCar_C_CanBeUsed");
static_assert(sizeof(BP_CustomCar_C_CanBeUsed) == 0x000002, "Wrong size on BP_CustomCar_C_CanBeUsed");
static_assert(offsetof(BP_CustomCar_C_CanBeUsed, Param_CanBeUsed) == 0x000000, "Member 'BP_CustomCar_C_CanBeUsed::Param_CanBeUsed' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CanBeUsed, CallFunc_IsDriverEmpty_ReturnValue) == 0x000001, "Member 'BP_CustomCar_C_CanBeUsed::CallFunc_IsDriverEmpty_ReturnValue' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.CheckUnderLava
// 0x00C8 (0x00C8 - 0x0000)
struct BP_CustomCar_C_CheckUnderLava final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_350F[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3510[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3511[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Lava_C*>                     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3512[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lava_C*                             CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLaveMode_Lava;                         // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_CheckUnderLava) == 0x000008, "Wrong alignment on BP_CustomCar_C_CheckUnderLava");
static_assert(sizeof(BP_CustomCar_C_CheckUnderLava) == 0x0000C8, "Wrong size on BP_CustomCar_C_CheckUnderLava");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, K2Node_DynamicCast_AsPlayer_Controller) == 0x000010, "Member 'BP_CustomCar_C_CheckUnderLava::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CustomCar_C_CheckUnderLava::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_BreakVector_X) == 0x000038, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_BreakVector_Z) == 0x000048, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000058, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_BreakVector_X_1) == 0x000070, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_BreakVector_Y_1) == 0x000078, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_BreakVector_Z_1) == 0x000080, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_GetAllActorsOfClass_OutActors) == 0x000088, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_GetGameState_ReturnValue) == 0x0000A8, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, K2Node_DynamicCast_AsBPI_Gamestate) == 0x0000B0, "Member 'BP_CustomCar_C_CheckUnderLava::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'BP_CustomCar_C_CheckUnderLava::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_CheckUnderLava, CallFunc_GetLaveMode_Lava) == 0x0000C1, "Member 'BP_CustomCar_C_CheckUnderLava::CallFunc_GetLaveMode_Lava' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.Constraint
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomCar_C_Constraint final
{
public:
	double                                        UrgencyForce;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDistance;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalDistance;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_Constraint) == 0x000008, "Wrong alignment on BP_CustomCar_C_Constraint");
static_assert(sizeof(BP_CustomCar_C_Constraint) == 0x000018, "Wrong size on BP_CustomCar_C_Constraint");
static_assert(offsetof(BP_CustomCar_C_Constraint, UrgencyForce) == 0x000000, "Member 'BP_CustomCar_C_Constraint::UrgencyForce' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_Constraint, MaxDistance) == 0x000008, "Member 'BP_CustomCar_C_Constraint::MaxDistance' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_Constraint, LocalDistance) == 0x000010, "Member 'BP_CustomCar_C_Constraint::LocalDistance' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.Detected
// 0x0010 (0x0010 - 0x0000)
struct BP_CustomCar_C_Detected final
{
public:
	bool                                          Param_Detected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3513[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PC;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_Detected) == 0x000008, "Wrong alignment on BP_CustomCar_C_Detected");
static_assert(sizeof(BP_CustomCar_C_Detected) == 0x000010, "Wrong size on BP_CustomCar_C_Detected");
static_assert(offsetof(BP_CustomCar_C_Detected, Param_Detected) == 0x000000, "Member 'BP_CustomCar_C_Detected::Param_Detected' has a wrong offset!");
static_assert(offsetof(BP_CustomCar_C_Detected, PC) == 0x000008, "Member 'BP_CustomCar_C_Detected::PC' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.EventDriveForwardGP
// 0x0008 (0x0008 - 0x0000)
struct BP_CustomCar_C_EventDriveForwardGP final
{
public:
	double                                        Axis;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomCar_C_EventDriveForwardGP) == 0x000008, "Wrong alignment on BP_CustomCar_C_EventDriveForwardGP");
static_assert(sizeof(BP_CustomCar_C_EventDriveForwardGP) == 0x000008, "Wrong size on BP_CustomCar_C_EventDriveForwardGP");
static_assert(offsetof(BP_CustomCar_C_EventDriveForwardGP, Axis) == 0x000000, "Member 'BP_CustomCar_C_EventDriveForwardGP::Axis' has a wrong offset!");

// Function BP_CustomCar.BP_CustomCar_C.ExecuteUbergraph_BP_CustomCar
// 0x06C0 (0x06C0 - 0x0000)
struct BP_CustomCar_C_ExecuteUbergraph_BP_CustomCar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3514[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3515[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CarGate_C>        K2Node_DynamicCast_AsBPI_Car_Gate;                 // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3516[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3517[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3518[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ControllerWithSettings_C> K2Node_DynamicCast_AsBPI_Controller_with_Settings; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3519[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerOnGamepad_Gamepad;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351A[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ControllerWithSettings_C> K2Node_DynamicCast_AsBPI_Controller_with_Settings_1; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerOnGamepad_Gamepad_1;              // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Sprint;                               // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351B[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Impulse;                              // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Hover_Grounded;                           // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Detected;                             // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351C[0x2];                                     // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_PC;                                   // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_Controller;                           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_ControlledActor;                      // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ChoosenChar                                 CallFunc_GetCharacter_Character;                   // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351D[0x5];                                     // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Axis_3;                               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Axis_2;                               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save;  // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351E[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save_1; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCameraSettings_InvertX;                // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCameraSettings_InvertY;                // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351F[0x5];                                     // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCameraSettings_X_Sensitivity;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCameraSettings_Y_Sensitivity;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCameraSettings_InvertX_1;              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCameraSettings_InvertY_1;              // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3520[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCameraSettings_X_Sensitivity_1;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCameraSettings_Y_Sensitivity_1;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3521[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CarGate_C>        K2Node_DynamicCast_AsBPI_Car_Gate_1;               // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3522[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Vehicle_C>        K2Node_DynamicCast_AsBPI_Vehicle;                  // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3523[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Vehicle_C>        K2Node_DynamicCast_AsBPI_Vehicle_1;                // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3524[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Axis_4;                         // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Axis_3;                         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3525[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Axis_2;                         // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Axis_1;                         // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3526[0x5];                                     // 0x036B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_NewTransform;                   // 0x0370(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_NewController;                        // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3527[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3528[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3529[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352A[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352B[0x7];                                     // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_MoveForwardAxis;                // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352C[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Axis_1;                               // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Axis;                                 // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ChoosenChar                                 K2Node_CustomEvent_Character_2;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ChoosenChar                                 K2Node_CustomEvent_Character_1;                    // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ChoosenChar                                 K2Node_CustomEvent_Character;                      // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352D[0x5];                                     // 0x047B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game;                      // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352E[0x7];                                     // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_VehicleCamera_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0498(0x0010)(ReferenceParm)
	class ABP_VehicleCamera_C*                    CallFunc_Array_Get_Item;                           // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352F[0x4];                                     // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3530[0x4];                                     // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3531[0x8];                                     // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0550(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RescuePoint_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDrive_AnimBP_C*                        K2Node_DynamicCast_AsDrive_Anim_BP;                // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3532[0x7];                                     // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Axis;                           // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3533[0x6];                                     // 0x05E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_3;              // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3534[0x7];                                     // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_2;          // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
