#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_DestroyStairs

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_DestroyStairs.Bp_DestroyStairs_C
// 0x0098 (0x0330 - 0x0298)
class ABp_DestroyStairs_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Placer;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BaseMesh;                                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cave_Rock_End;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGeometryCollectionComponent*           StairsBaseStraight_GeometryCollection;             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cave_Rock_Small01;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_80AB882A43DEB3BFF52093B6CFE656E0; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_80AB882A43DEB3BFF52093B6CFE656E0; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A54[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLoc;                                          // 0x02F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLoc;                                            // 0x0310(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlacerMat;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Bp_DestroyStairs_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_Bp_DestroyStairs(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Test();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_DestroyStairs_C">();
	}
	static class ABp_DestroyStairs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_DestroyStairs_C>();
	}
};
static_assert(alignof(ABp_DestroyStairs_C) == 0x000008, "Wrong alignment on ABp_DestroyStairs_C");
static_assert(sizeof(ABp_DestroyStairs_C) == 0x000330, "Wrong size on ABp_DestroyStairs_C");
static_assert(offsetof(ABp_DestroyStairs_C, UberGraphFrame) == 0x000298, "Member 'ABp_DestroyStairs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, Placer) == 0x0002A0, "Member 'ABp_DestroyStairs_C::Placer' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, BaseMesh) == 0x0002A8, "Member 'ABp_DestroyStairs_C::BaseMesh' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, Sphere) == 0x0002B0, "Member 'ABp_DestroyStairs_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, SM_Cave_Rock_End) == 0x0002B8, "Member 'ABp_DestroyStairs_C::SM_Cave_Rock_End' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, StairsBaseStraight_GeometryCollection) == 0x0002C0, "Member 'ABp_DestroyStairs_C::StairsBaseStraight_GeometryCollection' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, SM_Cave_Rock_Small01) == 0x0002C8, "Member 'ABp_DestroyStairs_C::SM_Cave_Rock_Small01' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, Box) == 0x0002D0, "Member 'ABp_DestroyStairs_C::Box' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, Billboard) == 0x0002D8, "Member 'ABp_DestroyStairs_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, DefaultSceneRoot) == 0x0002E0, "Member 'ABp_DestroyStairs_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, Timeline_NewTrack_0_80AB882A43DEB3BFF52093B6CFE656E0) == 0x0002E8, "Member 'ABp_DestroyStairs_C::Timeline_NewTrack_0_80AB882A43DEB3BFF52093B6CFE656E0' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, Timeline__Direction_80AB882A43DEB3BFF52093B6CFE656E0) == 0x0002EC, "Member 'ABp_DestroyStairs_C::Timeline__Direction_80AB882A43DEB3BFF52093B6CFE656E0' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, Timeline) == 0x0002F0, "Member 'ABp_DestroyStairs_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, StartLoc) == 0x0002F8, "Member 'ABp_DestroyStairs_C::StartLoc' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, EndLoc) == 0x000310, "Member 'ABp_DestroyStairs_C::EndLoc' has a wrong offset!");
static_assert(offsetof(ABp_DestroyStairs_C, PlacerMat) == 0x000328, "Member 'ABp_DestroyStairs_C::PlacerMat' has a wrong offset!");

}

