#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialog

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialog.BP_Dialog_C.BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_382E[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Dialog_C_BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Dialog.BP_Dialog_C.ExecuteUbergraph_BP_Dialog
// 0x0180 (0x0180 - 0x0000)
struct BP_Dialog_C_ExecuteUbergraph_BP_Dialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Any_Dialog_Playing__ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_382F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3830[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3831[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3832[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0130(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3833[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3834[0x2];                                     // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog) == 0x000008, "Wrong alignment on BP_Dialog_C_ExecuteUbergraph_BP_Dialog");
static_assert(sizeof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog) == 0x000180, "Wrong size on BP_Dialog_C_ExecuteUbergraph_BP_Dialog");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, EntryPoint) == 0x000000, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Is_Any_Dialog_Playing__ReturnValue) == 0x000004, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Is_Any_Dialog_Playing__ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, Temp_int_Variable) == 0x000008, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000010, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, K2Node_ComponentBoundEvent_OtherActor) == 0x000018, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, K2Node_ComponentBoundEvent_OtherComp) == 0x000020, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000028, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, K2Node_DynamicCast_AsPawn) == 0x000118, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_SpawnSound2D_ReturnValue) == 0x000128, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Array_Get_Item) == 0x000130, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, Temp_bool_Has_Been_Initd_Variable) == 0x000148, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Array_Get_Item_1) == 0x000150, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Subtract_IntInt_ReturnValue) == 0x00015C, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Add_IntInt_ReturnValue) == 0x000160, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000164, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, Temp_bool_IsClosed_Variable) == 0x000165, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Array_Get_Item_2) == 0x000168, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000170, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_ExecuteUbergraph_BP_Dialog, CallFunc_Delay_Duration_ImplicitCast) == 0x000178, "Member 'BP_Dialog_C_ExecuteUbergraph_BP_Dialog::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_Dialog.BP_Dialog_C.Is Any Dialog Playing?
// 0x0038 (0x0038 - 0x0000)
struct BP_Dialog_C_Is_Any_Dialog_Playing_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3835[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Dialog_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3836[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Dialog_C*                           CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialog_C_Is_Any_Dialog_Playing_) == 0x000008, "Wrong alignment on BP_Dialog_C_Is_Any_Dialog_Playing_");
static_assert(sizeof(BP_Dialog_C_Is_Any_Dialog_Playing_) == 0x000038, "Wrong size on BP_Dialog_C_Is_Any_Dialog_Playing_");
static_assert(offsetof(BP_Dialog_C_Is_Any_Dialog_Playing_, ReturnValue) == 0x000000, "Member 'BP_Dialog_C_Is_Any_Dialog_Playing_::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_Is_Any_Dialog_Playing_, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Dialog_C_Is_Any_Dialog_Playing_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_Is_Any_Dialog_Playing_, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Dialog_C_Is_Any_Dialog_Playing_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_Is_Any_Dialog_Playing_, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Dialog_C_Is_Any_Dialog_Playing_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_Is_Any_Dialog_Playing_, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_Dialog_C_Is_Any_Dialog_Playing_::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_Is_Any_Dialog_Playing_, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Dialog_C_Is_Any_Dialog_Playing_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_Is_Any_Dialog_Playing_, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Dialog_C_Is_Any_Dialog_Playing_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Dialog_C_Is_Any_Dialog_Playing_, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_Dialog_C_Is_Any_Dialog_Playing_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

