#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DL_Loader

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DL_Loader.BP_DL_Loader_C.BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D6[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DL_Loader.BP_DL_Loader_C.BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DL_Loader_C_BndEvt__BP_DL_Loader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_DL_Loader.BP_DL_Loader_C.ContainsControlledPawns
// 0x0070 (0x0070 - 0x0000)
struct BP_DL_Loader_C_ContainsControlledPawns final
{
public:
	bool                                          Contains;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  AsPawn;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D8[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D9[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29DA[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29DB[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DL_Loader_C_ContainsControlledPawns) == 0x000008, "Wrong alignment on BP_DL_Loader_C_ContainsControlledPawns");
static_assert(sizeof(BP_DL_Loader_C_ContainsControlledPawns) == 0x000070, "Wrong size on BP_DL_Loader_C_ContainsControlledPawns");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, Contains) == 0x000000, "Member 'BP_DL_Loader_C_ContainsControlledPawns::Contains' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, AsPawn) == 0x000008, "Member 'BP_DL_Loader_C_ContainsControlledPawns::AsPawn' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_DL_Loader_C_ContainsControlledPawns::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_DL_Loader_C_ContainsControlledPawns::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_DL_Loader_C_ContainsControlledPawns::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000020, "Member 'BP_DL_Loader_C_ContainsControlledPawns::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_DL_Loader_C_ContainsControlledPawns::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_DL_Loader_C_ContainsControlledPawns::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_DL_Loader_C_ContainsControlledPawns::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, K2Node_DynamicCast_AsPawn) == 0x000048, "Member 'BP_DL_Loader_C_ContainsControlledPawns::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_DL_Loader_C_ContainsControlledPawns::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, CallFunc_GetController_ReturnValue) == 0x000058, "Member 'BP_DL_Loader_C_ContainsControlledPawns::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, K2Node_DynamicCast_AsPlayer_Controller) == 0x000060, "Member 'BP_DL_Loader_C_ContainsControlledPawns::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ContainsControlledPawns, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_DL_Loader_C_ContainsControlledPawns::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_DL_Loader.BP_DL_Loader_C.ExecuteUbergraph_BP_DL_Loader
// 0x0198 (0x0198 - 0x0000)
struct BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29DC[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29DD[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0038(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29DE[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29DF[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsControlledPawns_Contains;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29E0[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_ContainsControlledPawns_AsPawn;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Loaded;                         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29E1[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader) == 0x000008, "Wrong alignment on BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader");
static_assert(sizeof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader) == 0x000198, "Wrong size on BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, EntryPoint) == 0x000000, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_HasAuthority_ReturnValue) == 0x000014, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_HasAuthority_ReturnValue_1) == 0x000016, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000018, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000020, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000028, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000030, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_bFromSweep) == 0x000034, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_SweepResult) == 0x000038, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000120, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_OtherActor) == 0x000128, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_OtherComp) == 0x000130, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000138, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, Temp_object_Variable) == 0x000140, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_GetDisplayName_ReturnValue) == 0x000148, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_GetPlayerPawn_ReturnValue) == 0x000158, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_Conv_StringToName_ReturnValue) == 0x000160, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000168, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_GetStreamingLevel_ReturnValue) == 0x000170, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_ContainsControlledPawns_Contains) == 0x000178, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_ContainsControlledPawns_Contains' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, CallFunc_ContainsControlledPawns_AsPawn) == 0x000180, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::CallFunc_ContainsControlledPawns_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_CustomEvent_Loaded) == 0x000188, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader, K2Node_CustomEvent_Loaded_1) == 0x000190, "Member 'BP_DL_Loader_C_ExecuteUbergraph_BP_DL_Loader::K2Node_CustomEvent_Loaded_1' has a wrong offset!");

// Function BP_DL_Loader.BP_DL_Loader_C.LoadUnloadAll
// 0x0001 (0x0001 - 0x0000)
struct BP_DL_Loader_C_LoadUnloadAll final
{
public:
	bool                                          Param_Loaded;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DL_Loader_C_LoadUnloadAll) == 0x000001, "Wrong alignment on BP_DL_Loader_C_LoadUnloadAll");
static_assert(sizeof(BP_DL_Loader_C_LoadUnloadAll) == 0x000001, "Wrong size on BP_DL_Loader_C_LoadUnloadAll");
static_assert(offsetof(BP_DL_Loader_C_LoadUnloadAll, Param_Loaded) == 0x000000, "Member 'BP_DL_Loader_C_LoadUnloadAll::Param_Loaded' has a wrong offset!");

// Function BP_DL_Loader.BP_DL_Loader_C.OnLoaded_FF8DAC9E4553BFD445F1FA8A6FED575B
// 0x0008 (0x0008 - 0x0000)
struct BP_DL_Loader_C_OnLoaded_FF8DAC9E4553BFD445F1FA8A6FED575B final
{
public:
	class UObject*                                Param_Loaded;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DL_Loader_C_OnLoaded_FF8DAC9E4553BFD445F1FA8A6FED575B) == 0x000008, "Wrong alignment on BP_DL_Loader_C_OnLoaded_FF8DAC9E4553BFD445F1FA8A6FED575B");
static_assert(sizeof(BP_DL_Loader_C_OnLoaded_FF8DAC9E4553BFD445F1FA8A6FED575B) == 0x000008, "Wrong size on BP_DL_Loader_C_OnLoaded_FF8DAC9E4553BFD445F1FA8A6FED575B");
static_assert(offsetof(BP_DL_Loader_C_OnLoaded_FF8DAC9E4553BFD445F1FA8A6FED575B, Param_Loaded) == 0x000000, "Member 'BP_DL_Loader_C_OnLoaded_FF8DAC9E4553BFD445F1FA8A6FED575B::Param_Loaded' has a wrong offset!");

// Function BP_DL_Loader.BP_DL_Loader_C.ShowElements
// 0x0001 (0x0001 - 0x0000)
struct BP_DL_Loader_C_ShowElements final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DL_Loader_C_ShowElements) == 0x000001, "Wrong alignment on BP_DL_Loader_C_ShowElements");
static_assert(sizeof(BP_DL_Loader_C_ShowElements) == 0x000001, "Wrong size on BP_DL_Loader_C_ShowElements");
static_assert(offsetof(BP_DL_Loader_C_ShowElements, Show) == 0x000000, "Member 'BP_DL_Loader_C_ShowElements::Show' has a wrong offset!");

}

