#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dialog.BP_Dialog_C
// 0x0048 (0x02E0 - 0x0298)
class ABP_Dialog_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<double>                                Durations;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class FText>                           Dialogs;                                           // 0x02C8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Index_BP_Dialog_C;                                 // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Playing;                                           // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Dialog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_Dialog(int32 EntryPoint);
	bool Is_Any_Dialog_Playing_();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Dialog_C">();
	}
	static class ABP_Dialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dialog_C>();
	}
};
static_assert(alignof(ABP_Dialog_C) == 0x000008, "Wrong alignment on ABP_Dialog_C");
static_assert(sizeof(ABP_Dialog_C) == 0x0002E0, "Wrong size on ABP_Dialog_C");
static_assert(offsetof(ABP_Dialog_C, UberGraphFrame) == 0x000298, "Member 'ABP_Dialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Dialog_C, Box) == 0x0002A0, "Member 'ABP_Dialog_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Dialog_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_Dialog_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Dialog_C, Sound) == 0x0002B0, "Member 'ABP_Dialog_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_Dialog_C, Durations) == 0x0002B8, "Member 'ABP_Dialog_C::Durations' has a wrong offset!");
static_assert(offsetof(ABP_Dialog_C, Dialogs) == 0x0002C8, "Member 'ABP_Dialog_C::Dialogs' has a wrong offset!");
static_assert(offsetof(ABP_Dialog_C, Index_BP_Dialog_C) == 0x0002D8, "Member 'ABP_Dialog_C::Index_BP_Dialog_C' has a wrong offset!");
static_assert(offsetof(ABP_Dialog_C, Playing) == 0x0002DC, "Member 'ABP_Dialog_C::Playing' has a wrong offset!");

}

