#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DevilSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DevilSpawner.BP_DevilSpawner_C.BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A6[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DevilSpawner_C_BndEvt__BP_DevilSpawner_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DevilSpawner.BP_DevilSpawner_C.ExecuteUbergraph_BP_DevilSpawner
// 0x0230 (0x0230 - 0x0000)
struct BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A7[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A8[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0110(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A9[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Devil_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner) == 0x000010, "Wrong alignment on BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner");
static_assert(sizeof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner) == 0x000230, "Wrong size on BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, EntryPoint) == 0x000000, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, CallFunc_GetTransform_ReturnValue) == 0x000110, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, K2Node_SwitchInteger_CmpSuccess) == 0x000170, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, CallFunc_BreakTransform_Location) == 0x000178, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, CallFunc_BreakTransform_Rotation) == 0x000190, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, CallFunc_BreakTransform_Scale) == 0x0001A8, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, CallFunc_MakeTransform_ReturnValue) == 0x0001C0, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000220, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000228, "Member 'BP_DevilSpawner_C_ExecuteUbergraph_BP_DevilSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

