#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Devil

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Devil_Poses_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Devil.BP_Devil_C
// 0x0150 (0x03E8 - 0x0298)
class ABP_Devil_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SmallDevilVoice;                                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraWings;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Wings;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraBody;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_9_NewTrack_0_06DC82AA4766DE5746950EAAEC42C1EE; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_9__Direction_06DC82AA4766DE5746950EAAEC42C1EE; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35CC[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_9;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_8_NewTrack_0_C6EA1442405097E0D84D5D9B32E90972; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_8__Direction_C6EA1442405097E0D84D5D9B32E90972; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35CD[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_8;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_6_NewTrack_0_4BA7AB904F3AB041E1BF7CB6A246E21A; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_6__Direction_4BA7AB904F3AB041E1BF7CB6A246E21A; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35CE[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_6;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_5_NewTrack_0_362C861F421BE3E60E27068321A3DE9C; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_5__Direction_362C861F421BE3E60E27068321A3DE9C; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35CF[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_5;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_4_NewTrack_0_703AA70A4CD68A65CF4F23AECC72C410; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_4__Direction_703AA70A4CD68A65CF4F23AECC72C410; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D0[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_4;                                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_NewTrack_0_223835EA42C07F586C18CA91BA3EA596; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_3__Direction_223835EA42C07F586C18CA91BA3EA596; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D1[0x3];                                     // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_3;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Blink_NewTrack_0_E1F1C2A74122E6339ED443A64B4850BB; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Blink__Direction_E1F1C2A74122E6339ED443A64B4850BB; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D2[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Blink;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_NewTrack_0_840B3DA144787BFD2D5B3994DAF1DC7C; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_840B3DA144787BFD2D5B3994DAF1DC7C; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D3[0x3];                                     // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_7E13D7B64229B805C2B576B626BB1337; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_7E13D7B64229B805C2B576B626BB1337; // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D4[0x3];                                     // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_A65938D249C5DA4C159B62BC7F65A6BF; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_A65938D249C5DA4C159B62BC7F65A6BF; // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D5[0x3];                                     // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialBody;                                      // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialWings;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousAngry;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewAngry;                                          // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousSmile;                                     // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSmile;                                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousBrows;                                     // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewBrows;                                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DevilDistance;                                     // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDevil_Poses                                  Pose;                                              // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDevil_Poses                                  PreviousPose;                                      // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D6[0x6];                                     // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayBeforeTalking;                                // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Blink__FinishedFunc();
	void Blink__UpdateFunc();
	void BodyFlySin();
	void ChangePose(EDevil_Poses Param_Pose);
	void Disapear();
	void ExecuteUbergraph_BP_Devil(int32 EntryPoint);
	void PlaySound(class USoundBase* NewSound);
	void RandomAngry();
	void RandomBlink();
	void RandomBrows();
	void RandomSmile();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Spawn();
	void Text01();
	void Text02();
	void Text03();
	void Text04();
	void Text05();
	void Text06();
	void Text07();
	void Text08();
	void Text09();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_3__FinishedFunc();
	void Timeline_3__UpdateFunc();
	void Timeline_4__FinishedFunc();
	void Timeline_4__UpdateFunc();
	void Timeline_5__FinishedFunc();
	void Timeline_5__UpdateFunc();
	void Timeline_6__FinishedFunc();
	void Timeline_6__UpdateFunc();
	void Timeline_8__FinishedFunc();
	void Timeline_8__UpdateFunc();
	void Timeline_9__FinishedFunc();
	void Timeline_9__UpdateFunc();
	void Update_Devil_Mouth_Dialog();
	void Update_Devil_Transform();
	void Update_Niagara_Speed();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Devil_C">();
	}
	static class ABP_Devil_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Devil_C>();
	}
};
static_assert(alignof(ABP_Devil_C) == 0x000008, "Wrong alignment on ABP_Devil_C");
static_assert(sizeof(ABP_Devil_C) == 0x0003E8, "Wrong size on ABP_Devil_C");
static_assert(offsetof(ABP_Devil_C, UberGraphFrame) == 0x000298, "Member 'ABP_Devil_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, SpotLight) == 0x0002A0, "Member 'ABP_Devil_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Arrow) == 0x0002A8, "Member 'ABP_Devil_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, SpringArm) == 0x0002B0, "Member 'ABP_Devil_C::SpringArm' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, PointLight) == 0x0002B8, "Member 'ABP_Devil_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Body) == 0x0002C0, "Member 'ABP_Devil_C::Body' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, SmallDevilVoice) == 0x0002C8, "Member 'ABP_Devil_C::SmallDevilVoice' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, NiagaraWings) == 0x0002D0, "Member 'ABP_Devil_C::NiagaraWings' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Wings) == 0x0002D8, "Member 'ABP_Devil_C::Wings' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, NiagaraBody) == 0x0002E0, "Member 'ABP_Devil_C::NiagaraBody' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, DefaultSceneRoot) == 0x0002E8, "Member 'ABP_Devil_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_9_NewTrack_0_06DC82AA4766DE5746950EAAEC42C1EE) == 0x0002F0, "Member 'ABP_Devil_C::Timeline_9_NewTrack_0_06DC82AA4766DE5746950EAAEC42C1EE' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_9__Direction_06DC82AA4766DE5746950EAAEC42C1EE) == 0x0002F4, "Member 'ABP_Devil_C::Timeline_9__Direction_06DC82AA4766DE5746950EAAEC42C1EE' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_9) == 0x0002F8, "Member 'ABP_Devil_C::Timeline_9' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_8_NewTrack_0_C6EA1442405097E0D84D5D9B32E90972) == 0x000300, "Member 'ABP_Devil_C::Timeline_8_NewTrack_0_C6EA1442405097E0D84D5D9B32E90972' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_8__Direction_C6EA1442405097E0D84D5D9B32E90972) == 0x000304, "Member 'ABP_Devil_C::Timeline_8__Direction_C6EA1442405097E0D84D5D9B32E90972' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_8) == 0x000308, "Member 'ABP_Devil_C::Timeline_8' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_6_NewTrack_0_4BA7AB904F3AB041E1BF7CB6A246E21A) == 0x000310, "Member 'ABP_Devil_C::Timeline_6_NewTrack_0_4BA7AB904F3AB041E1BF7CB6A246E21A' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_6__Direction_4BA7AB904F3AB041E1BF7CB6A246E21A) == 0x000314, "Member 'ABP_Devil_C::Timeline_6__Direction_4BA7AB904F3AB041E1BF7CB6A246E21A' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_6) == 0x000318, "Member 'ABP_Devil_C::Timeline_6' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_5_NewTrack_0_362C861F421BE3E60E27068321A3DE9C) == 0x000320, "Member 'ABP_Devil_C::Timeline_5_NewTrack_0_362C861F421BE3E60E27068321A3DE9C' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_5__Direction_362C861F421BE3E60E27068321A3DE9C) == 0x000324, "Member 'ABP_Devil_C::Timeline_5__Direction_362C861F421BE3E60E27068321A3DE9C' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_5) == 0x000328, "Member 'ABP_Devil_C::Timeline_5' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_4_NewTrack_0_703AA70A4CD68A65CF4F23AECC72C410) == 0x000330, "Member 'ABP_Devil_C::Timeline_4_NewTrack_0_703AA70A4CD68A65CF4F23AECC72C410' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_4__Direction_703AA70A4CD68A65CF4F23AECC72C410) == 0x000334, "Member 'ABP_Devil_C::Timeline_4__Direction_703AA70A4CD68A65CF4F23AECC72C410' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_4) == 0x000338, "Member 'ABP_Devil_C::Timeline_4' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_3_NewTrack_0_223835EA42C07F586C18CA91BA3EA596) == 0x000340, "Member 'ABP_Devil_C::Timeline_3_NewTrack_0_223835EA42C07F586C18CA91BA3EA596' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_3__Direction_223835EA42C07F586C18CA91BA3EA596) == 0x000344, "Member 'ABP_Devil_C::Timeline_3__Direction_223835EA42C07F586C18CA91BA3EA596' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_3) == 0x000348, "Member 'ABP_Devil_C::Timeline_3' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Blink_NewTrack_0_E1F1C2A74122E6339ED443A64B4850BB) == 0x000350, "Member 'ABP_Devil_C::Blink_NewTrack_0_E1F1C2A74122E6339ED443A64B4850BB' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Blink__Direction_E1F1C2A74122E6339ED443A64B4850BB) == 0x000354, "Member 'ABP_Devil_C::Blink__Direction_E1F1C2A74122E6339ED443A64B4850BB' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Blink) == 0x000358, "Member 'ABP_Devil_C::Blink' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_2_NewTrack_0_840B3DA144787BFD2D5B3994DAF1DC7C) == 0x000360, "Member 'ABP_Devil_C::Timeline_2_NewTrack_0_840B3DA144787BFD2D5B3994DAF1DC7C' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_2__Direction_840B3DA144787BFD2D5B3994DAF1DC7C) == 0x000364, "Member 'ABP_Devil_C::Timeline_2__Direction_840B3DA144787BFD2D5B3994DAF1DC7C' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_2) == 0x000368, "Member 'ABP_Devil_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_1_NewTrack_0_7E13D7B64229B805C2B576B626BB1337) == 0x000370, "Member 'ABP_Devil_C::Timeline_1_NewTrack_0_7E13D7B64229B805C2B576B626BB1337' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_1__Direction_7E13D7B64229B805C2B576B626BB1337) == 0x000374, "Member 'ABP_Devil_C::Timeline_1__Direction_7E13D7B64229B805C2B576B626BB1337' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_1) == 0x000378, "Member 'ABP_Devil_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_0_NewTrack_0_A65938D249C5DA4C159B62BC7F65A6BF) == 0x000380, "Member 'ABP_Devil_C::Timeline_0_NewTrack_0_A65938D249C5DA4C159B62BC7F65A6BF' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_0__Direction_A65938D249C5DA4C159B62BC7F65A6BF) == 0x000384, "Member 'ABP_Devil_C::Timeline_0__Direction_A65938D249C5DA4C159B62BC7F65A6BF' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Timeline_0) == 0x000388, "Member 'ABP_Devil_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, MaterialBody) == 0x000390, "Member 'ABP_Devil_C::MaterialBody' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, MaterialWings) == 0x000398, "Member 'ABP_Devil_C::MaterialWings' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, PreviousAngry) == 0x0003A0, "Member 'ABP_Devil_C::PreviousAngry' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, NewAngry) == 0x0003A8, "Member 'ABP_Devil_C::NewAngry' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, PreviousSmile) == 0x0003B0, "Member 'ABP_Devil_C::PreviousSmile' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, NewSmile) == 0x0003B8, "Member 'ABP_Devil_C::NewSmile' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, PreviousBrows) == 0x0003C0, "Member 'ABP_Devil_C::PreviousBrows' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, NewBrows) == 0x0003C8, "Member 'ABP_Devil_C::NewBrows' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, DevilDistance) == 0x0003D0, "Member 'ABP_Devil_C::DevilDistance' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, Pose) == 0x0003D8, "Member 'ABP_Devil_C::Pose' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, PreviousPose) == 0x0003D9, "Member 'ABP_Devil_C::PreviousPose' has a wrong offset!");
static_assert(offsetof(ABP_Devil_C, DelayBeforeTalking) == 0x0003E0, "Member 'ABP_Devil_C::DelayBeforeTalking' has a wrong offset!");

}

