#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructorBall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DestructorBall.BP_DestructorBall_C.ActivateBox
// 0x0001 (0x0001 - 0x0000)
struct BP_DestructorBall_C_ActivateBox final
{
public:
	bool                                          Right;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructorBall_C_ActivateBox) == 0x000001, "Wrong alignment on BP_DestructorBall_C_ActivateBox");
static_assert(sizeof(BP_DestructorBall_C_ActivateBox) == 0x000001, "Wrong size on BP_DestructorBall_C_ActivateBox");
static_assert(offsetof(BP_DestructorBall_C_ActivateBox, Right) == 0x000000, "Member 'BP_DestructorBall_C_ActivateBox::Right' has a wrong offset!");

// Function BP_DestructorBall.BP_DestructorBall_C.BalancerJoueur
// 0x0020 (0x0020 - 0x0000)
struct BP_DestructorBall_C_BalancerJoueur final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructorBall_C_BalancerJoueur) == 0x000008, "Wrong alignment on BP_DestructorBall_C_BalancerJoueur");
static_assert(sizeof(BP_DestructorBall_C_BalancerJoueur) == 0x000020, "Wrong size on BP_DestructorBall_C_BalancerJoueur");
static_assert(offsetof(BP_DestructorBall_C_BalancerJoueur, Target) == 0x000000, "Member 'BP_DestructorBall_C_BalancerJoueur::Target' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BalancerJoueur, Direction) == 0x000008, "Member 'BP_DestructorBall_C_BalancerJoueur::Direction' has a wrong offset!");

// Function BP_DestructorBall.BP_DestructorBall_C.BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ADF[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DestructorBall.BP_DestructorBall_C.BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE0[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DestructorBall_C_BndEvt__BP_DestructorBall_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DestructorBall.BP_DestructorBall_C.ExecuteUbergraph_BP_DestructorBall
// 0x0488 (0x0488 - 0x0000)
struct BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE1[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE2[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE3[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE4[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0088(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE5[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE6[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01A0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE7[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Target;                         // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Direction;                      // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE8[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0360(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Right;                          // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE9[0x5];                                     // 0x044B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AEA[0x7];                                     // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed;   // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall) == 0x000008, "Wrong alignment on BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall");
static_assert(sizeof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall) == 0x000488, "Wrong size on BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, EntryPoint) == 0x000000, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_GetPlaybackPosition_ReturnValue) == 0x000004, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, Temp_bool_IsClosed_Variable) == 0x000040, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, Temp_bool_Has_Been_Initd_Variable) == 0x000041, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000060, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000068, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000070, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000078, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000080, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000084, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000088, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_DynamicCast_AsPawn) == 0x000170, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000180, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_OtherActor) == 0x000188, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_OtherComp) == 0x000190, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000198, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_bFromSweep) == 0x00019C, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_ComponentBoundEvent_SweepResult) == 0x0001A0, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_GetForwardVector_ReturnValue) == 0x000288, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_DynamicCast_AsPawn_1) == 0x0002A0, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_DynamicCast_AsPawn_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_DynamicCast_bSuccess_1) == 0x0002A8, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_CustomEvent_Target) == 0x0002B0, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_CustomEvent_Direction) == 0x0002B8, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002D0, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_DynamicCast_AsBPI_Character) == 0x0002E8, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_DynamicCast_bSuccess_2) == 0x0002F8, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_RLerp_ReturnValue) == 0x000300, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x000318, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_GetForwardVector_ReturnValue_1) == 0x000330, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_SelectRotator_ReturnValue) == 0x000348, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000360, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, K2Node_CustomEvent_Right) == 0x000448, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::K2Node_CustomEvent_Right' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_Not_PreBool_ReturnValue) == 0x000449, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_Not_PreBool_ReturnValue_1) == 0x00044A, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_GetPhysicsLinearVelocity_ReturnValue) == 0x000450, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_GetPhysicsLinearVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_VSize_ReturnValue) == 0x000468, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000470, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed) == 0x000478, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed' has a wrong offset!");
static_assert(offsetof(BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000480, "Member 'BP_DestructorBall_C_ExecuteUbergraph_BP_DestructorBall::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_DestructorBall.BP_DestructorBall_C.OnRep_RepPosition
// 0x0001 (0x0001 - 0x0000)
struct BP_DestructorBall_C_OnRep_RepPosition final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructorBall_C_OnRep_RepPosition) == 0x000001, "Wrong alignment on BP_DestructorBall_C_OnRep_RepPosition");
static_assert(sizeof(BP_DestructorBall_C_OnRep_RepPosition) == 0x000001, "Wrong size on BP_DestructorBall_C_OnRep_RepPosition");
static_assert(offsetof(BP_DestructorBall_C_OnRep_RepPosition, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_DestructorBall_C_OnRep_RepPosition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

