#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_EnabledPhysics_01_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bp_EnabledPhysics_01_01.bp_EnabledPhysics_01_01_C
// 0x0038 (0x02D0 - 0x0298)
class Abp_EnabledPhysics_01_01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AStaticMeshActor*>               StaticMeshes;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AEmitter*>                       Particles;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_bp_EnabledPhysics_01_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_EnabledPhysics_01_01_C">();
	}
	static class Abp_EnabledPhysics_01_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abp_EnabledPhysics_01_01_C>();
	}
};
static_assert(alignof(Abp_EnabledPhysics_01_01_C) == 0x000008, "Wrong alignment on Abp_EnabledPhysics_01_01_C");
static_assert(sizeof(Abp_EnabledPhysics_01_01_C) == 0x0002D0, "Wrong size on Abp_EnabledPhysics_01_01_C");
static_assert(offsetof(Abp_EnabledPhysics_01_01_C, UberGraphFrame) == 0x000298, "Member 'Abp_EnabledPhysics_01_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abp_EnabledPhysics_01_01_C, Box) == 0x0002A0, "Member 'Abp_EnabledPhysics_01_01_C::Box' has a wrong offset!");
static_assert(offsetof(Abp_EnabledPhysics_01_01_C, DefaultSceneRoot) == 0x0002A8, "Member 'Abp_EnabledPhysics_01_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(Abp_EnabledPhysics_01_01_C, StaticMeshes) == 0x0002B0, "Member 'Abp_EnabledPhysics_01_01_C::StaticMeshes' has a wrong offset!");
static_assert(offsetof(Abp_EnabledPhysics_01_01_C, Particles) == 0x0002C0, "Member 'Abp_EnabledPhysics_01_01_C::Particles' has a wrong offset!");

}

