#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_EnabledPhysics_01_01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function bp_EnabledPhysics_01_01.bp_EnabledPhysics_01_01_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3855[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'bp_EnabledPhysics_01_01_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function bp_EnabledPhysics_01_01.bp_EnabledPhysics_01_01_C.ExecuteUbergraph_bp_EnabledPhysics_01_01
// 0x0158 (0x0158 - 0x0000)
struct bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3856[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3857[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitter*                               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3858[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class Abp_ThirdPersonCharacter_SF_Torch_C*    K2Node_DynamicCast_AsBp_Third_Person_Character_SF_Torch; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3859[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385A[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01) == 0x000008, "Wrong alignment on bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01");
static_assert(sizeof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01) == 0x000158, "Wrong size on bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, EntryPoint) == 0x000000, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, Temp_int_Array_Index_Variable) == 0x000014, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, CallFunc_Array_Get_Item) == 0x000020, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000028, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, K2Node_ComponentBoundEvent_OtherActor) == 0x000030, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, K2Node_ComponentBoundEvent_OtherComp) == 0x000038, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000040, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, K2Node_DynamicCast_AsBp_Third_Person_Character_SF_Torch) == 0x000130, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::K2Node_DynamicCast_AsBp_Third_Person_Character_SF_Torch' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, CallFunc_Array_Length_ReturnValue_1) == 0x000148, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, Temp_int_Loop_Counter_Variable_1) == 0x00014C, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, CallFunc_Less_IntInt_ReturnValue_1) == 0x000150, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01, CallFunc_Add_IntInt_ReturnValue_1) == 0x000154, "Member 'bp_EnabledPhysics_01_01_C_ExecuteUbergraph_bp_EnabledPhysics_01_01::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

}

