#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Footprint_01_02_MudRight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Footprint_01_02_MudRight.BP_Footprint_01_02_MudRight_C.ExecuteUbergraph_BP_Footprint_01_02_MudRight
// 0x0030 (0x0030 - 0x0000)
struct BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight) == 0x000008, "Wrong alignment on BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight");
static_assert(sizeof(BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight) == 0x000030, "Wrong size on BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight");
static_assert(offsetof(BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight, EntryPoint) == 0x000000, "Member 'BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000028, "Member 'BP_Footprint_01_02_MudRight_C_ExecuteUbergraph_BP_Footprint_01_02_MudRight::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

