#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Footprint_01_03_Water

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Footprint_01_03_Water.BP_Footprint_01_03_Water_C
// 0x0030 (0x02D0 - 0x02A0)
class ABP_Footprint_01_03_Water_C : public ADecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DecalSize_DecalSize_BEFA6CC2459395627D1B2B8CCADC1832; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DecalSize__Direction_BEFA6CC2459395627D1B2B8CCADC1832; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3627[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DecalSize;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseParticle;                                       // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3628[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Particle;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Delay;                                             // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DecalSize__FinishedFunc();
	void DecalSize__UpdateFunc();
	void ExecuteUbergraph_BP_Footprint_01_03_Water(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Footprint_01_03_Water_C">();
	}
	static class ABP_Footprint_01_03_Water_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Footprint_01_03_Water_C>();
	}
};
static_assert(alignof(ABP_Footprint_01_03_Water_C) == 0x000008, "Wrong alignment on ABP_Footprint_01_03_Water_C");
static_assert(sizeof(ABP_Footprint_01_03_Water_C) == 0x0002D0, "Wrong size on ABP_Footprint_01_03_Water_C");
static_assert(offsetof(ABP_Footprint_01_03_Water_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_Footprint_01_03_Water_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_01_03_Water_C, DecalSize_DecalSize_BEFA6CC2459395627D1B2B8CCADC1832) == 0x0002A8, "Member 'ABP_Footprint_01_03_Water_C::DecalSize_DecalSize_BEFA6CC2459395627D1B2B8CCADC1832' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_01_03_Water_C, DecalSize__Direction_BEFA6CC2459395627D1B2B8CCADC1832) == 0x0002AC, "Member 'ABP_Footprint_01_03_Water_C::DecalSize__Direction_BEFA6CC2459395627D1B2B8CCADC1832' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_01_03_Water_C, DecalSize) == 0x0002B0, "Member 'ABP_Footprint_01_03_Water_C::DecalSize' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_01_03_Water_C, UseParticle) == 0x0002B8, "Member 'ABP_Footprint_01_03_Water_C::UseParticle' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_01_03_Water_C, Particle) == 0x0002C0, "Member 'ABP_Footprint_01_03_Water_C::Particle' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_01_03_Water_C, Delay) == 0x0002C8, "Member 'ABP_Footprint_01_03_Water_C::Delay' has a wrong offset!");

}

