#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingIsland_02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloatingIsland_02.BP_FloatingIsland_02_C
// 0x00D0 (0x0368 - 0x0298)
class ABP_FloatingIsland_02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent24;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent23;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent22;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent21;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent20;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent19;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent18;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent17;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent16;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent15;                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent14;                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent13;                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent12;                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent11;                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent10;                             // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent9;                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent8;                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent7;                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent6;                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent5;                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent4;                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent3;                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent2;                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FloatingIsland_02_C">();
	}
	static class ABP_FloatingIsland_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FloatingIsland_02_C>();
	}
};
static_assert(alignof(ABP_FloatingIsland_02_C) == 0x000008, "Wrong alignment on ABP_FloatingIsland_02_C");
static_assert(sizeof(ABP_FloatingIsland_02_C) == 0x000368, "Wrong size on ABP_FloatingIsland_02_C");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent24) == 0x000298, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent24' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent23) == 0x0002A0, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent23' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent22) == 0x0002A8, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent22' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent21) == 0x0002B0, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent21' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent20) == 0x0002B8, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent20' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent19) == 0x0002C0, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent19' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent18) == 0x0002C8, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent18' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent17) == 0x0002D0, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent17' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent16) == 0x0002D8, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent16' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent15) == 0x0002E0, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent15' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent14) == 0x0002E8, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent14' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent13) == 0x0002F0, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent13' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent12) == 0x0002F8, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent12' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent11) == 0x000300, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent11' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent10) == 0x000308, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent10' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent9) == 0x000310, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent9' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent8) == 0x000318, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent7) == 0x000320, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent6) == 0x000328, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent5) == 0x000330, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent4) == 0x000338, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent3) == 0x000340, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent2) == 0x000348, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent1) == 0x000350, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, StaticMeshComponent0) == 0x000358, "Member 'ABP_FloatingIsland_02_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_FloatingIsland_02_C, SharedRoot) == 0x000360, "Member 'ABP_FloatingIsland_02_C::SharedRoot' has a wrong offset!");

}

