#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FallingMan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FallingMan.BP_FallingMan_C
// 0x0088 (0x0320 - 0x0298)
class ABP_FallingMan_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Man_Screaming_Sound_Effect_Cue;                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Target;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh2;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_F1B36A5D41C31DBEF031A2BC092D3195; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_F1B36A5D41C31DBEF031A2BC092D3195; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3951[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShortSound;                                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FallingMan(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FallingMan_C">();
	}
	static class ABP_FallingMan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FallingMan_C>();
	}
};
static_assert(alignof(ABP_FallingMan_C) == 0x000008, "Wrong alignment on ABP_FallingMan_C");
static_assert(sizeof(ABP_FallingMan_C) == 0x000320, "Wrong size on ABP_FallingMan_C");
static_assert(offsetof(ABP_FallingMan_C, UberGraphFrame) == 0x000298, "Member 'ABP_FallingMan_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, C_TickOptimizer) == 0x0002A0, "Member 'ABP_FallingMan_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, Man_Screaming_Sound_Effect_Cue) == 0x0002A8, "Member 'ABP_FallingMan_C::Man_Screaming_Sound_Effect_Cue' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, Target) == 0x0002B0, "Member 'ABP_FallingMan_C::Target' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, StaticMesh4) == 0x0002B8, "Member 'ABP_FallingMan_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, StaticMesh3) == 0x0002C0, "Member 'ABP_FallingMan_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, StaticMesh1) == 0x0002C8, "Member 'ABP_FallingMan_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, StaticMesh) == 0x0002D0, "Member 'ABP_FallingMan_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, SkeletalMesh2) == 0x0002D8, "Member 'ABP_FallingMan_C::SkeletalMesh2' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, SkeletalMesh1) == 0x0002E0, "Member 'ABP_FallingMan_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, SkeletalMesh) == 0x0002E8, "Member 'ABP_FallingMan_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, Scene) == 0x0002F0, "Member 'ABP_FallingMan_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, DefaultSceneRoot) == 0x0002F8, "Member 'ABP_FallingMan_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, Timeline_0_NewTrack_0_F1B36A5D41C31DBEF031A2BC092D3195) == 0x000300, "Member 'ABP_FallingMan_C::Timeline_0_NewTrack_0_F1B36A5D41C31DBEF031A2BC092D3195' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, Timeline_0__Direction_F1B36A5D41C31DBEF031A2BC092D3195) == 0x000304, "Member 'ABP_FallingMan_C::Timeline_0__Direction_F1B36A5D41C31DBEF031A2BC092D3195' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, Timeline_0) == 0x000308, "Member 'ABP_FallingMan_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, Duration) == 0x000310, "Member 'ABP_FallingMan_C::Duration' has a wrong offset!");
static_assert(offsetof(ABP_FallingMan_C, ShortSound) == 0x000318, "Member 'ABP_FallingMan_C::ShortSound' has a wrong offset!");

}

