#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingPlatform

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FloatingPlatform.BP_FloatingPlatform_C.ExecuteUbergraph_BP_FloatingPlatform
// 0x0230 (0x0230 - 0x0000)
struct BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Optimise;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8E[0x8];                                     // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TInterpTo_ReturnValue;                    // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0140(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_TInterpTo_DeltaTime_ImplicitCast;         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform) == 0x000010, "Wrong alignment on BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform");
static_assert(sizeof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform) == 0x000230, "Wrong size on BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, EntryPoint) == 0x000000, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_HasAuthority_ReturnValue_1) == 0x000006, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, K2Node_Event_Optimise) == 0x000007, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::K2Node_Event_Optimise' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000070, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000D0, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_TInterpTo_ReturnValue) == 0x0000E0, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_TInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000140, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform, CallFunc_TInterpTo_DeltaTime_ImplicitCast) == 0x000228, "Member 'BP_FloatingPlatform_C_ExecuteUbergraph_BP_FloatingPlatform::CallFunc_TInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_FloatingPlatform.BP_FloatingPlatform_C.Optimise
// 0x0001 (0x0001 - 0x0000)
struct BP_FloatingPlatform_C_Optimise final
{
public:
	bool                                          Param_Optimise;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FloatingPlatform_C_Optimise) == 0x000001, "Wrong alignment on BP_FloatingPlatform_C_Optimise");
static_assert(sizeof(BP_FloatingPlatform_C_Optimise) == 0x000001, "Wrong size on BP_FloatingPlatform_C_Optimise");
static_assert(offsetof(BP_FloatingPlatform_C_Optimise, Param_Optimise) == 0x000000, "Member 'BP_FloatingPlatform_C_Optimise::Param_Optimise' has a wrong offset!");

// Function BP_FloatingPlatform.BP_FloatingPlatform_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FloatingPlatform_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FloatingPlatform_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FloatingPlatform_C_ReceiveTick");
static_assert(sizeof(BP_FloatingPlatform_C_ReceiveTick) == 0x000004, "Wrong size on BP_FloatingPlatform_C_ReceiveTick");
static_assert(offsetof(BP_FloatingPlatform_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FloatingPlatform_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FloatingPlatform.BP_FloatingPlatform_C.UserConstructionScript
// 0x0070 (0x0070 - 0x0000)
struct BP_FloatingPlatform_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8F[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FloatingPlatform_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_FloatingPlatform_C_UserConstructionScript");
static_assert(sizeof(BP_FloatingPlatform_C_UserConstructionScript) == 0x000070, "Wrong size on BP_FloatingPlatform_C_UserConstructionScript");
static_assert(offsetof(BP_FloatingPlatform_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_FloatingPlatform_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingPlatform_C_UserConstructionScript, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_FloatingPlatform_C_UserConstructionScript::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");

}

