#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Footprint_01_03_Water

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Footprint_01_03_Water.BP_Footprint_01_03_Water_C.ExecuteUbergraph_BP_Footprint_01_03_Water
// 0x0058 (0x0058 - 0x0000)
struct BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3629[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water) == 0x000008, "Wrong alignment on BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water");
static_assert(sizeof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water) == 0x000058, "Wrong size on BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water");
static_assert(offsetof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water, EntryPoint) == 0x000000, "Member 'BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000038, "Member 'BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000048, "Member 'BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water, CallFunc_Delay_Duration_ImplicitCast) == 0x000050, "Member 'BP_Footprint_01_03_Water_C_ExecuteUbergraph_BP_Footprint_01_03_Water::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

