#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingPlatform

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloatingPlatform.BP_FloatingPlatform_C
// 0x00B8 (0x0350 - 0x0298)
class ABP_FloatingPlatform_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_VinceSync_C*                         C_VinceSync;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCableComponent*                        Cable1;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            PhysicsConstraint;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8C[0x8];                                     // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RepT;                                              // 0x02E0(0x0060)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FloatingPlatform_C*                 AttachTo;                                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FloatingPlatform(int32 EntryPoint);
	void Optimise(bool Param_Optimise);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FloatingPlatform_C">();
	}
	static class ABP_FloatingPlatform_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FloatingPlatform_C>();
	}
};
static_assert(alignof(ABP_FloatingPlatform_C) == 0x000010, "Wrong alignment on ABP_FloatingPlatform_C");
static_assert(sizeof(ABP_FloatingPlatform_C) == 0x000350, "Wrong size on ABP_FloatingPlatform_C");
static_assert(offsetof(ABP_FloatingPlatform_C, UberGraphFrame) == 0x000298, "Member 'ABP_FloatingPlatform_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, C_VinceSync) == 0x0002A0, "Member 'ABP_FloatingPlatform_C::C_VinceSync' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, C_TickOptimizer) == 0x0002A8, "Member 'ABP_FloatingPlatform_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, Cable1) == 0x0002B0, "Member 'ABP_FloatingPlatform_C::Cable1' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, Cube) == 0x0002B8, "Member 'ABP_FloatingPlatform_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, PhysicsConstraint) == 0x0002C0, "Member 'ABP_FloatingPlatform_C::PhysicsConstraint' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, StaticMesh) == 0x0002C8, "Member 'ABP_FloatingPlatform_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_FloatingPlatform_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, RepT) == 0x0002E0, "Member 'ABP_FloatingPlatform_C::RepT' has a wrong offset!");
static_assert(offsetof(ABP_FloatingPlatform_C, AttachTo) == 0x000340, "Member 'ABP_FloatingPlatform_C::AttachTo' has a wrong offset!");

}

