#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FallingMan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FallingMan.BP_FallingMan_C.ExecuteUbergraph_BP_FallingMan
// 0x0168 (0x0168 - 0x0000)
struct BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3952[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3953[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan) == 0x000008, "Wrong alignment on BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan");
static_assert(sizeof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan) == 0x000168, "Wrong size on BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, EntryPoint) == 0x000000, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, Temp_bool_Variable) == 0x000004, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, Temp_object_Variable) == 0x000008, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, Temp_object_Variable_1) == 0x000010, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_VLerp_ReturnValue) == 0x000020, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000038, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000120, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_MakeRotator_ReturnValue) == 0x000128, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000140, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, K2Node_Select_Default) == 0x000150, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_Delay_Duration_ImplicitCast) == 0x000158, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00015C, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000160, "Member 'BP_FallingMan_C_ExecuteUbergraph_BP_FallingMan::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_FallingMan.BP_FallingMan_C.UserConstructionScript
// 0x01B0 (0x01B0 - 0x0000)
struct BP_FallingMan_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FallingMan_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_FallingMan_C_UserConstructionScript");
static_assert(sizeof(BP_FallingMan_C_UserConstructionScript) == 0x0001B0, "Wrong size on BP_FallingMan_C_UserConstructionScript");
static_assert(offsetof(BP_FallingMan_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_FallingMan_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'BP_FallingMan_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000068, "Member 'BP_FallingMan_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000080, "Member 'BP_FallingMan_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000098, "Member 'BP_FallingMan_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0000B0, "Member 'BP_FallingMan_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallingMan_C_UserConstructionScript, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000C8, "Member 'BP_FallingMan_C_UserConstructionScript::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

}

