#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlipFlopPlatform

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FlipFlopPlatform.BP_FlipFlopPlatform_C.ExecuteUbergraph_BP_FlipFlopPlatform
// 0x0140 (0x0140 - 0x0000)
struct BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36AE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36AF[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B0[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B1[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform) == 0x000008, "Wrong alignment on BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform");
static_assert(sizeof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform) == 0x000140, "Wrong size on BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, EntryPoint) == 0x000000, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed) == 0x000008, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed' has a wrong offset!");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, CallFunc_GetPlaybackPosition_ReturnValue) == 0x000030, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, CallFunc_RLerp_ReturnValue) == 0x000038, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000050, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000138, "Member 'BP_FlipFlopPlatform_C_ExecuteUbergraph_BP_FlipFlopPlatform::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_FlipFlopPlatform.BP_FlipFlopPlatform_C.OnRep_RepTL_Position
// 0x0001 (0x0001 - 0x0000)
struct BP_FlipFlopPlatform_C_OnRep_RepTL_Position final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FlipFlopPlatform_C_OnRep_RepTL_Position) == 0x000001, "Wrong alignment on BP_FlipFlopPlatform_C_OnRep_RepTL_Position");
static_assert(sizeof(BP_FlipFlopPlatform_C_OnRep_RepTL_Position) == 0x000001, "Wrong size on BP_FlipFlopPlatform_C_OnRep_RepTL_Position");
static_assert(offsetof(BP_FlipFlopPlatform_C_OnRep_RepTL_Position, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_FlipFlopPlatform_C_OnRep_RepTL_Position::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

