#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeavenSun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HeavenSun.BP_HeavenSun_C
// 0x0050 (0x02E8 - 0x0298)
class ABP_HeavenSun_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          WhiteScreenTrigger;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          AttractionTrigger;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sun;                                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_HeavenSun(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HeavenSun_C">();
	}
	static class ABP_HeavenSun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HeavenSun_C>();
	}
};
static_assert(alignof(ABP_HeavenSun_C) == 0x000008, "Wrong alignment on ABP_HeavenSun_C");
static_assert(sizeof(ABP_HeavenSun_C) == 0x0002E8, "Wrong size on ABP_HeavenSun_C");
static_assert(offsetof(ABP_HeavenSun_C, UberGraphFrame) == 0x000298, "Member 'ABP_HeavenSun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, C_TickOptimizer) == 0x0002A0, "Member 'ABP_HeavenSun_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, WhiteScreenTrigger) == 0x0002A8, "Member 'ABP_HeavenSun_C::WhiteScreenTrigger' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, AttractionTrigger) == 0x0002B0, "Member 'ABP_HeavenSun_C::AttractionTrigger' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, StaticMesh1) == 0x0002B8, "Member 'ABP_HeavenSun_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, StaticMesh) == 0x0002C0, "Member 'ABP_HeavenSun_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, Arrow) == 0x0002C8, "Member 'ABP_HeavenSun_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, NS_Sun) == 0x0002D0, "Member 'ABP_HeavenSun_C::NS_Sun' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, Sphere) == 0x0002D8, "Member 'ABP_HeavenSun_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_HeavenSun_C, DefaultSceneRoot) == 0x0002E0, "Member 'ABP_HeavenSun_C::DefaultSceneRoot' has a wrong offset!");

}

