#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HugeWaterfall_Spline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HugeWaterfall_Spline.BP_HugeWaterfall_Spline_C
// 0x0060 (0x02F8 - 0x0298)
class ABP_HugeWaterfall_Spline_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleAnim_Anim_F71BB0514A61C0ED07F4DAA4DD55164D; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ParticleAnim__Direction_F71BB0514A61C0ED07F4DAA4DD55164D; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B2[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ParticleAnim;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfEmitters;                                  // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B3[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ParticleSystem;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              Particles;                                         // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        PlayRate;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HugeWaterfall_Spline(int32 EntryPoint);
	void ParticleAnim__FinishedFunc();
	void ParticleAnim__UpdateFunc();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HugeWaterfall_Spline_C">();
	}
	static class ABP_HugeWaterfall_Spline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HugeWaterfall_Spline_C>();
	}
};
static_assert(alignof(ABP_HugeWaterfall_Spline_C) == 0x000008, "Wrong alignment on ABP_HugeWaterfall_Spline_C");
static_assert(sizeof(ABP_HugeWaterfall_Spline_C) == 0x0002F8, "Wrong size on ABP_HugeWaterfall_Spline_C");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, UberGraphFrame) == 0x000298, "Member 'ABP_HugeWaterfall_Spline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, C_TickOptimizer) == 0x0002A0, "Member 'ABP_HugeWaterfall_Spline_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, Spline) == 0x0002A8, "Member 'ABP_HugeWaterfall_Spline_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_HugeWaterfall_Spline_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, ParticleAnim_Anim_F71BB0514A61C0ED07F4DAA4DD55164D) == 0x0002B8, "Member 'ABP_HugeWaterfall_Spline_C::ParticleAnim_Anim_F71BB0514A61C0ED07F4DAA4DD55164D' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, ParticleAnim__Direction_F71BB0514A61C0ED07F4DAA4DD55164D) == 0x0002BC, "Member 'ABP_HugeWaterfall_Spline_C::ParticleAnim__Direction_F71BB0514A61C0ED07F4DAA4DD55164D' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, ParticleAnim) == 0x0002C0, "Member 'ABP_HugeWaterfall_Spline_C::ParticleAnim' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, NumberOfEmitters) == 0x0002C8, "Member 'ABP_HugeWaterfall_Spline_C::NumberOfEmitters' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, ParticleSystem) == 0x0002D0, "Member 'ABP_HugeWaterfall_Spline_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, Particles) == 0x0002D8, "Member 'ABP_HugeWaterfall_Spline_C::Particles' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, PlayRate) == 0x0002E8, "Member 'ABP_HugeWaterfall_Spline_C::PlayRate' has a wrong offset!");
static_assert(offsetof(ABP_HugeWaterfall_Spline_C, NiagaraSystem) == 0x0002F0, "Member 'ABP_HugeWaterfall_Spline_C::NiagaraSystem' has a wrong offset!");

}

