#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HourGlassHandler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_HourGlassHandler.BP_HourGlassHandler_C.ExecuteUbergraph_BP_HourGlassHandler
// 0x00F0 (0x00F0 - 0x0000)
struct BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C94[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C95[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C96[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHourGlass_BP_C*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHourGlass_BP_C*                        CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHourGlass_BP_C*                        CallFunc_Array_Get_Item_2;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AHourGlass_BP_C*>                K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHourGlass_BP_C*                        CallFunc_Array_Get_Item_3;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C97[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHourGlass_BP_C*                        CallFunc_Array_Get_Item_4;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHourGlass_BP_C*                        CallFunc_Array_Get_Item_5;                         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AHourGlass_BP_C*>                K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm)
	class AHourGlass_BP_C*                        CallFunc_Array_Get_Item_6;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C98[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C99[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler) == 0x000008, "Wrong alignment on BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler");
static_assert(sizeof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler) == 0x0000F0, "Wrong size on BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, EntryPoint) == 0x000000, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed) == 0x000008, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_HasAuthority_ReturnValue) == 0x00003C, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Get_Item_2) == 0x000050, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, K2Node_MakeArray_Array) == 0x000058, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_RLerp_ReturnValue) == 0x000068, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Get_Item_3) == 0x000080, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_RLerp_ReturnValue_1) == 0x000090, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_RLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Get_Item_4) == 0x0000A8, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Get_Item_5) == 0x0000B0, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, K2Node_MakeArray_Array_1) == 0x0000B8, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Get_Item_6) == 0x0000C8, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, Temp_int_Loop_Counter_Variable_1) == 0x0000D8, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DC, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E0, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_GetPlaybackPosition_ReturnValue) == 0x0000E4, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x0000E8, "Member 'BP_HourGlassHandler_C_ExecuteUbergraph_BP_HourGlassHandler::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_HourGlassHandler.BP_HourGlassHandler_C.OnRep_RepTL_Position
// 0x0001 (0x0001 - 0x0000)
struct BP_HourGlassHandler_C_OnRep_RepTL_Position final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HourGlassHandler_C_OnRep_RepTL_Position) == 0x000001, "Wrong alignment on BP_HourGlassHandler_C_OnRep_RepTL_Position");
static_assert(sizeof(BP_HourGlassHandler_C_OnRep_RepTL_Position) == 0x000001, "Wrong size on BP_HourGlassHandler_C_OnRep_RepTL_Position");
static_assert(offsetof(BP_HourGlassHandler_C_OnRep_RepTL_Position, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_HourGlassHandler_C_OnRep_RepTL_Position::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

