#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HourGlassHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HourGlassHandler.BP_HourGlassHandler_C
// 0x0048 (0x02E0 - 0x0298)
class ABP_HourGlassHandler_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_1_3A2E428144EFB1E3CFF6E49589025DE3; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_3A2E428144EFB1E3CFF6E49589025DE3; // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_3A2E428144EFB1E3CFF6E49589025DE3; // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C93[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AHourGlass_BP_C*>                Hourglasses;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	float                                         RepTL_Position;                                    // 0x02D8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void ExecuteUbergraph_BP_HourGlassHandler(int32 EntryPoint);
	void OnRep_RepTL_Position();
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HourGlassHandler_C">();
	}
	static class ABP_HourGlassHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HourGlassHandler_C>();
	}
};
static_assert(alignof(ABP_HourGlassHandler_C) == 0x000008, "Wrong alignment on ABP_HourGlassHandler_C");
static_assert(sizeof(ABP_HourGlassHandler_C) == 0x0002E0, "Wrong size on ABP_HourGlassHandler_C");
static_assert(offsetof(ABP_HourGlassHandler_C, UberGraphFrame) == 0x000298, "Member 'ABP_HourGlassHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HourGlassHandler_C, Billboard) == 0x0002A0, "Member 'ABP_HourGlassHandler_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_HourGlassHandler_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_HourGlassHandler_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_HourGlassHandler_C, Timeline_NewTrack_1_3A2E428144EFB1E3CFF6E49589025DE3) == 0x0002B0, "Member 'ABP_HourGlassHandler_C::Timeline_NewTrack_1_3A2E428144EFB1E3CFF6E49589025DE3' has a wrong offset!");
static_assert(offsetof(ABP_HourGlassHandler_C, Timeline_NewTrack_0_3A2E428144EFB1E3CFF6E49589025DE3) == 0x0002B4, "Member 'ABP_HourGlassHandler_C::Timeline_NewTrack_0_3A2E428144EFB1E3CFF6E49589025DE3' has a wrong offset!");
static_assert(offsetof(ABP_HourGlassHandler_C, Timeline__Direction_3A2E428144EFB1E3CFF6E49589025DE3) == 0x0002B8, "Member 'ABP_HourGlassHandler_C::Timeline__Direction_3A2E428144EFB1E3CFF6E49589025DE3' has a wrong offset!");
static_assert(offsetof(ABP_HourGlassHandler_C, Timeline) == 0x0002C0, "Member 'ABP_HourGlassHandler_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_HourGlassHandler_C, Hourglasses) == 0x0002C8, "Member 'ABP_HourGlassHandler_C::Hourglasses' has a wrong offset!");
static_assert(offsetof(ABP_HourGlassHandler_C, RepTL_Position) == 0x0002D8, "Member 'ABP_HourGlassHandler_C::RepTL_Position' has a wrong offset!");

}

