#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeavenSun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_HeavenSun.BP_HeavenSun_C.BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B28[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_HeavenSun.BP_HeavenSun_C.BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B29[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_HeavenSun_C_BndEvt__BP_HeavenSun_WhiteScreenTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_HeavenSun.BP_HeavenSun_C.ExecuteUbergraph_BP_HeavenSun
// 0x05F8 (0x05F8 - 0x0000)
struct BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_EndScreen_C*                         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2B[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x0148(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2C[0x3];                                     // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0288(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2D[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0390(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2E[0x7];                                     // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0488(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2F[0x7];                                     // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B30[0x3];                                     // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x04E0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B31[0x7];                                     // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun) == 0x000008, "Wrong alignment on BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun");
static_assert(sizeof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun) == 0x0005F8, "Wrong size on BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, EntryPoint) == 0x000000, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, Temp_bool_IsClosed_Variable) == 0x000019, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_MakeRotator_ReturnValue_1) == 0x000048, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000060, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x000148, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000230, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000238, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000250, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000268, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000270, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000278, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000280, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000284, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000288, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_FindLookAtRotation_ReturnValue) == 0x000370, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000388, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000390, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_DynamicCast_AsPawn) == 0x000478, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_DynamicCast_bSuccess) == 0x000480, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_DynamicCast_AsBPI_Character) == 0x000488, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_DynamicCast_bSuccess_1) == 0x000498, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0004A0, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0004B8, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0004C0, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_OtherActor) == 0x0004C8, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_OtherComp) == 0x0004D0, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0004D8, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_bFromSweep) == 0x0004DC, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, K2Node_ComponentBoundEvent_SweepResult) == 0x0004E0, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0005C8, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_GetPlayerController_ReturnValue) == 0x0005D0, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0005D8, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0005E0, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0005E8, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0005F0, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun, CallFunc_MakeRotator_Pitch_ImplicitCast_1) == 0x0005F4, "Member 'BP_HeavenSun_C_ExecuteUbergraph_BP_HeavenSun::CallFunc_MakeRotator_Pitch_ImplicitCast_1' has a wrong offset!");

// Function BP_HeavenSun.BP_HeavenSun_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HeavenSun_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeavenSun_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HeavenSun_C_ReceiveTick");
static_assert(sizeof(BP_HeavenSun_C_ReceiveTick) == 0x000004, "Wrong size on BP_HeavenSun_C_ReceiveTick");
static_assert(offsetof(BP_HeavenSun_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HeavenSun_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

