#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_InteractivePlayer_01_01_Force

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bp_InteractivePlayer_01_01_Force.bp_InteractivePlayer_01_01_Force_C
// 0x0020 (0x02B8 - 0x0298)
class Abp_InteractivePlayer_01_01_Force_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Force;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Background;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_InteractivePlayer_01_01_Force(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_InteractivePlayer_01_01_Force_C">();
	}
	static class Abp_InteractivePlayer_01_01_Force_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abp_InteractivePlayer_01_01_Force_C>();
	}
};
static_assert(alignof(Abp_InteractivePlayer_01_01_Force_C) == 0x000008, "Wrong alignment on Abp_InteractivePlayer_01_01_Force_C");
static_assert(sizeof(Abp_InteractivePlayer_01_01_Force_C) == 0x0002B8, "Wrong size on Abp_InteractivePlayer_01_01_Force_C");
static_assert(offsetof(Abp_InteractivePlayer_01_01_Force_C, UberGraphFrame) == 0x000298, "Member 'Abp_InteractivePlayer_01_01_Force_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abp_InteractivePlayer_01_01_Force_C, Force) == 0x0002A0, "Member 'Abp_InteractivePlayer_01_01_Force_C::Force' has a wrong offset!");
static_assert(offsetof(Abp_InteractivePlayer_01_01_Force_C, Background) == 0x0002A8, "Member 'Abp_InteractivePlayer_01_01_Force_C::Background' has a wrong offset!");
static_assert(offsetof(Abp_InteractivePlayer_01_01_Force_C, DefaultSceneRoot) == 0x0002B0, "Member 'Abp_InteractivePlayer_01_01_Force_C::DefaultSceneRoot' has a wrong offset!");

}

