#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IceCube

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_IceCube.BP_IceCube_C.UserConstructionScript
// 0x0120 (0x0120 - 0x0000)
struct BP_IceCube_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A53[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_IceCube_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_IceCube_C_UserConstructionScript");
static_assert(sizeof(BP_IceCube_C_UserConstructionScript) == 0x000120, "Wrong size on BP_IceCube_C_UserConstructionScript");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_IceCube_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, Temp_real_Variable) == 0x000004, "Member 'BP_IceCube_C_UserConstructionScript::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, Temp_real_Variable_1) == 0x000008, "Member 'BP_IceCube_C_UserConstructionScript::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, Temp_real_Variable_2) == 0x00000C, "Member 'BP_IceCube_C_UserConstructionScript::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, Temp_real_Variable_3) == 0x000010, "Member 'BP_IceCube_C_UserConstructionScript::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000014, "Member 'BP_IceCube_C_UserConstructionScript::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, K2Node_Select_Default) == 0x000018, "Member 'BP_IceCube_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'BP_IceCube_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IceCube_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000038, "Member 'BP_IceCube_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

