#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IceCube

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IceCube.BP_IceCube_C
// 0x0040 (0x02D8 - 0x0298)
class ABP_IceCube_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IceCube_C">();
	}
	static class ABP_IceCube_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IceCube_C>();
	}
};
static_assert(alignof(ABP_IceCube_C) == 0x000008, "Wrong alignment on ABP_IceCube_C");
static_assert(sizeof(ABP_IceCube_C) == 0x0002D8, "Wrong size on ABP_IceCube_C");
static_assert(offsetof(ABP_IceCube_C, StaticMesh1) == 0x000298, "Member 'ABP_IceCube_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_IceCube_C, StaticMesh) == 0x0002A0, "Member 'ABP_IceCube_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_IceCube_C, StaticMesh4) == 0x0002A8, "Member 'ABP_IceCube_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_IceCube_C, StaticMesh3) == 0x0002B0, "Member 'ABP_IceCube_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_IceCube_C, StaticMesh2) == 0x0002B8, "Member 'ABP_IceCube_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_IceCube_C, Scene) == 0x0002C0, "Member 'ABP_IceCube_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_IceCube_C, Cube) == 0x0002C8, "Member 'ABP_IceCube_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_IceCube_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_IceCube_C::DefaultSceneRoot' has a wrong offset!");

}

