#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LobbyCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ChoosenChar_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LobbyCharacter.BP_LobbyCharacter_C
// 0x0050 (0x02E8 - 0x0298)
class ABP_LobbyCharacter_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_ChoosenChar                                 Chosen_Char;                                       // 0x02B8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E83[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           Ps;                                                // 0x02C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	class FString                                 PlayerName;                                        // 0x02C8(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	class FString                                 LocalMpPlayerName;                                 // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AddCloth(class USkeletalMesh* NewMesh, const struct FLinearColor& Tint);
	void ExecuteUbergraph_BP_LobbyCharacter(int32 EntryPoint);
	void MakeBlack();
	void OnRep_Chosen_Char();
	void OnRep_PlayerName();
	void OnRep_PS();
	void ReceiveBeginPlay();
	void RemoveClothes();
	void ResetMaterials();
	void SetAffectedPS(class APlayerState* Param_Ps);
	void SetChosenChar(E_ChoosenChar ChosenChar);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LobbyCharacter_C">();
	}
	static class ABP_LobbyCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LobbyCharacter_C>();
	}
};
static_assert(alignof(ABP_LobbyCharacter_C) == 0x000008, "Wrong alignment on ABP_LobbyCharacter_C");
static_assert(sizeof(ABP_LobbyCharacter_C) == 0x0002E8, "Wrong size on ABP_LobbyCharacter_C");
static_assert(offsetof(ABP_LobbyCharacter_C, UberGraphFrame) == 0x000298, "Member 'ABP_LobbyCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LobbyCharacter_C, Widget) == 0x0002A0, "Member 'ABP_LobbyCharacter_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_LobbyCharacter_C, SkeletalMesh) == 0x0002A8, "Member 'ABP_LobbyCharacter_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_LobbyCharacter_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_LobbyCharacter_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LobbyCharacter_C, Chosen_Char) == 0x0002B8, "Member 'ABP_LobbyCharacter_C::Chosen_Char' has a wrong offset!");
static_assert(offsetof(ABP_LobbyCharacter_C, Ps) == 0x0002C0, "Member 'ABP_LobbyCharacter_C::Ps' has a wrong offset!");
static_assert(offsetof(ABP_LobbyCharacter_C, PlayerName) == 0x0002C8, "Member 'ABP_LobbyCharacter_C::PlayerName' has a wrong offset!");
static_assert(offsetof(ABP_LobbyCharacter_C, LocalMpPlayerName) == 0x0002D8, "Member 'ABP_LobbyCharacter_C::LocalMpPlayerName' has a wrong offset!");

}

