#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LavaModifier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LavaModifier.BP_LavaModifier_C
// 0x0020 (0x02B8 - 0x0298)
class ABP_LavaModifier_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          LavaStart;                                         // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__BP_LavaModifier_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_LavaModifier(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LavaModifier_C">();
	}
	static class ABP_LavaModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LavaModifier_C>();
	}
};
static_assert(alignof(ABP_LavaModifier_C) == 0x000008, "Wrong alignment on ABP_LavaModifier_C");
static_assert(sizeof(ABP_LavaModifier_C) == 0x0002B8, "Wrong size on ABP_LavaModifier_C");
static_assert(offsetof(ABP_LavaModifier_C, UberGraphFrame) == 0x000298, "Member 'ABP_LavaModifier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LavaModifier_C, Box) == 0x0002A0, "Member 'ABP_LavaModifier_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_LavaModifier_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_LavaModifier_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LavaModifier_C, LavaStart) == 0x0002B0, "Member 'ABP_LavaModifier_C::LavaStart' has a wrong offset!");

}

