#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lamp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lamp.BP_Lamp_C
// 0x0060 (0x02F8 - 0x0298)
class ABP_Lamp_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Moths;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Light;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Flame;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           MPCTOD;                                            // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Parameter_Name;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Light_On;                                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Shadow;                                       // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A76[0x6];                                     // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Attenuation_Radius;                                // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Moths_On;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Lamp(int32 EntryPoint);
	void Toggle();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lamp_C">();
	}
	static class ABP_Lamp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lamp_C>();
	}
};
static_assert(alignof(ABP_Lamp_C) == 0x000008, "Wrong alignment on ABP_Lamp_C");
static_assert(sizeof(ABP_Lamp_C) == 0x0002F8, "Wrong size on ABP_Lamp_C");
static_assert(offsetof(ABP_Lamp_C, UberGraphFrame) == 0x000298, "Member 'ABP_Lamp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Moths) == 0x0002A0, "Member 'ABP_Lamp_C::Moths' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Light) == 0x0002A8, "Member 'ABP_Lamp_C::Light' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Flame) == 0x0002B0, "Member 'ABP_Lamp_C::Flame' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Mesh) == 0x0002B8, "Member 'ABP_Lamp_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_Lamp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, MPCTOD) == 0x0002C8, "Member 'ABP_Lamp_C::MPCTOD' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Parameter_Name) == 0x0002D0, "Member 'ABP_Lamp_C::Parameter_Name' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Light_On) == 0x0002D8, "Member 'ABP_Lamp_C::Light_On' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Cast_Shadow) == 0x0002D9, "Member 'ABP_Lamp_C::Cast_Shadow' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Attenuation_Radius) == 0x0002E0, "Member 'ABP_Lamp_C::Attenuation_Radius' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Intensity) == 0x0002E8, "Member 'ABP_Lamp_C::Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Lamp_C, Moths_On) == 0x0002F0, "Member 'ABP_Lamp_C::Moths_On' has a wrong offset!");

}

