#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lamp

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Lamp.BP_Lamp_C.ExecuteUbergraph_BP_Lamp
// 0x0018 (0x0018 - 0x0000)
struct BP_Lamp_C_ExecuteUbergraph_BP_Lamp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A77[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lamp_C_ExecuteUbergraph_BP_Lamp) == 0x000008, "Wrong alignment on BP_Lamp_C_ExecuteUbergraph_BP_Lamp");
static_assert(sizeof(BP_Lamp_C_ExecuteUbergraph_BP_Lamp) == 0x000018, "Wrong size on BP_Lamp_C_ExecuteUbergraph_BP_Lamp");
static_assert(offsetof(BP_Lamp_C_ExecuteUbergraph_BP_Lamp, EntryPoint) == 0x000000, "Member 'BP_Lamp_C_ExecuteUbergraph_BP_Lamp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_ExecuteUbergraph_BP_Lamp, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'BP_Lamp_C_ExecuteUbergraph_BP_Lamp::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_ExecuteUbergraph_BP_Lamp, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Lamp_C_ExecuteUbergraph_BP_Lamp::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_ExecuteUbergraph_BP_Lamp, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'BP_Lamp_C_ExecuteUbergraph_BP_Lamp::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Lamp.BP_Lamp_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct BP_Lamp_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A78[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lamp_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Lamp_C_UserConstructionScript");
static_assert(sizeof(BP_Lamp_C_UserConstructionScript) == 0x00000C, "Wrong size on BP_Lamp_C_UserConstructionScript");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000004, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast) == 0x000008, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast' has a wrong offset!");

}

