#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MoveUpDown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MoveUpDown.BP_MoveUpDown_C.ExecuteUbergraph_BP_MoveUpDown
// 0x0138 (0x0138 - 0x0000)
struct BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9C[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown) == 0x000008, "Wrong alignment on BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown");
static_assert(sizeof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown) == 0x000138, "Wrong size on BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, EntryPoint) == 0x000000, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, CallFunc_VLerp_ReturnValue) == 0x000020, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000038, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, CallFunc_GetPlaybackPosition_ReturnValue) == 0x000120, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, CallFunc_SelectFloat_ReturnValue) == 0x000128, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown, CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast) == 0x000130, "Member 'BP_MoveUpDown_C_ExecuteUbergraph_BP_MoveUpDown::CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast' has a wrong offset!");

// Function BP_MoveUpDown.BP_MoveUpDown_C.OnRep_TimelinePos
// 0x0001 (0x0001 - 0x0000)
struct BP_MoveUpDown_C_OnRep_TimelinePos final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoveUpDown_C_OnRep_TimelinePos) == 0x000001, "Wrong alignment on BP_MoveUpDown_C_OnRep_TimelinePos");
static_assert(sizeof(BP_MoveUpDown_C_OnRep_TimelinePos) == 0x000001, "Wrong size on BP_MoveUpDown_C_OnRep_TimelinePos");
static_assert(offsetof(BP_MoveUpDown_C_OnRep_TimelinePos, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_MoveUpDown_C_OnRep_TimelinePos::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_MoveUpDown.BP_MoveUpDown_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BP_MoveUpDown_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MoveUpDown_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_MoveUpDown_C_UserConstructionScript");
static_assert(sizeof(BP_MoveUpDown_C_UserConstructionScript) == 0x000030, "Wrong size on BP_MoveUpDown_C_UserConstructionScript");
static_assert(offsetof(BP_MoveUpDown_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_MoveUpDown_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MoveUpDown_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000018, "Member 'BP_MoveUpDown_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");

}

