#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_Mist_01_01_Particle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function bp_Mist_01_01_Particle.bp_Mist_01_01_Particle_C.UserConstructionScript
// 0x0210 (0x0210 - 0x0000)
struct bp_Mist_01_01_Particle_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ADB[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x00E0)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ADC[0x8];                                     // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x0110(0x00E0)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x01F0(0x0010)(ReferenceParm)
	float                                         K2Node_MakeStruct_Scalar_ImplicitCast;             // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_Mist_01_01_Particle_C_UserConstructionScript) == 0x000010, "Wrong alignment on bp_Mist_01_01_Particle_C_UserConstructionScript");
static_assert(sizeof(bp_Mist_01_01_Particle_C_UserConstructionScript) == 0x000210, "Wrong size on bp_Mist_01_01_Particle_C_UserConstructionScript");
static_assert(offsetof(bp_Mist_01_01_Particle_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'bp_Mist_01_01_Particle_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_Mist_01_01_Particle_C_UserConstructionScript, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'bp_Mist_01_01_Particle_C_UserConstructionScript::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(bp_Mist_01_01_Particle_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000F0, "Member 'bp_Mist_01_01_Particle_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_Mist_01_01_Particle_C_UserConstructionScript, K2Node_MakeStruct_ParticleSysParam_1) == 0x000110, "Member 'bp_Mist_01_01_Particle_C_UserConstructionScript::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(bp_Mist_01_01_Particle_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x0001F0, "Member 'bp_Mist_01_01_Particle_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(bp_Mist_01_01_Particle_C_UserConstructionScript, K2Node_MakeStruct_Scalar_ImplicitCast) == 0x000200, "Member 'bp_Mist_01_01_Particle_C_UserConstructionScript::K2Node_MakeStruct_Scalar_ImplicitCast' has a wrong offset!");

}

