#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MovingRope

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MovingRope.BP_MovingRope_C.ExecuteUbergraph_BP_MovingRope
// 0x0020 (0x0020 - 0x0000)
struct BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AF2[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Axis;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AF3[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope) == 0x000008, "Wrong alignment on BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope");
static_assert(sizeof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope) == 0x000020, "Wrong size on BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope");
static_assert(offsetof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope, EntryPoint) == 0x000000, "Member 'BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope, K2Node_Event_Axis) == 0x000008, "Member 'BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope::K2Node_Event_Axis' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000019, "Member 'BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00001C, "Member 'BP_MovingRope_C_ExecuteUbergraph_BP_MovingRope::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_MovingRope.BP_MovingRope_C.GetPivotAlpha
// 0x0040 (0x0040 - 0x0000)
struct BP_MovingRope_C_GetPivotAlpha final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingRope_C_GetPivotAlpha) == 0x000008, "Wrong alignment on BP_MovingRope_C_GetPivotAlpha");
static_assert(sizeof(BP_MovingRope_C_GetPivotAlpha) == 0x000040, "Wrong size on BP_MovingRope_C_GetPivotAlpha");
static_assert(offsetof(BP_MovingRope_C_GetPivotAlpha, Alpha) == 0x000000, "Member 'BP_MovingRope_C_GetPivotAlpha::Alpha' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_GetPivotAlpha, CallFunc_BreakVector_X) == 0x000008, "Member 'BP_MovingRope_C_GetPivotAlpha::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_GetPivotAlpha, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_MovingRope_C_GetPivotAlpha::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_GetPivotAlpha, CallFunc_BreakVector_Z) == 0x000018, "Member 'BP_MovingRope_C_GetPivotAlpha::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_GetPivotAlpha, CallFunc_BreakVector_X_1) == 0x000020, "Member 'BP_MovingRope_C_GetPivotAlpha::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_GetPivotAlpha, CallFunc_BreakVector_Y_1) == 0x000028, "Member 'BP_MovingRope_C_GetPivotAlpha::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_GetPivotAlpha, CallFunc_BreakVector_Z_1) == 0x000030, "Member 'BP_MovingRope_C_GetPivotAlpha::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_GetPivotAlpha, CallFunc_MapRangeClamped_ReturnValue) == 0x000038, "Member 'BP_MovingRope_C_GetPivotAlpha::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function BP_MovingRope.BP_MovingRope_C.OnPivot
// 0x0008 (0x0008 - 0x0000)
struct BP_MovingRope_C_OnPivot final
{
public:
	double                                        Axis;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingRope_C_OnPivot) == 0x000008, "Wrong alignment on BP_MovingRope_C_OnPivot");
static_assert(sizeof(BP_MovingRope_C_OnPivot) == 0x000008, "Wrong size on BP_MovingRope_C_OnPivot");
static_assert(offsetof(BP_MovingRope_C_OnPivot, Axis) == 0x000000, "Member 'BP_MovingRope_C_OnPivot::Axis' has a wrong offset!");

// Function BP_MovingRope.BP_MovingRope_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct BP_MovingRope_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AF4[0xF];                                     // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingRope_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_MovingRope_C_UserConstructionScript");
static_assert(sizeof(BP_MovingRope_C_UserConstructionScript) == 0x0000B0, "Wrong size on BP_MovingRope_C_UserConstructionScript");
static_assert(offsetof(BP_MovingRope_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_MovingRope_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_MovingRope_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_MovingRope_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000010, "Member 'BP_MovingRope_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_MovingRope_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_MovingRope_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_MovingRope_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingRope_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000A0, "Member 'BP_MovingRope_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

