#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MetallicObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MetallicObject.BP_MetallicObject_C
// 0x0040 (0x02D8 - 0x0298)
class ABP_MetallicObject_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_8086151F47EF192E87E851B44044C02C; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B52[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitLoc;                                           // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddForce(const struct FVector& NewParam);
	void CustomEvent_0();
	void ExecuteUbergraph_BP_MetallicObject(int32 EntryPoint);
	void FlushVelocity();
	void ReceiveBeginPlay();
	void ReinitLocation();
	void ResetLocation();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UpdateSimulatePhysx();
	void UpdateSimulation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MetallicObject_C">();
	}
	static class ABP_MetallicObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MetallicObject_C>();
	}
};
static_assert(alignof(ABP_MetallicObject_C) == 0x000008, "Wrong alignment on ABP_MetallicObject_C");
static_assert(sizeof(ABP_MetallicObject_C) == 0x0002D8, "Wrong size on ABP_MetallicObject_C");
static_assert(offsetof(ABP_MetallicObject_C, UberGraphFrame) == 0x000298, "Member 'ABP_MetallicObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MetallicObject_C, C_TickOptimizer) == 0x0002A0, "Member 'ABP_MetallicObject_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_MetallicObject_C, StaticMesh) == 0x0002A8, "Member 'ABP_MetallicObject_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_MetallicObject_C, Timeline_0__Direction_8086151F47EF192E87E851B44044C02C) == 0x0002B0, "Member 'ABP_MetallicObject_C::Timeline_0__Direction_8086151F47EF192E87E851B44044C02C' has a wrong offset!");
static_assert(offsetof(ABP_MetallicObject_C, Timeline_0) == 0x0002B8, "Member 'ABP_MetallicObject_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_MetallicObject_C, InitLoc) == 0x0002C0, "Member 'ABP_MetallicObject_C::InitLoc' has a wrong offset!");

}

