#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MovingRope

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MovingRope.BP_MovingRope_C
// 0x0048 (0x02E0 - 0x0298)
class ABP_MovingRope_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Length;                                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3AF1[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Spacing;                                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mat;                                               // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousAxis;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current;                                           // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PullingPlatform_C*                  PullingPlatform;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void CheckDoorOpen();
	void ExecuteUbergraph_BP_MovingRope(int32 EntryPoint);
	void GetPivotAlpha(double* Alpha);
	void OnPivot(double Axis);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MovingRope_C">();
	}
	static class ABP_MovingRope_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MovingRope_C>();
	}
};
static_assert(alignof(ABP_MovingRope_C) == 0x000008, "Wrong alignment on ABP_MovingRope_C");
static_assert(sizeof(ABP_MovingRope_C) == 0x0002E0, "Wrong size on ABP_MovingRope_C");
static_assert(offsetof(ABP_MovingRope_C, UberGraphFrame) == 0x000298, "Member 'ABP_MovingRope_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MovingRope_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_MovingRope_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MovingRope_C, Length) == 0x0002A8, "Member 'ABP_MovingRope_C::Length' has a wrong offset!");
static_assert(offsetof(ABP_MovingRope_C, Spacing) == 0x0002B0, "Member 'ABP_MovingRope_C::Spacing' has a wrong offset!");
static_assert(offsetof(ABP_MovingRope_C, Speed) == 0x0002B8, "Member 'ABP_MovingRope_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_MovingRope_C, Mat) == 0x0002C0, "Member 'ABP_MovingRope_C::Mat' has a wrong offset!");
static_assert(offsetof(ABP_MovingRope_C, PreviousAxis) == 0x0002C8, "Member 'ABP_MovingRope_C::PreviousAxis' has a wrong offset!");
static_assert(offsetof(ABP_MovingRope_C, Current) == 0x0002D0, "Member 'ABP_MovingRope_C::Current' has a wrong offset!");
static_assert(offsetof(ABP_MovingRope_C, PullingPlatform) == 0x0002D8, "Member 'ABP_MovingRope_C::PullingPlatform' has a wrong offset!");

}

