#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_neon_light_a_01MinusON1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function bp_neon_light_a_01-ON1.bp_neon_light_a_01-ON1_C.ExecuteUbergraph_bp_neon_light_a_01-ON1
// 0x0048 (0x0048 - 0x0000)
struct bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3784[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1) == 0x000008, "Wrong alignment on bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1");
static_assert(sizeof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1) == 0x000048, "Wrong size on bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, EntryPoint) == 0x000000, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_Lerp_ReturnValue_1) == 0x000020, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000028, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000030, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_Delay_Duration_ImplicitCast) == 0x00003C, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000040, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1, CallFunc_SetIntensity_NewIntensity_ImplicitCast_1) == 0x000044, "Member 'bp_neon_light_a_01MinusON1_C_ExecuteUbergraph_bp_neon_light_a_01MinusON1::CallFunc_SetIntensity_NewIntensity_ImplicitCast_1' has a wrong offset!");

// Function bp_neon_light_a_01-ON1.bp_neon_light_a_01-ON1_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct bp_neon_light_a_01MinusON1_C_UserConstructionScript final
{
public:
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_neon_light_a_01MinusON1_C_UserConstructionScript) == 0x000008, "Wrong alignment on bp_neon_light_a_01MinusON1_C_UserConstructionScript");
static_assert(sizeof(bp_neon_light_a_01MinusON1_C_UserConstructionScript) == 0x000030, "Wrong size on bp_neon_light_a_01MinusON1_C_UserConstructionScript");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000000, "Member 'bp_neon_light_a_01MinusON1_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'bp_neon_light_a_01MinusON1_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000018, "Member 'bp_neon_light_a_01MinusON1_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_neon_light_a_01MinusON1_C_UserConstructionScript, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000028, "Member 'bp_neon_light_a_01MinusON1_C_UserConstructionScript::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");

}

