#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NewChain

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NewChain.BP_NewChain_C.AutoDestroyChain
// 0x0006 (0x0006 - 0x0000)
struct BP_NewChain_C_AutoDestroyChain final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewChain_C_AutoDestroyChain) == 0x000001, "Wrong alignment on BP_NewChain_C_AutoDestroyChain");
static_assert(sizeof(BP_NewChain_C_AutoDestroyChain) == 0x000006, "Wrong size on BP_NewChain_C_AutoDestroyChain");
static_assert(offsetof(BP_NewChain_C_AutoDestroyChain, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_NewChain_C_AutoDestroyChain::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_AutoDestroyChain, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_NewChain_C_AutoDestroyChain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_AutoDestroyChain, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_NewChain_C_AutoDestroyChain::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_AutoDestroyChain, CallFunc_IsValid_ReturnValue_1) == 0x000003, "Member 'BP_NewChain_C_AutoDestroyChain::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_AutoDestroyChain, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'BP_NewChain_C_AutoDestroyChain::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_AutoDestroyChain, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'BP_NewChain_C_AutoDestroyChain::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_NewChain.BP_NewChain_C.Bounce
// 0x0018 (0x0018 - 0x0000)
struct BP_NewChain_C_Bounce final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewChain_C_Bounce) == 0x000008, "Wrong alignment on BP_NewChain_C_Bounce");
static_assert(sizeof(BP_NewChain_C_Bounce) == 0x000018, "Wrong size on BP_NewChain_C_Bounce");
static_assert(offsetof(BP_NewChain_C_Bounce, Velocity) == 0x000000, "Member 'BP_NewChain_C_Bounce::Velocity' has a wrong offset!");

// Function BP_NewChain.BP_NewChain_C.ChangeMaillonMasses
// 0x0040 (0x0040 - 0x0000)
struct BP_NewChain_C_ChangeMaillonMasses final
{
public:
	double                                        MassInKg;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_LinearDamping;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_AngularDamping;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D78[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLinearDamping_InDamping_ImplicitCast;  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAngularDamping_InDamping_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewChain_C_ChangeMaillonMasses) == 0x000008, "Wrong alignment on BP_NewChain_C_ChangeMaillonMasses");
static_assert(sizeof(BP_NewChain_C_ChangeMaillonMasses) == 0x000040, "Wrong size on BP_NewChain_C_ChangeMaillonMasses");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, MassInKg) == 0x000000, "Member 'BP_NewChain_C_ChangeMaillonMasses::MassInKg' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, Param_LinearDamping) == 0x000008, "Member 'BP_NewChain_C_ChangeMaillonMasses::Param_LinearDamping' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, Param_AngularDamping) == 0x000010, "Member 'BP_NewChain_C_ChangeMaillonMasses::Param_AngularDamping' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_NewChain_C_ChangeMaillonMasses::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_NewChain_C_ChangeMaillonMasses::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_NewChain_C_ChangeMaillonMasses::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_NewChain_C_ChangeMaillonMasses::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_NewChain_C_ChangeMaillonMasses::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_NewChain_C_ChangeMaillonMasses::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast) == 0x000034, "Member 'BP_NewChain_C_ChangeMaillonMasses::CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, CallFunc_SetLinearDamping_InDamping_ImplicitCast) == 0x000038, "Member 'BP_NewChain_C_ChangeMaillonMasses::CallFunc_SetLinearDamping_InDamping_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_ChangeMaillonMasses, CallFunc_SetAngularDamping_InDamping_ImplicitCast) == 0x00003C, "Member 'BP_NewChain_C_ChangeMaillonMasses::CallFunc_SetAngularDamping_InDamping_ImplicitCast' has a wrong offset!");

// Function BP_NewChain.BP_NewChain_C.Check Chain Force
// 0x0090 (0x0090 - 0x0000)
struct BP_NewChain_C_Check_Chain_Force final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceTotal;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PreviousMaillon;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        AForce;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LForce;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D79[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7A[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7B[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewChain_C_Check_Chain_Force) == 0x000008, "Wrong alignment on BP_NewChain_C_Check_Chain_Force");
static_assert(sizeof(BP_NewChain_C_Check_Chain_Force) == 0x000090, "Wrong size on BP_NewChain_C_Check_Chain_Force");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, Distance) == 0x000000, "Member 'BP_NewChain_C_Check_Chain_Force::Distance' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, DistanceTotal) == 0x000008, "Member 'BP_NewChain_C_Check_Chain_Force::DistanceTotal' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, PreviousMaillon) == 0x000010, "Member 'BP_NewChain_C_Check_Chain_Force::PreviousMaillon' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, AForce) == 0x000018, "Member 'BP_NewChain_C_Check_Chain_Force::AForce' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, LForce) == 0x000020, "Member 'BP_NewChain_C_Check_Chain_Force::LForce' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_NewChain_C_Check_Chain_Force::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_NewChain_C_Check_Chain_Force::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000060, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_Vector_Distance_ReturnValue) == 0x000080, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_Check_Chain_Force, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_NewChain_C_Check_Chain_Force::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_NewChain.BP_NewChain_C.DepenatreAll
// 0x0001 (0x0001 - 0x0000)
struct BP_NewChain_C_DepenatreAll final
{
public:
	ECollisionResponse                            NewResponse;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewChain_C_DepenatreAll) == 0x000001, "Wrong alignment on BP_NewChain_C_DepenatreAll");
static_assert(sizeof(BP_NewChain_C_DepenatreAll) == 0x000001, "Wrong size on BP_NewChain_C_DepenatreAll");
static_assert(offsetof(BP_NewChain_C_DepenatreAll, NewResponse) == 0x000000, "Member 'BP_NewChain_C_DepenatreAll::NewResponse' has a wrong offset!");

// Function BP_NewChain.BP_NewChain_C.DetectPenetration
// 0x0290 (0x0290 - 0x0000)
struct BP_NewChain_C_DetectPenetration final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CompsArray;                                        // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UPrimitiveComponent*>            Comps;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UPrimitiveComponent*                    PenetratedComp;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          PenetrationLocal;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7D[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7E[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          CallFunc_GetPawnArray_Array;                       // 0x0070(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D80[0x2];                                     // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D81[0x1];                                     // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D82[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D83[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D84[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewChain_C_DetectPenetration) == 0x000008, "Wrong alignment on BP_NewChain_C_DetectPenetration");
static_assert(sizeof(BP_NewChain_C_DetectPenetration) == 0x000290, "Wrong size on BP_NewChain_C_DetectPenetration");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, ReturnValue) == 0x000000, "Member 'BP_NewChain_C_DetectPenetration::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CompsArray) == 0x000008, "Member 'BP_NewChain_C_DetectPenetration::CompsArray' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, Comps) == 0x000018, "Member 'BP_NewChain_C_DetectPenetration::Comps' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, PenetratedComp) == 0x000028, "Member 'BP_NewChain_C_DetectPenetration::PenetratedComp' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, PenetrationLocal) == 0x000030, "Member 'BP_NewChain_C_DetectPenetration::PenetrationLocal' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_NewChain_C_DetectPenetration::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_NewChain_C_DetectPenetration::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, K2Node_DynamicCast_AsBPI_Gamestate) == 0x000050, "Member 'BP_NewChain_C_DetectPenetration::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_NewChain_C_DetectPenetration::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_GetPawnArray_Array) == 0x000070, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_GetPawnArray_Array' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000080, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_IsValid_ReturnValue) == 0x0000A4, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000A8, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_LineTraceSingle_OutHit) == 0x0000C0, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_LineTraceSingle_ReturnValue) == 0x0001A8, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_bBlockingHit) == 0x0001A9, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001AA, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_Time) == 0x0001AC, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_Distance) == 0x0001B0, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_Location) == 0x0001B8, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D0, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_Normal) == 0x0001E8, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_ImpactNormal) == 0x000200, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_PhysMat) == 0x000218, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_HitActor) == 0x000220, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_HitComponent) == 0x000228, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_HitBoneName) == 0x000230, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_BoneName) == 0x000238, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_ElementIndex) == 0x000244, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_FaceIndex) == 0x000248, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_TraceStart) == 0x000250, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_BreakHitResult_TraceEnd) == 0x000268, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_GetCollisionResponseToChannel_ReturnValue) == 0x000280, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_GetCollisionResponseToChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, CallFunc_Array_Add_ReturnValue) == 0x000284, "Member 'BP_NewChain_C_DetectPenetration::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DetectPenetration, K2Node_SwitchEnum_CmpSuccess) == 0x000288, "Member 'BP_NewChain_C_DetectPenetration::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_NewChain.BP_NewChain_C.DissolveChain
// 0x0010 (0x0010 - 0x0000)
struct BP_NewChain_C_DissolveChain final
{
public:
	double                                        PlayRate;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlaySound;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewChain_C_DissolveChain) == 0x000008, "Wrong alignment on BP_NewChain_C_DissolveChain");
static_assert(sizeof(BP_NewChain_C_DissolveChain) == 0x000010, "Wrong size on BP_NewChain_C_DissolveChain");
static_assert(offsetof(BP_NewChain_C_DissolveChain, PlayRate) == 0x000000, "Member 'BP_NewChain_C_DissolveChain::PlayRate' has a wrong offset!");
static_assert(offsetof(BP_NewChain_C_DissolveChain, PlaySound) == 0x000008, "Member 'BP_NewChain_C_DissolveChain::PlaySound' has a wrong offset!");

// Function BP_NewChain.BP_NewChain_C.ExecuteUbergraph_BP_NewChain
// 0x07F0 (0x07F0 - 0x0000)
struct BP_NewChain_C_ExecuteUbergraph_BP_NewChain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D85[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D86[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D87[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D88[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D89[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8A[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8B[0x1];                                     // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_7;               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SnapTips;                             // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8C[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Loc_1;                                // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Loc;                                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewDensity;                           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8D[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_NewChainMass;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Human;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8E[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index;                                // 0x0114(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Char;                                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_NewWeight;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_CubeSocket;                           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8F[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D90[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ChainAttachment_C> K2Node_DynamicCast_AsBPI_Chain_Attachment;         // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D91[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ChainAttachment_C> K2Node_DynamicCast_AsBPI_Chain_Attachment_1;       // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D92[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetAttachedComponent_Comp;                // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetAttachedComponent_Comp_1;              // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x01C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D93[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D94[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D95[0x6];                                     // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D96[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D97[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Character;                            // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Check_Chain_Force_Distance;               // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_SpawnChain_MaillonsMeshes;                // 0x0318(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         Pad_2D98[0x8];                                     // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0330(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CosmeticChain_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Puller;                               // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Velocity;                             // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D99[0x4];                                     // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9A[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_PlayRate;                             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlaySound;                            // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9B[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerController_C> K2Node_DynamicCast_AsBPI_Player_Controller;        // 0x0450(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9C[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Check_Chain_Force_Distance_1;             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Impulse;                              // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_2;              // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9D[0x7];                                     // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_3;              // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9E[0x3];                                     // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
