#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Overheadlight_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Overheadlight_01.BP_Overheadlight_01_C
// 0x0018 (0x02B0 - 0x0298)
class ABP_Overheadlight_01_C final : public AActor
{
public:
	class USpotLightComponent*                    SpotLight;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ceilinglight_300_01;                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Overheadlight_01_C">();
	}
	static class ABP_Overheadlight_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Overheadlight_01_C>();
	}
};
static_assert(alignof(ABP_Overheadlight_01_C) == 0x000008, "Wrong alignment on ABP_Overheadlight_01_C");
static_assert(sizeof(ABP_Overheadlight_01_C) == 0x0002B0, "Wrong size on ABP_Overheadlight_01_C");
static_assert(offsetof(ABP_Overheadlight_01_C, SpotLight) == 0x000298, "Member 'ABP_Overheadlight_01_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Overheadlight_01_C, Ceilinglight_300_01) == 0x0002A0, "Member 'ABP_Overheadlight_01_C::Ceilinglight_300_01' has a wrong offset!");
static_assert(offsetof(ABP_Overheadlight_01_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_Overheadlight_01_C::DefaultSceneRoot' has a wrong offset!");

}

