#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PullingPlatform

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PullingPlatform.BP_PullingPlatform_C.ExecuteUbergraph_BP_PullingPlatform
// 0x0160 (0x0160 - 0x0000)
struct BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AEC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_B;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue;              // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0078(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform) == 0x000008, "Wrong alignment on BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform");
static_assert(sizeof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform) == 0x000160, "Wrong size on BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, EntryPoint) == 0x000000, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, K2Node_CustomEvent_B) == 0x000008, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::K2Node_CustomEvent_B' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_Add_VectorFloat_ReturnValue) == 0x000010, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_Add_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_BreakVector_X_1) == 0x000040, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_BreakVector_Y_1) == 0x000048, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_BreakVector_Z_1) == 0x000050, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_FClamp_ReturnValue) == 0x000058, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000078, "Member 'BP_PullingPlatform_C_ExecuteUbergraph_BP_PullingPlatform::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_PullingPlatform.BP_PullingPlatform_C.MovePlatform
// 0x0008 (0x0008 - 0x0000)
struct BP_PullingPlatform_C_MovePlatform final
{
public:
	double                                        B;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PullingPlatform_C_MovePlatform) == 0x000008, "Wrong alignment on BP_PullingPlatform_C_MovePlatform");
static_assert(sizeof(BP_PullingPlatform_C_MovePlatform) == 0x000008, "Wrong size on BP_PullingPlatform_C_MovePlatform");
static_assert(offsetof(BP_PullingPlatform_C_MovePlatform, B) == 0x000000, "Member 'BP_PullingPlatform_C_MovePlatform::B' has a wrong offset!");

}

