#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ParadisePlatform

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ParadisePlatform.BP_ParadisePlatform_C
// 0x0068 (0x0300 - 0x0298)
class ABP_ParadisePlatform_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Ivy04;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ivy03;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ivy02;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ivy01;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          TopVegetationStream;                               // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn)
	int32                                         Height;                                            // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_37A8[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HeightSpacing;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        FirstHeightSpacing;                                // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         TopVegetationDensity;                              // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SideBushDensity;                                   // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FRandomStream                          BushPlacementStream;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn)
	bool                                          BaseRock;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IvyVisibility;                                     // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void RandomBushLocation(double* X, double* Y);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ParadisePlatform_C">();
	}
	static class ABP_ParadisePlatform_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ParadisePlatform_C>();
	}
};
static_assert(alignof(ABP_ParadisePlatform_C) == 0x000008, "Wrong alignment on ABP_ParadisePlatform_C");
static_assert(sizeof(ABP_ParadisePlatform_C) == 0x000300, "Wrong size on ABP_ParadisePlatform_C");
static_assert(offsetof(ABP_ParadisePlatform_C, Ivy04) == 0x000298, "Member 'ABP_ParadisePlatform_C::Ivy04' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, Ivy03) == 0x0002A0, "Member 'ABP_ParadisePlatform_C::Ivy03' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, Ivy02) == 0x0002A8, "Member 'ABP_ParadisePlatform_C::Ivy02' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, Ivy01) == 0x0002B0, "Member 'ABP_ParadisePlatform_C::Ivy01' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, StaticMesh) == 0x0002B8, "Member 'ABP_ParadisePlatform_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_ParadisePlatform_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, TopVegetationStream) == 0x0002C8, "Member 'ABP_ParadisePlatform_C::TopVegetationStream' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, Height) == 0x0002D0, "Member 'ABP_ParadisePlatform_C::Height' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, HeightSpacing) == 0x0002D8, "Member 'ABP_ParadisePlatform_C::HeightSpacing' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, FirstHeightSpacing) == 0x0002E0, "Member 'ABP_ParadisePlatform_C::FirstHeightSpacing' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, TopVegetationDensity) == 0x0002E8, "Member 'ABP_ParadisePlatform_C::TopVegetationDensity' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, SideBushDensity) == 0x0002EC, "Member 'ABP_ParadisePlatform_C::SideBushDensity' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, BushPlacementStream) == 0x0002F0, "Member 'ABP_ParadisePlatform_C::BushPlacementStream' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, BaseRock) == 0x0002F8, "Member 'ABP_ParadisePlatform_C::BaseRock' has a wrong offset!");
static_assert(offsetof(ABP_ParadisePlatform_C, IvyVisibility) == 0x0002F9, "Member 'ABP_ParadisePlatform_C::IvyVisibility' has a wrong offset!");

}

