#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PortMovingPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PortMovingPlate.BP_PortMovingPlate_C.ExecuteUbergraph_BP_PortMovingPlate
// 0x0108 (0x0108 - 0x0000)
struct BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF4[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0020(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate) == 0x000008, "Wrong alignment on BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate");
static_assert(sizeof(BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate) == 0x000108, "Wrong size on BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate");
static_assert(offsetof(BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate, EntryPoint) == 0x000000, "Member 'BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate, CallFunc_VLerp_ReturnValue) == 0x000008, "Member 'BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000020, "Member 'BP_PortMovingPlate_C_ExecuteUbergraph_BP_PortMovingPlate::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

}

