#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RotatingMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RotatingMesh.BP_RotatingMesh_C
// 0x0058 (0x02F0 - 0x0298)
class ABP_RotatingMesh_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                New_Scale;                                         // 0x02B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FRotator                               RepRot;                                            // 0x02D8(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void CustomEvent();
	void ExecuteUbergraph_BP_RotatingMesh(int32 EntryPoint);
	void OnRep_RepRot();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RotatingMesh_C">();
	}
	static class ABP_RotatingMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RotatingMesh_C>();
	}
};
static_assert(alignof(ABP_RotatingMesh_C) == 0x000008, "Wrong alignment on ABP_RotatingMesh_C");
static_assert(sizeof(ABP_RotatingMesh_C) == 0x0002F0, "Wrong size on ABP_RotatingMesh_C");
static_assert(offsetof(ABP_RotatingMesh_C, UberGraphFrame) == 0x000298, "Member 'ABP_RotatingMesh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RotatingMesh_C, C_TickOptimizer) == 0x0002A0, "Member 'ABP_RotatingMesh_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_RotatingMesh_C, StaticMesh) == 0x0002A8, "Member 'ABP_RotatingMesh_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_RotatingMesh_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_RotatingMesh_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_RotatingMesh_C, New_Scale) == 0x0002B8, "Member 'ABP_RotatingMesh_C::New_Scale' has a wrong offset!");
static_assert(offsetof(ABP_RotatingMesh_C, Speed) == 0x0002D0, "Member 'ABP_RotatingMesh_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_RotatingMesh_C, RepRot) == 0x0002D8, "Member 'ABP_RotatingMesh_C::RepRot' has a wrong offset!");

}

