#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RescuePoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RescuePoint.BP_RescuePoint_C.BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_RescuePoint_C_BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_RescuePoint.BP_RescuePoint_C.ExecuteUbergraph_BP_RescuePoint
// 0x0280 (0x0280 - 0x0000)
struct BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Teleport_C*                          CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFA[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_CustomEvent_ActorsToTeleport;               // 0x0018(0x0010)(ReferenceParm)
	TArray<class AActor*>                         K2Node_CustomEvent_Array;                          // 0x0028(0x0010)(ReferenceParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFB[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0058(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class USphereComponent*>               K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFC[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       CallFunc_Array_Get_Item;                           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFD[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFE[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFF[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E00[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E01[0x3];                                     // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint) == 0x000008, "Wrong alignment on BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint");
static_assert(sizeof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint) == 0x000280, "Wrong size on BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, EntryPoint) == 0x000000, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_HasAuthority_ReturnValue_1) == 0x000011, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_CustomEvent_ActorsToTeleport) == 0x000018, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_CustomEvent_ActorsToTeleport' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_CustomEvent_Array) == 0x000028, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_CustomEvent_Array' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000038, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_ComponentBoundEvent_OtherActor) == 0x000040, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_ComponentBoundEvent_OtherComp) == 0x000048, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000050, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_ComponentBoundEvent_bFromSweep) == 0x000054, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_ComponentBoundEvent_SweepResult) == 0x000058, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_MakeArray_Array) == 0x000140, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_DynamicCast_AsPawn) == 0x000150, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_Array_Get_Item) == 0x000160, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_GetGameState_ReturnValue) == 0x000168, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000170, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_DynamicCast_AsBPI_Gamestate) == 0x000188, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakVector_X) == 0x0001A0, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakVector_Y) == 0x0001A8, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakVector_Z) == 0x0001B0, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_Array_Get_Item_1) == 0x0001B8, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_Array_Length_ReturnValue) == 0x0001C0, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_DynamicCast_AsBPI_Character) == 0x0001C8, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0001E0, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakRotator_Roll) == 0x0001F8, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakRotator_Pitch) == 0x0001FC, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakRotator_Yaw) == 0x000200, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_MakeRotator_ReturnValue) == 0x000208, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000220, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakVector_X_1) == 0x000238, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakVector_Y_1) == 0x000240, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_BreakVector_Z_1) == 0x000248, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000250, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_MakeVector_ReturnValue) == 0x000258, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, Temp_int_Loop_Counter_Variable) == 0x000270, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_Less_IntInt_ReturnValue) == 0x000274, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint, CallFunc_Add_IntInt_ReturnValue) == 0x000278, "Member 'BP_RescuePoint_C_ExecuteUbergraph_BP_RescuePoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RescuePoint.BP_RescuePoint_C.GetStartComponentByIndex
// 0x0028 (0x0028 - 0x0000)
struct BP_RescuePoint_C_GetStartComponentByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E02[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USphereComponent*>               K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USphereComponent*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RescuePoint_C_GetStartComponentByIndex) == 0x000008, "Wrong alignment on BP_RescuePoint_C_GetStartComponentByIndex");
static_assert(sizeof(BP_RescuePoint_C_GetStartComponentByIndex) == 0x000028, "Wrong size on BP_RescuePoint_C_GetStartComponentByIndex");
static_assert(offsetof(BP_RescuePoint_C_GetStartComponentByIndex, Param_Index) == 0x000000, "Member 'BP_RescuePoint_C_GetStartComponentByIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_GetStartComponentByIndex, Output) == 0x000008, "Member 'BP_RescuePoint_C_GetStartComponentByIndex::Output' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_GetStartComponentByIndex, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_RescuePoint_C_GetStartComponentByIndex::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_GetStartComponentByIndex, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_RescuePoint_C_GetStartComponentByIndex::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_RescuePoint.BP_RescuePoint_C.TeleportAll
// 0x0010 (0x0010 - 0x0000)
struct BP_RescuePoint_C_TeleportAll final
{
public:
	TArray<class AActor*>                         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_RescuePoint_C_TeleportAll) == 0x000008, "Wrong alignment on BP_RescuePoint_C_TeleportAll");
static_assert(sizeof(BP_RescuePoint_C_TeleportAll) == 0x000010, "Wrong size on BP_RescuePoint_C_TeleportAll");
static_assert(offsetof(BP_RescuePoint_C_TeleportAll, Array) == 0x000000, "Member 'BP_RescuePoint_C_TeleportAll::Array' has a wrong offset!");

// Function BP_RescuePoint.BP_RescuePoint_C.TeleportServer
// 0x0010 (0x0010 - 0x0000)
struct BP_RescuePoint_C_TeleportServer final
{
public:
	TArray<class AActor*>                         Param_ActorsToTeleport;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_RescuePoint_C_TeleportServer) == 0x000008, "Wrong alignment on BP_RescuePoint_C_TeleportServer");
static_assert(sizeof(BP_RescuePoint_C_TeleportServer) == 0x000010, "Wrong size on BP_RescuePoint_C_TeleportServer");
static_assert(offsetof(BP_RescuePoint_C_TeleportServer, Param_ActorsToTeleport) == 0x000000, "Member 'BP_RescuePoint_C_TeleportServer::Param_ActorsToTeleport' has a wrong offset!");

// Function BP_RescuePoint.BP_RescuePoint_C.UserConstructionScript
// 0x04C8 (0x04C8 - 0x0000)
struct BP_RescuePoint_C_UserConstructionScript final
{
public:
	bool                                          GroundFound;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E03[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewLocalVar_0;                                     // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E04[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class USphereComponent*>               K2Node_MakeArray_Array;                            // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E05[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       CallFunc_Array_Get_Item;                           // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E06[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0208(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E07[0x1];                                     // 0x02F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E08[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E09[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x03E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RescuePoint_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_RescuePoint_C_UserConstructionScript");
static_assert(sizeof(BP_RescuePoint_C_UserConstructionScript) == 0x0004C8, "Wrong size on BP_RescuePoint_C_UserConstructionScript");
static_assert(offsetof(BP_RescuePoint_C_UserConstructionScript, GroundFound) == 0x000000, "Member 'BP_RescuePoint_C_UserConstructionScript::GroundFound' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_UserConstructionScript, NewLocalVar_0) == 0x000008, "Member 'BP_RescuePoint_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_RescuePoint_C_UserConstructionScript, Temp_object_Variable) == 0x000020, "Member 'BP_RescuePoint_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
