#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RotatingArc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RotatingArc.BP_RotatingArc_C
// 0x0030 (0x02C8 - 0x0298)
class ABP_RotatingArc_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_VinceSync_C*                         C_VinceSync;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RotatingArc(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RotatingArc_C">();
	}
	static class ABP_RotatingArc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RotatingArc_C>();
	}
};
static_assert(alignof(ABP_RotatingArc_C) == 0x000008, "Wrong alignment on ABP_RotatingArc_C");
static_assert(sizeof(ABP_RotatingArc_C) == 0x0002C8, "Wrong size on ABP_RotatingArc_C");
static_assert(offsetof(ABP_RotatingArc_C, UberGraphFrame) == 0x000298, "Member 'ABP_RotatingArc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RotatingArc_C, C_VinceSync) == 0x0002A0, "Member 'ABP_RotatingArc_C::C_VinceSync' has a wrong offset!");
static_assert(offsetof(ABP_RotatingArc_C, C_TickOptimizer) == 0x0002A8, "Member 'ABP_RotatingArc_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_RotatingArc_C, StaticMesh) == 0x0002B0, "Member 'ABP_RotatingArc_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_RotatingArc_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_RotatingArc_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_RotatingArc_C, Speed) == 0x0002C0, "Member 'ABP_RotatingArc_C::Speed' has a wrong offset!");

}

