#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RescuePoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RescuePoint.BP_RescuePoint_C
// 0x0078 (0x0310 - 0x0298)
class ABP_RescuePoint_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere3;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere2;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere1;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToTeleport;                                  // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector                                BoxSize;                                           // 0x02F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Vehicle;                                           // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          AutoDestroy;                                       // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__BP_RescuePoint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_RescuePoint(int32 EntryPoint);
	void GetStartComponentByIndex(int32 Param_Index, class USphereComponent** Output);
	void ReceiveBeginPlay();
	void TeleportAll(TArray<class AActor*>& Array);
	void TeleportServer(TArray<class AActor*>& Param_ActorsToTeleport);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RescuePoint_C">();
	}
	static class ABP_RescuePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RescuePoint_C>();
	}
};
static_assert(alignof(ABP_RescuePoint_C) == 0x000008, "Wrong alignment on ABP_RescuePoint_C");
static_assert(sizeof(ABP_RescuePoint_C) == 0x000310, "Wrong size on ABP_RescuePoint_C");
static_assert(offsetof(ABP_RescuePoint_C, UberGraphFrame) == 0x000298, "Member 'ABP_RescuePoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, Plane) == 0x0002A0, "Member 'ABP_RescuePoint_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, Arrow) == 0x0002A8, "Member 'ABP_RescuePoint_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, Sphere3) == 0x0002B0, "Member 'ABP_RescuePoint_C::Sphere3' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, Sphere2) == 0x0002B8, "Member 'ABP_RescuePoint_C::Sphere2' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, Sphere1) == 0x0002C0, "Member 'ABP_RescuePoint_C::Sphere1' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, Sphere) == 0x0002C8, "Member 'ABP_RescuePoint_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, Box) == 0x0002D0, "Member 'ABP_RescuePoint_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_RescuePoint_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, ActorsToTeleport) == 0x0002E0, "Member 'ABP_RescuePoint_C::ActorsToTeleport' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, BoxSize) == 0x0002F0, "Member 'ABP_RescuePoint_C::BoxSize' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, Vehicle) == 0x000308, "Member 'ABP_RescuePoint_C::Vehicle' has a wrong offset!");
static_assert(offsetof(ABP_RescuePoint_C, AutoDestroy) == 0x000309, "Member 'ABP_RescuePoint_C::AutoDestroy' has a wrong offset!");

}

