#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Stones01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Stones01.BP_Stones01_C
// 0x0058 (0x02F0 - 0x0298)
class ABP_Stones01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent9;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent8;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent7;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent6;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent5;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent4;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent3;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent2;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Stones01_C">();
	}
	static class ABP_Stones01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Stones01_C>();
	}
};
static_assert(alignof(ABP_Stones01_C) == 0x000008, "Wrong alignment on ABP_Stones01_C");
static_assert(sizeof(ABP_Stones01_C) == 0x0002F0, "Wrong size on ABP_Stones01_C");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent9) == 0x000298, "Member 'ABP_Stones01_C::StaticMeshComponent9' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent8) == 0x0002A0, "Member 'ABP_Stones01_C::StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent7) == 0x0002A8, "Member 'ABP_Stones01_C::StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent6) == 0x0002B0, "Member 'ABP_Stones01_C::StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent5) == 0x0002B8, "Member 'ABP_Stones01_C::StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent4) == 0x0002C0, "Member 'ABP_Stones01_C::StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent3) == 0x0002C8, "Member 'ABP_Stones01_C::StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent2) == 0x0002D0, "Member 'ABP_Stones01_C::StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent1) == 0x0002D8, "Member 'ABP_Stones01_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, StaticMeshComponent0) == 0x0002E0, "Member 'ABP_Stones01_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Stones01_C, SharedRoot) == 0x0002E8, "Member 'ABP_Stones01_C::SharedRoot' has a wrong offset!");

}

