#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StraightRope

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_StraightRope.BP_StraightRope_C.UserConstructionScript
// 0x00A0 (0x00A0 - 0x0000)
struct BP_StraightRope_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3804[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StraightRope_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_StraightRope_C_UserConstructionScript");
static_assert(sizeof(BP_StraightRope_C_UserConstructionScript) == 0x0000A0, "Wrong size on BP_StraightRope_C_UserConstructionScript");
static_assert(offsetof(BP_StraightRope_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_StraightRope_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_StraightRope_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_StraightRope_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StraightRope_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000008, "Member 'BP_StraightRope_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StraightRope_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'BP_StraightRope_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StraightRope_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_StraightRope_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StraightRope_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_StraightRope_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StraightRope_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x000090, "Member 'BP_StraightRope_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");

}

