#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shaft_Tomb_01_800_60

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Shaft_Tomb_01_800_60.BP_Shaft_Tomb_01_800_60_C
// 0x00C0 (0x0368 - 0x02A8)
class ABP_Shaft_Tomb_01_800_60_C final : public AStaticMeshActor
{
public:
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_09;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_08;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_07;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_06;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_05;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_04;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wall_Base_01_Brick_01_Straight_150_150_A3;      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_03;                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTombBackWall01_var06;                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wall_Base_01_Brick_01_Straight_150_150_A2;      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wall_Base_01_Brick_01_Straight_150_150_A1;      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wall_Base_01_Brick_01_Straight_150_150_A;       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_02;                             // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_01;                             // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTombBackWall01_var05;                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTombBackWall01_var04;                          // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Floor01_var04;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTombBackWall01_var03;                          // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTombBackWall01_var02;                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTombBackWall01_var01;                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Shaft_Tomb_01_800_60_C">();
	}
	static class ABP_Shaft_Tomb_01_800_60_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Shaft_Tomb_01_800_60_C>();
	}
};
static_assert(alignof(ABP_Shaft_Tomb_01_800_60_C) == 0x000008, "Wrong alignment on ABP_Shaft_Tomb_01_800_60_C");
static_assert(sizeof(ABP_Shaft_Tomb_01_800_60_C) == 0x000368, "Wrong size on ABP_Shaft_Tomb_01_800_60_C");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_09) == 0x0002A8, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_09' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_08) == 0x0002B0, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_08' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_07) == 0x0002B8, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_07' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_06) == 0x0002C0, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_06' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_05) == 0x0002C8, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_05' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_04) == 0x0002D0, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_04' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_Wall_Base_01_Brick_01_Straight_150_150_A3) == 0x0002D8, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_Wall_Base_01_Brick_01_Straight_150_150_A3' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_03) == 0x0002E0, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_03' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, WallTombBackWall01_var06) == 0x0002E8, "Member 'ABP_Shaft_Tomb_01_800_60_C::WallTombBackWall01_var06' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_Wall_Base_01_Brick_01_Straight_150_150_A2) == 0x0002F0, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_Wall_Base_01_Brick_01_Straight_150_150_A2' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_Wall_Base_01_Brick_01_Straight_150_150_A1) == 0x0002F8, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_Wall_Base_01_Brick_01_Straight_150_150_A1' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_Wall_Base_01_Brick_01_Straight_150_150_A) == 0x000300, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_Wall_Base_01_Brick_01_Straight_150_150_A' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_02) == 0x000308, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_02' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, SM_CeilBeam_01_400_01) == 0x000310, "Member 'ABP_Shaft_Tomb_01_800_60_C::SM_CeilBeam_01_400_01' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, WallTombBackWall01_var05) == 0x000318, "Member 'ABP_Shaft_Tomb_01_800_60_C::WallTombBackWall01_var05' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, WallTombBackWall01_var04) == 0x000320, "Member 'ABP_Shaft_Tomb_01_800_60_C::WallTombBackWall01_var04' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, Floor01_var04) == 0x000328, "Member 'ABP_Shaft_Tomb_01_800_60_C::Floor01_var04' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, WallTombBackWall01_var03) == 0x000330, "Member 'ABP_Shaft_Tomb_01_800_60_C::WallTombBackWall01_var03' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, StaticMesh3) == 0x000338, "Member 'ABP_Shaft_Tomb_01_800_60_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, StaticMesh2) == 0x000340, "Member 'ABP_Shaft_Tomb_01_800_60_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, WallTombBackWall01_var02) == 0x000348, "Member 'ABP_Shaft_Tomb_01_800_60_C::WallTombBackWall01_var02' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, StaticMesh1) == 0x000350, "Member 'ABP_Shaft_Tomb_01_800_60_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, StaticMesh) == 0x000358, "Member 'ABP_Shaft_Tomb_01_800_60_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Shaft_Tomb_01_800_60_C, WallTombBackWall01_var01) == 0x000360, "Member 'ABP_Shaft_Tomb_01_800_60_C::WallTombBackWall01_var01' has a wrong offset!");

}

