#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StabilisationSocket

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StabilisationSocket.BP_StabilisationSocket_C
// 0x0050 (0x02E8 - 0x0298)
class ABP_StabilisationSocket_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviousLocation;                                  // 0x02B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Calculate;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StabilisationSocket(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StabilisationSocket_C">();
	}
	static class ABP_StabilisationSocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StabilisationSocket_C>();
	}
};
static_assert(alignof(ABP_StabilisationSocket_C) == 0x000008, "Wrong alignment on ABP_StabilisationSocket_C");
static_assert(sizeof(ABP_StabilisationSocket_C) == 0x0002E8, "Wrong size on ABP_StabilisationSocket_C");
static_assert(offsetof(ABP_StabilisationSocket_C, UberGraphFrame) == 0x000298, "Member 'ABP_StabilisationSocket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StabilisationSocket_C, Sphere) == 0x0002A0, "Member 'ABP_StabilisationSocket_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_StabilisationSocket_C, Scene) == 0x0002A8, "Member 'ABP_StabilisationSocket_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_StabilisationSocket_C, PreviousLocation) == 0x0002B0, "Member 'ABP_StabilisationSocket_C::PreviousLocation' has a wrong offset!");
static_assert(offsetof(ABP_StabilisationSocket_C, Velocity) == 0x0002C8, "Member 'ABP_StabilisationSocket_C::Velocity' has a wrong offset!");
static_assert(offsetof(ABP_StabilisationSocket_C, Calculate) == 0x0002E0, "Member 'ABP_StabilisationSocket_C::Calculate' has a wrong offset!");

}

