#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SelfPlacingBlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SelfPlacingBlock.BP_SelfPlacingBlock_C.BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_380A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_SelfPlacingBlock.BP_SelfPlacingBlock_C.BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SelfPlacingBlock_C_BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_SelfPlacingBlock.BP_SelfPlacingBlock_C.ExecuteUbergraph_BP_SelfPlacingBlock
// 0x0600 (0x0600 - 0x0000)
struct BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_380B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APC_Game_C*                             K2Node_DynamicCast_AsPC_Game;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_380C[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_380D[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_380E[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0050(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDetectableByPlacingBlocks_ReturnValue; // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_380F[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3810[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0178(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3811[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x02A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       CallFunc_SetMaterials_MaterialInstances;           // 0x0390(0x0010)(ReferenceParm)
	TArray<class UMaterialInstanceDynamic*>       CallFunc_SetMaterials_MaterialInstances_1;         // 0x03A0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3812[0x3];                                     // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3813[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0418(0x0010)(ReferenceParm)
	uint8                                         Pad_3814[0x8];                                     // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0430(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3815[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_WeldSparks_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3816[0x7];                                     // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x04F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_UpdatePlacerMatOpacity_Value_ImplicitCast; // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock) == 0x000010, "Wrong alignment on BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock");
static_assert(sizeof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock) == 0x000600, "Wrong size on BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, EntryPoint) == 0x000000, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_DynamicCast_AsPC_Game) == 0x000010, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_DynamicCast_AsPC_Game' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000030, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000038, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000040, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000048, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_bFromSweep) == 0x00004C, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_SweepResult) == 0x000050, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_DynamicCast_AsBPI_Character) == 0x000138, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_GetIsDetectableByPlacingBlocks_ReturnValue) == 0x000149, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_GetIsDetectableByPlacingBlocks_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000158, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_OtherActor) == 0x000160, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_OtherComp) == 0x000168, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000170, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000178, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00018C, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000190, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_RLerp_ReturnValue) == 0x0001A8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001C0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x0002A8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_SetMaterials_MaterialInstances) == 0x000390, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_SetMaterials_MaterialInstances' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_SetMaterials_MaterialInstances_1) == 0x0003A0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_SetMaterials_MaterialInstances_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, Temp_int_Loop_Counter_Variable) == 0x0003B0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Add_IntInt_ReturnValue) == 0x0003B4, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Array_Get_Item) == 0x0003B8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Array_Length_ReturnValue_1) == 0x0003C0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Less_IntInt_ReturnValue) == 0x0003C4, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_GetComponentBounds_Origin) == 0x0003C8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_GetComponentBounds_BoxExtent) == 0x0003E0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_GetComponentBounds_SphereRadius) == 0x0003F8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Add_VectorVector_ReturnValue) == 0x000400, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000418, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_MakeTransform_ReturnValue) == 0x000430, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Array_Length_ReturnValue_2) == 0x000490, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000498, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_FinishSpawningActor_ReturnValue) == 0x0004A0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0004A8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004B0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0004C8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_VLerp_ReturnValue) == 0x0004E0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0004F8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_UpdatePlacerMatOpacity_Value_ImplicitCast) == 0x0005E0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_UpdatePlacerMatOpacity_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0005E8, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0005F0, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x0005F4, "Member 'BP_SelfPlacingBlock_C_ExecuteUbergraph_BP_SelfPlacingBlock::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_SelfPlacingBlock.BP_SelfPlacingBlock_C.RandomRotAxis
// 0x0028 (0x0028 - 0x0000)
struct BP_SelfPlacingBlock_C_RandomRotAxis final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3817[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfPlacingBlock_C_RandomRotAxis) == 0x000008, "Wrong alignment on BP_SelfPlacingBlock_C_RandomRotAxis");
static_assert(sizeof(BP_SelfPlacingBlock_C_RandomRotAxis) == 0x000028, "Wrong size on BP_SelfPlacingBlock_C_RandomRotAxis");
static_assert(offsetof(BP_SelfPlacingBlock_C_RandomRotAxis, ReturnValue) == 0x000000, "Member 'BP_SelfPlacingBlock_C_RandomRotAxis::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_RandomRotAxis, CallFunc_RandomBool_ReturnValue) == 0x000008, "Member 'BP_SelfPlacingBlock_C_RandomRotAxis::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_RandomRotAxis, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'BP_SelfPlacingBlock_C_RandomRotAxis::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_RandomRotAxis, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_SelfPlacingBlock_C_RandomRotAxis::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_RandomRotAxis, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'BP_SelfPlacingBlock_C_RandomRotAxis::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function BP_SelfPlacingBlock.BP_SelfPlacingBlock_C.ResetMaterials
// 0x0038 (0x0038 - 0x0000)
struct BP_SelfPlacingBlock_C_ResetMaterials final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3818[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3819[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfPlacingBlock_C_ResetMaterials) == 0x000008, "Wrong alignment on BP_SelfPlacingBlock_C_ResetMaterials");
static_assert(sizeof(BP_SelfPlacingBlock_C_ResetMaterials) == 0x000038, "Wrong size on BP_SelfPlacingBlock_C_ResetMaterials");
static_assert(offsetof(BP_SelfPlacingBlock_C_ResetMaterials, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SelfPlacingBlock_C_ResetMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ResetMaterials, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SelfPlacingBlock_C_ResetMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ResetMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SelfPlacingBlock_C_ResetMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ResetMaterials, CallFunc_GetMaterials_ReturnValue) == 0x000010, "Member 'BP_SelfPlacingBlock_C_ResetMaterials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ResetMaterials, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_SelfPlacingBlock_C_ResetMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ResetMaterials, CallFunc_GetMaterial_ReturnValue) == 0x000028, "Member 'BP_SelfPlacingBlock_C_ResetMaterials::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_ResetMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_SelfPlacingBlock_C_ResetMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SelfPlacingBlock.BP_SelfPlacingBlock_C.SetMaterials
// 0x0060 (0x0060 - 0x0000)
struct BP_SelfPlacingBlock_C_SetMaterials final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MaterialInstances;                                 // 0x0008(0x0010)(Parm, OutParm)
	TArray<class UMaterialInstanceDynamic*>       Arr;                                               // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381A[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfPlacingBlock_C_SetMaterials) == 0x000008, "Wrong alignment on BP_SelfPlacingBlock_C_SetMaterials");
static_assert(sizeof(BP_SelfPlacingBlock_C_SetMaterials) == 0x000060, "Wrong size on BP_SelfPlacingBlock_C_SetMaterials");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, Material) == 0x000000, "Member 'BP_SelfPlacingBlock_C_SetMaterials::Material' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, MaterialInstances) == 0x000008, "Member 'BP_SelfPlacingBlock_C_SetMaterials::MaterialInstances' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, Arr) == 0x000018, "Member 'BP_SelfPlacingBlock_C_SetMaterials::Arr' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_SelfPlacingBlock_C_SetMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_SelfPlacingBlock_C_SetMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_SelfPlacingBlock_C_SetMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_SelfPlacingBlock_C_SetMaterials::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, CallFunc_GetMaterials_ReturnValue) == 0x000040, "Member 'BP_SelfPlacingBlock_C_SetMaterials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'BP_SelfPlacingBlock_C_SetMaterials::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_SelfPlacingBlock_C_SetMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_SetMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_SelfPlacingBlock_C_SetMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SelfPlacingBlock.BP_SelfPlacingBlock_C.UpdatePlacerMatOpacity
// 0x0028 (0x0028 - 0x0000)
struct BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381B[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity) == 0x000008, "Wrong alignment on BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity");
static_assert(sizeof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity) == 0x000028, "Wrong size on BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity");
static_assert(offsetof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity, Value) == 0x000000, "Member 'BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity::Value' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000024, "Member 'BP_SelfPlacingBlock_C_UpdatePlacerMatOpacity::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_SelfPlacingBlock.BP_SelfPlacingBlock_C.UserConstructionScript
// 0x0540 (0x0540 - 0x0000)
struct BP_SelfPlacingBlock_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0118(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_RandomRotAxis_ReturnValue;                // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0238(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomRotAxis_ReturnValue_1;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_2;     // 0x0360(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0448(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfPlacingBlock_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SelfPlacingBlock_C_UserConstructionScript");
static_assert(sizeof(BP_SelfPlacingBlock_C_UserConstructionScript) == 0x000540, "Wrong size on BP_SelfPlacingBlock_C_UserConstructionScript");
static_assert(offsetof(BP_SelfPlacingBlock_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'BP_SelfPlacingBlock_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfPlacingBlock_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_SelfPlacingBlock_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
