#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StatuesPlatform

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StatuesPlatform.BP_StatuesPlatform_C
// 0x0040 (0x02D8 - 0x0298)
class ABP_StatuesPlatform_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ParadisePlatformMiddle;                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_84C87A664E8AF10835BFFDB5D99745A5; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_84C87A664E8AF10835BFFDB5D99745A5; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B13[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Up;                                                // 0x02C8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B14[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LongueVue;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StatuesPlatform(int32 EntryPoint);
	void IsActivated(bool* Activated);
	void OnRep_Up();
	void OnUp();
	void Pushed();
	void ReceiveBeginPlay();
	void Released();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StatuesPlatform_C">();
	}
	static class ABP_StatuesPlatform_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StatuesPlatform_C>();
	}
};
static_assert(alignof(ABP_StatuesPlatform_C) == 0x000008, "Wrong alignment on ABP_StatuesPlatform_C");
static_assert(sizeof(ABP_StatuesPlatform_C) == 0x0002D8, "Wrong size on ABP_StatuesPlatform_C");
static_assert(offsetof(ABP_StatuesPlatform_C, UberGraphFrame) == 0x000298, "Member 'ABP_StatuesPlatform_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StatuesPlatform_C, C_TickOptimizer) == 0x0002A0, "Member 'ABP_StatuesPlatform_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_StatuesPlatform_C, ParadisePlatformMiddle) == 0x0002A8, "Member 'ABP_StatuesPlatform_C::ParadisePlatformMiddle' has a wrong offset!");
static_assert(offsetof(ABP_StatuesPlatform_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_StatuesPlatform_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_StatuesPlatform_C, Timeline_0_NewTrack_0_84C87A664E8AF10835BFFDB5D99745A5) == 0x0002B8, "Member 'ABP_StatuesPlatform_C::Timeline_0_NewTrack_0_84C87A664E8AF10835BFFDB5D99745A5' has a wrong offset!");
static_assert(offsetof(ABP_StatuesPlatform_C, Timeline_0__Direction_84C87A664E8AF10835BFFDB5D99745A5) == 0x0002BC, "Member 'ABP_StatuesPlatform_C::Timeline_0__Direction_84C87A664E8AF10835BFFDB5D99745A5' has a wrong offset!");
static_assert(offsetof(ABP_StatuesPlatform_C, Timeline_0) == 0x0002C0, "Member 'ABP_StatuesPlatform_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_StatuesPlatform_C, Up) == 0x0002C8, "Member 'ABP_StatuesPlatform_C::Up' has a wrong offset!");
static_assert(offsetof(ABP_StatuesPlatform_C, LongueVue) == 0x0002D0, "Member 'ABP_StatuesPlatform_C::LongueVue' has a wrong offset!");

}

