#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShrinkingCube

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ShrinkingCube.BP_ShrinkingCube_C.ExecuteUbergraph_BP_ShrinkingCube
// 0x0198 (0x0198 - 0x0000)
struct BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1B[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1C[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube) == 0x000008, "Wrong alignment on BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube");
static_assert(sizeof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube) == 0x000198, "Wrong size on BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, EntryPoint) == 0x000000, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_GetPlaybackPosition_ReturnValue) == 0x000028, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_BreakVector_Z) == 0x000040, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_GetSocketLocation_ReturnValue) == 0x000070, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000A0, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000188, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube, CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast) == 0x000190, "Member 'BP_ShrinkingCube_C_ExecuteUbergraph_BP_ShrinkingCube::CallFunc_SetPlaybackPosition_NewPosition_ImplicitCast' has a wrong offset!");

// Function BP_ShrinkingCube.BP_ShrinkingCube_C.OnRep_RepPosition
// 0x0001 (0x0001 - 0x0000)
struct BP_ShrinkingCube_C_OnRep_RepPosition final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkingCube_C_OnRep_RepPosition) == 0x000001, "Wrong alignment on BP_ShrinkingCube_C_OnRep_RepPosition");
static_assert(sizeof(BP_ShrinkingCube_C_OnRep_RepPosition) == 0x000001, "Wrong size on BP_ShrinkingCube_C_OnRep_RepPosition");
static_assert(offsetof(BP_ShrinkingCube_C_OnRep_RepPosition, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_ShrinkingCube_C_OnRep_RepPosition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_ShrinkingCube.BP_ShrinkingCube_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ShrinkingCube_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkingCube_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ShrinkingCube_C_ReceiveTick");
static_assert(sizeof(BP_ShrinkingCube_C_ReceiveTick) == 0x000004, "Wrong size on BP_ShrinkingCube_C_ReceiveTick");
static_assert(offsetof(BP_ShrinkingCube_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ShrinkingCube_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ShrinkingCube.BP_ShrinkingCube_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_ShrinkingCube_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkingCube_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ShrinkingCube_C_UserConstructionScript");
static_assert(sizeof(BP_ShrinkingCube_C_UserConstructionScript) == 0x000018, "Wrong size on BP_ShrinkingCube_C_UserConstructionScript");
static_assert(offsetof(BP_ShrinkingCube_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'BP_ShrinkingCube_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

