#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SPB_AutoPlacer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SPB_AutoPlacer.BP_SPB_AutoPlacer_C.BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34EC[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_SPB_AutoPlacer.BP_SPB_AutoPlacer_C.BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SPB_AutoPlacer_C_BndEvt__BP_SPB_AutoPlacer_Sphere1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_SPB_AutoPlacer.BP_SPB_AutoPlacer_C.ExecuteUbergraph_BP_SPB_AutoPlacer
// 0x0490 (0x0490 - 0x0000)
struct BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayers_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34ED[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34EE[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34EF[0x8];                                     // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F0[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F1[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x01F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F2[0x3];                                     // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0300(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F3[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_SpawningBlock_C*                    K2Node_DynamicCast_AsBP_Spawning_Block;            // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F4[0x7];                                     // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F5[0x7];                                     // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SpawningBlock_C*                    K2Node_DynamicCast_AsBP_Spawning_Block_1;          // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F6[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0448(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SpawningBlock_C*                    K2Node_DynamicCast_AsBP_Spawning_Block_2;          // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F7[0x3];                                     // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F8[0x7];                                     // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTransformAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer) == 0x000010, "Wrong alignment on BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer");
static_assert(sizeof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer) == 0x000490, "Wrong size on BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, EntryPoint) == 0x000000, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_GetNumPlayers_ReturnValue) == 0x000004, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_GetNumPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_HasAuthority_ReturnValue) == 0x00001C, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_HasAuthority_ReturnValue_1) == 0x00001D, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_HasAuthority_ReturnValue_2) == 0x00001E, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_GetSplineLength_ReturnValue) == 0x000020, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x000040, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_MapRangeClamped_ReturnValue) == 0x0000A0, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000A8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000190, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_Event_DeltaSeconds) == 0x000198, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001A0, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001A8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C0, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Vector_Distance_ReturnValue) == 0x0001D8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001E0, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0001E8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_K2_SetWorldTransform_SweepHitResult_1) == 0x0001F8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_K2_SetWorldTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0002E0, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0002E8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0002F0, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0002F8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_bFromSweep) == 0x0002FC, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_SweepResult) == 0x000300, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0003E8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_OtherActor) == 0x0003F0, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_OtherComp) == 0x0003F8, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000400, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_GetDisplayName_ReturnValue) == 0x000408, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_DynamicCast_AsBP_Spawning_Block) == 0x000418, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_DynamicCast_AsBP_Spawning_Block' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_DynamicCast_bSuccess) == 0x000420, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_DynamicCast_AsPawn) == 0x000428, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_DynamicCast_bSuccess_1) == 0x000430, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_DynamicCast_AsBP_Spawning_Block_1) == 0x000438, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_DynamicCast_AsBP_Spawning_Block_1' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_DynamicCast_bSuccess_2) == 0x000440, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000448, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Array_Get_Item) == 0x000458, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_DynamicCast_AsBP_Spawning_Block_2) == 0x000460, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_DynamicCast_AsBP_Spawning_Block_2' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, K2Node_DynamicCast_bSuccess_3) == 0x000468, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Array_Length_ReturnValue) == 0x00046C, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Less_IntInt_ReturnValue) == 0x000470, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000478, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000480, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_GetTransformAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000488, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_GetTransformAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x00048C, "Member 'BP_SPB_AutoPlacer_C_ExecuteUbergraph_BP_SPB_AutoPlacer::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_SPB_AutoPlacer.BP_SPB_AutoPlacer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SPB_AutoPlacer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SPB_AutoPlacer_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SPB_AutoPlacer_C_ReceiveTick");
static_assert(sizeof(BP_SPB_AutoPlacer_C_ReceiveTick) == 0x000004, "Wrong size on BP_SPB_AutoPlacer_C_ReceiveTick");
static_assert(offsetof(BP_SPB_AutoPlacer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SPB_AutoPlacer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SPB_AutoPlacer.BP_SPB_AutoPlacer_C.UserConstructionScript
// 0x01B0 (0x01B0 - 0x0000)
struct BP_SPB_AutoPlacer_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SPB_AutoPlacer_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_SPB_AutoPlacer_C_UserConstructionScript");
static_assert(sizeof(BP_SPB_AutoPlacer_C_UserConstructionScript) == 0x0001B0, "Wrong size on BP_SPB_AutoPlacer_C_UserConstructionScript");
static_assert(offsetof(BP_SPB_AutoPlacer_C_UserConstructionScript, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x000000, "Member 'BP_SPB_AutoPlacer_C_UserConstructionScript::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SPB_AutoPlacer_C_UserConstructionScript, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000060, "Member 'BP_SPB_AutoPlacer_C_UserConstructionScript::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
