#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SelfPlacingBlock

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SelfPlacingBlock.BP_SelfPlacingBlock_C
// 0x00C8 (0x0360 - 0x0298)
class ABP_SelfPlacingBlock_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_4D6212A6427BFFC6D8E763A1972CF9F8; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_4D6212A6427BFFC6D8E763A1972CF9F8; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3805[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_E4AFD8CF4C02B06668BC52949704C01C; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_E4AFD8CF4C02B06668BC52949704C01C; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3806[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn)
	double                                        Time;                                              // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Preview;                                           // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3807[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Distance;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Place;                                             // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3808[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InitialRotation;                                   // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UMaterialInstanceDynamic*>       Material_Instances;                                // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       PlacerMats;                                        // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PreviousOverlapedActors;                           // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanDetectPawns;                                    // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3809[0x3];                                     // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitLocation;                                      // 0x0348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_SelfPlacingBlock_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_SelfPlacingBlock(int32 EntryPoint);
	void GlowDown();
	void PlaceBlock();
	double RandomRotAxis();
	void ReceiveBeginPlay();
	void ResetMaterials();
	void SetMaterials(class UMaterialInterface* Material, TArray<class UMaterialInstanceDynamic*>* MaterialInstances);
	void StopGlow();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void UnplaceBlock();
	void UpdatePlacerMatOpacity(double Value);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SelfPlacingBlock_C">();
	}
	static class ABP_SelfPlacingBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SelfPlacingBlock_C>();
	}
};
static_assert(alignof(ABP_SelfPlacingBlock_C) == 0x000008, "Wrong alignment on ABP_SelfPlacingBlock_C");
static_assert(sizeof(ABP_SelfPlacingBlock_C) == 0x000360, "Wrong size on ABP_SelfPlacingBlock_C");
static_assert(offsetof(ABP_SelfPlacingBlock_C, UberGraphFrame) == 0x000298, "Member 'ABP_SelfPlacingBlock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Cube) == 0x0002A0, "Member 'ABP_SelfPlacingBlock_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Scene) == 0x0002A8, "Member 'ABP_SelfPlacingBlock_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Box) == 0x0002B0, "Member 'ABP_SelfPlacingBlock_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_SelfPlacingBlock_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Timeline_1_NewTrack_0_4D6212A6427BFFC6D8E763A1972CF9F8) == 0x0002C0, "Member 'ABP_SelfPlacingBlock_C::Timeline_1_NewTrack_0_4D6212A6427BFFC6D8E763A1972CF9F8' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Timeline_1__Direction_4D6212A6427BFFC6D8E763A1972CF9F8) == 0x0002C4, "Member 'ABP_SelfPlacingBlock_C::Timeline_1__Direction_4D6212A6427BFFC6D8E763A1972CF9F8' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Timeline_1) == 0x0002C8, "Member 'ABP_SelfPlacingBlock_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Timeline_0_NewTrack_0_E4AFD8CF4C02B06668BC52949704C01C) == 0x0002D0, "Member 'ABP_SelfPlacingBlock_C::Timeline_0_NewTrack_0_E4AFD8CF4C02B06668BC52949704C01C' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Timeline_0__Direction_E4AFD8CF4C02B06668BC52949704C01C) == 0x0002D4, "Member 'ABP_SelfPlacingBlock_C::Timeline_0__Direction_E4AFD8CF4C02B06668BC52949704C01C' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Timeline_0) == 0x0002D8, "Member 'ABP_SelfPlacingBlock_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Stream) == 0x0002E0, "Member 'ABP_SelfPlacingBlock_C::Stream' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Time) == 0x0002E8, "Member 'ABP_SelfPlacingBlock_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Preview) == 0x0002F0, "Member 'ABP_SelfPlacingBlock_C::Preview' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Distance) == 0x0002F8, "Member 'ABP_SelfPlacingBlock_C::Distance' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Place) == 0x000300, "Member 'ABP_SelfPlacingBlock_C::Place' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, InitialRotation) == 0x000308, "Member 'ABP_SelfPlacingBlock_C::InitialRotation' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, Material_Instances) == 0x000320, "Member 'ABP_SelfPlacingBlock_C::Material_Instances' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, PlacerMats) == 0x000330, "Member 'ABP_SelfPlacingBlock_C::PlacerMats' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, PreviousOverlapedActors) == 0x000340, "Member 'ABP_SelfPlacingBlock_C::PreviousOverlapedActors' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, CanDetectPawns) == 0x000344, "Member 'ABP_SelfPlacingBlock_C::CanDetectPawns' has a wrong offset!");
static_assert(offsetof(ABP_SelfPlacingBlock_C, InitLocation) == 0x000348, "Member 'ABP_SelfPlacingBlock_C::InitLocation' has a wrong offset!");

}

