#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineFence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineFence.BP_SplineFence_C.BuildFence
// 0x0670 (0x0670 - 0x0000)
struct BP_SplineFence_C_BuildFence final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375F[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3760[0xC];                                     // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0090(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_1;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3761[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3762[0x5];                                     // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_2;                            // 0x0120(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_2;               // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3763[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Array_Get_Item_2;                         // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3764[0x2];                                     // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Array_Get_Item_3;                         // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3765[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3766[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3767[0x8];                                     // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0400(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0460(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue;        // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue_1;      // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3768[0x8];                                     // 0x04C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x04D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue_2;      // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3769[0x4];                                     // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue_3;      // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376A[0x4];                                     // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0598(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376B[0x8];                                     // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x05D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376C[0x3];                                     // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue_4;      // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376D[0x3];                                     // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast;      // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376E[0x4];                                     // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_1;          // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_2;          // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineFence_C_BuildFence) == 0x000010, "Wrong alignment on BP_SplineFence_C_BuildFence");
static_assert(sizeof(BP_SplineFence_C_BuildFence) == 0x000670, "Wrong size on BP_SplineFence_C_BuildFence");
static_assert(offsetof(BP_SplineFence_C_BuildFence, Temp_int_Variable) == 0x000000, "Member 'BP_SplineFence_C_BuildFence::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, Temp_struct_Variable) == 0x000010, "Member 'BP_SplineFence_C_BuildFence::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_AddComponent_ReturnValue) == 0x000078, "Member 'BP_SplineFence_C_BuildFence::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_IntInt_ReturnValue_2) == 0x000080, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, Temp_struct_Variable_1) == 0x000090, "Member 'BP_SplineFence_C_BuildFence::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_AddComponent_ReturnValue_1) == 0x0000F0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_IntInt_ReturnValue_3) == 0x000100, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_IsValid_ReturnValue) == 0x000104, "Member 'BP_SplineFence_C_BuildFence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeRandomStream_ReturnValue) == 0x000108, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000110, "Member 'BP_SplineFence_C_BuildFence::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Percent_IntInt_ReturnValue) == 0x000114, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_SetStaticMesh_ReturnValue) == 0x000118, "Member 'BP_SplineFence_C_BuildFence::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000119, "Member 'BP_SplineFence_C_BuildFence::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_IsValid_ReturnValue_1) == 0x00011A, "Member 'BP_SplineFence_C_BuildFence::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, Temp_struct_Variable_2) == 0x000120, "Member 'BP_SplineFence_C_BuildFence::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Array_Get_Item) == 0x000180, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_AddComponent_ReturnValue_2) == 0x000198, "Member 'BP_SplineFence_C_BuildFence::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Array_Get_Item_1) == 0x0001A0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0001B8, "Member 'BP_SplineFence_C_BuildFence::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Array_Get_Item_2) == 0x0001C0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Array_LastIndex_ReturnValue) == 0x0001D8, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Roll) == 0x0001DC, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Pitch) == 0x0001E0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Yaw) == 0x0001E4, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001E8, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0001EC, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001ED, "Member 'BP_SplineFence_C_BuildFence::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_GetUpVector_ReturnValue) == 0x0001F0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Array_Get_Item_3) == 0x000208, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000220, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_GetUpVector_ReturnValue_1) == 0x000238, "Member 'BP_SplineFence_C_BuildFence::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_VectorVector_ReturnValue) == 0x000250, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000268, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000280, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000298, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0002B0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_FindLookAtRotation_ReturnValue) == 0x0002C8, "Member 'BP_SplineFence_C_BuildFence::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x0002E0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Roll_1) == 0x0002F8, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Pitch_1) == 0x0002FC, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Yaw_1) == 0x000300, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000308, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000320, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000328, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeRotator_ReturnValue) == 0x000340, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeRotFromZ_ReturnValue) == 0x000358, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Vector_Distance_ReturnValue) == 0x000370, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Roll_2) == 0x000378, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Pitch_2) == 0x00037C, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_BreakRotator_Yaw_2) == 0x000380, "Member 'BP_SplineFence_C_BuildFence::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000388, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000390, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeVector_ReturnValue) == 0x000398, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeRotator_ReturnValue_1) == 0x0003B0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeRotator_ReturnValue_2) == 0x0003C8, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_ComposeRotators_ReturnValue) == 0x0003E0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeTransform_ReturnValue) == 0x000400, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeTransform_ReturnValue_1) == 0x000460, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_AddInstanceWorldSpace_ReturnValue) == 0x0004C0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_AddInstanceWorldSpace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_AddInstanceWorldSpace_ReturnValue_1) == 0x0004C4, "Member 'BP_SplineFence_C_BuildFence::CallFunc_AddInstanceWorldSpace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeTransform_ReturnValue_2) == 0x0004D0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x000530, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_AddInstanceWorldSpace_ReturnValue_2) == 0x000548, "Member 'BP_SplineFence_C_BuildFence::CallFunc_AddInstanceWorldSpace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000550, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_AddInstanceWorldSpace_ReturnValue_3) == 0x000568, "Member 'BP_SplineFence_C_BuildFence::CallFunc_AddInstanceWorldSpace_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Vector_Distance_ReturnValue_1) == 0x000570, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000578, "Member 'BP_SplineFence_C_BuildFence::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000590, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_ComposeRotators_ReturnValue_1) == 0x000598, "Member 'BP_SplineFence_C_BuildFence::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeVector_ReturnValue_1) == 0x0005B0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeTransform_ReturnValue_3) == 0x0005D0, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000630, "Member 'BP_SplineFence_C_BuildFence::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_AddInstanceWorldSpace_ReturnValue_4) == 0x000634, "Member 'BP_SplineFence_C_BuildFence::CallFunc_AddInstanceWorldSpace_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_IsValid_ReturnValue_2) == 0x000638, "Member 'BP_SplineFence_C_BuildFence::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x00063C, "Member 'BP_SplineFence_C_BuildFence::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_VectorFloat_B_ImplicitCast) == 0x000640, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_VectorFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000648, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000650, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000658, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000660, "Member 'BP_SplineFence_C_BuildFence::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeRotator_Roll_ImplicitCast_1) == 0x000668, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeRotator_Roll_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_BuildFence, CallFunc_MakeRotator_Roll_ImplicitCast_2) == 0x00066C, "Member 'BP_SplineFence_C_BuildFence::CallFunc_MakeRotator_Roll_ImplicitCast_2' has a wrong offset!");

// Function BP_SplineFence.BP_SplineFence_C.CalculatePolesAndRibsTransforms
// 0x00D0 (0x00D0 - 0x0000)
struct BP_SplineFence_C_CalculatePolesAndRibsTransforms final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x000C(0x0008)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376F[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3770[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue; // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3771[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_RotatorFloat_B_ImplicitCast;     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineFence_C_CalculatePolesAndRibsTransforms) == 0x000008, "Wrong alignment on BP_SplineFence_C_CalculatePolesAndRibsTransforms");
static_assert(sizeof(BP_SplineFence_C_CalculatePolesAndRibsTransforms) == 0x0000D0, "Wrong size on BP_SplineFence_C_CalculatePolesAndRibsTransforms");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, Temp_int_Variable) == 0x000000, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Add_IntInt_ReturnValue_1) == 0x000008, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_MakeRandomStream_ReturnValue) == 0x00000C, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000014, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x000018, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x00001C, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x000040, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000060, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000068, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue) == 0x000080, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_ComposeRotators_ReturnValue) == 0x0000A0, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Array_Add_ReturnValue_1) == 0x0000B8, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Array_Add_ReturnValue_2) == 0x0000BC, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Array_Add_ReturnValue_3) == 0x0000C0, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_Multiply_RotatorFloat_B_ImplicitCast) == 0x0000C4, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_Multiply_RotatorFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0000C8, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_CalculatePolesAndRibsTransforms, CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0000CC, "Member 'BP_SplineFence_C_CalculatePolesAndRibsTransforms::CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function BP_SplineFence.BP_SplineFence_C.UserConstructionScript
// 0x0070 (0x0070 - 0x0000)
struct BP_SplineFence_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3772[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x0010(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3773[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineFence_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SplineFence_C_UserConstructionScript");
static_assert(sizeof(BP_SplineFence_C_UserConstructionScript) == 0x000070, "Wrong size on BP_SplineFence_C_UserConstructionScript");
static_assert(offsetof(BP_SplineFence_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue) == 0x000000, "Member 'BP_SplineFence_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineFence_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_SplineFence_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
