#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpawningBlock

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SpawningBlock.BP_SpawningBlock_C.ExecuteUbergraph_BP_SpawningBlock
// 0x0070 (0x0070 - 0x0000)
struct BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CF4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock) == 0x000008, "Wrong alignment on BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock");
static_assert(sizeof(BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock) == 0x000070, "Wrong size on BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock");
static_assert(offsetof(BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock, EntryPoint) == 0x000000, "Member 'BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000020, "Member 'BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000028, "Member 'BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000040, "Member 'BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock, CallFunc_VLerp_ReturnValue) == 0x000058, "Member 'BP_SpawningBlock_C_ExecuteUbergraph_BP_SpawningBlock::CallFunc_VLerp_ReturnValue' has a wrong offset!");

}

