#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShrinkinPlatform

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShrinkinPlatform.BP_ShrinkinPlatform_C
// 0x0060 (0x02F8 - 0x0298)
class ABP_ShrinkinPlatform_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoxScale;                                          // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        New_Rate;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Scale;                                             // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ShrinkinPlatform(int32 EntryPoint);
	bool IsSomeoneOnIt(bool* Mantling);
	void ReceiveTick(float DeltaSeconds);
	void UpdateCollision();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShrinkinPlatform_C">();
	}
	static class ABP_ShrinkinPlatform_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShrinkinPlatform_C>();
	}
};
static_assert(alignof(ABP_ShrinkinPlatform_C) == 0x000008, "Wrong alignment on ABP_ShrinkinPlatform_C");
static_assert(sizeof(ABP_ShrinkinPlatform_C) == 0x0002F8, "Wrong size on ABP_ShrinkinPlatform_C");
static_assert(offsetof(ABP_ShrinkinPlatform_C, UberGraphFrame) == 0x000298, "Member 'ABP_ShrinkinPlatform_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ShrinkinPlatform_C, C_TickOptimizer) == 0x0002A0, "Member 'ABP_ShrinkinPlatform_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_ShrinkinPlatform_C, Box) == 0x0002A8, "Member 'ABP_ShrinkinPlatform_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ShrinkinPlatform_C, StaticMesh) == 0x0002B0, "Member 'ABP_ShrinkinPlatform_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ShrinkinPlatform_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_ShrinkinPlatform_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ShrinkinPlatform_C, BoxScale) == 0x0002C0, "Member 'ABP_ShrinkinPlatform_C::BoxScale' has a wrong offset!");
static_assert(offsetof(ABP_ShrinkinPlatform_C, New_Rate) == 0x0002D8, "Member 'ABP_ShrinkinPlatform_C::New_Rate' has a wrong offset!");
static_assert(offsetof(ABP_ShrinkinPlatform_C, Scale) == 0x0002E0, "Member 'ABP_ShrinkinPlatform_C::Scale' has a wrong offset!");

}

