#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SquarePlacer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SquarePlacer.BP_SquarePlacer_C.PlaceMesh
// 0x00B0 (0x00B0 - 0x0000)
struct BP_SquarePlacer_C_PlaceMesh final
{
public:
	double                                        RelativeTransform_Location_X;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Relative_Transform_Location_Y;                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Relative_Transform_Rotation;                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquarePlacer_C_PlaceMesh) == 0x000010, "Wrong alignment on BP_SquarePlacer_C_PlaceMesh");
static_assert(sizeof(BP_SquarePlacer_C_PlaceMesh) == 0x0000B0, "Wrong size on BP_SquarePlacer_C_PlaceMesh");
static_assert(offsetof(BP_SquarePlacer_C_PlaceMesh, RelativeTransform_Location_X) == 0x000000, "Member 'BP_SquarePlacer_C_PlaceMesh::RelativeTransform_Location_X' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_PlaceMesh, Relative_Transform_Location_Y) == 0x000008, "Member 'BP_SquarePlacer_C_PlaceMesh::Relative_Transform_Location_Y' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_PlaceMesh, Relative_Transform_Rotation) == 0x000010, "Member 'BP_SquarePlacer_C_PlaceMesh::Relative_Transform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_PlaceMesh, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_SquarePlacer_C_PlaceMesh::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_PlaceMesh, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_SquarePlacer_C_PlaceMesh::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_PlaceMesh, CallFunc_AddInstance_ReturnValue) == 0x0000A0, "Member 'BP_SquarePlacer_C_PlaceMesh::CallFunc_AddInstance_ReturnValue' has a wrong offset!");

// Function BP_SquarePlacer.BP_SquarePlacer_C.UserConstructionScript
// 0x00D8 (0x00D8 - 0x0000)
struct BP_SquarePlacer_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AC[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AD[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AE[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AF[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue_1;     // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_4;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B0[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_5;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B1[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquarePlacer_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SquarePlacer_C_UserConstructionScript");
static_assert(sizeof(BP_SquarePlacer_C_UserConstructionScript) == 0x0000D8, "Wrong size on BP_SquarePlacer_C_UserConstructionScript");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_SquarePlacer_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, Temp_int_Variable_1) == 0x000008, "Member 'BP_SquarePlacer_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000010, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000018, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, Temp_int_Variable_2) == 0x000038, "Member 'BP_SquarePlacer_C_UserConstructionScript::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000040, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000060, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000068, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_NormalizedDeltaRotator_ReturnValue_1) == 0x000078, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_NormalizedDeltaRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000090, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000098, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x0000A0, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_4) == 0x0000A8, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x0000B0, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, Temp_int_Variable_3) == 0x0000B8, "Member 'BP_SquarePlacer_C_UserConstructionScript::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_5) == 0x0000C0, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000CC, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000D0, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SquarePlacer_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0000D1, "Member 'BP_SquarePlacer_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");

}

