#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StabilisationSocket

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_StabilisationSocket.BP_StabilisationSocket_C.ExecuteUbergraph_BP_StabilisationSocket
// 0x00B0 (0x00B0 - 0x0000)
struct BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket) == 0x000008, "Wrong alignment on BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket");
static_assert(sizeof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket) == 0x0000B0, "Wrong size on BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, EntryPoint) == 0x000000, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000050, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, CallFunc_Divide_VectorVector_ReturnValue) == 0x000068, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000080, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, CallFunc_Conv_VectorToString_ReturnValue) == 0x000098, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x0000A8, "Member 'BP_StabilisationSocket_C_ExecuteUbergraph_BP_StabilisationSocket::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function BP_StabilisationSocket.BP_StabilisationSocket_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_StabilisationSocket_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StabilisationSocket_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_StabilisationSocket_C_ReceiveTick");
static_assert(sizeof(BP_StabilisationSocket_C_ReceiveTick) == 0x000004, "Wrong size on BP_StabilisationSocket_C_ReceiveTick");
static_assert(offsetof(BP_StabilisationSocket_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_StabilisationSocket_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

