#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkyTransition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SkyTransition.BP_SkyTransition_C.ExecuteUbergraph_BP_SkyTransition
// 0x0040 (0x0040 - 0x0000)
struct BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3866[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition) == 0x000008, "Wrong alignment on BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition");
static_assert(sizeof(BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition) == 0x000040, "Wrong size on BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition");
static_assert(offsetof(BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition, EntryPoint) == 0x000000, "Member 'BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition, CallFunc_BreakVector_X) == 0x000020, "Member 'BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition, CallFunc_BreakVector_Y) == 0x000028, "Member 'BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000038, "Member 'BP_SkyTransition_C_ExecuteUbergraph_BP_SkyTransition::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_SkyTransition.BP_SkyTransition_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_SkyTransition_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyTransition_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SkyTransition_C_UserConstructionScript");
static_assert(sizeof(BP_SkyTransition_C_UserConstructionScript) == 0x000038, "Wrong size on BP_SkyTransition_C_UserConstructionScript");
static_assert(offsetof(BP_SkyTransition_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_SkyTransition_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000018, "Member 'BP_SkyTransition_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000020, "Member 'BP_SkyTransition_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000028, "Member 'BP_SkyTransition_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SkyTransition_C_UserConstructionScript, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000030, "Member 'BP_SkyTransition_C_UserConstructionScript::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

}

