#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StraightRope

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StraightRope.BP_StraightRope_C
// 0x0020 (0x02B8 - 0x0298)
class ABP_StraightRope_C final : public AActor
{
public:
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3803[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Spacing;                                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StraightRope_C">();
	}
	static class ABP_StraightRope_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StraightRope_C>();
	}
};
static_assert(alignof(ABP_StraightRope_C) == 0x000008, "Wrong alignment on ABP_StraightRope_C");
static_assert(sizeof(ABP_StraightRope_C) == 0x0002B8, "Wrong size on ABP_StraightRope_C");
static_assert(offsetof(ABP_StraightRope_C, HierarchicalInstancedStaticMesh) == 0x000298, "Member 'ABP_StraightRope_C::HierarchicalInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_StraightRope_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_StraightRope_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_StraightRope_C, Quantity) == 0x0002A8, "Member 'ABP_StraightRope_C::Quantity' has a wrong offset!");
static_assert(offsetof(ABP_StraightRope_C, Spacing) == 0x0002B0, "Member 'ABP_StraightRope_C::Spacing' has a wrong offset!");

}

