#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShrinkinPlatform

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ShrinkinPlatform.BP_ShrinkinPlatform_C.ExecuteUbergraph_BP_ShrinkinPlatform
// 0x0108 (0x0108 - 0x0000)
struct BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3609[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360A[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomeoneOnIt_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomeoneOnIt_Mantling;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360B[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue_1;                  // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360C[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VInterpTo_InterpSpeed_ImplicitCast;       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_InterpSpeed_ImplicitCast_1;     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast;         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast_1;       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform) == 0x000008, "Wrong alignment on BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform");
static_assert(sizeof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform) == 0x000108, "Wrong size on BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, EntryPoint) == 0x000000, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed) == 0x000008, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, Temp_bool_Variable) == 0x000010, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, Temp_byte_Variable) == 0x000011, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, Temp_byte_Variable_1) == 0x000012, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000018, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_Z) == 0x000040, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_X_1) == 0x000048, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_Y_1) == 0x000050, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_Z_1) == 0x000058, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000060, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_IsSomeoneOnIt_ReturnValue) == 0x000080, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_IsSomeoneOnIt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_IsSomeoneOnIt_Mantling) == 0x000081, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_IsSomeoneOnIt_Mantling' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_SelectVector_ReturnValue) == 0x000088, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_VInterpTo_ReturnValue) == 0x0000A0, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0000B8, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_VInterpTo_ReturnValue_1) == 0x0000C0, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_VInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_X_2) == 0x0000D8, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_Y_2) == 0x0000E0, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_BreakVector_Z_2) == 0x0000E8, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, K2Node_Select_Default) == 0x0000F1, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_VInterpTo_InterpSpeed_ImplicitCast) == 0x0000F4, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_VInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_VInterpTo_InterpSpeed_ImplicitCast_1) == 0x0000F8, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_VInterpTo_InterpSpeed_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_VInterpTo_DeltaTime_ImplicitCast) == 0x0000FC, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_VInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform, CallFunc_VInterpTo_DeltaTime_ImplicitCast_1) == 0x000100, "Member 'BP_ShrinkinPlatform_C_ExecuteUbergraph_BP_ShrinkinPlatform::CallFunc_VInterpTo_DeltaTime_ImplicitCast_1' has a wrong offset!");

// Function BP_ShrinkinPlatform.BP_ShrinkinPlatform_C.IsSomeoneOnIt
// 0x0048 (0x0048 - 0x0000)
struct BP_ShrinkinPlatform_C_IsSomeoneOnIt final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mantling;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360D[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360F[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkinPlatform_C_IsSomeoneOnIt) == 0x000008, "Wrong alignment on BP_ShrinkinPlatform_C_IsSomeoneOnIt");
static_assert(sizeof(BP_ShrinkinPlatform_C_IsSomeoneOnIt) == 0x000048, "Wrong size on BP_ShrinkinPlatform_C_IsSomeoneOnIt");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, ReturnValue) == 0x000000, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, Mantling) == 0x000001, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::Mantling' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000010, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000020, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, K2Node_DynamicCast_AsBP_Character) == 0x000030, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_IsSomeoneOnIt, CallFunc_IsPlaying_ReturnValue) == 0x000041, "Member 'BP_ShrinkinPlatform_C_IsSomeoneOnIt::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function BP_ShrinkinPlatform.BP_ShrinkinPlatform_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ShrinkinPlatform_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkinPlatform_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ShrinkinPlatform_C_ReceiveTick");
static_assert(sizeof(BP_ShrinkinPlatform_C_ReceiveTick) == 0x000004, "Wrong size on BP_ShrinkinPlatform_C_ReceiveTick");
static_assert(offsetof(BP_ShrinkinPlatform_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ShrinkinPlatform_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ShrinkinPlatform.BP_ShrinkinPlatform_C.UpdateCollision
// 0x0048 (0x0048 - 0x0000)
struct BP_ShrinkinPlatform_C_UpdateCollision final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3610[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayers_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayers_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3611[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3612[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkinPlatform_C_UpdateCollision) == 0x000008, "Wrong alignment on BP_ShrinkinPlatform_C_UpdateCollision");
static_assert(sizeof(BP_ShrinkinPlatform_C_UpdateCollision) == 0x000048, "Wrong size on BP_ShrinkinPlatform_C_UpdateCollision");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, Temp_bool_Variable) == 0x000000, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, Temp_byte_Variable) == 0x000001, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, Temp_byte_Variable_1) == 0x000002, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, CallFunc_GetNumPlayers_ReturnValue) == 0x000004, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::CallFunc_GetNumPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, CallFunc_GetNumPlayers_ReturnValue_1) == 0x000008, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::CallFunc_GetNumPlayers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000D, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000020, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, CallFunc_VSize_ReturnValue) == 0x000038, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShrinkinPlatform_C_UpdateCollision, K2Node_Select_Default) == 0x000041, "Member 'BP_ShrinkinPlatform_C_UpdateCollision::K2Node_Select_Default' has a wrong offset!");

// Function BP_ShrinkinPlatform.BP_ShrinkinPlatform_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_ShrinkinPlatform_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShrinkinPlatform_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ShrinkinPlatform_C_UserConstructionScript");
static_assert(sizeof(BP_ShrinkinPlatform_C_UserConstructionScript) == 0x000018, "Wrong size on BP_ShrinkinPlatform_C_UserConstructionScript");
static_assert(offsetof(BP_ShrinkinPlatform_C_UserConstructionScript, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000000, "Member 'BP_ShrinkinPlatform_C_UserConstructionScript::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");

}

