#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_ThirdPersonCharacter_SF_Torch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "bp_ThirdPersonCharacter_SF_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C
// 0x0040 (0x07D0 - 0x0790)
class Abp_ThirdPersonCharacter_SF_Torch_C final : public Abp_ThirdPersonCharacter_SF_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_bp_ThirdPersonCharacter_SF_Torch_C; // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        S_Torch_01_01_LoopMono_Cue;                        // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FPP_Torch_Socket;                                  // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    TorchMinusLagMinusSimulation;                      // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      TorchFireEffect;                                   // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   TorchLight;                                        // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TPP_Torch;                                         // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TPP_Torch_Socket;                                  // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UThirdPerson_AnimBP_Torch_C*            AnimationInstance_Torch;                           // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch(int32 EntryPoint);
	void GrabTorch();
	void OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C(class FName NotifyName);
	void OnBlendOut_8589E5BA4EF38FA7A40132B209612096(class FName NotifyName);
	void OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C(class FName NotifyName);
	void OnCompleted_8589E5BA4EF38FA7A40132B209612096(class FName NotifyName);
	void OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C(class FName NotifyName);
	void OnInterrupted_8589E5BA4EF38FA7A40132B209612096(class FName NotifyName);
	void OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C(class FName NotifyName);
	void OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096(class FName NotifyName);
	void OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C(class FName NotifyName);
	void OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096(class FName NotifyName);
	void ReceiveBeginPlay();
	void ReleaseTorch();
	void SetTorchFireIgnited(bool IsIgnited);
	void SetTorchHoldingAnimation(bool IsHoldingTorch);
	void SetTorchVisibility(bool IsVisible);
	void ToggleFlashlight();
	void UpdateCameraType();
	void UpdateHandSway(double DeltaTime, double AzimuthSpeed, double InclinationSpeed, double DistanceSpeed, double Max_Distance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bp_ThirdPersonCharacter_SF_Torch_C">();
	}
	static class Abp_ThirdPersonCharacter_SF_Torch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abp_ThirdPersonCharacter_SF_Torch_C>();
	}
};
static_assert(alignof(Abp_ThirdPersonCharacter_SF_Torch_C) == 0x000010, "Wrong alignment on Abp_ThirdPersonCharacter_SF_Torch_C");
static_assert(sizeof(Abp_ThirdPersonCharacter_SF_Torch_C) == 0x0007D0, "Wrong size on Abp_ThirdPersonCharacter_SF_Torch_C");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, UberGraphFrame_bp_ThirdPersonCharacter_SF_Torch_C) == 0x000788, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::UberGraphFrame_bp_ThirdPersonCharacter_SF_Torch_C' has a wrong offset!");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, S_Torch_01_01_LoopMono_Cue) == 0x000790, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::S_Torch_01_01_LoopMono_Cue' has a wrong offset!");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, FPP_Torch_Socket) == 0x000798, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::FPP_Torch_Socket' has a wrong offset!");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, TorchMinusLagMinusSimulation) == 0x0007A0, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::TorchMinusLagMinusSimulation' has a wrong offset!");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, TorchFireEffect) == 0x0007A8, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::TorchFireEffect' has a wrong offset!");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, TorchLight) == 0x0007B0, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::TorchLight' has a wrong offset!");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, TPP_Torch) == 0x0007B8, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::TPP_Torch' has a wrong offset!");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, TPP_Torch_Socket) == 0x0007C0, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::TPP_Torch_Socket' has a wrong offset!");
static_assert(offsetof(Abp_ThirdPersonCharacter_SF_Torch_C, AnimationInstance_Torch) == 0x0007C8, "Member 'Abp_ThirdPersonCharacter_SF_Torch_C::AnimationInstance_Torch' has a wrong offset!");

}

