#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_ThirdPersonCharacter_SF_Torch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch
// 0x0168 (0x0168 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369D[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369E[0x5];                                     // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UThirdPerson_AnimBP_Torch_C*            K2Node_DynamicCast_AsThird_Person_Anim_BP_Torch;   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369F[0x1];                                     // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsIgnited;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A0[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHoldingTorch;                 // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A1[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_Select_Default;                             // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A2[0x2];                                     // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast_1; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch) == 0x000008, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch) == 0x000168, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, EntryPoint) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_8) == 0x000004, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_7) == 0x00001C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_6) == 0x000034, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_5) == 0x00004C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, Temp_name_Variable) == 0x000064, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00007C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00007D, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_4) == 0x000080, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_3) == 0x000088, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_5) == 0x000090, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_2) == 0x0000A0, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000A8, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_1) == 0x0000B8, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C0, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName) == 0x0000D0, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000D8, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, Temp_name_Variable_1) == 0x0000E8, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, Temp_bool_Variable) == 0x0000F0, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x0000F1, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x0000F2, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_GetAnimInstance_ReturnValue) == 0x0000F8, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_DynamicCast_AsThird_Person_Anim_BP_Torch) == 0x000100, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_DynamicCast_AsThird_Person_Anim_BP_Torch' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, Temp_bool_Variable_1) == 0x000109, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_Not_PreBool_ReturnValue) == 0x00010A, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CreateDelegate_OutputDelegate_9) == 0x00010C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_IsIgnited) == 0x00011C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_IsIgnited' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_SelectFloat_ReturnValue) == 0x000120, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000128, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000130, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000138, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_IsValid_ReturnValue_1) == 0x000141, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_IsVisible) == 0x000142, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_IsVisible' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_IsHoldingTorch) == 0x000143, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_IsHoldingTorch' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_CustomEvent_NotifyName_9) == 0x000144, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, K2Node_Select_Default) == 0x000150, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000158, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_IsValid_ReturnValue_2) == 0x000159, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast) == 0x00015C, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch, CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast_1) == 0x000160, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF_Torch::CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast_1' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_73F7A7F145308A0C6C59E8AEACA9706C::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnBlendOut_8589E5BA4EF38FA7A40132B209612096
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_8589E5BA4EF38FA7A40132B209612096 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_8589E5BA4EF38FA7A40132B209612096) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_8589E5BA4EF38FA7A40132B209612096");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_8589E5BA4EF38FA7A40132B209612096) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_8589E5BA4EF38FA7A40132B209612096");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_8589E5BA4EF38FA7A40132B209612096, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnBlendOut_8589E5BA4EF38FA7A40132B209612096::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_73F7A7F145308A0C6C59E8AEACA9706C::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnCompleted_8589E5BA4EF38FA7A40132B209612096
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_8589E5BA4EF38FA7A40132B209612096 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_8589E5BA4EF38FA7A40132B209612096) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_8589E5BA4EF38FA7A40132B209612096");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_8589E5BA4EF38FA7A40132B209612096) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_8589E5BA4EF38FA7A40132B209612096");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_8589E5BA4EF38FA7A40132B209612096, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnCompleted_8589E5BA4EF38FA7A40132B209612096::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_73F7A7F145308A0C6C59E8AEACA9706C::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnInterrupted_8589E5BA4EF38FA7A40132B209612096
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_8589E5BA4EF38FA7A40132B209612096 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_8589E5BA4EF38FA7A40132B209612096) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_8589E5BA4EF38FA7A40132B209612096");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_8589E5BA4EF38FA7A40132B209612096) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_8589E5BA4EF38FA7A40132B209612096");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_8589E5BA4EF38FA7A40132B209612096, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnInterrupted_8589E5BA4EF38FA7A40132B209612096::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_73F7A7F145308A0C6C59E8AEACA9706C::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyBegin_8589E5BA4EF38FA7A40132B209612096::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_73F7A7F145308A0C6C59E8AEACA9706C::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096
// 0x0008 (0x0008 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096) == 0x000004, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096) == 0x000008, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096, NotifyName) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_OnNotifyEnd_8589E5BA4EF38FA7A40132B209612096::NotifyName' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.SetTorchFireIgnited
// 0x0001 (0x0001 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_SetTorchFireIgnited final
{
public:
	bool                                          IsIgnited;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchFireIgnited) == 0x000001, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_SetTorchFireIgnited");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchFireIgnited) == 0x000001, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_SetTorchFireIgnited");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchFireIgnited, IsIgnited) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_SetTorchFireIgnited::IsIgnited' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.SetTorchHoldingAnimation
// 0x0001 (0x0001 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_SetTorchHoldingAnimation final
{
public:
	bool                                          IsHoldingTorch;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchHoldingAnimation) == 0x000001, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_SetTorchHoldingAnimation");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchHoldingAnimation) == 0x000001, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_SetTorchHoldingAnimation");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchHoldingAnimation, IsHoldingTorch) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_SetTorchHoldingAnimation::IsHoldingTorch' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.SetTorchVisibility
// 0x0001 (0x0001 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_SetTorchVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchVisibility) == 0x000001, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_SetTorchVisibility");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchVisibility) == 0x000001, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_SetTorchVisibility");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_SetTorchVisibility, IsVisible) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_SetTorchVisibility::IsVisible' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF_Torch.bp_ThirdPersonCharacter_SF_Torch_C.UpdateHandSway
// 0x0180 (0x0180 - 0x0000)
struct bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AzimuthSpeed;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InclinationSpeed;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceSpeed;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Distance;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A3[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A4[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GenerateSwayLocation_Location;            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0068(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_K2_MakePerlinNoiseAndRemap_RangeOutMax_ImplicitCast; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A5[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_MakePerlinNoiseAndRemap_Value_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A6[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GenerateSwayLocation_Distance_ImplicitCast; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway) == 0x000008, "Wrong alignment on bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway) == 0x000180, "Wrong size on bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway, DeltaTime) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway::DeltaTime' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway, AzimuthSpeed) == 0x000008, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway::AzimuthSpeed' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway, InclinationSpeed) == 0x000010, "Member 'bp_ThirdPersonCharacter_SF_Torch_C_UpdateHandSway::InclinationSpeed' has a wrong offset!");
