#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Train_ext_end_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Train_ext_end_01.BP_Train_ext_end_01_C
// 0x0040 (0x02D8 - 0x0298)
class ABP_Train_ext_end_01_C final : public AActor
{
public:
	class UPointLightComponent*                   PointLight4;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight3;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CCA;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ext_endwall_lights_01;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ext_endwall_01;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Train_ext_end_01_C">();
	}
	static class ABP_Train_ext_end_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Train_ext_end_01_C>();
	}
};
static_assert(alignof(ABP_Train_ext_end_01_C) == 0x000008, "Wrong alignment on ABP_Train_ext_end_01_C");
static_assert(sizeof(ABP_Train_ext_end_01_C) == 0x0002D8, "Wrong size on ABP_Train_ext_end_01_C");
static_assert(offsetof(ABP_Train_ext_end_01_C, PointLight4) == 0x000298, "Member 'ABP_Train_ext_end_01_C::PointLight4' has a wrong offset!");
static_assert(offsetof(ABP_Train_ext_end_01_C, PointLight3) == 0x0002A0, "Member 'ABP_Train_ext_end_01_C::PointLight3' has a wrong offset!");
static_assert(offsetof(ABP_Train_ext_end_01_C, PointLight1) == 0x0002A8, "Member 'ABP_Train_ext_end_01_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ABP_Train_ext_end_01_C, PointLight) == 0x0002B0, "Member 'ABP_Train_ext_end_01_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Train_ext_end_01_C, CCA) == 0x0002B8, "Member 'ABP_Train_ext_end_01_C::CCA' has a wrong offset!");
static_assert(offsetof(ABP_Train_ext_end_01_C, Ext_endwall_lights_01) == 0x0002C0, "Member 'ABP_Train_ext_end_01_C::Ext_endwall_lights_01' has a wrong offset!");
static_assert(offsetof(ABP_Train_ext_end_01_C, Ext_endwall_01) == 0x0002C8, "Member 'ABP_Train_ext_end_01_C::Ext_endwall_01' has a wrong offset!");
static_assert(offsetof(ABP_Train_ext_end_01_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_Train_ext_end_01_C::DefaultSceneRoot' has a wrong offset!");

}

