#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Thunder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Thunder.BP_Thunder_C
// 0x0090 (0x0328 - 0x0298)
class ABP_Thunder_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Target;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_B19729A742FE2A60A2863AAB1609C98A; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_B19729A742FE2A60A2863AAB1609C98A; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AFE[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                InitLoc;                                           // 0x02F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ThunderWall_C*                      LastThunderWall;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                TargetLoc;                                         // 0x0310(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Thunder_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Debris();
	void DestroyWallAll(class UObject* Param_Target);
	void ExecuteUbergraph_BP_Thunder(int32 EntryPoint);
	void IsActivated(bool* Activated);
	void MoveAll();
	void Pushed();
	void ReceiveBeginPlay();
	void Released();
	void RemoveThunderAll();
	void ResetMove();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Thunder_C">();
	}
	static class ABP_Thunder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Thunder_C>();
	}
};
static_assert(alignof(ABP_Thunder_C) == 0x000008, "Wrong alignment on ABP_Thunder_C");
static_assert(sizeof(ABP_Thunder_C) == 0x000328, "Wrong size on ABP_Thunder_C");
static_assert(offsetof(ABP_Thunder_C, UberGraphFrame) == 0x000298, "Member 'ABP_Thunder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SkeletalMesh) == 0x0002A0, "Member 'ABP_Thunder_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, StaticMesh1) == 0x0002A8, "Member 'ABP_Thunder_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Box) == 0x0002B0, "Member 'ABP_Thunder_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Arrow) == 0x0002B8, "Member 'ABP_Thunder_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Target) == 0x0002C0, "Member 'ABP_Thunder_C::Target' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, StaticMesh) == 0x0002C8, "Member 'ABP_Thunder_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_Thunder_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0_NewTrack_0_B19729A742FE2A60A2863AAB1609C98A) == 0x0002D8, "Member 'ABP_Thunder_C::Timeline_0_NewTrack_0_B19729A742FE2A60A2863AAB1609C98A' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0__Direction_B19729A742FE2A60A2863AAB1609C98A) == 0x0002DC, "Member 'ABP_Thunder_C::Timeline_0__Direction_B19729A742FE2A60A2863AAB1609C98A' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0) == 0x0002E0, "Member 'ABP_Thunder_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Duration) == 0x0002E8, "Member 'ABP_Thunder_C::Duration' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, InitLoc) == 0x0002F0, "Member 'ABP_Thunder_C::InitLoc' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, LastThunderWall) == 0x000308, "Member 'ABP_Thunder_C::LastThunderWall' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, TargetLoc) == 0x000310, "Member 'ABP_Thunder_C::TargetLoc' has a wrong offset!");

}

