#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowedBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThrowedBullet.BP_ThrowedBullet_C
// 0x0058 (0x02F0 - 0x0298)
class ABP_ThrowedBullet_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_CC9949FA42C9457E1D59719326629F65; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_CC9949FA42C9457E1D59719326629F65; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A7A[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DownSpeed;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Launcher;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CanDetect;                                         // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CollisionDetection();
	void DownTL();
	void ExecuteUbergraph_BP_ThrowedBullet(int32 EntryPoint);
	void HitMulti(class UObject* Target);
	void OnHit(class UObject* Target);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ThrowedBullet_C">();
	}
	static class ABP_ThrowedBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ThrowedBullet_C>();
	}
};
static_assert(alignof(ABP_ThrowedBullet_C) == 0x000008, "Wrong alignment on ABP_ThrowedBullet_C");
static_assert(sizeof(ABP_ThrowedBullet_C) == 0x0002F0, "Wrong size on ABP_ThrowedBullet_C");
static_assert(offsetof(ABP_ThrowedBullet_C, UberGraphFrame) == 0x000298, "Member 'ABP_ThrowedBullet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, Sphere) == 0x0002A0, "Member 'ABP_ThrowedBullet_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, Arrow) == 0x0002A8, "Member 'ABP_ThrowedBullet_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, StaticMesh) == 0x0002B0, "Member 'ABP_ThrowedBullet_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_ThrowedBullet_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, Timeline_0_NewTrack_0_CC9949FA42C9457E1D59719326629F65) == 0x0002C0, "Member 'ABP_ThrowedBullet_C::Timeline_0_NewTrack_0_CC9949FA42C9457E1D59719326629F65' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, Timeline_0__Direction_CC9949FA42C9457E1D59719326629F65) == 0x0002C4, "Member 'ABP_ThrowedBullet_C::Timeline_0__Direction_CC9949FA42C9457E1D59719326629F65' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, Timeline_0) == 0x0002C8, "Member 'ABP_ThrowedBullet_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, Speed) == 0x0002D0, "Member 'ABP_ThrowedBullet_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, DownSpeed) == 0x0002D8, "Member 'ABP_ThrowedBullet_C::DownSpeed' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, Launcher) == 0x0002E0, "Member 'ABP_ThrowedBullet_C::Launcher' has a wrong offset!");
static_assert(offsetof(ABP_ThrowedBullet_C, CanDetect) == 0x0002E8, "Member 'ABP_ThrowedBullet_C::CanDetect' has a wrong offset!");

}

