#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TempleGate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TempleGate.BP_TempleGate_C
// 0x0080 (0x0318 - 0x0298)
class ABP_TempleGate_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_CorrugatedFence_08;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_07;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_06;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_05;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_01;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_04;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_03;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CorrugatedFence_02;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_36BD256647D26C4E0DBDF19E56C7D23F; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_36BD256647D26C4E0DBDF19E56C7D23F; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Cars;                                              // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	bool                                          bOpen;                                             // 0x0310(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void Close();
	void CountOccupedCars(int32* Count);
	void ExecuteUbergraph_BP_TempleGate(int32 EntryPoint);
	void IsActivated(bool* Activated);
	void OnRep_bOpen();
	void Open();
	void Pushed();
	void Released();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TempleGate_C">();
	}
	static class ABP_TempleGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TempleGate_C>();
	}
};
static_assert(alignof(ABP_TempleGate_C) == 0x000008, "Wrong alignment on ABP_TempleGate_C");
static_assert(sizeof(ABP_TempleGate_C) == 0x000318, "Wrong size on ABP_TempleGate_C");
static_assert(offsetof(ABP_TempleGate_C, UberGraphFrame) == 0x000298, "Member 'ABP_TempleGate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, SM_CorrugatedFence_08) == 0x0002A0, "Member 'ABP_TempleGate_C::SM_CorrugatedFence_08' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, SM_CorrugatedFence_07) == 0x0002A8, "Member 'ABP_TempleGate_C::SM_CorrugatedFence_07' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, SM_CorrugatedFence_06) == 0x0002B0, "Member 'ABP_TempleGate_C::SM_CorrugatedFence_06' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, SM_CorrugatedFence_05) == 0x0002B8, "Member 'ABP_TempleGate_C::SM_CorrugatedFence_05' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, SM_CorrugatedFence_01) == 0x0002C0, "Member 'ABP_TempleGate_C::SM_CorrugatedFence_01' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, SM_CorrugatedFence_04) == 0x0002C8, "Member 'ABP_TempleGate_C::SM_CorrugatedFence_04' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, SM_CorrugatedFence_03) == 0x0002D0, "Member 'ABP_TempleGate_C::SM_CorrugatedFence_03' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, SM_CorrugatedFence_02) == 0x0002D8, "Member 'ABP_TempleGate_C::SM_CorrugatedFence_02' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, Sphere) == 0x0002E0, "Member 'ABP_TempleGate_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, DefaultSceneRoot) == 0x0002E8, "Member 'ABP_TempleGate_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, Timeline_0_NewTrack_0_36BD256647D26C4E0DBDF19E56C7D23F) == 0x0002F0, "Member 'ABP_TempleGate_C::Timeline_0_NewTrack_0_36BD256647D26C4E0DBDF19E56C7D23F' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, Timeline_0__Direction_36BD256647D26C4E0DBDF19E56C7D23F) == 0x0002F4, "Member 'ABP_TempleGate_C::Timeline_0__Direction_36BD256647D26C4E0DBDF19E56C7D23F' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, Timeline_0) == 0x0002F8, "Member 'ABP_TempleGate_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, Cars) == 0x000300, "Member 'ABP_TempleGate_C::Cars' has a wrong offset!");
static_assert(offsetof(ABP_TempleGate_C, bOpen) == 0x000310, "Member 'ABP_TempleGate_C::bOpen' has a wrong offset!");

}

