#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TurningPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TurningPlate.BP_TurningPlate_C.ExecuteUbergraph_BP_TurningPlate
// 0x0128 (0x0128 - 0x0000)
struct BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32E4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32E5[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate) == 0x000008, "Wrong alignment on BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate");
static_assert(sizeof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate) == 0x000128, "Wrong size on BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, EntryPoint) == 0x000000, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000038, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000120, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_TurningPlate.BP_TurningPlate_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TurningPlate_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TurningPlate_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TurningPlate_C_ReceiveTick");
static_assert(sizeof(BP_TurningPlate_C_ReceiveTick) == 0x000004, "Wrong size on BP_TurningPlate_C_ReceiveTick");
static_assert(offsetof(BP_TurningPlate_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TurningPlate_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

