#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThunderSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ThunderSpawner.BP_ThunderSpawner_C.ExecuteUbergraph_BP_ThunderSpawner
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ThunderEffect_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner) == 0x000010, "Wrong alignment on BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner");
static_assert(sizeof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner) == 0x0000A0, "Wrong size on BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, EntryPoint) == 0x000000, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000080, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, CallFunc_SpawnSound2D_ReturnValue) == 0x000088, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, CallFunc_Delay_Duration_ImplicitCast) == 0x000090, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner, CallFunc_Delay_Duration_ImplicitCast_1) == 0x000094, "Member 'BP_ThunderSpawner_C_ExecuteUbergraph_BP_ThunderSpawner::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");

// Function BP_ThunderSpawner.BP_ThunderSpawner_C.RandomRotation
// 0x0110 (0x0110 - 0x0000)
struct BP_ThunderSpawner_C_RandomRotation final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0020(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThunderSpawner_C_RandomRotation) == 0x000008, "Wrong alignment on BP_ThunderSpawner_C_RandomRotation");
static_assert(sizeof(BP_ThunderSpawner_C_RandomRotation) == 0x000110, "Wrong size on BP_ThunderSpawner_C_RandomRotation");
static_assert(offsetof(BP_ThunderSpawner_C_RandomRotation, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_ThunderSpawner_C_RandomRotation::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomRotation, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'BP_ThunderSpawner_C_RandomRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomRotation, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000020, "Member 'BP_ThunderSpawner_C_RandomRotation::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomRotation, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000108, "Member 'BP_ThunderSpawner_C_RandomRotation::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_ThunderSpawner.BP_ThunderSpawner_C.RandomScale
// 0x0048 (0x0048 - 0x0000)
struct BP_ThunderSpawner_C_RandomScale final
{
public:
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThunderSpawner_C_RandomScale) == 0x000008, "Wrong alignment on BP_ThunderSpawner_C_RandomScale");
static_assert(sizeof(BP_ThunderSpawner_C_RandomScale) == 0x000048, "Wrong size on BP_ThunderSpawner_C_RandomScale");
static_assert(offsetof(BP_ThunderSpawner_C_RandomScale, CallFunc_RandomBool_ReturnValue) == 0x000000, "Member 'BP_ThunderSpawner_C_RandomScale::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomScale, CallFunc_BreakVector_X) == 0x000008, "Member 'BP_ThunderSpawner_C_RandomScale::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomScale, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_ThunderSpawner_C_RandomScale::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomScale, CallFunc_BreakVector_Z) == 0x000018, "Member 'BP_ThunderSpawner_C_RandomScale::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomScale, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_ThunderSpawner_C_RandomScale::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomScale, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'BP_ThunderSpawner_C_RandomScale::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_RandomScale, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'BP_ThunderSpawner_C_RandomScale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_ThunderSpawner.BP_ThunderSpawner_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_ThunderSpawner_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_TargetArmLength_ImplicitCast;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThunderSpawner_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ThunderSpawner_C_UserConstructionScript");
static_assert(sizeof(BP_ThunderSpawner_C_UserConstructionScript) == 0x000010, "Wrong size on BP_ThunderSpawner_C_UserConstructionScript");
static_assert(offsetof(BP_ThunderSpawner_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_ThunderSpawner_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_UserConstructionScript, K2Node_VariableSet_TargetArmLength_ImplicitCast) == 0x000008, "Member 'BP_ThunderSpawner_C_UserConstructionScript::K2Node_VariableSet_TargetArmLength_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ThunderSpawner_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00000C, "Member 'BP_ThunderSpawner_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

