#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Torch02_Blueprint

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Torch02_Blueprint.BP_Torch02_Blueprint_C
// 0x0038 (0x02D0 - 0x0298)
class ABP_Torch02_Blueprint_C final : public AActor
{
public:
	class UAudioComponent*                        Fire_Sound;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Fire;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Torch02;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Torch01_Holder;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Fire_Enable;                                       // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Torch02_Blueprint_C">();
	}
	static class ABP_Torch02_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Torch02_Blueprint_C>();
	}
};
static_assert(alignof(ABP_Torch02_Blueprint_C) == 0x000008, "Wrong alignment on ABP_Torch02_Blueprint_C");
static_assert(sizeof(ABP_Torch02_Blueprint_C) == 0x0002D0, "Wrong size on ABP_Torch02_Blueprint_C");
static_assert(offsetof(ABP_Torch02_Blueprint_C, Fire_Sound) == 0x000298, "Member 'ABP_Torch02_Blueprint_C::Fire_Sound' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_Blueprint_C, PointLight) == 0x0002A0, "Member 'ABP_Torch02_Blueprint_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_Blueprint_C, P_Fire) == 0x0002A8, "Member 'ABP_Torch02_Blueprint_C::P_Fire' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_Blueprint_C, SM_Torch02) == 0x0002B0, "Member 'ABP_Torch02_Blueprint_C::SM_Torch02' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_Blueprint_C, SM_Torch01_Holder) == 0x0002B8, "Member 'ABP_Torch02_Blueprint_C::SM_Torch01_Holder' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_Blueprint_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_Torch02_Blueprint_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_Blueprint_C, Fire_Enable) == 0x0002C8, "Member 'ABP_Torch02_Blueprint_C::Fire_Enable' has a wrong offset!");

}

