#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Target

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Target.BP_Target_C
// 0x0080 (0x0318 - 0x0298)
class ABP_Target_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_VinceSync_C*                         C_VinceSync;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_BDD69EBF40408B7A70EE85ABA11D7CA1; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_BDD69EBF40408B7A70EE85ABA11D7CA1; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C8D[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_F1FDDE4148108583A092C0B331C3EDF6; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_F1FDDE4148108583A092C0B331C3EDF6; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C8E[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        LoopDuration;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Spacing;                                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 ActorToTrigger;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          TargetTouched;                                     // 0x0310(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Target(int32 EntryPoint);
	void OnRep_TargetTouched();
	void OnTargetTouched();
	void PlayLoop();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Touch();
	void Touched(bool* Param_Touched);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Target_C">();
	}
	static class ABP_Target_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Target_C>();
	}
};
static_assert(alignof(ABP_Target_C) == 0x000008, "Wrong alignment on ABP_Target_C");
static_assert(sizeof(ABP_Target_C) == 0x000318, "Wrong size on ABP_Target_C");
static_assert(offsetof(ABP_Target_C, UberGraphFrame) == 0x000298, "Member 'ABP_Target_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, C_VinceSync) == 0x0002A0, "Member 'ABP_Target_C::C_VinceSync' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, C_TickOptimizer) == 0x0002A8, "Member 'ABP_Target_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, StaticMesh1) == 0x0002B0, "Member 'ABP_Target_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, StaticMesh) == 0x0002B8, "Member 'ABP_Target_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Cylinder) == 0x0002C0, "Member 'ABP_Target_C::Cylinder' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Scene) == 0x0002C8, "Member 'ABP_Target_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_Target_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Timeline_1_NewTrack_0_BDD69EBF40408B7A70EE85ABA11D7CA1) == 0x0002D8, "Member 'ABP_Target_C::Timeline_1_NewTrack_0_BDD69EBF40408B7A70EE85ABA11D7CA1' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Timeline_1__Direction_BDD69EBF40408B7A70EE85ABA11D7CA1) == 0x0002DC, "Member 'ABP_Target_C::Timeline_1__Direction_BDD69EBF40408B7A70EE85ABA11D7CA1' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Timeline_1) == 0x0002E0, "Member 'ABP_Target_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Timeline_0_NewTrack_0_F1FDDE4148108583A092C0B331C3EDF6) == 0x0002E8, "Member 'ABP_Target_C::Timeline_0_NewTrack_0_F1FDDE4148108583A092C0B331C3EDF6' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Timeline_0__Direction_F1FDDE4148108583A092C0B331C3EDF6) == 0x0002EC, "Member 'ABP_Target_C::Timeline_0__Direction_F1FDDE4148108583A092C0B331C3EDF6' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Timeline_0) == 0x0002F0, "Member 'ABP_Target_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, LoopDuration) == 0x0002F8, "Member 'ABP_Target_C::LoopDuration' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, Spacing) == 0x000300, "Member 'ABP_Target_C::Spacing' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, ActorToTrigger) == 0x000308, "Member 'ABP_Target_C::ActorToTrigger' has a wrong offset!");
static_assert(offsetof(ABP_Target_C, TargetTouched) == 0x000310, "Member 'ABP_Target_C::TargetTouched' has a wrong offset!");

}

