#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowedBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ThrowedBullet.BP_ThrowedBullet_C.BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A7B[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ThrowedBullet_C_BndEvt__BP_ThrowedBullet_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_ThrowedBullet.BP_ThrowedBullet_C.CollisionDetection
// 0x0278 (0x0278 - 0x0000)
struct BP_ThrowedBullet_C_CollisionDetection final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A7C[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x00B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A7D[0x1];                                     // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A7E[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A7F[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowedBullet_C_CollisionDetection) == 0x000008, "Wrong alignment on BP_ThrowedBullet_C_CollisionDetection");
static_assert(sizeof(BP_ThrowedBullet_C_CollisionDetection) == 0x000278, "Wrong size on BP_ThrowedBullet_C_CollisionDetection");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, Temp_object_Variable) == 0x000000, "Member 'BP_ThrowedBullet_C_CollisionDetection::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000010, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_MakeRotator_ReturnValue) == 0x000050, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000080, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_Add_VectorVector_ReturnValue) == 0x000098, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_SphereTraceSingle_OutHit) == 0x0000B0, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_SphereTraceSingle_ReturnValue) == 0x000198, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_bBlockingHit) == 0x000199, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_bInitialOverlap) == 0x00019A, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_Time) == 0x00019C, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_Distance) == 0x0001A0, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_Location) == 0x0001A8, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_ImpactPoint) == 0x0001C0, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_Normal) == 0x0001D8, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F0, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_PhysMat) == 0x000208, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_HitActor) == 0x000210, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_HitComponent) == 0x000218, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_HitBoneName) == 0x000220, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_BoneName) == 0x000228, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_HitItem) == 0x000230, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_ElementIndex) == 0x000234, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_FaceIndex) == 0x000238, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_TraceStart) == 0x000240, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_BreakHitResult_TraceEnd) == 0x000258, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_CollisionDetection, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000270, "Member 'BP_ThrowedBullet_C_CollisionDetection::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_ThrowedBullet.BP_ThrowedBullet_C.ExecuteUbergraph_BP_ThrowedBullet
// 0x0410 (0x0410 - 0x0000)
struct BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A80[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A81[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0168(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult_1;       // 0x0268(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0350(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A82[0x7];                                     // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Debris_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Target_1;                       // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A83[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Target;                         // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Target_C>         K2Node_DynamicCast_AsBPI_Target;                   // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A84[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet) == 0x000010, "Wrong alignment on BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet");
static_assert(sizeof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet) == 0x000410, "Wrong size on BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, EntryPoint) == 0x000000, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_HasAuthority_ReturnValue) == 0x000006, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_HasAuthority_ReturnValue_1) == 0x000007, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_GetForwardVector_ReturnValue) == 0x000010, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_K2_AddWorldOffset_SweepHitResult) == 0x000048, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_K2_AddWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_Lerp_ReturnValue) == 0x000130, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000138, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000140, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000148, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_ComponentBoundEvent_OtherActor) == 0x000150, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_ComponentBoundEvent_OtherComp) == 0x000158, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000160, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_ComponentBoundEvent_bFromSweep) == 0x000164, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_ComponentBoundEvent_SweepResult) == 0x000168, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_MakeVector_ReturnValue) == 0x000250, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_K2_AddWorldOffset_SweepHitResult_1) == 0x000268, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_K2_AddWorldOffset_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000350, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003B0, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, Temp_bool_IsClosed_Variable) == 0x0003B8, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003C0, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_CustomEvent_Target_1) == 0x0003C8, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_CustomEvent_Target_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_HasAuthority_ReturnValue_2) == 0x0003D0, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_CustomEvent_Target) == 0x0003D8, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_DynamicCast_AsBPI_Target) == 0x0003E0, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_DynamicCast_AsBPI_Target' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, K2Node_DynamicCast_bSuccess) == 0x0003F0, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0003F8, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000400, "Member 'BP_ThrowedBullet_C_ExecuteUbergraph_BP_ThrowedBullet::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");

// Function BP_ThrowedBullet.BP_ThrowedBullet_C.HitMulti
// 0x0008 (0x0008 - 0x0000)
struct BP_ThrowedBullet_C_HitMulti final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowedBullet_C_HitMulti) == 0x000008, "Wrong alignment on BP_ThrowedBullet_C_HitMulti");
static_assert(sizeof(BP_ThrowedBullet_C_HitMulti) == 0x000008, "Wrong size on BP_ThrowedBullet_C_HitMulti");
static_assert(offsetof(BP_ThrowedBullet_C_HitMulti, Target) == 0x000000, "Member 'BP_ThrowedBullet_C_HitMulti::Target' has a wrong offset!");

// Function BP_ThrowedBullet.BP_ThrowedBullet_C.OnHit
// 0x0008 (0x0008 - 0x0000)
struct BP_ThrowedBullet_C_OnHit final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowedBullet_C_OnHit) == 0x000008, "Wrong alignment on BP_ThrowedBullet_C_OnHit");
static_assert(sizeof(BP_ThrowedBullet_C_OnHit) == 0x000008, "Wrong size on BP_ThrowedBullet_C_OnHit");
static_assert(offsetof(BP_ThrowedBullet_C_OnHit, Target) == 0x000000, "Member 'BP_ThrowedBullet_C_OnHit::Target' has a wrong offset!");

// Function BP_ThrowedBullet.BP_ThrowedBullet_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ThrowedBullet_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowedBullet_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ThrowedBullet_C_ReceiveTick");
static_assert(sizeof(BP_ThrowedBullet_C_ReceiveTick) == 0x000004, "Wrong size on BP_ThrowedBullet_C_ReceiveTick");
static_assert(offsetof(BP_ThrowedBullet_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ThrowedBullet_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

