#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tyrolienne

#include "Basic.hpp"

#include "ALS_MovementState_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Tyrolienne.BP_Tyrolienne_C.BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EFE[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Tyrolienne.BP_Tyrolienne_C.BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EFF[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Tyrolienne_C_BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Tyrolienne.BP_Tyrolienne_C.ExecuteUbergraph_BP_Tyrolienne
// 0x03C0 (0x03C0 - 0x0000)
struct BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F00[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Char;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F01[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomeoneAlreadyInTyro_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F02[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F03[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0058(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F04[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IALS_Character_BPI_C>  K2Node_DynamicCast_AsALS_Character_BPI;            // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F05[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F06[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BPI_Get_EssentialValues_Velocity;         // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BPI_Get_EssentialValues_Acceleration;     // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BPI_Get_EssentialValues_MovementInput;    // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_IsMoving;         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_HasMovementInput; // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F07[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BPI_Get_EssentialValues_Speed;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BPI_Get_EssentialValues_MovementInputAmount; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BPI_Get_EssentialValues_AimingRotation;   // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BPI_Get_EssentialValues_AimYawRate;       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BPI_Get_EssentialValues_PullCharacter;    // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_Pull;             // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_Climb;            // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F08[0x6];                                     // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_BPI_Get_EssentialValues_MoveInput;        // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_SwimOnSurface;    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F09[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BPI_Get_EssentialValues_LeftHandLocation; // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BPI_Get_EssentialValues_RightHandLocation; // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BPI_Get_EssentialValues_RadialVelocityRight; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BPI_Get_EssentialValues_RadialVelocityUp; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_Swim;             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_Bounce;           // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_LookAround;       // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_Get_EssentialValues_Balancier;        // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrounded_Grounded;                      // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F0A[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSomeoneAlreadyInTyro_ReturnValue_1;     // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F0B[0x6];                                     // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F0C[0x6];                                     // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F0D[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x02C0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne) == 0x000008, "Wrong alignment on BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne");
static_assert(sizeof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne) == 0x0003C0, "Wrong size on BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, EntryPoint) == 0x000000, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_CustomEvent_Char) == 0x000008, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_CustomEvent_Char' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_AsBPI_Character) == 0x000010, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_AsPawn) == 0x000028, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_IsSomeoneAlreadyInTyro_ReturnValue) == 0x000031, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_IsSomeoneAlreadyInTyro_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000038, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000040, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000048, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000050, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000054, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000058, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_AsPawn_1) == 0x000140, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_AsPawn_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_AsALS_Character_BPI) == 0x000150, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_AsALS_Character_BPI' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_AsBPI_Character_1) == 0x000168, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_AsBPI_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_bSuccess_4) == 0x000178, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_Velocity) == 0x000180, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_Velocity' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_Acceleration) == 0x000198, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_Acceleration' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_MovementInput) == 0x0001B0, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_MovementInput' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_IsMoving) == 0x0001C8, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_IsMoving' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_HasMovementInput) == 0x0001C9, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_HasMovementInput' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_Speed) == 0x0001D0, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_Speed' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_MovementInputAmount) == 0x0001D8, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_MovementInputAmount' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_AimingRotation) == 0x0001E0, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_AimingRotation' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_AimYawRate) == 0x0001F8, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_AimYawRate' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_PullCharacter) == 0x000200, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_PullCharacter' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_Pull) == 0x000208, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_Pull' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_Climb) == 0x000209, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_Climb' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_MoveInput) == 0x000210, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_MoveInput' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_SwimOnSurface) == 0x000220, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_SwimOnSurface' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_LeftHandLocation) == 0x000228, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_LeftHandLocation' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_RightHandLocation) == 0x000240, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_RightHandLocation' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_RadialVelocityRight) == 0x000258, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_RadialVelocityRight' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_RadialVelocityUp) == 0x000260, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_RadialVelocityUp' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_Swim) == 0x000268, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_Swim' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_Bounce) == 0x000269, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_Bounce' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_LookAround) == 0x00026A, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_LookAround' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BPI_Get_EssentialValues_Balancier) == 0x00026B, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BPI_Get_EssentialValues_Balancier' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_IsGrounded_Grounded) == 0x00026C, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_IsGrounded_Grounded' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BreakVector_X) == 0x000270, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BreakVector_Y) == 0x000278, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_BreakVector_Z) == 0x000280, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000288, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_IsSomeoneAlreadyInTyro_ReturnValue_1) == 0x000289, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_IsSomeoneAlreadyInTyro_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_GetPlayerPawn_ReturnValue) == 0x000290, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x000298, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000299, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002A0, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_OtherActor) == 0x0002A8, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_OtherComp) == 0x0002B0, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0002B8, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_bFromSweep) == 0x0002BC, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_ComponentBoundEvent_SweepResult) == 0x0002C0, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, CallFunc_GetGameInstance_ReturnValue) == 0x0003A8, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_AsCustom_GI) == 0x0003B0, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne, K2Node_DynamicCast_bSuccess_5) == 0x0003B8, "Member 'BP_Tyrolienne_C_ExecuteUbergraph_BP_Tyrolienne::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function BP_Tyrolienne.BP_Tyrolienne_C.IsSomeoneAlreadyInTyro
// 0x0050 (0x0050 - 0x0000)
struct BP_Tyrolienne_C_IsSomeoneAlreadyInTyro final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F0E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F0F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F10[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EALS_MovementState                            CallFunc_GetMovementState_State;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro) == 0x000008, "Wrong alignment on BP_Tyrolienne_C_IsSomeoneAlreadyInTyro");
static_assert(sizeof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro) == 0x000050, "Wrong size on BP_Tyrolienne_C_IsSomeoneAlreadyInTyro");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, ReturnValue) == 0x000000, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, K2Node_DynamicCast_AsBPI_Character) == 0x000038, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, CallFunc_GetMovementState_State) == 0x000049, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::CallFunc_GetMovementState_State' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_IsSomeoneAlreadyInTyro, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'BP_Tyrolienne_C_IsSomeoneAlreadyInTyro::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_Tyrolienne.BP_Tyrolienne_C.SwitchCharacterToTyrolienne
// 0x0008 (0x0008 - 0x0000)
struct BP_Tyrolienne_C_SwitchCharacterToTyrolienne final
{
public:
	class UObject*                                Char;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tyrolienne_C_SwitchCharacterToTyrolienne) == 0x000008, "Wrong alignment on BP_Tyrolienne_C_SwitchCharacterToTyrolienne");
static_assert(sizeof(BP_Tyrolienne_C_SwitchCharacterToTyrolienne) == 0x000008, "Wrong size on BP_Tyrolienne_C_SwitchCharacterToTyrolienne");
static_assert(offsetof(BP_Tyrolienne_C_SwitchCharacterToTyrolienne, Char) == 0x000000, "Member 'BP_Tyrolienne_C_SwitchCharacterToTyrolienne::Char' has a wrong offset!");

// Function BP_Tyrolienne.BP_Tyrolienne_C.OnBoxDetection
// 0x00D8 (0x00D8 - 0x0000)
struct BP_Tyrolienne_C_OnBoxDetection final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F11[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnBoxDetection_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F12[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F13[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F14[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_Jump;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_Fall;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F15[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAnimVariables_RadialVelocity;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAnimVariables_MoveInput;               // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_Climb;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_Pull;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F16[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAnimVariables_PulledCharacter;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_IsDriving;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F17[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAnimVariables_DriveLeftHand;           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAnimVariables_DriveRightHand;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_LookAround;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EALS_MovementState                            CallFunc_GetMovementState_State;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tyrolienne_C_OnBoxDetection) == 0x000008, "Wrong alignment on BP_Tyrolienne_C_OnBoxDetection");
static_assert(sizeof(BP_Tyrolienne_C_OnBoxDetection) == 0x0000D8, "Wrong size on BP_Tyrolienne_C_OnBoxDetection");
static_assert(offsetof(BP_Tyrolienne_C_OnBoxDetection, Object) == 0x000000, "Member 'BP_Tyrolienne_C_OnBoxDetection::Object' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_OnBoxDetection, ReturnValue) == 0x000008, "Member 'BP_Tyrolienne_C_OnBoxDetection::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tyrolienne_C_OnBoxDetection, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_Tyrolienne_C_OnBoxDetection::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
