#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TurningPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TurningPlate.BP_TurningPlate_C.ExecuteUbergraph_BP_TurningPlate
// 0x00F8 (0x00F8 - 0x0000)
struct BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3854[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate) == 0x000008, "Wrong alignment on BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate");
static_assert(sizeof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate) == 0x0000F8, "Wrong size on BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, EntryPoint) == 0x000000, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000008, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate, K2Node_Event_DeltaSeconds) == 0x0000F0, "Member 'BP_TurningPlate_C_ExecuteUbergraph_BP_TurningPlate::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_TurningPlate.BP_TurningPlate_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TurningPlate_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TurningPlate_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TurningPlate_C_ReceiveTick");
static_assert(sizeof(BP_TurningPlate_C_ReceiveTick) == 0x000004, "Wrong size on BP_TurningPlate_C_ReceiveTick");
static_assert(offsetof(BP_TurningPlate_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TurningPlate_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

