#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trampoline

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Trampoline.BP_Trampoline_C.ExecuteUbergraph_BP_Trampoline
// 0x0004 (0x0004 - 0x0000)
struct BP_Trampoline_C_ExecuteUbergraph_BP_Trampoline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trampoline_C_ExecuteUbergraph_BP_Trampoline) == 0x000004, "Wrong alignment on BP_Trampoline_C_ExecuteUbergraph_BP_Trampoline");
static_assert(sizeof(BP_Trampoline_C_ExecuteUbergraph_BP_Trampoline) == 0x000004, "Wrong size on BP_Trampoline_C_ExecuteUbergraph_BP_Trampoline");
static_assert(offsetof(BP_Trampoline_C_ExecuteUbergraph_BP_Trampoline, EntryPoint) == 0x000000, "Member 'BP_Trampoline_C_ExecuteUbergraph_BP_Trampoline::EntryPoint' has a wrong offset!");

// Function BP_Trampoline.BP_Trampoline_C.GetBounceForce
// 0x0038 (0x0038 - 0x0000)
struct BP_Trampoline_C_GetBounceForce final
{
public:
	double                                        Force;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayers_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3802[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trampoline_C_GetBounceForce) == 0x000008, "Wrong alignment on BP_Trampoline_C_GetBounceForce");
static_assert(sizeof(BP_Trampoline_C_GetBounceForce) == 0x000038, "Wrong size on BP_Trampoline_C_GetBounceForce");
static_assert(offsetof(BP_Trampoline_C_GetBounceForce, Force) == 0x000000, "Member 'BP_Trampoline_C_GetBounceForce::Force' has a wrong offset!");
static_assert(offsetof(BP_Trampoline_C_GetBounceForce, CallFunc_GetNumPlayers_ReturnValue) == 0x000008, "Member 'BP_Trampoline_C_GetBounceForce::CallFunc_GetNumPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trampoline_C_GetBounceForce, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'BP_Trampoline_C_GetBounceForce::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trampoline_C_GetBounceForce, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Trampoline_C_GetBounceForce::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trampoline_C_GetBounceForce, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'BP_Trampoline_C_GetBounceForce::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trampoline_C_GetBounceForce, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000028, "Member 'BP_Trampoline_C_GetBounceForce::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Trampoline_C_GetBounceForce, CallFunc_MapRangeClamped_ReturnValue) == 0x000030, "Member 'BP_Trampoline_C_GetBounceForce::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function BP_Trampoline.BP_Trampoline_C.JustZImpulse
// 0x0001 (0x0001 - 0x0000)
struct BP_Trampoline_C_JustZImpulse final
{
public:
	bool                                          Param_JustZ;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trampoline_C_JustZImpulse) == 0x000001, "Wrong alignment on BP_Trampoline_C_JustZImpulse");
static_assert(sizeof(BP_Trampoline_C_JustZImpulse) == 0x000001, "Wrong size on BP_Trampoline_C_JustZImpulse");
static_assert(offsetof(BP_Trampoline_C_JustZImpulse, Param_JustZ) == 0x000000, "Member 'BP_Trampoline_C_JustZImpulse::Param_JustZ' has a wrong offset!");

// Function BP_Trampoline.BP_Trampoline_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_Trampoline_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trampoline_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_Trampoline_C_UserConstructionScript");
static_assert(sizeof(BP_Trampoline_C_UserConstructionScript) == 0x000001, "Wrong size on BP_Trampoline_C_UserConstructionScript");
static_assert(offsetof(BP_Trampoline_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_Trampoline_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

