#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThunderEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ThunderEffect.BP_ThunderEffect_C.ExecuteUbergraph_BP_ThunderEffect
// 0x0030 (0x0030 - 0x0000)
struct BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A86[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Intensity_ImplicitCast;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect) == 0x000008, "Wrong alignment on BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect");
static_assert(sizeof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect) == 0x000030, "Wrong size on BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect");
static_assert(offsetof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect, EntryPoint) == 0x000000, "Member 'BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000018, "Member 'BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect, K2Node_VariableSet_Intensity_ImplicitCast) == 0x000020, "Member 'BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect::K2Node_VariableSet_Intensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000028, "Member 'BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00002C, "Member 'BP_ThunderEffect_C_ExecuteUbergraph_BP_ThunderEffect::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

