#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TyrolienneGrue

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TyrolienneGrue.BP_TyrolienneGrue_C.ExecuteUbergraph_BP_TyrolienneGrue
// 0x0120 (0x0120 - 0x0000)
struct BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_120[0x2];                                      // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue) == 0x000008, "Wrong alignment on BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue");
static_assert(sizeof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue) == 0x000120, "Wrong size on BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue");
static_assert(offsetof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue, EntryPoint) == 0x000000, "Member 'BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000010, "Member 'BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue, CallFunc_RLerp_ReturnValue) == 0x000018, "Member 'BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000030, "Member 'BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000118, "Member 'BP_TyrolienneGrue_C_ExecuteUbergraph_BP_TyrolienneGrue::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_TyrolienneGrue.BP_TyrolienneGrue_C.InitRots
// 0x01D0 (0x01D0 - 0x0000)
struct BP_TyrolienneGrue_C_InitRots final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0000(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TyrolienneGrue_C_InitRots) == 0x000008, "Wrong alignment on BP_TyrolienneGrue_C_InitRots");
static_assert(sizeof(BP_TyrolienneGrue_C_InitRots) == 0x0001D0, "Wrong size on BP_TyrolienneGrue_C_InitRots");
static_assert(offsetof(BP_TyrolienneGrue_C_InitRots, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000000, "Member 'BP_TyrolienneGrue_C_InitRots::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TyrolienneGrue_C_InitRots, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000E8, "Member 'BP_TyrolienneGrue_C_InitRots::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

}

