#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tyrolienne

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MovingObject_classes.hpp"
#include "ALS_MovementState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Tyrolienne.BP_Tyrolienne_C
// 0x0020 (0x0470 - 0x0450)
class ABP_Tyrolienne_C : public ABP_MovingObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Tyrolienne_C;                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box1_0;                                            // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       HandSocket;                                        // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        AttachSocketArrow;                                 // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Tyrolienne_Box1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Tyrolienne_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_Tyrolienne(int32 EntryPoint);
	bool IsSomeoneAlreadyInTyro();
	void SwitchCharacterToTyrolienne(class UObject* Char);
	bool OnBoxDetection(class UObject* Object);
	void Reset();
	void ResetDetectionOnEndMoving();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Tyrolienne_C">();
	}
	static class ABP_Tyrolienne_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Tyrolienne_C>();
	}
};
static_assert(alignof(ABP_Tyrolienne_C) == 0x000010, "Wrong alignment on ABP_Tyrolienne_C");
static_assert(sizeof(ABP_Tyrolienne_C) == 0x000470, "Wrong size on ABP_Tyrolienne_C");
static_assert(offsetof(ABP_Tyrolienne_C, UberGraphFrame_BP_Tyrolienne_C) == 0x000450, "Member 'ABP_Tyrolienne_C::UberGraphFrame_BP_Tyrolienne_C' has a wrong offset!");
static_assert(offsetof(ABP_Tyrolienne_C, Box1_0) == 0x000458, "Member 'ABP_Tyrolienne_C::Box1_0' has a wrong offset!");
static_assert(offsetof(ABP_Tyrolienne_C, HandSocket) == 0x000460, "Member 'ABP_Tyrolienne_C::HandSocket' has a wrong offset!");
static_assert(offsetof(ABP_Tyrolienne_C, AttachSocketArrow) == 0x000468, "Member 'ABP_Tyrolienne_C::AttachSocketArrow' has a wrong offset!");

}

