#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TyrolienneGrue

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TyrolienneGrue.BP_TyrolienneGrue_C
// 0x00A0 (0x0338 - 0x0298)
class ABP_TyrolienneGrue_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_VinceSync_C*                         C_VinceSync;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Sound;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MERGED_TowerCrane11;                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MERGED_TowerCrane10;                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MERGED_TowerCrane9;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_31F628D5434F5D756C05D598686E79E2; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_31F628D5434F5D756C05D598686E79E2; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Time;                                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABPT_TyrolienneSocket_C*                TyrolienneSocket;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FRotator                               RotA;                                              // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FRotator                               RotB;                                              // 0x0320(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_TyrolienneGrue(int32 EntryPoint);
	void InitRots();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TyrolienneGrue_C">();
	}
	static class ABP_TyrolienneGrue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TyrolienneGrue_C>();
	}
};
static_assert(alignof(ABP_TyrolienneGrue_C) == 0x000008, "Wrong alignment on ABP_TyrolienneGrue_C");
static_assert(sizeof(ABP_TyrolienneGrue_C) == 0x000338, "Wrong size on ABP_TyrolienneGrue_C");
static_assert(offsetof(ABP_TyrolienneGrue_C, UberGraphFrame) == 0x000298, "Member 'ABP_TyrolienneGrue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, C_VinceSync) == 0x0002A0, "Member 'ABP_TyrolienneGrue_C::C_VinceSync' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, Sound) == 0x0002A8, "Member 'ABP_TyrolienneGrue_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, C_TickOptimizer) == 0x0002B0, "Member 'ABP_TyrolienneGrue_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, TextRender) == 0x0002B8, "Member 'ABP_TyrolienneGrue_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, Sphere) == 0x0002C0, "Member 'ABP_TyrolienneGrue_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, SM_MERGED_TowerCrane11) == 0x0002C8, "Member 'ABP_TyrolienneGrue_C::SM_MERGED_TowerCrane11' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, SM_MERGED_TowerCrane10) == 0x0002D0, "Member 'ABP_TyrolienneGrue_C::SM_MERGED_TowerCrane10' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, SM_MERGED_TowerCrane9) == 0x0002D8, "Member 'ABP_TyrolienneGrue_C::SM_MERGED_TowerCrane9' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, DefaultSceneRoot) == 0x0002E0, "Member 'ABP_TyrolienneGrue_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, Timeline_0_NewTrack_0_31F628D5434F5D756C05D598686E79E2) == 0x0002E8, "Member 'ABP_TyrolienneGrue_C::Timeline_0_NewTrack_0_31F628D5434F5D756C05D598686E79E2' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, Timeline_0__Direction_31F628D5434F5D756C05D598686E79E2) == 0x0002EC, "Member 'ABP_TyrolienneGrue_C::Timeline_0__Direction_31F628D5434F5D756C05D598686E79E2' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, Timeline_0) == 0x0002F0, "Member 'ABP_TyrolienneGrue_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, Time) == 0x0002F8, "Member 'ABP_TyrolienneGrue_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, TyrolienneSocket) == 0x000300, "Member 'ABP_TyrolienneGrue_C::TyrolienneSocket' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, RotA) == 0x000308, "Member 'ABP_TyrolienneGrue_C::RotA' has a wrong offset!");
static_assert(offsetof(ABP_TyrolienneGrue_C, RotB) == 0x000320, "Member 'ABP_TyrolienneGrue_C::RotB' has a wrong offset!");

}

