#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_ThirdPersonCharacter_SF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function bp_ThirdPersonCharacter_SF.bp_ThirdPersonCharacter_SF_C.DrawLightsDebug
// 0x00C8 (0x00C8 - 0x0000)
struct bp_ThirdPersonCharacter_SF_C_DrawLightsDebug final
{
public:
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug) == 0x000008, "Wrong alignment on bp_ThirdPersonCharacter_SF_C_DrawLightsDebug");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug) == 0x0000C8, "Wrong size on bp_ThirdPersonCharacter_SF_C_DrawLightsDebug");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_GetForwardVector_ReturnValue) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_GetForwardVector_ReturnValue_1) == 0x000060, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000078, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000090, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000A8, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_DrawLightsDebug, CallFunc_IsVisible_ReturnValue) == 0x0000C0, "Member 'bp_ThirdPersonCharacter_SF_C_DrawLightsDebug::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF.bp_ThirdPersonCharacter_SF_C.ExecuteUbergraph_bp_ThirdPersonCharacter_SF
// 0x0470 (0x0470 - 0x0000)
struct bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0020(0x0018)(HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365E[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365F[0x1];                                     // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue_1;      // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETouchIndex                                   K2Node_InputTouchEvent_FingerIndex;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3660[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_InputTouchEvent_Location;                   // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3661[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETouchIndex                                   K2Node_InputTouchEvent_FingerIndex_1;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3662[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_InputTouchEvent_Location_1;                 // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3663[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Immediate;                      // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3664[0x6];                                     // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x02D8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x02F0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0308(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x0320(0x0018)(HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3665[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x0360(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3666[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3667[0x6];                                     // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3668[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UThirdPerson_AnimBP_C*                  K2Node_DynamicCast_AsThird_Person_Anim_BP;         // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            K2Node_CustomEvent_ZoomDirection;                  // 0x03C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            K2Node_CustomEvent_Zoom_Direction;                 // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3669[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x03D0(0x0018)(HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_366A[0x5];                                     // 0x03F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_1;                            // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   Temp_byte_Variable_1;                              // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_366B[0x7];                                     // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_MouseSensitivityScale_ImplicitCast; // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateCrouch_DeltaTime_ImplicitCast;      // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateHandSway_DeltaTime_ImplicitCast;    // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_366C[0x4];                                     // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_366D[0x4];                                     // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_2;        // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_TargetArmLength_ImplicitCast;   // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_TargetArmLength_ImplicitCast_1; // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast_1; // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF) == 0x000008, "Wrong alignment on bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF");
static_assert(sizeof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF) == 0x000470, "Wrong size on bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, EntryPoint) == 0x000000, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputKeyEvent_Key_1) == 0x000008, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputKeyEvent_Key) == 0x000020, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_9) == 0x000038, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_8) == 0x000050, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_7) == 0x000068, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_6) == 0x000080, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_5) == 0x000098, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_name_Variable) == 0x0000B0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000C8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000C9, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_4) == 0x0000CC, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_3) == 0x0000D4, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000DC, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_2) == 0x0000EC, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000F4, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName_1) == 0x000104, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_8) == 0x00010C, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_NotifyName) == 0x00011C, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CreateDelegate_OutputDelegate_9) == 0x000124, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_name_Variable_1) == 0x000134, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x00013C, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x00013D, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_byte_Variable) == 0x00013E, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_GetPlayerController_ReturnValue) == 0x000140, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000148, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x000160, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000178, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_ComposeRotators_ReturnValue) == 0x000190, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_Event_DeltaSeconds) == 0x0001A8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_BreakRotator_Roll) == 0x0001AC, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_BreakRotator_Pitch) == 0x0001B0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_BreakRotator_Yaw) == 0x0001B4, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001C0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_MakeRotator_ReturnValue) == 0x0001C8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0001E0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Multiply_RotatorFloat_ReturnValue_1) == 0x0001F8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Multiply_RotatorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000210, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputTouchEvent_FingerIndex) == 0x000228, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputTouchEvent_FingerIndex' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputTouchEvent_Location) == 0x000230, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputTouchEvent_Location' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_ComposeRotators_ReturnValue_1) == 0x000248, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_BreakRotator_Roll_1) == 0x000260, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_BreakRotator_Pitch_1) == 0x000264, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_BreakRotator_Yaw_1) == 0x000268, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000270, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_MakeRotator_ReturnValue_1) == 0x000278, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputTouchEvent_FingerIndex_1) == 0x000290, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputTouchEvent_FingerIndex_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputTouchEvent_Location_1) == 0x000298, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputTouchEvent_Location_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_GetController_ReturnValue) == 0x0002B0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_DynamicCast_AsPlayer_Controller) == 0x0002B8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_DynamicCast_bSuccess) == 0x0002C0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x0002C8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_DynamicCast_bSuccess_1) == 0x0002D0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_Immediate) == 0x0002D1, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_Immediate' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputKeyEvent_Key_3) == 0x0002D8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputKeyEvent_Key_4) == 0x0002F0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_struct_Variable) == 0x000308, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputKeyEvent_Key_5) == 0x000320, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000338, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000340, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_FClamp_ReturnValue) == 0x000348, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_FClamp_ReturnValue_1) == 0x000350, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_IsValid_ReturnValue) == 0x000358, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputKeyEvent_Key_6) == 0x000360, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputKeyEvent_Key_6' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_IsValid_ReturnValue_1) == 0x000378, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_SelectFloat_ReturnValue) == 0x000380, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000388, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000390, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000398, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_IsValid_ReturnValue_2) == 0x0003A0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_IsValid_ReturnValue_3) == 0x0003A1, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_GetAnimInstance_ReturnValue) == 0x0003A8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_bool_Has_Been_Initd_Variable) == 0x0003B0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_DynamicCast_AsThird_Person_Anim_BP) == 0x0003B8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_DynamicCast_AsThird_Person_Anim_BP' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_DynamicCast_bSuccess_2) == 0x0003C0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_bool_IsClosed_Variable) == 0x0003C1, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_bool_Variable) == 0x0003C2, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Not_PreBool_ReturnValue) == 0x0003C3, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_bool_Has_Been_Initd_Variable_1) == 0x0003C4, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_bool_Variable_1) == 0x0003C5, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003C6, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_ZoomDirection) == 0x0003C7, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_ZoomDirection' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_CustomEvent_Zoom_Direction) == 0x0003C8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_CustomEvent_Zoom_Direction' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_InputKeyEvent_Key_2) == 0x0003D0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_Select_Default) == 0x0003E8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_bool_IsClosed_Variable_1) == 0x0003F0, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_bool_Variable_2) == 0x0003F1, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Not_PreBool_ReturnValue_2) == 0x0003F2, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_struct_Variable_1) == 0x0003F8, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, Temp_byte_Variable_1) == 0x000410, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_VariableSet_MouseSensitivityScale_ImplicitCast) == 0x000418, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_VariableSet_MouseSensitivityScale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_UpdateCrouch_DeltaTime_ImplicitCast) == 0x000420, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_UpdateCrouch_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_UpdateHandSway_DeltaTime_ImplicitCast) == 0x000428, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_UpdateHandSway_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000430, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000438, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000440, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x000448, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000450, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_Add_DoubleDouble_A_ImplicitCast_2) == 0x000458, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_Add_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_VariableSet_TargetArmLength_ImplicitCast) == 0x000460, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_VariableSet_TargetArmLength_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, K2Node_VariableSet_TargetArmLength_ImplicitCast_1) == 0x000464, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::K2Node_VariableSet_TargetArmLength_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast) == 0x000468, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF, CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast_1) == 0x00046C, "Member 'bp_ThirdPersonCharacter_SF_C_ExecuteUbergraph_bp_ThirdPersonCharacter_SF::CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast_1' has a wrong offset!");

// Function bp_ThirdPersonCharacter_SF.bp_ThirdPersonCharacter_SF_C.GenerateSwayLocation
// 0x0060 (0x0060 - 0x0000)
struct bp_ThirdPersonCharacter_SF_C_GenerateSwayLocation final
{
public:
	double                                        Theta;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Phi;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
