#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Underbody_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Underbody_01.BP_Underbody_01_C
// 0x0128 (0x03C0 - 0x0298)
class ABP_Underbody_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_underbody_wire_01;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_wire_011;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_box_03;                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_box_031;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_tube_01;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_tube_011;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_ladder_011;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_ladder_015;                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_anchor_011;                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_ladder_012;                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_ladder_013;                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_ladder_014;                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_bar_011;                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_bar_01;                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_anchor_01;                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_box_012;                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_box_022;                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_ladder_01;                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_box_011;                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_box_021;                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_box_02;                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_box_01;                               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Underbody_bogie_02;                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Underbody_bogie_01;                                // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_bogie_011;                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_bogie_01;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_016;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_015;                                  // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_014;                                  // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_02;                                   // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_013;                                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_012;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_011;                                  // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_underbody_01;                                   // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Underbody_01_C">();
	}
	static class ABP_Underbody_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Underbody_01_C>();
	}
};
static_assert(alignof(ABP_Underbody_01_C) == 0x000008, "Wrong alignment on ABP_Underbody_01_C");
static_assert(sizeof(ABP_Underbody_01_C) == 0x0003C0, "Wrong size on ABP_Underbody_01_C");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_wire_01) == 0x000298, "Member 'ABP_Underbody_01_C::SM_underbody_wire_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_wire_011) == 0x0002A0, "Member 'ABP_Underbody_01_C::SM_underbody_wire_011' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_box_03) == 0x0002A8, "Member 'ABP_Underbody_01_C::SM_underbody_box_03' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_box_031) == 0x0002B0, "Member 'ABP_Underbody_01_C::SM_underbody_box_031' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_tube_01) == 0x0002B8, "Member 'ABP_Underbody_01_C::SM_underbody_tube_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_tube_011) == 0x0002C0, "Member 'ABP_Underbody_01_C::SM_underbody_tube_011' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_ladder_011) == 0x0002C8, "Member 'ABP_Underbody_01_C::SM_underbody_ladder_011' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_ladder_015) == 0x0002D0, "Member 'ABP_Underbody_01_C::SM_underbody_ladder_015' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_anchor_011) == 0x0002D8, "Member 'ABP_Underbody_01_C::SM_underbody_anchor_011' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_ladder_012) == 0x0002E0, "Member 'ABP_Underbody_01_C::SM_underbody_ladder_012' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_ladder_013) == 0x0002E8, "Member 'ABP_Underbody_01_C::SM_underbody_ladder_013' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_ladder_014) == 0x0002F0, "Member 'ABP_Underbody_01_C::SM_underbody_ladder_014' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_bar_011) == 0x0002F8, "Member 'ABP_Underbody_01_C::SM_underbody_bar_011' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_bar_01) == 0x000300, "Member 'ABP_Underbody_01_C::SM_underbody_bar_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_anchor_01) == 0x000308, "Member 'ABP_Underbody_01_C::SM_underbody_anchor_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_box_012) == 0x000310, "Member 'ABP_Underbody_01_C::SM_underbody_box_012' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_box_022) == 0x000318, "Member 'ABP_Underbody_01_C::SM_underbody_box_022' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_ladder_01) == 0x000320, "Member 'ABP_Underbody_01_C::SM_underbody_ladder_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_box_011) == 0x000328, "Member 'ABP_Underbody_01_C::SM_underbody_box_011' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_box_021) == 0x000330, "Member 'ABP_Underbody_01_C::SM_underbody_box_021' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, StaticMesh1) == 0x000338, "Member 'ABP_Underbody_01_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_box_02) == 0x000340, "Member 'ABP_Underbody_01_C::SM_underbody_box_02' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, StaticMesh) == 0x000348, "Member 'ABP_Underbody_01_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_box_01) == 0x000350, "Member 'ABP_Underbody_01_C::SM_underbody_box_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, Underbody_bogie_02) == 0x000358, "Member 'ABP_Underbody_01_C::Underbody_bogie_02' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, Underbody_bogie_01) == 0x000360, "Member 'ABP_Underbody_01_C::Underbody_bogie_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_bogie_011) == 0x000368, "Member 'ABP_Underbody_01_C::SM_underbody_bogie_011' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_bogie_01) == 0x000370, "Member 'ABP_Underbody_01_C::SM_underbody_bogie_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_016) == 0x000378, "Member 'ABP_Underbody_01_C::SM_underbody_016' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_015) == 0x000380, "Member 'ABP_Underbody_01_C::SM_underbody_015' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_014) == 0x000388, "Member 'ABP_Underbody_01_C::SM_underbody_014' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_02) == 0x000390, "Member 'ABP_Underbody_01_C::SM_underbody_02' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_013) == 0x000398, "Member 'ABP_Underbody_01_C::SM_underbody_013' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_012) == 0x0003A0, "Member 'ABP_Underbody_01_C::SM_underbody_012' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_011) == 0x0003A8, "Member 'ABP_Underbody_01_C::SM_underbody_011' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, SM_underbody_01) == 0x0003B0, "Member 'ABP_Underbody_01_C::SM_underbody_01' has a wrong offset!");
static_assert(offsetof(ABP_Underbody_01_C, DefaultSceneRoot) == 0x0003B8, "Member 'ABP_Underbody_01_C::DefaultSceneRoot' has a wrong offset!");

}

