#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VentiloChild_GR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Ventilo_Child_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VentiloChild_GR.BP_VentiloChild_GR_C
// 0x0048 (0x0358 - 0x0310)
class ABP_VentiloChild_GR_C final : public ABP_Ventilo_Child_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_VentiloChild_GR_C;               // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Metal_Constr_04;                                // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene3;                                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Metal_Constr_03;                                // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene2;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Metal_Constr_01;                                // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene1;                                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Metal_Constr_02;                                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VentiloChild_GR(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VentiloChild_GR_C">();
	}
	static class ABP_VentiloChild_GR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VentiloChild_GR_C>();
	}
};
static_assert(alignof(ABP_VentiloChild_GR_C) == 0x000008, "Wrong alignment on ABP_VentiloChild_GR_C");
static_assert(sizeof(ABP_VentiloChild_GR_C) == 0x000358, "Wrong size on ABP_VentiloChild_GR_C");
static_assert(offsetof(ABP_VentiloChild_GR_C, UberGraphFrame_BP_VentiloChild_GR_C) == 0x000310, "Member 'ABP_VentiloChild_GR_C::UberGraphFrame_BP_VentiloChild_GR_C' has a wrong offset!");
static_assert(offsetof(ABP_VentiloChild_GR_C, SM_Metal_Constr_04) == 0x000318, "Member 'ABP_VentiloChild_GR_C::SM_Metal_Constr_04' has a wrong offset!");
static_assert(offsetof(ABP_VentiloChild_GR_C, Scene3) == 0x000320, "Member 'ABP_VentiloChild_GR_C::Scene3' has a wrong offset!");
static_assert(offsetof(ABP_VentiloChild_GR_C, SM_Metal_Constr_03) == 0x000328, "Member 'ABP_VentiloChild_GR_C::SM_Metal_Constr_03' has a wrong offset!");
static_assert(offsetof(ABP_VentiloChild_GR_C, Scene2) == 0x000330, "Member 'ABP_VentiloChild_GR_C::Scene2' has a wrong offset!");
static_assert(offsetof(ABP_VentiloChild_GR_C, SM_Metal_Constr_01) == 0x000338, "Member 'ABP_VentiloChild_GR_C::SM_Metal_Constr_01' has a wrong offset!");
static_assert(offsetof(ABP_VentiloChild_GR_C, Scene1) == 0x000340, "Member 'ABP_VentiloChild_GR_C::Scene1' has a wrong offset!");
static_assert(offsetof(ABP_VentiloChild_GR_C, SM_Metal_Constr_02) == 0x000348, "Member 'ABP_VentiloChild_GR_C::SM_Metal_Constr_02' has a wrong offset!");
static_assert(offsetof(ABP_VentiloChild_GR_C, Scene) == 0x000350, "Member 'ABP_VentiloChild_GR_C::Scene' has a wrong offset!");

}

