#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ventilo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Ventilo.BP_Ventilo_C.ExecuteUbergraph_BP_Ventilo
// 0x01C8 (0x01C8 - 0x0000)
struct BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D57[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D58[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D59[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5A[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0058(0x0010)(ReferenceParm)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5B[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0088(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5C[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5D[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo) == 0x000008, "Wrong alignment on BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo");
static_assert(sizeof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo) == 0x0001C8, "Wrong size on BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, EntryPoint) == 0x000000, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000008, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, K2Node_DynamicCast_AsBPI_Character) == 0x000030, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000058, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_MakeRotator_ReturnValue) == 0x000068, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000088, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Greater_IntInt_ReturnValue) == 0x000170, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_GetDistanceTo_ReturnValue) == 0x000174, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_GetForwardVector_ReturnValue) == 0x000178, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_MapRangeClamped_ReturnValue) == 0x000190, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000198, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001B0, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0001B8, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x0001C0, "Member 'BP_Ventilo_C_ExecuteUbergraph_BP_Ventilo::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");

// Function BP_Ventilo.BP_Ventilo_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Ventilo_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ventilo_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Ventilo_C_ReceiveTick");
static_assert(sizeof(BP_Ventilo_C_ReceiveTick) == 0x000004, "Wrong size on BP_Ventilo_C_ReceiveTick");
static_assert(offsetof(BP_Ventilo_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Ventilo_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

