#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_wayFloor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_wayFloor.Bp_wayFloor_C
// 0x0048 (0x02E0 - 0x0298)
class ABp_wayFloor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_4650563543DC14D00DB9BBB800634289; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_4650563543DC14D00DB9BBB800634289; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D14[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitLoc;                                           // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Bp_wayFloor_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_Bp_wayFloor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_wayFloor_C">();
	}
	static class ABp_wayFloor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_wayFloor_C>();
	}
};
static_assert(alignof(ABp_wayFloor_C) == 0x000008, "Wrong alignment on ABp_wayFloor_C");
static_assert(sizeof(ABp_wayFloor_C) == 0x0002E0, "Wrong size on ABp_wayFloor_C");
static_assert(offsetof(ABp_wayFloor_C, UberGraphFrame) == 0x000298, "Member 'ABp_wayFloor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABp_wayFloor_C, Box) == 0x0002A0, "Member 'ABp_wayFloor_C::Box' has a wrong offset!");
static_assert(offsetof(ABp_wayFloor_C, StaticMesh) == 0x0002A8, "Member 'ABp_wayFloor_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABp_wayFloor_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABp_wayFloor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABp_wayFloor_C, Timeline_NewTrack_0_4650563543DC14D00DB9BBB800634289) == 0x0002B8, "Member 'ABp_wayFloor_C::Timeline_NewTrack_0_4650563543DC14D00DB9BBB800634289' has a wrong offset!");
static_assert(offsetof(ABp_wayFloor_C, Timeline__Direction_4650563543DC14D00DB9BBB800634289) == 0x0002BC, "Member 'ABp_wayFloor_C::Timeline__Direction_4650563543DC14D00DB9BBB800634289' has a wrong offset!");
static_assert(offsetof(ABp_wayFloor_C, Timeline) == 0x0002C0, "Member 'ABp_wayFloor_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABp_wayFloor_C, InitLoc) == 0x0002C8, "Member 'ABp_wayFloor_C::InitLoc' has a wrong offset!");

}

