#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Wall_Tomb_01_300_500

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Wall_Tomb_01_300_500.BP_Wall_Tomb_01_300_500_C
// 0x0050 (0x02F8 - 0x02A8)
class ABP_Wall_Tomb_01_300_500_C final : public AStaticMeshActor
{
public:
	class UStaticMeshComponent*                   Cube;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTombBackWall01_var03;                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CeilBeam_01_400_01;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_StoneSquare_01;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StoneTilesFloor01_var04;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StoneTilesFloor01_var03;                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Coffin01_04;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Coffin01_03;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTomb01_var05;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallTombBackWall01_var01;                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Wall_Tomb_01_300_500_C">();
	}
	static class ABP_Wall_Tomb_01_300_500_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Wall_Tomb_01_300_500_C>();
	}
};
static_assert(alignof(ABP_Wall_Tomb_01_300_500_C) == 0x000008, "Wrong alignment on ABP_Wall_Tomb_01_300_500_C");
static_assert(sizeof(ABP_Wall_Tomb_01_300_500_C) == 0x0002F8, "Wrong size on ABP_Wall_Tomb_01_300_500_C");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, Cube) == 0x0002A8, "Member 'ABP_Wall_Tomb_01_300_500_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, WallTombBackWall01_var03) == 0x0002B0, "Member 'ABP_Wall_Tomb_01_300_500_C::WallTombBackWall01_var03' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, SM_CeilBeam_01_400_01) == 0x0002B8, "Member 'ABP_Wall_Tomb_01_300_500_C::SM_CeilBeam_01_400_01' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, SM_StoneSquare_01) == 0x0002C0, "Member 'ABP_Wall_Tomb_01_300_500_C::SM_StoneSquare_01' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, StoneTilesFloor01_var04) == 0x0002C8, "Member 'ABP_Wall_Tomb_01_300_500_C::StoneTilesFloor01_var04' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, StoneTilesFloor01_var03) == 0x0002D0, "Member 'ABP_Wall_Tomb_01_300_500_C::StoneTilesFloor01_var03' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, Coffin01_04) == 0x0002D8, "Member 'ABP_Wall_Tomb_01_300_500_C::Coffin01_04' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, Coffin01_03) == 0x0002E0, "Member 'ABP_Wall_Tomb_01_300_500_C::Coffin01_03' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, WallTomb01_var05) == 0x0002E8, "Member 'ABP_Wall_Tomb_01_300_500_C::WallTomb01_var05' has a wrong offset!");
static_assert(offsetof(ABP_Wall_Tomb_01_300_500_C, WallTombBackWall01_var01) == 0x0002F0, "Member 'ABP_Wall_Tomb_01_300_500_C::WallTombBackWall01_var01' has a wrong offset!");

}

