#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_OrderButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_OrderButton.BPC_OrderButton_C.CheckEvent
// 0x0001 (0x0001 - 0x0000)
struct BPC_OrderButton_C_CheckEvent final
{
public:
	bool                                          Push;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_OrderButton_C_CheckEvent) == 0x000001, "Wrong alignment on BPC_OrderButton_C_CheckEvent");
static_assert(sizeof(BPC_OrderButton_C_CheckEvent) == 0x000001, "Wrong size on BPC_OrderButton_C_CheckEvent");
static_assert(offsetof(BPC_OrderButton_C_CheckEvent, Push) == 0x000000, "Member 'BPC_OrderButton_C_CheckEvent::Push' has a wrong offset!");

// Function BPC_OrderButton.BPC_OrderButton_C.ExecuteUbergraph_BPC_OrderButton
// 0x0008 (0x0008 - 0x0000)
struct BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Push;                                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton) == 0x000004, "Wrong alignment on BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton");
static_assert(sizeof(BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton) == 0x000008, "Wrong size on BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton");
static_assert(offsetof(BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton, EntryPoint) == 0x000000, "Member 'BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton, K2Node_Event_Push) == 0x000006, "Member 'BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton::K2Node_Event_Push' has a wrong offset!");
static_assert(offsetof(BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton, Temp_bool_IsClosed_Variable) == 0x000007, "Member 'BPC_OrderButton_C_ExecuteUbergraph_BPC_OrderButton::Temp_bool_IsClosed_Variable' has a wrong offset!");

}

