#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_AsianFan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Ventilo_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_AsianFan.BPC_AsianFan_C
// 0x0020 (0x0308 - 0x02E8)
class ABPC_AsianFan_C final : public ABP_Ventilo_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPC_AsianFan_C;                     // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_C354434F4F842B9693C5EBA65628D869; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C354434F4F842B9693C5EBA65628D869; // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1291[0x3];                                     // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_AsianFan(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_AsianFan_C">();
	}
	static class ABPC_AsianFan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPC_AsianFan_C>();
	}
};
static_assert(alignof(ABPC_AsianFan_C) == 0x000008, "Wrong alignment on ABPC_AsianFan_C");
static_assert(sizeof(ABPC_AsianFan_C) == 0x000308, "Wrong size on ABPC_AsianFan_C");
static_assert(offsetof(ABPC_AsianFan_C, UberGraphFrame_BPC_AsianFan_C) == 0x0002E8, "Member 'ABPC_AsianFan_C::UberGraphFrame_BPC_AsianFan_C' has a wrong offset!");
static_assert(offsetof(ABPC_AsianFan_C, ParticleSystem) == 0x0002F0, "Member 'ABPC_AsianFan_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABPC_AsianFan_C, Timeline_0_NewTrack_0_C354434F4F842B9693C5EBA65628D869) == 0x0002F8, "Member 'ABPC_AsianFan_C::Timeline_0_NewTrack_0_C354434F4F842B9693C5EBA65628D869' has a wrong offset!");
static_assert(offsetof(ABPC_AsianFan_C, Timeline_0__Direction_C354434F4F842B9693C5EBA65628D869) == 0x0002FC, "Member 'ABPC_AsianFan_C::Timeline_0__Direction_C354434F4F842B9693C5EBA65628D869' has a wrong offset!");
static_assert(offsetof(ABPC_AsianFan_C, Timeline_0) == 0x000300, "Member 'ABPC_AsianFan_C::Timeline_0' has a wrong offset!");

}

