#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TubeWaterVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPC_TubeWaterVolume.BPC_TubeWaterVolume_C.BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37F1[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BPC_TubeWaterVolume.BPC_TubeWaterVolume_C.BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BPC_TubeWaterVolume_C_BndEvt__BPC_TubeWaterVolume_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BPC_TubeWaterVolume.BPC_TubeWaterVolume_C.ExecuteUbergraph_BPC_TubeWaterVolume
// 0x0130 (0x0130 - 0x0000)
struct BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37F2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37F3[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37F4[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume) == 0x000008, "Wrong alignment on BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume");
static_assert(sizeof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume) == 0x000130, "Wrong size on BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, EntryPoint) == 0x000000, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000028, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000030, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000038, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000040, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'BPC_TubeWaterVolume_C_ExecuteUbergraph_BPC_TubeWaterVolume::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");

}

