#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Statut

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_Statut.BPC_Statut_C.CheckAllStatus
// 0x0038 (0x0038 - 0x0000)
struct BPC_Statut_C_CheckAllStatus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C6D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABPC_Statut_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C6E[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPC_Statut_C*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Statut_C_CheckAllStatus) == 0x000008, "Wrong alignment on BPC_Statut_C_CheckAllStatus");
static_assert(sizeof(BPC_Statut_C_CheckAllStatus) == 0x000038, "Wrong size on BPC_Statut_C_CheckAllStatus");
static_assert(offsetof(BPC_Statut_C_CheckAllStatus, ReturnValue) == 0x000000, "Member 'BPC_Statut_C_CheckAllStatus::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_CheckAllStatus, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BPC_Statut_C_CheckAllStatus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_CheckAllStatus, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BPC_Statut_C_CheckAllStatus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_CheckAllStatus, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BPC_Statut_C_CheckAllStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_CheckAllStatus, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BPC_Statut_C_CheckAllStatus::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_CheckAllStatus, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BPC_Statut_C_CheckAllStatus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_CheckAllStatus, CallFunc_Array_Get_Item) == 0x000028, "Member 'BPC_Statut_C_CheckAllStatus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_CheckAllStatus, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BPC_Statut_C_CheckAllStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_Statut.BPC_Statut_C.ExecuteUbergraph_BPC_Statut
// 0x0060 (0x0060 - 0x0000)
struct BPC_Statut_C_ExecuteUbergraph_BPC_Statut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C6F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ButtonEvent_C>    CallFunc_Pushed_self_CastInput;                    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAllStatus_ReturnValue;               // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut) == 0x000008, "Wrong alignment on BPC_Statut_C_ExecuteUbergraph_BPC_Statut");
static_assert(sizeof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut) == 0x000060, "Wrong size on BPC_Statut_C_ExecuteUbergraph_BPC_Statut");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, EntryPoint) == 0x000000, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, CallFunc_Pushed_self_CastInput) == 0x000008, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::CallFunc_Pushed_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, Temp_bool_Has_Been_Initd_Variable_1) == 0x000019, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, CallFunc_HasAuthority_ReturnValue) == 0x00001A, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, CallFunc_HasAuthority_ReturnValue_1) == 0x00001B, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, CallFunc_GetForwardVector_ReturnValue_1) == 0x000038, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, CallFunc_Dot_VectorVector_ReturnValue) == 0x000050, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, Temp_bool_IsClosed_Variable_1) == 0x000059, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_ExecuteUbergraph_BPC_Statut, CallFunc_CheckAllStatus_ReturnValue) == 0x00005A, "Member 'BPC_Statut_C_ExecuteUbergraph_BPC_Statut::CallFunc_CheckAllStatus_ReturnValue' has a wrong offset!");

// Function BPC_Statut.BPC_Statut_C.GetBoxArray
// 0x0020 (0x0020 - 0x0000)
struct BPC_Statut_C_GetBoxArray final
{
public:
	TArray<class UBoxComponent*>                  Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UBoxComponent*>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BPC_Statut_C_GetBoxArray) == 0x000008, "Wrong alignment on BPC_Statut_C_GetBoxArray");
static_assert(sizeof(BPC_Statut_C_GetBoxArray) == 0x000020, "Wrong size on BPC_Statut_C_GetBoxArray");
static_assert(offsetof(BPC_Statut_C_GetBoxArray, Array) == 0x000000, "Member 'BPC_Statut_C_GetBoxArray::Array' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_GetBoxArray, K2Node_MakeArray_Array) == 0x000010, "Member 'BPC_Statut_C_GetBoxArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function BPC_Statut.BPC_Statut_C.GetLeftBoxes
// 0x0020 (0x0020 - 0x0000)
struct BPC_Statut_C_GetLeftBoxes final
{
public:
	TArray<class UBoxComponent*>                  Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UBoxComponent*>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BPC_Statut_C_GetLeftBoxes) == 0x000008, "Wrong alignment on BPC_Statut_C_GetLeftBoxes");
static_assert(sizeof(BPC_Statut_C_GetLeftBoxes) == 0x000020, "Wrong size on BPC_Statut_C_GetLeftBoxes");
static_assert(offsetof(BPC_Statut_C_GetLeftBoxes, Array) == 0x000000, "Member 'BPC_Statut_C_GetLeftBoxes::Array' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_GetLeftBoxes, K2Node_MakeArray_Array) == 0x000010, "Member 'BPC_Statut_C_GetLeftBoxes::K2Node_MakeArray_Array' has a wrong offset!");

// Function BPC_Statut.BPC_Statut_C.GetRightBoxes
// 0x0020 (0x0020 - 0x0000)
struct BPC_Statut_C_GetRightBoxes final
{
public:
	TArray<class UBoxComponent*>                  Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UBoxComponent*>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BPC_Statut_C_GetRightBoxes) == 0x000008, "Wrong alignment on BPC_Statut_C_GetRightBoxes");
static_assert(sizeof(BPC_Statut_C_GetRightBoxes) == 0x000020, "Wrong size on BPC_Statut_C_GetRightBoxes");
static_assert(offsetof(BPC_Statut_C_GetRightBoxes, Array) == 0x000000, "Member 'BPC_Statut_C_GetRightBoxes::Array' has a wrong offset!");
static_assert(offsetof(BPC_Statut_C_GetRightBoxes, K2Node_MakeArray_Array) == 0x000010, "Member 'BPC_Statut_C_GetRightBoxes::K2Node_MakeArray_Array' has a wrong offset!");

// Function BPC_Statut.BPC_Statut_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_Statut_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Statut_C_ReceiveTick) == 0x000004, "Wrong alignment on BPC_Statut_C_ReceiveTick");
static_assert(sizeof(BPC_Statut_C_ReceiveTick) == 0x000004, "Wrong size on BPC_Statut_C_ReceiveTick");
static_assert(offsetof(BPC_Statut_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPC_Statut_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

