#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Woman02

#include "Basic.hpp"

#include "E_ChoosenChar_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_Woman02.BPC_Woman02_C.ExecuteUbergraph_BPC_Woman02
// 0x0020 (0x0020 - 0x0000)
struct BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChristian_ALS_AnimBP_C*                K2Node_DynamicCast_AsChristian_ALS_Anim_BP;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02) == 0x000008, "Wrong alignment on BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02");
static_assert(sizeof(BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02) == 0x000020, "Wrong size on BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02");
static_assert(offsetof(BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02, EntryPoint) == 0x000000, "Member 'BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02, K2Node_DynamicCast_AsChristian_ALS_Anim_BP) == 0x000010, "Member 'BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02::K2Node_DynamicCast_AsChristian_ALS_Anim_BP' has a wrong offset!");
static_assert(offsetof(BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_Woman02_C_ExecuteUbergraph_BPC_Woman02::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_Woman02.BPC_Woman02_C.AddClothes
// 0x0018 (0x0018 - 0x0000)
struct BPC_Woman02_C_AddClothes final
{
public:
	struct FLinearColor                           CallFunc_GetCharacterColor_Color;                  // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Woman02_C_AddClothes) == 0x000008, "Wrong alignment on BPC_Woman02_C_AddClothes");
static_assert(sizeof(BPC_Woman02_C_AddClothes) == 0x000018, "Wrong size on BPC_Woman02_C_AddClothes");
static_assert(offsetof(BPC_Woman02_C_AddClothes, CallFunc_GetCharacterColor_Color) == 0x000000, "Member 'BPC_Woman02_C_AddClothes::CallFunc_GetCharacterColor_Color' has a wrong offset!");
static_assert(offsetof(BPC_Woman02_C_AddClothes, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BPC_Woman02_C_AddClothes::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BPC_Woman02.BPC_Woman02_C.GetCharacter
// 0x0001 (0x0001 - 0x0000)
struct BPC_Woman02_C_GetCharacter final
{
public:
	E_ChoosenChar                                 Character;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Woman02_C_GetCharacter) == 0x000001, "Wrong alignment on BPC_Woman02_C_GetCharacter");
static_assert(sizeof(BPC_Woman02_C_GetCharacter) == 0x000001, "Wrong size on BPC_Woman02_C_GetCharacter");
static_assert(offsetof(BPC_Woman02_C_GetCharacter, Character) == 0x000000, "Member 'BPC_Woman02_C_GetCharacter::Character' has a wrong offset!");

}

