#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ModernMale

#include "Basic.hpp"

#include "E_ChoosenChar_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_ModernMale.BPC_ModernMale_C.AddClothes
// 0x0010 (0x0010 - 0x0000)
struct BPC_ModernMale_C_AddClothes final
{
public:
	struct FLinearColor                           CallFunc_GetCharacterColor_Color;                  // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_ModernMale_C_AddClothes) == 0x000004, "Wrong alignment on BPC_ModernMale_C_AddClothes");
static_assert(sizeof(BPC_ModernMale_C_AddClothes) == 0x000010, "Wrong size on BPC_ModernMale_C_AddClothes");
static_assert(offsetof(BPC_ModernMale_C_AddClothes, CallFunc_GetCharacterColor_Color) == 0x000000, "Member 'BPC_ModernMale_C_AddClothes::CallFunc_GetCharacterColor_Color' has a wrong offset!");

// Function BPC_ModernMale.BPC_ModernMale_C.GetCharacter
// 0x0001 (0x0001 - 0x0000)
struct BPC_ModernMale_C_GetCharacter final
{
public:
	E_ChoosenChar                                 Character;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_ModernMale_C_GetCharacter) == 0x000001, "Wrong alignment on BPC_ModernMale_C_GetCharacter");
static_assert(sizeof(BPC_ModernMale_C_GetCharacter) == 0x000001, "Wrong size on BPC_ModernMale_C_GetCharacter");
static_assert(offsetof(BPC_ModernMale_C_GetCharacter, Character) == 0x000000, "Member 'BPC_ModernMale_C_GetCharacter::Character' has a wrong offset!");

}

