#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ModButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_ModButton.BPI_ModButton_C.Trigger
// 0x0018 (0x0018 - 0x0000)
struct BPI_ModButton_C_Trigger final
{
public:
	bool                                          Start;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ModButton_C_Trigger) == 0x000008, "Wrong alignment on BPI_ModButton_C_Trigger");
static_assert(sizeof(BPI_ModButton_C_Trigger) == 0x000018, "Wrong size on BPI_ModButton_C_Trigger");
static_assert(offsetof(BPI_ModButton_C_Trigger, Start) == 0x000000, "Member 'BPI_ModButton_C_Trigger::Start' has a wrong offset!");
static_assert(offsetof(BPI_ModButton_C_Trigger, Actor) == 0x000008, "Member 'BPI_ModButton_C_Trigger::Actor' has a wrong offset!");
static_assert(offsetof(BPI_ModButton_C_Trigger, Duration) == 0x000010, "Member 'BPI_ModButton_C_Trigger::Duration' has a wrong offset!");

}

