#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_LobbyCharacter

#include "Basic.hpp"

#include "E_ChoosenChar_structs.hpp"


namespace SDK::Params
{

// Function BPI_LobbyCharacter.BPI_LobbyCharacter_C.SetAffectedPS
// 0x0008 (0x0008 - 0x0000)
struct BPI_LobbyCharacter_C_SetAffectedPS final
{
public:
	class APlayerState*                           Ps;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_LobbyCharacter_C_SetAffectedPS) == 0x000008, "Wrong alignment on BPI_LobbyCharacter_C_SetAffectedPS");
static_assert(sizeof(BPI_LobbyCharacter_C_SetAffectedPS) == 0x000008, "Wrong size on BPI_LobbyCharacter_C_SetAffectedPS");
static_assert(offsetof(BPI_LobbyCharacter_C_SetAffectedPS, Ps) == 0x000000, "Member 'BPI_LobbyCharacter_C_SetAffectedPS::Ps' has a wrong offset!");

// Function BPI_LobbyCharacter.BPI_LobbyCharacter_C.SetChosenChar
// 0x0001 (0x0001 - 0x0000)
struct BPI_LobbyCharacter_C_SetChosenChar final
{
public:
	E_ChoosenChar                                 ChosenChar;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_LobbyCharacter_C_SetChosenChar) == 0x000001, "Wrong alignment on BPI_LobbyCharacter_C_SetChosenChar");
static_assert(sizeof(BPI_LobbyCharacter_C_SetChosenChar) == 0x000001, "Wrong size on BPI_LobbyCharacter_C_SetChosenChar");
static_assert(offsetof(BPI_LobbyCharacter_C_SetChosenChar, ChosenChar) == 0x000000, "Member 'BPI_LobbyCharacter_C_SetChosenChar::ChosenChar' has a wrong offset!");

}

