#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_PivotAction

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_PivotAction.BPI_PivotAction_C.GetPivotAlpha
// 0x0008 (0x0008 - 0x0000)
struct BPI_PivotAction_C_GetPivotAlpha final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PivotAction_C_GetPivotAlpha) == 0x000008, "Wrong alignment on BPI_PivotAction_C_GetPivotAlpha");
static_assert(sizeof(BPI_PivotAction_C_GetPivotAlpha) == 0x000008, "Wrong size on BPI_PivotAction_C_GetPivotAlpha");
static_assert(offsetof(BPI_PivotAction_C_GetPivotAlpha, Alpha) == 0x000000, "Member 'BPI_PivotAction_C_GetPivotAlpha::Alpha' has a wrong offset!");

// Function BPI_PivotAction.BPI_PivotAction_C.OnPivot
// 0x0008 (0x0008 - 0x0000)
struct BPI_PivotAction_C_OnPivot final
{
public:
	double                                        Axis;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PivotAction_C_OnPivot) == 0x000008, "Wrong alignment on BPI_PivotAction_C_OnPivot");
static_assert(sizeof(BPI_PivotAction_C_OnPivot) == 0x000008, "Wrong size on BPI_PivotAction_C_OnPivot");
static_assert(offsetof(BPI_PivotAction_C_OnPivot, Axis) == 0x000000, "Member 'BPI_PivotAction_C_OnPivot::Axis' has a wrong offset!");

}

