#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ChainAttachment

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_ChainAttachment.BPI_ChainAttachment_C.GetAttachedComponent
// 0x0008 (0x0008 - 0x0000)
struct BPI_ChainAttachment_C_GetAttachedComponent final
{
public:
	class UPrimitiveComponent*                    Comp;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ChainAttachment_C_GetAttachedComponent) == 0x000008, "Wrong alignment on BPI_ChainAttachment_C_GetAttachedComponent");
static_assert(sizeof(BPI_ChainAttachment_C_GetAttachedComponent) == 0x000008, "Wrong size on BPI_ChainAttachment_C_GetAttachedComponent");
static_assert(offsetof(BPI_ChainAttachment_C_GetAttachedComponent, Comp) == 0x000000, "Member 'BPI_ChainAttachment_C_GetAttachedComponent::Comp' has a wrong offset!");

// Function BPI_ChainAttachment.BPI_ChainAttachment_C.GetCosmeticSocket
// 0x0008 (0x0008 - 0x0000)
struct BPI_ChainAttachment_C_GetCosmeticSocket final
{
public:
	class UPrimitiveComponent*                    Comp;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ChainAttachment_C_GetCosmeticSocket) == 0x000008, "Wrong alignment on BPI_ChainAttachment_C_GetCosmeticSocket");
static_assert(sizeof(BPI_ChainAttachment_C_GetCosmeticSocket) == 0x000008, "Wrong size on BPI_ChainAttachment_C_GetCosmeticSocket");
static_assert(offsetof(BPI_ChainAttachment_C_GetCosmeticSocket, Comp) == 0x000000, "Member 'BPI_ChainAttachment_C_GetCosmeticSocket::Comp' has a wrong offset!");

}

