#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Trampoline

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Trampoline.BPI_Trampoline_C.GetBounceForce
// 0x0008 (0x0008 - 0x0000)
struct BPI_Trampoline_C_GetBounceForce final
{
public:
	double                                        Force;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Trampoline_C_GetBounceForce) == 0x000008, "Wrong alignment on BPI_Trampoline_C_GetBounceForce");
static_assert(sizeof(BPI_Trampoline_C_GetBounceForce) == 0x000008, "Wrong size on BPI_Trampoline_C_GetBounceForce");
static_assert(offsetof(BPI_Trampoline_C_GetBounceForce, Force) == 0x000000, "Member 'BPI_Trampoline_C_GetBounceForce::Force' has a wrong offset!");

// Function BPI_Trampoline.BPI_Trampoline_C.JustZImpulse
// 0x0001 (0x0001 - 0x0000)
struct BPI_Trampoline_C_JustZImpulse final
{
public:
	bool                                          JustZ;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Trampoline_C_JustZImpulse) == 0x000001, "Wrong alignment on BPI_Trampoline_C_JustZImpulse");
static_assert(sizeof(BPI_Trampoline_C_JustZImpulse) == 0x000001, "Wrong size on BPI_Trampoline_C_JustZImpulse");
static_assert(offsetof(BPI_Trampoline_C_JustZImpulse, JustZ) == 0x000000, "Member 'BPI_Trampoline_C_JustZImpulse::JustZ' has a wrong offset!");

}

