#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPT_Helico

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPT_Helico.BPT_Helico_C.ExecuteUbergraph_BPT_Helico
// 0x0220 (0x0220 - 0x0000)
struct BPT_Helico_C_ExecuteUbergraph_BPT_Helico final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0040(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x0128(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico) == 0x000008, "Wrong alignment on BPT_Helico_C_ExecuteUbergraph_BPT_Helico");
static_assert(sizeof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico) == 0x000220, "Wrong size on BPT_Helico_C_ExecuteUbergraph_BPT_Helico");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, EntryPoint) == 0x000000, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, CallFunc_MakeRotator_ReturnValue_1) == 0x000028, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000040, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x000128, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000210, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000218, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPT_Helico_C_ExecuteUbergraph_BPT_Helico, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00021C, "Member 'BPT_Helico_C_ExecuteUbergraph_BPT_Helico::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BPT_Helico.BPT_Helico_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPT_Helico_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPT_Helico_C_ReceiveTick) == 0x000004, "Wrong alignment on BPT_Helico_C_ReceiveTick");
static_assert(sizeof(BPT_Helico_C_ReceiveTick) == 0x000004, "Wrong size on BPT_Helico_C_ReceiveTick");
static_assert(offsetof(BPT_Helico_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPT_Helico_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

