#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPT_Drone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPT_Drone.BPT_Drone_C.ExecuteUbergraph_BPT_Drone
// 0x0228 (0x0228 - 0x0000)
struct BPT_Drone_C_ExecuteUbergraph_BPT_Drone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x0130(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone) == 0x000008, "Wrong alignment on BPT_Drone_C_ExecuteUbergraph_BPT_Drone");
static_assert(sizeof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone) == 0x000228, "Wrong size on BPT_Drone_C_ExecuteUbergraph_BPT_Drone");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, EntryPoint) == 0x000000, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000030, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_MakeRotator_ReturnValue_1) == 0x000118, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x000130, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000218, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000220, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPT_Drone_C_ExecuteUbergraph_BPT_Drone, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x000224, "Member 'BPT_Drone_C_ExecuteUbergraph_BPT_Drone::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");

// Function BPT_Drone.BPT_Drone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPT_Drone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPT_Drone_C_ReceiveTick) == 0x000004, "Wrong alignment on BPT_Drone_C_ReceiveTick");
static_assert(sizeof(BPT_Drone_C_ReceiveTick) == 0x000004, "Wrong size on BPT_Drone_C_ReceiveTick");
static_assert(offsetof(BPT_Drone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPT_Drone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

