#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrasierTemple_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BrasierTemple_BP.BrasierTemple_BP_C
// 0x0028 (0x02C0 - 0x0298)
class ABrasierTemple_BP_C final : public AActor
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Light_On;                                          // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BrasierTemple_BP_C">();
	}
	static class ABrasierTemple_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABrasierTemple_BP_C>();
	}
};
static_assert(alignof(ABrasierTemple_BP_C) == 0x000008, "Wrong alignment on ABrasierTemple_BP_C");
static_assert(sizeof(ABrasierTemple_BP_C) == 0x0002C0, "Wrong size on ABrasierTemple_BP_C");
static_assert(offsetof(ABrasierTemple_BP_C, PointLight) == 0x000298, "Member 'ABrasierTemple_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABrasierTemple_BP_C, ParticleSystem) == 0x0002A0, "Member 'ABrasierTemple_BP_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABrasierTemple_BP_C, StaticMesh) == 0x0002A8, "Member 'ABrasierTemple_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABrasierTemple_BP_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABrasierTemple_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABrasierTemple_BP_C, Light_On) == 0x0002B8, "Member 'ABrasierTemple_BP_C::Light_On' has a wrong offset!");

}

