#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bridge_Spline_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Bridge_Spline_BP.Bridge_Spline_BP_C.AdaptSplineMesh
// 0x0108 (0x0108 - 0x0000)
struct Bridge_Spline_BP_C_AdaptSplineMesh final
{
public:
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D5[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D6[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default;                             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D7[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bridge_Spline_BP_C_AdaptSplineMesh) == 0x000008, "Wrong alignment on Bridge_Spline_BP_C_AdaptSplineMesh");
static_assert(sizeof(Bridge_Spline_BP_C_AdaptSplineMesh) == 0x000108, "Wrong size on Bridge_Spline_BP_C_AdaptSplineMesh");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, SplineMeshComponent) == 0x000000, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::SplineMeshComponent' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, Param_Index) == 0x000008, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::Param_Index' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000010, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, Temp_byte_Variable) == 0x000018, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000020, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000028, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_ClampVectorSize_ReturnValue) == 0x000040, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000058, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x000088, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x0000A0, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_ClampVectorSize_ReturnValue_1) == 0x0000B8, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_ClampVectorSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, Temp_byte_Variable_1) == 0x0000D0, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000D8, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, Temp_bool_Variable) == 0x0000F0, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, K2Node_Select_Default) == 0x0000F1, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0000F4, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0000F8, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0000FC, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_AdaptSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000100, "Member 'Bridge_Spline_BP_C_AdaptSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");

// Function Bridge_Spline_BP.Bridge_Spline_BP_C.RandomMesh
// 0x0028 (0x0028 - 0x0000)
struct Bridge_Spline_BP_C_RandomMesh final
{
public:
	class UStaticMesh*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeightFromStream_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D8[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bridge_Spline_BP_C_RandomMesh) == 0x000008, "Wrong alignment on Bridge_Spline_BP_C_RandomMesh");
static_assert(sizeof(Bridge_Spline_BP_C_RandomMesh) == 0x000028, "Wrong size on Bridge_Spline_BP_C_RandomMesh");
static_assert(offsetof(Bridge_Spline_BP_C_RandomMesh, ReturnValue) == 0x000000, "Member 'Bridge_Spline_BP_C_RandomMesh::ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_RandomMesh, Temp_bool_Variable) == 0x000008, "Member 'Bridge_Spline_BP_C_RandomMesh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_RandomMesh, CallFunc_RandomBoolWithWeightFromStream_ReturnValue) == 0x000009, "Member 'Bridge_Spline_BP_C_RandomMesh::CallFunc_RandomBoolWithWeightFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_RandomMesh, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'Bridge_Spline_BP_C_RandomMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_RandomMesh, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'Bridge_Spline_BP_C_RandomMesh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_RandomMesh, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x000014, "Member 'Bridge_Spline_BP_C_RandomMesh::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_RandomMesh, CallFunc_Array_Get_Item) == 0x000018, "Member 'Bridge_Spline_BP_C_RandomMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_RandomMesh, K2Node_Select_Default) == 0x000020, "Member 'Bridge_Spline_BP_C_RandomMesh::K2Node_Select_Default' has a wrong offset!");

// Function Bridge_Spline_BP.Bridge_Spline_BP_C.UserConstructionScript
// 0x0170 (0x0170 - 0x0000)
struct Bridge_Spline_BP_C_UserConstructionScript final
{
public:
	class UStaticMesh*                            EmptyRoadMesh;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SelectedRandomMesh;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37DA[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37DB[0x1];                                     // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37DC[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37DD[0x1];                                     // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_RandomMesh_ReturnValue;                   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37DE[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37DF[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37E0[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x00E0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37E1[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37E2[0x2];                                     // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37E3[0x5];                                     // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bridge_Spline_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on Bridge_Spline_BP_C_UserConstructionScript");
static_assert(sizeof(Bridge_Spline_BP_C_UserConstructionScript) == 0x000170, "Wrong size on Bridge_Spline_BP_C_UserConstructionScript");
static_assert(offsetof(Bridge_Spline_BP_C_UserConstructionScript, EmptyRoadMesh) == 0x000000, "Member 'Bridge_Spline_BP_C_UserConstructionScript::EmptyRoadMesh' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_UserConstructionScript, SelectedRandomMesh) == 0x000008, "Member 'Bridge_Spline_BP_C_UserConstructionScript::SelectedRandomMesh' has a wrong offset!");
static_assert(offsetof(Bridge_Spline_BP_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Bridge_Spline_BP_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
