#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrowseUGCLevel_W

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SteamCorePro_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BrowseUGCLevel_W.BrowseUGCLevel_W_C
// 0x0120 (0x03E0 - 0x02C0)
class UBrowseUGCLevel_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_82;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxString_75;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Down_Button;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageNumber_Text;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Search_HorizontalBox;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               UGC_WrapBox;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Up_Button;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSteamUGCDetails                       Details;                                           // 0x0308(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	EOrientation                                  Orientation;                                       // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CreateGame;                                        // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUGCQueryHandle                        UGCRequest;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         Page;                                              // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamUGCQuery                                QueryType;                                         // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Options;                                           // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         In_Height_Override;                                // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Add_UGC_Items(const struct FUGCQueryHandle& HandleIn);
	void AddSpacesBeforeUpperLetters(const class FString& SourceString, class FString* StringOut);
	void BndEvt__BrowseUGCLevel_W_Button_82_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BrowseUGCLevel_W_ComboBoxString_75_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__BrowseUGCLevel_W_Down_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BrowseUGCLevel_W_Up_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BrowseUGCLevel_W(int32 EntryPoint);
	void FindQueryTypeByString(const class FString& Query_String, ESteamUGCQuery* Query);
	void OnCallback_080A699F435ABCA73E2C70B014FD3C73(const struct FSteamUGCQueryCompleted& Data, bool bWasSuccessful);
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BrowseUGCLevel_W_C">();
	}
	static class UBrowseUGCLevel_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrowseUGCLevel_W_C>();
	}
};
static_assert(alignof(UBrowseUGCLevel_W_C) == 0x000008, "Wrong alignment on UBrowseUGCLevel_W_C");
static_assert(sizeof(UBrowseUGCLevel_W_C) == 0x0003E0, "Wrong size on UBrowseUGCLevel_W_C");
static_assert(offsetof(UBrowseUGCLevel_W_C, UberGraphFrame) == 0x0002C0, "Member 'UBrowseUGCLevel_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, Button_82) == 0x0002C8, "Member 'UBrowseUGCLevel_W_C::Button_82' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, ComboBoxString_75) == 0x0002D0, "Member 'UBrowseUGCLevel_W_C::ComboBoxString_75' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, Down_Button) == 0x0002D8, "Member 'UBrowseUGCLevel_W_C::Down_Button' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, PageNumber_Text) == 0x0002E0, "Member 'UBrowseUGCLevel_W_C::PageNumber_Text' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, Search_HorizontalBox) == 0x0002E8, "Member 'UBrowseUGCLevel_W_C::Search_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, SizeBox_0) == 0x0002F0, "Member 'UBrowseUGCLevel_W_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, UGC_WrapBox) == 0x0002F8, "Member 'UBrowseUGCLevel_W_C::UGC_WrapBox' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, Up_Button) == 0x000300, "Member 'UBrowseUGCLevel_W_C::Up_Button' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, Details) == 0x000308, "Member 'UBrowseUGCLevel_W_C::Details' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, Orientation) == 0x0003B0, "Member 'UBrowseUGCLevel_W_C::Orientation' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, CreateGame) == 0x0003B1, "Member 'UBrowseUGCLevel_W_C::CreateGame' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, UGCRequest) == 0x0003B8, "Member 'UBrowseUGCLevel_W_C::UGCRequest' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, Page) == 0x0003C0, "Member 'UBrowseUGCLevel_W_C::Page' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, QueryType) == 0x0003C4, "Member 'UBrowseUGCLevel_W_C::QueryType' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, Options) == 0x0003C8, "Member 'UBrowseUGCLevel_W_C::Options' has a wrong offset!");
static_assert(offsetof(UBrowseUGCLevel_W_C, In_Height_Override) == 0x0003D8, "Member 'UBrowseUGCLevel_W_C::In_Height_Override' has a wrong offset!");

}

