#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrowseLocalLevels_W

#include "Basic.hpp"

#include "IGLE_ST_GlobalSettings_structs.hpp"


namespace SDK::Params
{

// Function BrowseLocalLevels_W.BrowseLocalLevels_W_C.ExecuteUbergraph_BrowseLocalLevels_W
// 0x0368 (0x0368 - 0x0000)
struct BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLE_ST_GlobalSettings                CallFunc_IGLE_GetGlobalSettings_Settings;          // 0x0008(0x0088)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A0(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00B8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x00D0(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FIGLE_ST_GlobalSettings                CallFunc_IGLE_GetGlobalSettings_Settings_1;        // 0x0120(0x0088)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_IGLE_GetAllSubdirectories_ReturnValue;    // 0x01C8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FIGLE_ST_GlobalSettings                CallFunc_IGLE_GetGlobalSettings_Settings_2;        // 0x0200(0x0088)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_IGLE_GetFilesWithExtension_ReturnValue;   // 0x0298(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCleanFilename_ReturnValue;             // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalLevelSlot_W_C*                    CallFunc_Create_ReturnValue;                       // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 K2Node_MakeArray_Array;                            // 0x0320(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_GetProjectDirectory_ReturnValue;          // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ConvertRelativePathToFull_ReturnValue;    // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W) == 0x000008, "Wrong alignment on BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W");
static_assert(sizeof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W) == 0x000368, "Wrong size on BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, EntryPoint) == 0x000000, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_IGLE_GetGlobalSettings_Settings) == 0x000008, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_IGLE_GetGlobalSettings_Settings' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, Temp_int_Array_Index_Variable) == 0x000090, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, Temp_int_Array_Index_Variable_1) == 0x00009C, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_MakeLiteralText_ReturnValue) == 0x0000A0, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_GetText_ReturnValue) == 0x0000B8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_GetText_ReturnValue_1) == 0x0000D0, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0000E8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F0, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Concat_StrStr_ReturnValue) == 0x000100, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000110, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_IGLE_GetGlobalSettings_Settings_1) == 0x000120, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_IGLE_GetGlobalSettings_Settings_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001A8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001B8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_IGLE_GetAllSubdirectories_ReturnValue) == 0x0001C8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_IGLE_GetAllSubdirectories_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Array_Length_ReturnValue) == 0x0001E8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001F0, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_IGLE_GetGlobalSettings_Settings_2) == 0x000200, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_IGLE_GetGlobalSettings_Settings_2' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000288, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_IGLE_GetFilesWithExtension_ReturnValue) == 0x000298, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_IGLE_GetFilesWithExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Array_Get_Item_1) == 0x0002A8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Array_Length_ReturnValue_1) == 0x0002B8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_GetCleanFilename_ReturnValue) == 0x0002C0, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_GetCleanFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Less_IntInt_ReturnValue) == 0x0002D0, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0002D8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_GetBaseFilename_ReturnValue) == 0x0002E8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, Temp_int_Loop_Counter_Variable_1) == 0x0002F8, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_GetOwningPlayer_ReturnValue) == 0x000300, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Create_ReturnValue) == 0x000308, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Less_IntInt_ReturnValue_1) == 0x000310, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_Add_IntInt_ReturnValue_1) == 0x000314, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000318, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, K2Node_MakeArray_Array) == 0x000320, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_GetProjectDirectory_ReturnValue) == 0x000330, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_GetProjectDirectory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_GetGameInstance_ReturnValue) == 0x000340, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, CallFunc_ConvertRelativePathToFull_ReturnValue) == 0x000348, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::CallFunc_ConvertRelativePathToFull_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, K2Node_DynamicCast_AsCustom_GI) == 0x000358, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W, K2Node_DynamicCast_bSuccess) == 0x000360, "Member 'BrowseLocalLevels_W_C_ExecuteUbergraph_BrowseLocalLevels_W::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BrowseLocalLevels_W.BrowseLocalLevels_W_C.OpenMainLevel
// 0x0018 (0x0018 - 0x0000)
struct BrowseLocalLevels_W_C_OpenMainLevel final
{
public:
	bool                                          ForEditing_;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PathToCustomLevelFromGameDir;                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BrowseLocalLevels_W_C_OpenMainLevel) == 0x000008, "Wrong alignment on BrowseLocalLevels_W_C_OpenMainLevel");
static_assert(sizeof(BrowseLocalLevels_W_C_OpenMainLevel) == 0x000018, "Wrong size on BrowseLocalLevels_W_C_OpenMainLevel");
static_assert(offsetof(BrowseLocalLevels_W_C_OpenMainLevel, ForEditing_) == 0x000000, "Member 'BrowseLocalLevels_W_C_OpenMainLevel::ForEditing_' has a wrong offset!");
static_assert(offsetof(BrowseLocalLevels_W_C_OpenMainLevel, PathToCustomLevelFromGameDir) == 0x000008, "Member 'BrowseLocalLevels_W_C_OpenMainLevel::PathToCustomLevelFromGameDir' has a wrong offset!");

}

