#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_Billboard_A

#include "Basic.hpp"


namespace SDK::Params
{

// Function BS_Billboard_A.BS_Billboard_A_C.ExecuteUbergraph_BS_Billboard_A
// 0x0018 (0x0018 - 0x0000)
struct BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A) == 0x000008, "Wrong alignment on BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A");
static_assert(sizeof(BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A) == 0x000018, "Wrong size on BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A");
static_assert(offsetof(BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A, EntryPoint) == 0x000000, "Member 'BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A::EntryPoint' has a wrong offset!");
static_assert(offsetof(BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A, CallFunc_Delay_Duration_ImplicitCast) == 0x000010, "Member 'BS_Billboard_A_C_ExecuteUbergraph_BS_Billboard_A::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BS_Billboard_A.BS_Billboard_A_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BS_Billboard_A_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BS_Billboard_A_C_ReceiveTick) == 0x000004, "Wrong alignment on BS_Billboard_A_C_ReceiveTick");
static_assert(sizeof(BS_Billboard_A_C_ReceiveTick) == 0x000004, "Wrong size on BS_Billboard_A_C_ReceiveTick");
static_assert(offsetof(BS_Billboard_A_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BS_Billboard_A_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BS_Billboard_A.BS_Billboard_A_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BS_Billboard_A_C_UserConstructionScript final
{
public:
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F1[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BS_Billboard_A_C_UserConstructionScript) == 0x000008, "Wrong alignment on BS_Billboard_A_C_UserConstructionScript");
static_assert(sizeof(BS_Billboard_A_C_UserConstructionScript) == 0x000020, "Wrong size on BS_Billboard_A_C_UserConstructionScript");
static_assert(offsetof(BS_Billboard_A_C_UserConstructionScript, K2Node_MultiGate_FirstRun) == 0x000000, "Member 'BS_Billboard_A_C_UserConstructionScript::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(BS_Billboard_A_C_UserConstructionScript, K2Node_MultiGate_Data) == 0x000004, "Member 'BS_Billboard_A_C_UserConstructionScript::K2Node_MultiGate_Data' has a wrong offset!");
static_assert(offsetof(BS_Billboard_A_C_UserConstructionScript, K2Node_MultiGate_ScratchBool) == 0x000008, "Member 'BS_Billboard_A_C_UserConstructionScript::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(BS_Billboard_A_C_UserConstructionScript, K2Node_MultiGate_ScratchIndex) == 0x00000C, "Member 'BS_Billboard_A_C_UserConstructionScript::K2Node_MultiGate_ScratchIndex' has a wrong offset!");
static_assert(offsetof(BS_Billboard_A_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BS_Billboard_A_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BS_Billboard_A_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000018, "Member 'BS_Billboard_A_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

