#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_Kiosk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BS_Kiosk.BS_Kiosk_C
// 0x0018 (0x02B0 - 0x0298)
class ABS_Kiosk_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Kiosk;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mat;                                               // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BS_Kiosk(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BS_Kiosk_C">();
	}
	static class ABS_Kiosk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABS_Kiosk_C>();
	}
};
static_assert(alignof(ABS_Kiosk_C) == 0x000008, "Wrong alignment on ABS_Kiosk_C");
static_assert(sizeof(ABS_Kiosk_C) == 0x0002B0, "Wrong size on ABS_Kiosk_C");
static_assert(offsetof(ABS_Kiosk_C, UberGraphFrame) == 0x000298, "Member 'ABS_Kiosk_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABS_Kiosk_C, Kiosk) == 0x0002A0, "Member 'ABS_Kiosk_C::Kiosk' has a wrong offset!");
static_assert(offsetof(ABS_Kiosk_C, Mat) == 0x0002A8, "Member 'ABS_Kiosk_C::Mat' has a wrong offset!");

}

