#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_VentA

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BS_VentA.BS_VentA_C
// 0x0040 (0x02D8 - 0x0298)
class ABS_VentA_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Vent_016;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Vent_015;                                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Vent_014;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Vent_013;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Vent_012;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Vent_011;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Vent_01;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BS_VentA_C">();
	}
	static class ABS_VentA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABS_VentA_C>();
	}
};
static_assert(alignof(ABS_VentA_C) == 0x000008, "Wrong alignment on ABS_VentA_C");
static_assert(sizeof(ABS_VentA_C) == 0x0002D8, "Wrong size on ABS_VentA_C");
static_assert(offsetof(ABS_VentA_C, StaticMesh) == 0x000298, "Member 'ABS_VentA_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABS_VentA_C, Vent_016) == 0x0002A0, "Member 'ABS_VentA_C::Vent_016' has a wrong offset!");
static_assert(offsetof(ABS_VentA_C, Vent_015) == 0x0002A8, "Member 'ABS_VentA_C::Vent_015' has a wrong offset!");
static_assert(offsetof(ABS_VentA_C, Vent_014) == 0x0002B0, "Member 'ABS_VentA_C::Vent_014' has a wrong offset!");
static_assert(offsetof(ABS_VentA_C, Vent_013) == 0x0002B8, "Member 'ABS_VentA_C::Vent_013' has a wrong offset!");
static_assert(offsetof(ABS_VentA_C, Vent_012) == 0x0002C0, "Member 'ABS_VentA_C::Vent_012' has a wrong offset!");
static_assert(offsetof(ABS_VentA_C, Vent_011) == 0x0002C8, "Member 'ABS_VentA_C::Vent_011' has a wrong offset!");
static_assert(offsetof(ABS_VentA_C, Vent_01) == 0x0002D0, "Member 'ABS_VentA_C::Vent_01' has a wrong offset!");

}

