#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: C_TickOptimizer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function C_TickOptimizer.C_TickOptimizer_C.ExecuteUbergraph_C_TickOptimizer
// 0x0080 (0x0080 - 0x0000)
struct C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CEF[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF0[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetActorTickInterval_TickInterval_ImplicitCast; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer) == 0x000008, "Wrong alignment on C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer");
static_assert(sizeof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer) == 0x000080, "Wrong size on C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, EntryPoint) == 0x000000, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::EntryPoint' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_Vector_Distance_ReturnValue) == 0x000050, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_GetOwner_ReturnValue_1) == 0x000058, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_MapRangeClamped_ReturnValue) == 0x000068, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000070, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_SetActorTickInterval_TickInterval_ImplicitCast) == 0x000074, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_SetActorTickInterval_TickInterval_ImplicitCast' has a wrong offset!");
static_assert(offsetof(C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer, CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast) == 0x000078, "Member 'C_TickOptimizer_C_ExecuteUbergraph_C_TickOptimizer::CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast' has a wrong offset!");

// Function C_TickOptimizer.C_TickOptimizer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct C_TickOptimizer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(C_TickOptimizer_C_ReceiveTick) == 0x000004, "Wrong alignment on C_TickOptimizer_C_ReceiveTick");
static_assert(sizeof(C_TickOptimizer_C_ReceiveTick) == 0x000004, "Wrong size on C_TickOptimizer_C_ReceiveTick");
static_assert(offsetof(C_TickOptimizer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'C_TickOptimizer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

