#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: C_VinceSync

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function C_VinceSync.C_VinceSync_C.ExecuteUbergraph_C_VinceSync
// 0x05B0 (0x05B0 - 0x0000)
struct C_VinceSync_C_ExecuteUbergraph_C_VinceSync final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED5[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED6[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED7[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_CustomEvent_ComponentToSync;                // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED8[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x02C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_SyncedLocation_1;               // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_SyncedRotation_1;               // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0398(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_CustomEvent_SyncedLocation;                 // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_SyncedRotation;                 // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x04B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED9[0x3];                                     // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast;         // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync) == 0x000010, "Wrong alignment on C_VinceSync_C_ExecuteUbergraph_C_VinceSync");
static_assert(sizeof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync) == 0x0005B0, "Wrong size on C_VinceSync_C_ExecuteUbergraph_C_VinceSync");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, EntryPoint) == 0x000000, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::EntryPoint' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_IsServer_ReturnValue) == 0x000020, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000028, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000058, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000070, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000078, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_VInterpTo_ReturnValue) == 0x000090, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0000A8, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_RInterpTo_ReturnValue) == 0x0000B0, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000C8, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001B0, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_GetOwner_ReturnValue_2) == 0x000298, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0002A0, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, K2Node_CustomEvent_ComponentToSync) == 0x0002B0, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::K2Node_CustomEvent_ComponentToSync' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0002C0, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_BreakTransform_Location) == 0x000320, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_BreakTransform_Rotation) == 0x000338, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_BreakTransform_Scale) == 0x000350, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, K2Node_CustomEvent_SyncedLocation_1) == 0x000368, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::K2Node_CustomEvent_SyncedLocation_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, K2Node_CustomEvent_SyncedRotation_1) == 0x000380, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::K2Node_CustomEvent_SyncedRotation_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000398, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, K2Node_CustomEvent_SyncedLocation) == 0x000480, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::K2Node_CustomEvent_SyncedLocation' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, K2Node_CustomEvent_SyncedRotation) == 0x000498, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::K2Node_CustomEvent_SyncedRotation' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0004B0, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_IsServer_ReturnValue_1) == 0x000598, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_VInterpTo_DeltaTime_ImplicitCast) == 0x00059C, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_VInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_ExecuteUbergraph_C_VinceSync, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x0005A0, "Member 'C_VinceSync_C_ExecuteUbergraph_C_VinceSync::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function C_VinceSync.C_VinceSync_C.InitSync
// 0x0008 (0x0008 - 0x0000)
struct C_VinceSync_C_InitSync final
{
public:
	class USceneComponent*                        Param_ComponentToSync;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(C_VinceSync_C_InitSync) == 0x000008, "Wrong alignment on C_VinceSync_C_InitSync");
static_assert(sizeof(C_VinceSync_C_InitSync) == 0x000008, "Wrong size on C_VinceSync_C_InitSync");
static_assert(offsetof(C_VinceSync_C_InitSync, Param_ComponentToSync) == 0x000000, "Member 'C_VinceSync_C_InitSync::Param_ComponentToSync' has a wrong offset!");

// Function C_VinceSync.C_VinceSync_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct C_VinceSync_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(C_VinceSync_C_ReceiveTick) == 0x000004, "Wrong alignment on C_VinceSync_C_ReceiveTick");
static_assert(sizeof(C_VinceSync_C_ReceiveTick) == 0x000004, "Wrong size on C_VinceSync_C_ReceiveTick");
static_assert(offsetof(C_VinceSync_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'C_VinceSync_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function C_VinceSync.C_VinceSync_C.SetComponentToSync
// 0x0008 (0x0008 - 0x0000)
struct C_VinceSync_C_SetComponentToSync final
{
public:
	class USceneComponent*                        Param_ComponentToSync;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(C_VinceSync_C_SetComponentToSync) == 0x000008, "Wrong alignment on C_VinceSync_C_SetComponentToSync");
static_assert(sizeof(C_VinceSync_C_SetComponentToSync) == 0x000008, "Wrong size on C_VinceSync_C_SetComponentToSync");
static_assert(offsetof(C_VinceSync_C_SetComponentToSync, Param_ComponentToSync) == 0x000000, "Member 'C_VinceSync_C_SetComponentToSync::Param_ComponentToSync' has a wrong offset!");

// Function C_VinceSync.C_VinceSync_C.Teleport
// 0x0030 (0x0030 - 0x0000)
struct C_VinceSync_C_Teleport final
{
public:
	struct FVector                                Param_SyncedLocation;                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Param_SyncedRotation;                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(C_VinceSync_C_Teleport) == 0x000008, "Wrong alignment on C_VinceSync_C_Teleport");
static_assert(sizeof(C_VinceSync_C_Teleport) == 0x000030, "Wrong size on C_VinceSync_C_Teleport");
static_assert(offsetof(C_VinceSync_C_Teleport, Param_SyncedLocation) == 0x000000, "Member 'C_VinceSync_C_Teleport::Param_SyncedLocation' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_Teleport, Param_SyncedRotation) == 0x000018, "Member 'C_VinceSync_C_Teleport::Param_SyncedRotation' has a wrong offset!");

// Function C_VinceSync.C_VinceSync_C.TeleportAll
// 0x0030 (0x0030 - 0x0000)
struct C_VinceSync_C_TeleportAll final
{
public:
	struct FVector                                Param_SyncedLocation;                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Param_SyncedRotation;                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(C_VinceSync_C_TeleportAll) == 0x000008, "Wrong alignment on C_VinceSync_C_TeleportAll");
static_assert(sizeof(C_VinceSync_C_TeleportAll) == 0x000030, "Wrong size on C_VinceSync_C_TeleportAll");
static_assert(offsetof(C_VinceSync_C_TeleportAll, Param_SyncedLocation) == 0x000000, "Member 'C_VinceSync_C_TeleportAll::Param_SyncedLocation' has a wrong offset!");
static_assert(offsetof(C_VinceSync_C_TeleportAll, Param_SyncedRotation) == 0x000018, "Member 'C_VinceSync_C_TeleportAll::Param_SyncedRotation' has a wrong offset!");

}

