#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraShake_Notify

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraShake_Notify.CameraShake_Notify_C.Received_Notify
// 0x0088 (0x0088 - 0x0000)
struct CameraShake_Notify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E97[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E98[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E99[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9A[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9B[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ClientStartCameraShake_Scale_ImplicitCast; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraShake_Notify_C_Received_Notify) == 0x000008, "Wrong alignment on CameraShake_Notify_C_Received_Notify");
static_assert(sizeof(CameraShake_Notify_C_Received_Notify) == 0x000088, "Wrong size on CameraShake_Notify_C_Received_Notify");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, MeshComp) == 0x000000, "Member 'CameraShake_Notify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, Animation) == 0x000008, "Member 'CameraShake_Notify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, EventReference) == 0x000010, "Member 'CameraShake_Notify_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, ReturnValue) == 0x000040, "Member 'CameraShake_Notify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'CameraShake_Notify_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'CameraShake_Notify_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, K2Node_DynamicCast_AsPawn) == 0x000058, "Member 'CameraShake_Notify_C_Received_Notify::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'CameraShake_Notify_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'CameraShake_Notify_C_Received_Notify::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'CameraShake_Notify_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, K2Node_DynamicCast_AsPlayer_Controller) == 0x000078, "Member 'CameraShake_Notify_C_Received_Notify::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'CameraShake_Notify_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CameraShake_Notify_C_Received_Notify, CallFunc_ClientStartCameraShake_Scale_ImplicitCast) == 0x000084, "Member 'CameraShake_Notify_C_Received_Notify::CallFunc_ClientStartCameraShake_Scale_ImplicitCast' has a wrong offset!");

}

