#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CastShadowsProperty_C

#include "Basic.hpp"

#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function CastShadowsProperty_C.CastShadowsProperty_C_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct CastShadowsProperty_C_C_CustomEvent final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CastShadowsProperty_C_C_CustomEvent) == 0x000008, "Wrong alignment on CastShadowsProperty_C_C_CustomEvent");
static_assert(sizeof(CastShadowsProperty_C_C_CustomEvent) == 0x000010, "Wrong size on CastShadowsProperty_C_C_CustomEvent");
static_assert(offsetof(CastShadowsProperty_C_C_CustomEvent, PropertyName) == 0x000000, "Member 'CastShadowsProperty_C_C_CustomEvent::PropertyName' has a wrong offset!");

// Function CastShadowsProperty_C.CastShadowsProperty_C_C.ExecuteUbergraph_CastShadowsProperty_C
// 0x00E0 (0x00E0 - 0x0000)
struct CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PropertyName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PropertyName;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UIGLE_InterfaceComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FIGLEProperty                          CallFunc_GetPropertyByName_Property;               // 0x0048(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyByName_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_BoolProperty_C*                   K2Node_DynamicCast_AsIGLE_Bool_Property;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C) == 0x000008, "Wrong alignment on CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C");
static_assert(sizeof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C) == 0x0000E0, "Wrong size on CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, EntryPoint) == 0x000000, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::EntryPoint' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, K2Node_CustomEvent_PropertyName) == 0x000030, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::K2Node_CustomEvent_PropertyName' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, CallFunc_GetPropertyByName_Property) == 0x000048, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::CallFunc_GetPropertyByName_Property' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, CallFunc_GetPropertyByName_ReturnValue) == 0x0000C8, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::CallFunc_GetPropertyByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, K2Node_SwitchString_CmpSuccess) == 0x0000C9, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, K2Node_DynamicCast_AsIGLE_Bool_Property) == 0x0000D0, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::K2Node_DynamicCast_AsIGLE_Bool_Property' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'CastShadowsProperty_C_C_ExecuteUbergraph_CastShadowsProperty_C::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CastShadowsProperty_C.CastShadowsProperty_C_C.UpdateShadows
// 0x0040 (0x0040 - 0x0000)
struct CastShadowsProperty_C_C_UpdateShadows final
{
public:
	bool                                          NewCastShadow;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CastShadowsProperty_C_C_UpdateShadows) == 0x000008, "Wrong alignment on CastShadowsProperty_C_C_UpdateShadows");
static_assert(sizeof(CastShadowsProperty_C_C_UpdateShadows) == 0x000040, "Wrong size on CastShadowsProperty_C_C_UpdateShadows");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, NewCastShadow) == 0x000000, "Member 'CastShadowsProperty_C_C_UpdateShadows::NewCastShadow' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CastShadowsProperty_C_C_UpdateShadows::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CastShadowsProperty_C_C_UpdateShadows::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CastShadowsProperty_C_C_UpdateShadows::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'CastShadowsProperty_C_C_UpdateShadows::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'CastShadowsProperty_C_C_UpdateShadows::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'CastShadowsProperty_C_C_UpdateShadows::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, CallFunc_Array_Get_Item) == 0x000030, "Member 'CastShadowsProperty_C_C_UpdateShadows::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CastShadowsProperty_C_C_UpdateShadows, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'CastShadowsProperty_C_C_UpdateShadows::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

