#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChainedTogether

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ChainedTogether.MaterialPickerStruct
// 0x0060 (0x0068 - 0x0008)
struct FMaterialPickerStruct final : public FTableRowBase
{
public:
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      SoftMaterialRef;                                   // 0x0018(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture>                Icon;                                              // 0x0040(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMaterialPickerStruct) == 0x000008, "Wrong alignment on FMaterialPickerStruct");
static_assert(sizeof(FMaterialPickerStruct) == 0x000068, "Wrong size on FMaterialPickerStruct");
static_assert(offsetof(FMaterialPickerStruct, Name) == 0x000008, "Member 'FMaterialPickerStruct::Name' has a wrong offset!");
static_assert(offsetof(FMaterialPickerStruct, SoftMaterialRef) == 0x000018, "Member 'FMaterialPickerStruct::SoftMaterialRef' has a wrong offset!");
static_assert(offsetof(FMaterialPickerStruct, Icon) == 0x000040, "Member 'FMaterialPickerStruct::Icon' has a wrong offset!");

// ScriptStruct ChainedTogether.PickMaterialStruct
// 0x0060 (0x0060 - 0x0000)
struct FPickMaterialStruct final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      SoftMaterialRef;                                   // 0x0010(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture>                Icon;                                              // 0x0038(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPickMaterialStruct) == 0x000008, "Wrong alignment on FPickMaterialStruct");
static_assert(sizeof(FPickMaterialStruct) == 0x000060, "Wrong size on FPickMaterialStruct");
static_assert(offsetof(FPickMaterialStruct, Name) == 0x000000, "Member 'FPickMaterialStruct::Name' has a wrong offset!");
static_assert(offsetof(FPickMaterialStruct, SoftMaterialRef) == 0x000010, "Member 'FPickMaterialStruct::SoftMaterialRef' has a wrong offset!");
static_assert(offsetof(FPickMaterialStruct, Icon) == 0x000038, "Member 'FPickMaterialStruct::Icon' has a wrong offset!");

}

