#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChainedTogether

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class ChainedTogether.DistanceVisibilityBFL
// 0x0000 (0x0028 - 0x0028)
class UDistanceVisibilityBFL final : public UBlueprintFunctionLibrary
{
public:
	static void SetVisibilityBasedOnDistance(class UStaticMeshComponent* TargetMesh, float MaxDistance);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DistanceVisibilityBFL">();
	}
	static class UDistanceVisibilityBFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistanceVisibilityBFL>();
	}
};
static_assert(alignof(UDistanceVisibilityBFL) == 0x000008, "Wrong alignment on UDistanceVisibilityBFL");
static_assert(sizeof(UDistanceVisibilityBFL) == 0x000028, "Wrong size on UDistanceVisibilityBFL");

// Class ChainedTogether.MyCustomWidget
// 0x0008 (0x02C8 - 0x02C0)
class UMyCustomWidget : public UUserWidget
{
public:
	class UInputKeySelector*                      InputKeySelector;                                  // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MyCustomWidget">();
	}
	static class UMyCustomWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyCustomWidget>();
	}
};
static_assert(alignof(UMyCustomWidget) == 0x000008, "Wrong alignment on UMyCustomWidget");
static_assert(sizeof(UMyCustomWidget) == 0x0002C8, "Wrong size on UMyCustomWidget");
static_assert(offsetof(UMyCustomWidget, InputKeySelector) == 0x0002C0, "Member 'UMyCustomWidget::InputKeySelector' has a wrong offset!");

}

