#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Checkpoint_BP

#include "Basic.hpp"

#include "S_Checkpoint_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Checkpoint_BP.Checkpoint_BP_C.BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3476[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Checkpoint_BP_C_BndEvt__Checkpoint_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Checkpoint_BP.Checkpoint_BP_C.CheckSaveCheckpoint
// 0x0048 (0x0048 - 0x0000)
struct Checkpoint_BP_C_CheckSaveCheckpoint final
{
public:
	TArray<struct FS_Checkpoint>                  Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Param_Saved;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3477[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Checkpoint                          CallFunc_Array_Get_Item;                           // 0x0020(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3478[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Checkpoint_BP_C_CheckSaveCheckpoint) == 0x000008, "Wrong alignment on Checkpoint_BP_C_CheckSaveCheckpoint");
static_assert(sizeof(Checkpoint_BP_C_CheckSaveCheckpoint) == 0x000048, "Wrong size on Checkpoint_BP_C_CheckSaveCheckpoint");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, Array) == 0x000000, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::Array' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, Param_Saved) == 0x000010, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::Param_Saved' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, CallFunc_Array_Get_Item) == 0x000020, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_CheckSaveCheckpoint, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000040, "Member 'Checkpoint_BP_C_CheckSaveCheckpoint::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function Checkpoint_BP.Checkpoint_BP_C.ExecuteUbergraph_Checkpoint_BP
// 0x01F8 (0x01F8 - 0x0000)
struct Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3479[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347A[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347B[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save;  // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347C[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_Checkpoint>                  CallFunc_GetCheckpoints_Checkpoints;               // 0x0168(0x0010)(ReferenceParm)
	bool                                          CallFunc_CheckSaveCheckpoint_Saved;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347D[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save_1; // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347E[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347F[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTimer_Timer;                           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Checkpoint                          K2Node_MakeStruct_S_Checkpoint;                    // 0x01E0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP) == 0x000008, "Wrong alignment on Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP");
static_assert(sizeof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP) == 0x0001F8, "Wrong size on Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, EntryPoint) == 0x000000, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_MakeStruct_LinearColor) == 0x000110, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_MakeStruct_LinearColor_1) == 0x000120, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_LinearColorLerp_ReturnValue) == 0x000130, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000140, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_GetGameInstance_ReturnValue) == 0x000148, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_DynamicCast_AsBPI_Game_Instance_with_Save) == 0x000150, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_DynamicCast_AsBPI_Game_Instance_with_Save' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_GetCheckpoints_Checkpoints) == 0x000168, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_GetCheckpoints_Checkpoints' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_CheckSaveCheckpoint_Saved) == 0x000178, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_CheckSaveCheckpoint_Saved' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_GetGameInstance_ReturnValue_1) == 0x000180, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_DynamicCast_AsBPI_Game_Instance_with_Save_1) == 0x000188, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_DynamicCast_AsBPI_Game_Instance_with_Save_1' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001A0, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_GetGameState_ReturnValue) == 0x0001B8, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0001C0, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_DynamicCast_AsBPI_Gamestate) == 0x0001C8, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, CallFunc_GetTimer_Timer) == 0x0001DC, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::CallFunc_GetTimer_Timer' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP, K2Node_MakeStruct_S_Checkpoint) == 0x0001E0, "Member 'Checkpoint_BP_C_ExecuteUbergraph_Checkpoint_BP::K2Node_MakeStruct_S_Checkpoint' has a wrong offset!");

// Function Checkpoint_BP.Checkpoint_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Checkpoint_BP_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Checkpoint_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Checkpoint_BP_C_UserConstructionScript");
static_assert(sizeof(Checkpoint_BP_C_UserConstructionScript) == 0x000010, "Wrong size on Checkpoint_BP_C_UserConstructionScript");
static_assert(offsetof(Checkpoint_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Checkpoint_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Checkpoint_BP_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'Checkpoint_BP_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

