#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Christian_ALS_AnimBP

#include "Basic.hpp"

#include "VelocityBlend_structs.hpp"
#include "ALS_RotationMode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovementDirection_structs.hpp"
#include "LeanAmount_structs.hpp"
#include "DynamicMontageParams_structs.hpp"
#include "RotateInPlace_Asset_structs.hpp"
#include "TurnInPlace_Asset_structs.hpp"
#include "ALS_Gait_structs.hpp"
#include "ALS_MovementState_structs.hpp"
#include "ALS_MovementAction_structs.hpp"
#include "ALS_Stance_structs.hpp"
#include "ALS_ViewMode_structs.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "GroundedEntryState_structs.hpp"


namespace SDK::Params
{

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.(CLF) CycleBlending
// 0x0070 (0x0070 - 0x0000)
struct Christian_ALS_AnimBP_C__CLF__CycleBlending final
{
public:
	struct FPoseLink                              F;                                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              B;                                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LF;                                                // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LB;                                                // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RF;                                                // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RB;                                                // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param__CLF__CycleBlending;                         // 0x0060(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Christian_ALS_AnimBP_C__CLF__CycleBlending) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C__CLF__CycleBlending");
static_assert(sizeof(Christian_ALS_AnimBP_C__CLF__CycleBlending) == 0x000070, "Wrong size on Christian_ALS_AnimBP_C__CLF__CycleBlending");
static_assert(offsetof(Christian_ALS_AnimBP_C__CLF__CycleBlending, F) == 0x000000, "Member 'Christian_ALS_AnimBP_C__CLF__CycleBlending::F' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__CLF__CycleBlending, B) == 0x000010, "Member 'Christian_ALS_AnimBP_C__CLF__CycleBlending::B' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__CLF__CycleBlending, LF) == 0x000020, "Member 'Christian_ALS_AnimBP_C__CLF__CycleBlending::LF' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__CLF__CycleBlending, LB) == 0x000030, "Member 'Christian_ALS_AnimBP_C__CLF__CycleBlending::LB' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__CLF__CycleBlending, RF) == 0x000040, "Member 'Christian_ALS_AnimBP_C__CLF__CycleBlending::RF' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__CLF__CycleBlending, RB) == 0x000050, "Member 'Christian_ALS_AnimBP_C__CLF__CycleBlending::RB' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__CLF__CycleBlending, Param__CLF__CycleBlending) == 0x000060, "Member 'Christian_ALS_AnimBP_C__CLF__CycleBlending::Param__CLF__CycleBlending' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.(N) CycleBlending
// 0x0080 (0x0080 - 0x0000)
struct Christian_ALS_AnimBP_C__N__CycleBlending final
{
public:
	struct FPoseLink                              F;                                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              B;                                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LF;                                                // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LB;                                                // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RF;                                                // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RB;                                                // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Sprint;                                            // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param__N__CycleBlending;                           // 0x0070(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Christian_ALS_AnimBP_C__N__CycleBlending) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C__N__CycleBlending");
static_assert(sizeof(Christian_ALS_AnimBP_C__N__CycleBlending) == 0x000080, "Wrong size on Christian_ALS_AnimBP_C__N__CycleBlending");
static_assert(offsetof(Christian_ALS_AnimBP_C__N__CycleBlending, F) == 0x000000, "Member 'Christian_ALS_AnimBP_C__N__CycleBlending::F' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__N__CycleBlending, B) == 0x000010, "Member 'Christian_ALS_AnimBP_C__N__CycleBlending::B' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__N__CycleBlending, LF) == 0x000020, "Member 'Christian_ALS_AnimBP_C__N__CycleBlending::LF' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__N__CycleBlending, LB) == 0x000030, "Member 'Christian_ALS_AnimBP_C__N__CycleBlending::LB' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__N__CycleBlending, RF) == 0x000040, "Member 'Christian_ALS_AnimBP_C__N__CycleBlending::RF' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__N__CycleBlending, RB) == 0x000050, "Member 'Christian_ALS_AnimBP_C__N__CycleBlending::RB' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__N__CycleBlending, Sprint) == 0x000060, "Member 'Christian_ALS_AnimBP_C__N__CycleBlending::Sprint' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C__N__CycleBlending, Param__N__CycleBlending) == 0x000070, "Member 'Christian_ALS_AnimBP_C__N__CycleBlending::Param__N__CycleBlending' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.AimOffsetBehaviors
// 0x0010 (0x0010 - 0x0000)
struct Christian_ALS_AnimBP_C_AimOffsetBehaviors final
{
public:
	struct FPoseLink                              Param_AimOffsetBehaviors;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Christian_ALS_AnimBP_C_AimOffsetBehaviors) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_AimOffsetBehaviors");
static_assert(sizeof(Christian_ALS_AnimBP_C_AimOffsetBehaviors) == 0x000010, "Wrong size on Christian_ALS_AnimBP_C_AimOffsetBehaviors");
static_assert(offsetof(Christian_ALS_AnimBP_C_AimOffsetBehaviors, Param_AimOffsetBehaviors) == 0x000000, "Member 'Christian_ALS_AnimBP_C_AimOffsetBehaviors::Param_AimOffsetBehaviors' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.AngleInRange
// 0x0050 (0x0050 - 0x0000)
struct Christian_ALS_AnimBP_C_AngleInRange final
{
public:
	double                                        Angle;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinAngle;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAngle;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Buffer;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IncreaseBuffer;                                    // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9A[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_AngleInRange) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_AngleInRange");
static_assert(sizeof(Christian_ALS_AnimBP_C_AngleInRange) == 0x000050, "Wrong size on Christian_ALS_AnimBP_C_AngleInRange");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, Angle) == 0x000000, "Member 'Christian_ALS_AnimBP_C_AngleInRange::Angle' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, MinAngle) == 0x000008, "Member 'Christian_ALS_AnimBP_C_AngleInRange::MinAngle' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, MaxAngle) == 0x000010, "Member 'Christian_ALS_AnimBP_C_AngleInRange::MaxAngle' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, Buffer) == 0x000018, "Member 'Christian_ALS_AnimBP_C_AngleInRange::Buffer' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, IncreaseBuffer) == 0x000020, "Member 'Christian_ALS_AnimBP_C_AngleInRange::IncreaseBuffer' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, ReturnValue) == 0x000021, "Member 'Christian_ALS_AnimBP_C_AngleInRange::ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, Temp_bool_Variable) == 0x000022, "Member 'Christian_ALS_AnimBP_C_AngleInRange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'Christian_ALS_AnimBP_C_AngleInRange::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'Christian_ALS_AnimBP_C_AngleInRange::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'Christian_ALS_AnimBP_C_AngleInRange::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'Christian_ALS_AnimBP_C_AngleInRange::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000048, "Member 'Christian_ALS_AnimBP_C_AngleInRange::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000049, "Member 'Christian_ALS_AnimBP_C_AngleInRange::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_AngleInRange, K2Node_Select_Default) == 0x00004A, "Member 'Christian_ALS_AnimBP_C_AngleInRange::K2Node_Select_Default' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Christian_ALS_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Christian_ALS_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_AnimGraph");
static_assert(sizeof(Christian_ALS_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Christian_ALS_AnimBP_C_AnimGraph");
static_assert(offsetof(Christian_ALS_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Christian_ALS_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.BaseLayer
// 0x0010 (0x0010 - 0x0000)
struct Christian_ALS_AnimBP_C_BaseLayer final
{
public:
	struct FPoseLink                              Param_BaseLayer;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Christian_ALS_AnimBP_C_BaseLayer) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_BaseLayer");
static_assert(sizeof(Christian_ALS_AnimBP_C_BaseLayer) == 0x000010, "Wrong size on Christian_ALS_AnimBP_C_BaseLayer");
static_assert(offsetof(Christian_ALS_AnimBP_C_BaseLayer, Param_BaseLayer) == 0x000000, "Member 'Christian_ALS_AnimBP_C_BaseLayer::Param_BaseLayer' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.BasePoses
// 0x0010 (0x0010 - 0x0000)
struct Christian_ALS_AnimBP_C_BasePoses final
{
public:
	struct FPoseLink                              Param_BasePoses;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Christian_ALS_AnimBP_C_BasePoses) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_BasePoses");
static_assert(sizeof(Christian_ALS_AnimBP_C_BasePoses) == 0x000010, "Wrong size on Christian_ALS_AnimBP_C_BasePoses");
static_assert(offsetof(Christian_ALS_AnimBP_C_BasePoses, Param_BasePoses) == 0x000000, "Member 'Christian_ALS_AnimBP_C_BasePoses::Param_BasePoses' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Christian_ALS_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         Param_DeltaTimeX;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Christian_ALS_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Christian_ALS_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Christian_ALS_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Christian_ALS_AnimBP_C_BlueprintUpdateAnimation, Param_DeltaTimeX) == 0x000000, "Member 'Christian_ALS_AnimBP_C_BlueprintUpdateAnimation::Param_DeltaTimeX' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.BPI_SetGroundedEntryState
// 0x0001 (0x0001 - 0x0000)
struct Christian_ALS_AnimBP_C_BPI_SetGroundedEntryState final
{
public:
	EGroundedEntryState                           Param_GroundedEntryState;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_BPI_SetGroundedEntryState) == 0x000001, "Wrong alignment on Christian_ALS_AnimBP_C_BPI_SetGroundedEntryState");
static_assert(sizeof(Christian_ALS_AnimBP_C_BPI_SetGroundedEntryState) == 0x000001, "Wrong size on Christian_ALS_AnimBP_C_BPI_SetGroundedEntryState");
static_assert(offsetof(Christian_ALS_AnimBP_C_BPI_SetGroundedEntryState, Param_GroundedEntryState) == 0x000000, "Member 'Christian_ALS_AnimBP_C_BPI_SetGroundedEntryState::Param_GroundedEntryState' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.BPI_SetOverlayOverrideState
// 0x0004 (0x0004 - 0x0000)
struct Christian_ALS_AnimBP_C_BPI_SetOverlayOverrideState final
{
public:
	int32                                         Param_OverlayOverrideState;                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_BPI_SetOverlayOverrideState) == 0x000004, "Wrong alignment on Christian_ALS_AnimBP_C_BPI_SetOverlayOverrideState");
static_assert(sizeof(Christian_ALS_AnimBP_C_BPI_SetOverlayOverrideState) == 0x000004, "Wrong size on Christian_ALS_AnimBP_C_BPI_SetOverlayOverrideState");
static_assert(offsetof(Christian_ALS_AnimBP_C_BPI_SetOverlayOverrideState, Param_OverlayOverrideState) == 0x000000, "Member 'Christian_ALS_AnimBP_C_BPI_SetOverlayOverrideState::Param_OverlayOverrideState' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.CalculateCrouchingPlayRate
// 0x0060 (0x0060 - 0x0000)
struct Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate final
{
public:
	double                                        PlayRate;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate");
static_assert(sizeof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate) == 0x000060, "Wrong size on Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, PlayRate) == 0x000000, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::PlayRate' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_GetOwningComponent_ReturnValue) == 0x000008, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000010, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_BreakVector_X) == 0x000028, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_BreakVector_Y) == 0x000030, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_BreakVector_Z) == 0x000038, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate, CallFunc_FClamp_ReturnValue) == 0x000058, "Member 'Christian_ALS_AnimBP_C_CalculateCrouchingPlayRate::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.CalculateDiagonalScaleAmount
// 0x0040 (0x0040 - 0x0000)
struct Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount");
static_assert(sizeof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount) == 0x000040, "Wrong size on Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount, ReturnValue) == 0x000000, "Member 'Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount::ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount, CallFunc_Abs_ReturnValue) == 0x000010, "Member 'Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount, CallFunc_GetFloatValue_ReturnValue) == 0x000018, "Member 'Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000020, "Member 'Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000038, "Member 'Christian_ALS_AnimBP_C_CalculateDiagonalScaleAmount::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.CalculateInAirLeanAmount
// 0x00D0 (0x00D0 - 0x0000)
struct Christian_ALS_AnimBP_C_CalculateInAirLeanAmount final
{
public:
	struct FLeanAmount                            Param_LeanAmount;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9C[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCapsuleRotation_Rotation;              // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLeanAmount                            K2Node_MakeStruct_LeanAmount;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9D[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_Vector2DFloat_B_ImplicitCast;    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_LR_17_ADF99333493B27F5B49BA89100DC4C05_ImplicitCast; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_FB_15_297866804FB14F4B81FB4A976A7F57D1_ImplicitCast; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_CalculateInAirLeanAmount");
static_assert(sizeof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount) == 0x0000D0, "Wrong size on Christian_ALS_AnimBP_C_CalculateInAirLeanAmount");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, Param_LeanAmount) == 0x000000, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::Param_LeanAmount' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, K2Node_DynamicCast_AsBPI_Character) == 0x000008, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_GetFloatValue_ReturnValue) == 0x00001C, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_GetCapsuleRotation_Rotation) == 0x000020, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_GetCapsuleRotation_Rotation' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x000038, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000050, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_BreakVector_X) == 0x000068, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_BreakVector_Y) == 0x000070, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_BreakVector_Z) == 0x000078, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_MakeVector2D_ReturnValue) == 0x000080, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000090, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_BreakVector2D_X) == 0x0000A0, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_BreakVector2D_Y) == 0x0000A8, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, K2Node_MakeStruct_LeanAmount) == 0x0000B0, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::K2Node_MakeStruct_LeanAmount' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0000B8, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, CallFunc_Multiply_Vector2DFloat_B_ImplicitCast) == 0x0000C0, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::CallFunc_Multiply_Vector2DFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, K2Node_MakeStruct_LR_17_ADF99333493B27F5B49BA89100DC4C05_ImplicitCast) == 0x0000C8, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::K2Node_MakeStruct_LR_17_ADF99333493B27F5B49BA89100DC4C05_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateInAirLeanAmount, K2Node_MakeStruct_FB_15_297866804FB14F4B81FB4A976A7F57D1_ImplicitCast) == 0x0000CC, "Member 'Christian_ALS_AnimBP_C_CalculateInAirLeanAmount::K2Node_MakeStruct_FB_15_297866804FB14F4B81FB4A976A7F57D1_ImplicitCast' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.CalculateLandPrediction
// 0x02E0 (0x02E0 - 0x0000)
struct Christian_ALS_AnimBP_C_CalculateLandPrediction final
{
public:
	double                                        Param_LandPrediction;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	EDrawDebugTrace                               CallFunc_GetDebugTraceType_DebugType;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9E[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9F[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA0[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CallFunc_GetCapsuleComponent_Capsule;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_NormalUnsafe_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingleByProfile_OutHit;       // 0x00F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleByProfile_ReturnValue;  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA1[0x1];                                     // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA2[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA3[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWalkableSurface_ReturnValue;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA4[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA5[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_CalculateLandPrediction) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_CalculateLandPrediction");
static_assert(sizeof(Christian_ALS_AnimBP_C_CalculateLandPrediction) == 0x0002E0, "Wrong size on Christian_ALS_AnimBP_C_CalculateLandPrediction");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, Param_LandPrediction) == 0x000000, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::Param_LandPrediction' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, Temp_object_Variable) == 0x000008, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_GetDebugTraceType_DebugType) == 0x000018, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_GetDebugTraceType_DebugType' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000019, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, K2Node_DynamicCast_AsBPI_Character) == 0x000020, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_GetCurveValue_ReturnValue) == 0x000034, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, K2Node_DynamicCast_AsBPI_Character_1) == 0x000038, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::K2Node_DynamicCast_AsBPI_Character_1' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_GetCapsuleComponent_Capsule) == 0x000068, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_GetCapsuleComponent_Capsule' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakVector_X) == 0x000070, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakVector_Y) == 0x000078, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakVector_Z) == 0x000080, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_FClamp_ReturnValue) == 0x000088, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_MapRangeClamped_ReturnValue) == 0x000090, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_Vector_NormalUnsafe_ReturnValue) == 0x0000B0, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_Vector_NormalUnsafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000C8, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_CapsuleTraceSingleByProfile_OutHit) == 0x0000F8, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_CapsuleTraceSingleByProfile_OutHit' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_CapsuleTraceSingleByProfile_ReturnValue) == 0x0001E0, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_CapsuleTraceSingleByProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_bBlockingHit) == 0x0001E1, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001E2, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_Time) == 0x0001E4, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_Distance) == 0x0001E8, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_Location) == 0x0001F0, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_ImpactPoint) == 0x000208, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_Normal) == 0x000220, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_ImpactNormal) == 0x000238, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_PhysMat) == 0x000250, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_HitActor) == 0x000258, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_HitComponent) == 0x000260, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_HitBoneName) == 0x000268, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_BoneName) == 0x000270, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_HitItem) == 0x000278, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_ElementIndex) == 0x00027C, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_FaceIndex) == 0x000280, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_TraceStart) == 0x000288, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BreakHitResult_TraceEnd) == 0x0002A0, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_IsWalkableSurface_ReturnValue) == 0x0002B8, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_IsWalkableSurface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_GetFloatValue_ReturnValue) == 0x0002BC, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_Lerp_ReturnValue) == 0x0002C0, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_BooleanAND_ReturnValue) == 0x0002C8, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0002D0, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Christian_ALS_AnimBP_C_CalculateLandPrediction, CallFunc_Lerp_A_ImplicitCast) == 0x0002D8, "Member 'Christian_ALS_AnimBP_C_CalculateLandPrediction::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");

// Function Christian_ALS_AnimBP.Christian_ALS_AnimBP_C.CalculateMovementDirection
// 0x0058 (0x0058 - 0x0000)
struct Christian_ALS_AnimBP_C_CalculateMovementDirection final
{
public:
	EMovementDirection                            ReturnValues;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA7[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementDirection                            CallFunc_CalculateQuadrant_ReturnValue;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA8[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalculateQuadrant_Angle_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Christian_ALS_AnimBP_C_CalculateMovementDirection) == 0x000008, "Wrong alignment on Christian_ALS_AnimBP_C_CalculateMovementDirection");
