#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloudElevator_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function CloudElevator_BP.CloudElevator_BP_C.ExecuteUbergraph_CloudElevator_BP
// 0x0058 (0x0058 - 0x0000)
struct CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3867[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3868[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3869[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0020(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_386A[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP) == 0x000008, "Wrong alignment on CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP");
static_assert(sizeof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP) == 0x000058, "Wrong size on CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, EntryPoint) == 0x000000, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, Temp_int_Array_Index_Variable) == 0x000010, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000014, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000020, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, CallFunc_Array_Get_Item) == 0x000030, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, K2Node_DynamicCast_AsBPI_Character) == 0x000040, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'CloudElevator_BP_C_ExecuteUbergraph_CloudElevator_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CloudElevator_BP.CloudElevator_BP_C.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct CloudElevator_BP_C_IsActivated final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CloudElevator_BP_C_IsActivated) == 0x000001, "Wrong alignment on CloudElevator_BP_C_IsActivated");
static_assert(sizeof(CloudElevator_BP_C_IsActivated) == 0x000001, "Wrong size on CloudElevator_BP_C_IsActivated");
static_assert(offsetof(CloudElevator_BP_C_IsActivated, Activated) == 0x000000, "Member 'CloudElevator_BP_C_IsActivated::Activated' has a wrong offset!");

// Function CloudElevator_BP.CloudElevator_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CloudElevator_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CloudElevator_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on CloudElevator_BP_C_ReceiveTick");
static_assert(sizeof(CloudElevator_BP_C_ReceiveTick) == 0x000004, "Wrong size on CloudElevator_BP_C_ReceiveTick");
static_assert(offsetof(CloudElevator_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CloudElevator_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

