#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Collectable_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Collectable_BP.Collectable_BP_C
// 0x0060 (0x02F8 - 0x0298)
class ACollectable_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraBody;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wing_low;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_7DAEFB934B74B0DC353E489BFC9C1364; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_7DAEFB934B74B0DC353E489BFC9C1364; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37F5[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Wing_Index;                                        // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_37F6[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mat;                                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Collectable_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_Collectable_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Collectable_BP_C">();
	}
	static class ACollectable_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACollectable_BP_C>();
	}
};
static_assert(alignof(ACollectable_BP_C) == 0x000008, "Wrong alignment on ACollectable_BP_C");
static_assert(sizeof(ACollectable_BP_C) == 0x0002F8, "Wrong size on ACollectable_BP_C");
static_assert(offsetof(ACollectable_BP_C, UberGraphFrame) == 0x000298, "Member 'ACollectable_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, NiagaraBody) == 0x0002A0, "Member 'ACollectable_BP_C::NiagaraBody' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, PointLight) == 0x0002A8, "Member 'ACollectable_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, Wing_low) == 0x0002B0, "Member 'ACollectable_BP_C::Wing_low' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, Sphere) == 0x0002B8, "Member 'ACollectable_BP_C::Sphere' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, Box) == 0x0002C0, "Member 'ACollectable_BP_C::Box' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, C_TickOptimizer) == 0x0002C8, "Member 'ACollectable_BP_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, DefaultSceneRoot) == 0x0002D0, "Member 'ACollectable_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, Timeline_NewTrack_0_7DAEFB934B74B0DC353E489BFC9C1364) == 0x0002D8, "Member 'ACollectable_BP_C::Timeline_NewTrack_0_7DAEFB934B74B0DC353E489BFC9C1364' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, Timeline__Direction_7DAEFB934B74B0DC353E489BFC9C1364) == 0x0002DC, "Member 'ACollectable_BP_C::Timeline__Direction_7DAEFB934B74B0DC353E489BFC9C1364' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, Timeline) == 0x0002E0, "Member 'ACollectable_BP_C::Timeline' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, Wing_Index) == 0x0002E8, "Member 'ACollectable_BP_C::Wing_Index' has a wrong offset!");
static_assert(offsetof(ACollectable_BP_C, Mat) == 0x0002F0, "Member 'ACollectable_BP_C::Mat' has a wrong offset!");

}

