#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// DelegateFunction CommonUI.CommonActionWidget.OnInputMethodChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CommonActionWidget_OnInputMethodChanged__DelegateSignature final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_OnInputMethodChanged__DelegateSignature) == 0x000001, "Wrong alignment on CommonActionWidget_OnInputMethodChanged__DelegateSignature");
static_assert(sizeof(CommonActionWidget_OnInputMethodChanged__DelegateSignature) == 0x000001, "Wrong size on CommonActionWidget_OnInputMethodChanged__DelegateSignature");
static_assert(offsetof(CommonActionWidget_OnInputMethodChanged__DelegateSignature, bUsingGamepad) == 0x000000, "Member 'CommonActionWidget_OnInputMethodChanged__DelegateSignature::bUsingGamepad' has a wrong offset!");

// Function CommonUI.CommonActionWidget.SetEnhancedInputAction
// 0x0008 (0x0008 - 0x0000)
struct CommonActionWidget_SetEnhancedInputAction final
{
public:
	class UInputAction*                           InInputAction;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_SetEnhancedInputAction) == 0x000008, "Wrong alignment on CommonActionWidget_SetEnhancedInputAction");
static_assert(sizeof(CommonActionWidget_SetEnhancedInputAction) == 0x000008, "Wrong size on CommonActionWidget_SetEnhancedInputAction");
static_assert(offsetof(CommonActionWidget_SetEnhancedInputAction, InInputAction) == 0x000000, "Member 'CommonActionWidget_SetEnhancedInputAction::InInputAction' has a wrong offset!");

// Function CommonUI.CommonActionWidget.SetIconRimBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonActionWidget_SetIconRimBrush final
{
public:
	struct FSlateBrush                            InIconRimBrush;                                    // 0x0000(0x00D0)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_SetIconRimBrush) == 0x000010, "Wrong alignment on CommonActionWidget_SetIconRimBrush");
static_assert(sizeof(CommonActionWidget_SetIconRimBrush) == 0x0000D0, "Wrong size on CommonActionWidget_SetIconRimBrush");
static_assert(offsetof(CommonActionWidget_SetIconRimBrush, InIconRimBrush) == 0x000000, "Member 'CommonActionWidget_SetIconRimBrush::InIconRimBrush' has a wrong offset!");

// Function CommonUI.CommonActionWidget.SetInputAction
// 0x0010 (0x0010 - 0x0000)
struct CommonActionWidget_SetInputAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_SetInputAction) == 0x000008, "Wrong alignment on CommonActionWidget_SetInputAction");
static_assert(sizeof(CommonActionWidget_SetInputAction) == 0x000010, "Wrong size on CommonActionWidget_SetInputAction");
static_assert(offsetof(CommonActionWidget_SetInputAction, InputActionRow) == 0x000000, "Member 'CommonActionWidget_SetInputAction::InputActionRow' has a wrong offset!");

// Function CommonUI.CommonActionWidget.SetInputActions
// 0x0010 (0x0010 - 0x0000)
struct CommonActionWidget_SetInputActions final
{
public:
	TArray<struct FDataTableRowHandle>            NewInputActions;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_SetInputActions) == 0x000008, "Wrong alignment on CommonActionWidget_SetInputActions");
static_assert(sizeof(CommonActionWidget_SetInputActions) == 0x000010, "Wrong size on CommonActionWidget_SetInputActions");
static_assert(offsetof(CommonActionWidget_SetInputActions, NewInputActions) == 0x000000, "Member 'CommonActionWidget_SetInputActions::NewInputActions' has a wrong offset!");

// Function CommonUI.CommonActionWidget.GetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct CommonActionWidget_GetDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_GetDisplayText) == 0x000008, "Wrong alignment on CommonActionWidget_GetDisplayText");
static_assert(sizeof(CommonActionWidget_GetDisplayText) == 0x000018, "Wrong size on CommonActionWidget_GetDisplayText");
static_assert(offsetof(CommonActionWidget_GetDisplayText, ReturnValue) == 0x000000, "Member 'CommonActionWidget_GetDisplayText::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActionWidget.GetIcon
// 0x00D0 (0x00D0 - 0x0000)
struct CommonActionWidget_GetIcon final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_GetIcon) == 0x000010, "Wrong alignment on CommonActionWidget_GetIcon");
static_assert(sizeof(CommonActionWidget_GetIcon) == 0x0000D0, "Wrong size on CommonActionWidget_GetIcon");
static_assert(offsetof(CommonActionWidget_GetIcon, ReturnValue) == 0x000000, "Member 'CommonActionWidget_GetIcon::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActionWidget.IsHeldAction
// 0x0001 (0x0001 - 0x0000)
struct CommonActionWidget_IsHeldAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActionWidget_IsHeldAction) == 0x000001, "Wrong alignment on CommonActionWidget_IsHeldAction");
static_assert(sizeof(CommonActionWidget_IsHeldAction) == 0x000001, "Wrong size on CommonActionWidget_IsHeldAction");
static_assert(offsetof(CommonActionWidget_IsHeldAction, ReturnValue) == 0x000000, "Member 'CommonActionWidget_IsHeldAction::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonUserWidget.SetConsumePointerInput
// 0x0001 (0x0001 - 0x0000)
struct CommonUserWidget_SetConsumePointerInput final
{
public:
	bool                                          bInConsumePointerInput;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonUserWidget_SetConsumePointerInput) == 0x000001, "Wrong alignment on CommonUserWidget_SetConsumePointerInput");
static_assert(sizeof(CommonUserWidget_SetConsumePointerInput) == 0x000001, "Wrong size on CommonUserWidget_SetConsumePointerInput");
static_assert(offsetof(CommonUserWidget_SetConsumePointerInput, bInConsumePointerInput) == 0x000000, "Member 'CommonUserWidget_SetConsumePointerInput::bInConsumePointerInput' has a wrong offset!");

// Function CommonUI.CommonActivatableWidget.BindVisibilityToActivation
// 0x0008 (0x0008 - 0x0000)
struct CommonActivatableWidget_BindVisibilityToActivation final
{
public:
	class UCommonActivatableWidget*               ActivatableWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatableWidget_BindVisibilityToActivation) == 0x000008, "Wrong alignment on CommonActivatableWidget_BindVisibilityToActivation");
static_assert(sizeof(CommonActivatableWidget_BindVisibilityToActivation) == 0x000008, "Wrong size on CommonActivatableWidget_BindVisibilityToActivation");
static_assert(offsetof(CommonActivatableWidget_BindVisibilityToActivation, ActivatableWidget) == 0x000000, "Member 'CommonActivatableWidget_BindVisibilityToActivation::ActivatableWidget' has a wrong offset!");

// Function CommonUI.CommonActivatableWidget.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatableWidget_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatableWidget_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on CommonActivatableWidget_BP_OnHandleBackAction");
static_assert(sizeof(CommonActivatableWidget_BP_OnHandleBackAction) == 0x000001, "Wrong size on CommonActivatableWidget_BP_OnHandleBackAction");
static_assert(offsetof(CommonActivatableWidget_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'CommonActivatableWidget_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActivatableWidget.SetBindVisibilities
// 0x0003 (0x0003 - 0x0000)
struct CommonActivatableWidget_SetBindVisibilities final
{
public:
	ESlateVisibility                              OnActivatedVisibility;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              OnDeactivatedVisibility;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAllActive;                                      // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatableWidget_SetBindVisibilities) == 0x000001, "Wrong alignment on CommonActivatableWidget_SetBindVisibilities");
static_assert(sizeof(CommonActivatableWidget_SetBindVisibilities) == 0x000003, "Wrong size on CommonActivatableWidget_SetBindVisibilities");
static_assert(offsetof(CommonActivatableWidget_SetBindVisibilities, OnActivatedVisibility) == 0x000000, "Member 'CommonActivatableWidget_SetBindVisibilities::OnActivatedVisibility' has a wrong offset!");
static_assert(offsetof(CommonActivatableWidget_SetBindVisibilities, OnDeactivatedVisibility) == 0x000001, "Member 'CommonActivatableWidget_SetBindVisibilities::OnDeactivatedVisibility' has a wrong offset!");
static_assert(offsetof(CommonActivatableWidget_SetBindVisibilities, bInAllActive) == 0x000002, "Member 'CommonActivatableWidget_SetBindVisibilities::bInAllActive' has a wrong offset!");

// Function CommonUI.CommonActivatableWidget.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct CommonActivatableWidget_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatableWidget_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on CommonActivatableWidget_BP_GetDesiredFocusTarget");
static_assert(sizeof(CommonActivatableWidget_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on CommonActivatableWidget_BP_GetDesiredFocusTarget");
static_assert(offsetof(CommonActivatableWidget_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'CommonActivatableWidget_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActivatableWidget.BP_GetDesiredInputConfig
// 0x0005 (0x0005 - 0x0000)
struct CommonActivatableWidget_BP_GetDesiredInputConfig final
{
public:
	struct FUIInputConfig                         ReturnValue;                                       // 0x0000(0x0005)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatableWidget_BP_GetDesiredInputConfig) == 0x000001, "Wrong alignment on CommonActivatableWidget_BP_GetDesiredInputConfig");
static_assert(sizeof(CommonActivatableWidget_BP_GetDesiredInputConfig) == 0x000005, "Wrong size on CommonActivatableWidget_BP_GetDesiredInputConfig");
static_assert(offsetof(CommonActivatableWidget_BP_GetDesiredInputConfig, ReturnValue) == 0x000000, "Member 'CommonActivatableWidget_BP_GetDesiredInputConfig::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActivatableWidget.GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct CommonActivatableWidget_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatableWidget_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on CommonActivatableWidget_GetDesiredFocusTarget");
static_assert(sizeof(CommonActivatableWidget_GetDesiredFocusTarget) == 0x000008, "Wrong size on CommonActivatableWidget_GetDesiredFocusTarget");
static_assert(offsetof(CommonActivatableWidget_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'CommonActivatableWidget_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonActivatableWidget.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatableWidget_IsActivated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonActivatableWidget_IsActivated) == 0x000001, "Wrong alignment on CommonActivatableWidget_IsActivated");
static_assert(sizeof(CommonActivatableWidget_IsActivated) == 0x000001, "Wrong size on CommonActivatableWidget_IsActivated");
static_assert(offsetof(CommonActivatableWidget_IsActivated, ReturnValue) == 0x000000, "Member 'CommonActivatableWidget_IsActivated::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonAnimatedSwitcher.ActivateNextWidget
// 0x0001 (0x0001 - 0x0000)
struct CommonAnimatedSwitcher_ActivateNextWidget final
{
public:
	bool                                          bCanWrap;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonAnimatedSwitcher_ActivateNextWidget) == 0x000001, "Wrong alignment on CommonAnimatedSwitcher_ActivateNextWidget");
static_assert(sizeof(CommonAnimatedSwitcher_ActivateNextWidget) == 0x000001, "Wrong size on CommonAnimatedSwitcher_ActivateNextWidget");
static_assert(offsetof(CommonAnimatedSwitcher_ActivateNextWidget, bCanWrap) == 0x000000, "Member 'CommonAnimatedSwitcher_ActivateNextWidget::bCanWrap' has a wrong offset!");

// Function CommonUI.CommonAnimatedSwitcher.ActivatePreviousWidget
// 0x0001 (0x0001 - 0x0000)
struct CommonAnimatedSwitcher_ActivatePreviousWidget final
{
public:
	bool                                          bCanWrap;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonAnimatedSwitcher_ActivatePreviousWidget) == 0x000001, "Wrong alignment on CommonAnimatedSwitcher_ActivatePreviousWidget");
static_assert(sizeof(CommonAnimatedSwitcher_ActivatePreviousWidget) == 0x000001, "Wrong size on CommonAnimatedSwitcher_ActivatePreviousWidget");
static_assert(offsetof(CommonAnimatedSwitcher_ActivatePreviousWidget, bCanWrap) == 0x000000, "Member 'CommonAnimatedSwitcher_ActivatePreviousWidget::bCanWrap' has a wrong offset!");

// Function CommonUI.CommonAnimatedSwitcher.SetDisableTransitionAnimation
// 0x0001 (0x0001 - 0x0000)
struct CommonAnimatedSwitcher_SetDisableTransitionAnimation final
{
public:
	bool                                          bDisableAnimation;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonAnimatedSwitcher_SetDisableTransitionAnimation) == 0x000001, "Wrong alignment on CommonAnimatedSwitcher_SetDisableTransitionAnimation");
static_assert(sizeof(CommonAnimatedSwitcher_SetDisableTransitionAnimation) == 0x000001, "Wrong size on CommonAnimatedSwitcher_SetDisableTransitionAnimation");
static_assert(offsetof(CommonAnimatedSwitcher_SetDisableTransitionAnimation, bDisableAnimation) == 0x000000, "Member 'CommonAnimatedSwitcher_SetDisableTransitionAnimation::bDisableAnimation' has a wrong offset!");

// Function CommonUI.CommonAnimatedSwitcher.HasWidgets
// 0x0001 (0x0001 - 0x0000)
struct CommonAnimatedSwitcher_HasWidgets final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonAnimatedSwitcher_HasWidgets) == 0x000001, "Wrong alignment on CommonAnimatedSwitcher_HasWidgets");
static_assert(sizeof(CommonAnimatedSwitcher_HasWidgets) == 0x000001, "Wrong size on CommonAnimatedSwitcher_HasWidgets");
static_assert(offsetof(CommonAnimatedSwitcher_HasWidgets, ReturnValue) == 0x000000, "Member 'CommonAnimatedSwitcher_HasWidgets::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonAnimatedSwitcher.IsCurrentlySwitching
// 0x0001 (0x0001 - 0x0000)
struct CommonAnimatedSwitcher_IsCurrentlySwitching final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonAnimatedSwitcher_IsCurrentlySwitching) == 0x000001, "Wrong alignment on CommonAnimatedSwitcher_IsCurrentlySwitching");
static_assert(sizeof(CommonAnimatedSwitcher_IsCurrentlySwitching) == 0x000001, "Wrong size on CommonAnimatedSwitcher_IsCurrentlySwitching");
static_assert(offsetof(CommonAnimatedSwitcher_IsCurrentlySwitching, ReturnValue) == 0x000000, "Member 'CommonAnimatedSwitcher_IsCurrentlySwitching::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonAnimatedSwitcher.IsTransitionPlaying
// 0x0001 (0x0001 - 0x0000)
struct CommonAnimatedSwitcher_IsTransitionPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonAnimatedSwitcher_IsTransitionPlaying) == 0x000001, "Wrong alignment on CommonAnimatedSwitcher_IsTransitionPlaying");
static_assert(sizeof(CommonAnimatedSwitcher_IsTransitionPlaying) == 0x000001, "Wrong size on CommonAnimatedSwitcher_IsTransitionPlaying");
static_assert(offsetof(CommonAnimatedSwitcher_IsTransitionPlaying, ReturnValue) == 0x000000, "Member 'CommonAnimatedSwitcher_IsTransitionPlaying::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonBorderStyle.GetBackgroundBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonBorderStyle_GetBackgroundBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonBorderStyle_GetBackgroundBrush) == 0x000010, "Wrong alignment on CommonBorderStyle_GetBackgroundBrush");
static_assert(sizeof(CommonBorderStyle_GetBackgroundBrush) == 0x0000D0, "Wrong size on CommonBorderStyle_GetBackgroundBrush");
static_assert(offsetof(CommonBorderStyle_GetBackgroundBrush, Brush) == 0x000000, "Member 'CommonBorderStyle_GetBackgroundBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonBorder.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonBorder_SetStyle final
{
public:
	TSubclassOf<class UCommonBorderStyle>         InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonBorder_SetStyle) == 0x000008, "Wrong alignment on CommonBorder_SetStyle");
static_assert(sizeof(CommonBorder_SetStyle) == 0x000008, "Wrong size on CommonBorder_SetStyle");
static_assert(offsetof(CommonBorder_SetStyle, InStyle) == 0x000000, "Member 'CommonBorder_SetStyle::InStyle' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetButtonPadding
// 0x0010 (0x0010 - 0x0000)
struct CommonButtonStyle_GetButtonPadding final
{
public:
	struct FMargin                                OutButtonPadding;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetButtonPadding) == 0x000004, "Wrong alignment on CommonButtonStyle_GetButtonPadding");
static_assert(sizeof(CommonButtonStyle_GetButtonPadding) == 0x000010, "Wrong size on CommonButtonStyle_GetButtonPadding");
static_assert(offsetof(CommonButtonStyle_GetButtonPadding, OutButtonPadding) == 0x000000, "Member 'CommonButtonStyle_GetButtonPadding::OutButtonPadding' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetCustomPadding
// 0x0010 (0x0010 - 0x0000)
struct CommonButtonStyle_GetCustomPadding final
{
public:
	struct FMargin                                OutCustomPadding;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetCustomPadding) == 0x000004, "Wrong alignment on CommonButtonStyle_GetCustomPadding");
static_assert(sizeof(CommonButtonStyle_GetCustomPadding) == 0x000010, "Wrong size on CommonButtonStyle_GetCustomPadding");
static_assert(offsetof(CommonButtonStyle_GetCustomPadding, OutCustomPadding) == 0x000000, "Member 'CommonButtonStyle_GetCustomPadding::OutCustomPadding' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetDisabledBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonButtonStyle_GetDisabledBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetDisabledBrush) == 0x000010, "Wrong alignment on CommonButtonStyle_GetDisabledBrush");
static_assert(sizeof(CommonButtonStyle_GetDisabledBrush) == 0x0000D0, "Wrong size on CommonButtonStyle_GetDisabledBrush");
static_assert(offsetof(CommonButtonStyle_GetDisabledBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetDisabledBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetDisabledTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetDisabledTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetDisabledTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetDisabledTextStyle");
static_assert(sizeof(CommonButtonStyle_GetDisabledTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetDisabledTextStyle");
static_assert(offsetof(CommonButtonStyle_GetDisabledTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetDisabledTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetMaterialBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonButtonStyle_GetMaterialBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetMaterialBrush) == 0x000010, "Wrong alignment on CommonButtonStyle_GetMaterialBrush");
static_assert(sizeof(CommonButtonStyle_GetMaterialBrush) == 0x0000D0, "Wrong size on CommonButtonStyle_GetMaterialBrush");
static_assert(offsetof(CommonButtonStyle_GetMaterialBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetMaterialBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalBaseBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonButtonStyle_GetNormalBaseBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalBaseBrush) == 0x000010, "Wrong alignment on CommonButtonStyle_GetNormalBaseBrush");
static_assert(sizeof(CommonButtonStyle_GetNormalBaseBrush) == 0x0000D0, "Wrong size on CommonButtonStyle_GetNormalBaseBrush");
static_assert(offsetof(CommonButtonStyle_GetNormalBaseBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetNormalBaseBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalHoveredBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonButtonStyle_GetNormalHoveredBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalHoveredBrush) == 0x000010, "Wrong alignment on CommonButtonStyle_GetNormalHoveredBrush");
static_assert(sizeof(CommonButtonStyle_GetNormalHoveredBrush) == 0x0000D0, "Wrong size on CommonButtonStyle_GetNormalHoveredBrush");
static_assert(offsetof(CommonButtonStyle_GetNormalHoveredBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetNormalHoveredBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalHoveredTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetNormalHoveredTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalHoveredTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetNormalHoveredTextStyle");
static_assert(sizeof(CommonButtonStyle_GetNormalHoveredTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetNormalHoveredTextStyle");
static_assert(offsetof(CommonButtonStyle_GetNormalHoveredTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetNormalHoveredTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalPressedBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonButtonStyle_GetNormalPressedBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalPressedBrush) == 0x000010, "Wrong alignment on CommonButtonStyle_GetNormalPressedBrush");
static_assert(sizeof(CommonButtonStyle_GetNormalPressedBrush) == 0x0000D0, "Wrong size on CommonButtonStyle_GetNormalPressedBrush");
static_assert(offsetof(CommonButtonStyle_GetNormalPressedBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetNormalPressedBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetNormalTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetNormalTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetNormalTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetNormalTextStyle");
static_assert(sizeof(CommonButtonStyle_GetNormalTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetNormalTextStyle");
static_assert(offsetof(CommonButtonStyle_GetNormalTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetNormalTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedBaseBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonButtonStyle_GetSelectedBaseBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedBaseBrush) == 0x000010, "Wrong alignment on CommonButtonStyle_GetSelectedBaseBrush");
static_assert(sizeof(CommonButtonStyle_GetSelectedBaseBrush) == 0x0000D0, "Wrong size on CommonButtonStyle_GetSelectedBaseBrush");
static_assert(offsetof(CommonButtonStyle_GetSelectedBaseBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetSelectedBaseBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedHoveredBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonButtonStyle_GetSelectedHoveredBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedHoveredBrush) == 0x000010, "Wrong alignment on CommonButtonStyle_GetSelectedHoveredBrush");
static_assert(sizeof(CommonButtonStyle_GetSelectedHoveredBrush) == 0x0000D0, "Wrong size on CommonButtonStyle_GetSelectedHoveredBrush");
static_assert(offsetof(CommonButtonStyle_GetSelectedHoveredBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetSelectedHoveredBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedHoveredTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetSelectedHoveredTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedHoveredTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetSelectedHoveredTextStyle");
static_assert(sizeof(CommonButtonStyle_GetSelectedHoveredTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetSelectedHoveredTextStyle");
static_assert(offsetof(CommonButtonStyle_GetSelectedHoveredTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetSelectedHoveredTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedPressedBrush
// 0x00D0 (0x00D0 - 0x0000)
struct CommonButtonStyle_GetSelectedPressedBrush final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedPressedBrush) == 0x000010, "Wrong alignment on CommonButtonStyle_GetSelectedPressedBrush");
static_assert(sizeof(CommonButtonStyle_GetSelectedPressedBrush) == 0x0000D0, "Wrong size on CommonButtonStyle_GetSelectedPressedBrush");
static_assert(offsetof(CommonButtonStyle_GetSelectedPressedBrush, Brush) == 0x000000, "Member 'CommonButtonStyle_GetSelectedPressedBrush::Brush' has a wrong offset!");

// Function CommonUI.CommonButtonStyle.GetSelectedTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonStyle_GetSelectedTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonStyle_GetSelectedTextStyle) == 0x000008, "Wrong alignment on CommonButtonStyle_GetSelectedTextStyle");
static_assert(sizeof(CommonButtonStyle_GetSelectedTextStyle) == 0x000008, "Wrong size on CommonButtonStyle_GetSelectedTextStyle");
static_assert(offsetof(CommonButtonStyle_GetSelectedTextStyle, ReturnValue) == 0x000000, "Member 'CommonButtonStyle_GetSelectedTextStyle::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonBase.BP_OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_BP_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_BP_OnInputMethodChanged) == 0x000001, "Wrong alignment on CommonButtonBase_BP_OnInputMethodChanged");
static_assert(sizeof(CommonButtonBase_BP_OnInputMethodChanged) == 0x000001, "Wrong size on CommonButtonBase_BP_OnInputMethodChanged");
static_assert(offsetof(CommonButtonBase_BP_OnInputMethodChanged, CurrentInputType) == 0x000000, "Member 'CommonButtonBase_BP_OnInputMethodChanged::CurrentInputType' has a wrong offset!");

// Function CommonUI.CommonButtonBase.BP_OnLockedChanged
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_BP_OnLockedChanged final
{
public:
	bool                                          bIsLocked;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_BP_OnLockedChanged) == 0x000001, "Wrong alignment on CommonButtonBase_BP_OnLockedChanged");
static_assert(sizeof(CommonButtonBase_BP_OnLockedChanged) == 0x000001, "Wrong size on CommonButtonBase_BP_OnLockedChanged");
static_assert(offsetof(CommonButtonBase_BP_OnLockedChanged, bIsLocked) == 0x000000, "Member 'CommonButtonBase_BP_OnLockedChanged::bIsLocked' has a wrong offset!");

// Function CommonUI.CommonButtonBase.DisableButtonWithReason
// 0x0018 (0x0018 - 0x0000)
struct CommonButtonBase_DisableButtonWithReason final
{
public:
	class FText                                   DisabledReason;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_DisableButtonWithReason) == 0x000008, "Wrong alignment on CommonButtonBase_DisableButtonWithReason");
static_assert(sizeof(CommonButtonBase_DisableButtonWithReason) == 0x000018, "Wrong size on CommonButtonBase_DisableButtonWithReason");
static_assert(offsetof(CommonButtonBase_DisableButtonWithReason, DisabledReason) == 0x000000, "Member 'CommonButtonBase_DisableButtonWithReason::DisabledReason' has a wrong offset!");

// Function CommonUI.CommonButtonBase.GetConvertInputActionToHold
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_GetConvertInputActionToHold final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_GetConvertInputActionToHold) == 0x000001, "Wrong alignment on CommonButtonBase_GetConvertInputActionToHold");
static_assert(sizeof(CommonButtonBase_GetConvertInputActionToHold) == 0x000001, "Wrong size on CommonButtonBase_GetConvertInputActionToHold");
static_assert(offsetof(CommonButtonBase_GetConvertInputActionToHold, ReturnValue) == 0x000000, "Member 'CommonButtonBase_GetConvertInputActionToHold::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonBase.HandleTriggeringActionCommited
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_HandleTriggeringActionCommited final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_HandleTriggeringActionCommited) == 0x000001, "Wrong alignment on CommonButtonBase_HandleTriggeringActionCommited");
static_assert(sizeof(CommonButtonBase_HandleTriggeringActionCommited) == 0x000001, "Wrong size on CommonButtonBase_HandleTriggeringActionCommited");
static_assert(offsetof(CommonButtonBase_HandleTriggeringActionCommited, bPassThrough) == 0x000000, "Member 'CommonButtonBase_HandleTriggeringActionCommited::bPassThrough' has a wrong offset!");

// Function CommonUI.CommonButtonBase.NativeOnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct CommonButtonBase_NativeOnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_NativeOnActionProgress) == 0x000004, "Wrong alignment on CommonButtonBase_NativeOnActionProgress");
static_assert(sizeof(CommonButtonBase_NativeOnActionProgress) == 0x000004, "Wrong size on CommonButtonBase_NativeOnActionProgress");
static_assert(offsetof(CommonButtonBase_NativeOnActionProgress, HeldPercent) == 0x000000, "Member 'CommonButtonBase_NativeOnActionProgress::HeldPercent' has a wrong offset!");

// Function CommonUI.CommonButtonBase.NativeOnHoldProgress
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_NativeOnHoldProgress final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CFC[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonButtonBase_NativeOnHoldProgress) == 0x000004, "Wrong alignment on CommonButtonBase_NativeOnHoldProgress");
static_assert(sizeof(CommonButtonBase_NativeOnHoldProgress) == 0x000008, "Wrong size on CommonButtonBase_NativeOnHoldProgress");
static_assert(offsetof(CommonButtonBase_NativeOnHoldProgress, DeltaTime) == 0x000000, "Member 'CommonButtonBase_NativeOnHoldProgress::DeltaTime' has a wrong offset!");
static_assert(offsetof(CommonButtonBase_NativeOnHoldProgress, ReturnValue) == 0x000004, "Member 'CommonButtonBase_NativeOnHoldProgress::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonBase.NativeOnHoldProgressRollback
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_NativeOnHoldProgressRollback final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CFD[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonButtonBase_NativeOnHoldProgressRollback) == 0x000004, "Wrong alignment on CommonButtonBase_NativeOnHoldProgressRollback");
static_assert(sizeof(CommonButtonBase_NativeOnHoldProgressRollback) == 0x000008, "Wrong size on CommonButtonBase_NativeOnHoldProgressRollback");
static_assert(offsetof(CommonButtonBase_NativeOnHoldProgressRollback, DeltaTime) == 0x000000, "Member 'CommonButtonBase_NativeOnHoldProgressRollback::DeltaTime' has a wrong offset!");
static_assert(offsetof(CommonButtonBase_NativeOnHoldProgressRollback, ReturnValue) == 0x000004, "Member 'CommonButtonBase_NativeOnHoldProgressRollback::ReturnValue' has a wrong offset!");

// Function CommonUI.CommonButtonBase.OnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct CommonButtonBase_OnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_OnActionProgress) == 0x000004, "Wrong alignment on CommonButtonBase_OnActionProgress");
static_assert(sizeof(CommonButtonBase_OnActionProgress) == 0x000004, "Wrong size on CommonButtonBase_OnActionProgress");
static_assert(offsetof(CommonButtonBase_OnActionProgress, HeldPercent) == 0x000000, "Member 'CommonButtonBase_OnActionProgress::HeldPercent' has a wrong offset!");

// Function CommonUI.CommonButtonBase.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_OnInputMethodChanged) == 0x000001, "Wrong alignment on CommonButtonBase_OnInputMethodChanged");
static_assert(sizeof(CommonButtonBase_OnInputMethodChanged) == 0x000001, "Wrong size on CommonButtonBase_OnInputMethodChanged");
static_assert(offsetof(CommonButtonBase_OnInputMethodChanged, CurrentInputType) == 0x000000, "Member 'CommonButtonBase_OnInputMethodChanged::CurrentInputType' has a wrong offset!");

// Function CommonUI.CommonButtonBase.OnTriggeredInputActionChanged
// 0x0010 (0x0010 - 0x0000)
struct CommonButtonBase_OnTriggeredInputActionChanged final
{
public:
	struct FDataTableRowHandle                    NewTriggeredAction;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_OnTriggeredInputActionChanged) == 0x000008, "Wrong alignment on CommonButtonBase_OnTriggeredInputActionChanged");
static_assert(sizeof(CommonButtonBase_OnTriggeredInputActionChanged) == 0x000010, "Wrong size on CommonButtonBase_OnTriggeredInputActionChanged");
static_assert(offsetof(CommonButtonBase_OnTriggeredInputActionChanged, NewTriggeredAction) == 0x000000, "Member 'CommonButtonBase_OnTriggeredInputActionChanged::NewTriggeredAction' has a wrong offset!");

// Function CommonUI.CommonButtonBase.OnTriggeringEnhancedInputActionChanged
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_OnTriggeringEnhancedInputActionChanged final
{
public:
	const class UInputAction*                     InInputAction;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_OnTriggeringEnhancedInputActionChanged) == 0x000008, "Wrong alignment on CommonButtonBase_OnTriggeringEnhancedInputActionChanged");
static_assert(sizeof(CommonButtonBase_OnTriggeringEnhancedInputActionChanged) == 0x000008, "Wrong size on CommonButtonBase_OnTriggeringEnhancedInputActionChanged");
static_assert(offsetof(CommonButtonBase_OnTriggeringEnhancedInputActionChanged, InInputAction) == 0x000000, "Member 'CommonButtonBase_OnTriggeringEnhancedInputActionChanged::InInputAction' has a wrong offset!");

// Function CommonUI.CommonButtonBase.OnTriggeringInputActionChanged
// 0x0010 (0x0010 - 0x0000)
struct CommonButtonBase_OnTriggeringInputActionChanged final
{
public:
	struct FDataTableRowHandle                    NewTriggeredAction;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_OnTriggeringInputActionChanged) == 0x000008, "Wrong alignment on CommonButtonBase_OnTriggeringInputActionChanged");
static_assert(sizeof(CommonButtonBase_OnTriggeringInputActionChanged) == 0x000010, "Wrong size on CommonButtonBase_OnTriggeringInputActionChanged");
static_assert(offsetof(CommonButtonBase_OnTriggeringInputActionChanged, NewTriggeredAction) == 0x000000, "Member 'CommonButtonBase_OnTriggeringInputActionChanged::NewTriggeredAction' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetClickMethod
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetClickMethod final
{
public:
	EButtonClickMethod                            InClickMethod;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetClickMethod) == 0x000001, "Wrong alignment on CommonButtonBase_SetClickMethod");
static_assert(sizeof(CommonButtonBase_SetClickMethod) == 0x000001, "Wrong size on CommonButtonBase_SetClickMethod");
static_assert(offsetof(CommonButtonBase_SetClickMethod, InClickMethod) == 0x000000, "Member 'CommonButtonBase_SetClickMethod::InClickMethod' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetHideInputAction
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetHideInputAction final
{
public:
	bool                                          bInHideInputAction;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetHideInputAction) == 0x000001, "Wrong alignment on CommonButtonBase_SetHideInputAction");
static_assert(sizeof(CommonButtonBase_SetHideInputAction) == 0x000001, "Wrong size on CommonButtonBase_SetHideInputAction");
static_assert(offsetof(CommonButtonBase_SetHideInputAction, bInHideInputAction) == 0x000000, "Member 'CommonButtonBase_SetHideInputAction::bInHideInputAction' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetHoveredSoundOverride
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_SetHoveredSoundOverride final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetHoveredSoundOverride) == 0x000008, "Wrong alignment on CommonButtonBase_SetHoveredSoundOverride");
static_assert(sizeof(CommonButtonBase_SetHoveredSoundOverride) == 0x000008, "Wrong size on CommonButtonBase_SetHoveredSoundOverride");
static_assert(offsetof(CommonButtonBase_SetHoveredSoundOverride, Sound) == 0x000000, "Member 'CommonButtonBase_SetHoveredSoundOverride::Sound' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetInputActionProgressMaterial
// 0x00E0 (0x00E0 - 0x0000)
struct CommonButtonBase_SetInputActionProgressMaterial final
{
public:
	struct FSlateBrush                            InProgressMaterialBrush;                           // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   InProgressMaterialParam;                           // 0x00D0(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CFE[0x8];                                     // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommonButtonBase_SetInputActionProgressMaterial) == 0x000010, "Wrong alignment on CommonButtonBase_SetInputActionProgressMaterial");
static_assert(sizeof(CommonButtonBase_SetInputActionProgressMaterial) == 0x0000E0, "Wrong size on CommonButtonBase_SetInputActionProgressMaterial");
static_assert(offsetof(CommonButtonBase_SetInputActionProgressMaterial, InProgressMaterialBrush) == 0x000000, "Member 'CommonButtonBase_SetInputActionProgressMaterial::InProgressMaterialBrush' has a wrong offset!");
static_assert(offsetof(CommonButtonBase_SetInputActionProgressMaterial, InProgressMaterialParam) == 0x0000D0, "Member 'CommonButtonBase_SetInputActionProgressMaterial::InProgressMaterialParam' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetIsFocusable
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetIsFocusable final
{
public:
	bool                                          bInIsFocusable;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetIsFocusable) == 0x000001, "Wrong alignment on CommonButtonBase_SetIsFocusable");
static_assert(sizeof(CommonButtonBase_SetIsFocusable) == 0x000001, "Wrong size on CommonButtonBase_SetIsFocusable");
static_assert(offsetof(CommonButtonBase_SetIsFocusable, bInIsFocusable) == 0x000000, "Member 'CommonButtonBase_SetIsFocusable::bInIsFocusable' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetIsInteractableWhenSelected
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetIsInteractableWhenSelected final
{
public:
	bool                                          bInInteractableWhenSelected;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetIsInteractableWhenSelected) == 0x000001, "Wrong alignment on CommonButtonBase_SetIsInteractableWhenSelected");
static_assert(sizeof(CommonButtonBase_SetIsInteractableWhenSelected) == 0x000001, "Wrong size on CommonButtonBase_SetIsInteractableWhenSelected");
static_assert(offsetof(CommonButtonBase_SetIsInteractableWhenSelected, bInInteractableWhenSelected) == 0x000000, "Member 'CommonButtonBase_SetIsInteractableWhenSelected::bInInteractableWhenSelected' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetIsInteractionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetIsInteractionEnabled final
{
public:
	bool                                          bInIsInteractionEnabled;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetIsInteractionEnabled) == 0x000001, "Wrong alignment on CommonButtonBase_SetIsInteractionEnabled");
static_assert(sizeof(CommonButtonBase_SetIsInteractionEnabled) == 0x000001, "Wrong size on CommonButtonBase_SetIsInteractionEnabled");
static_assert(offsetof(CommonButtonBase_SetIsInteractionEnabled, bInIsInteractionEnabled) == 0x000000, "Member 'CommonButtonBase_SetIsInteractionEnabled::bInIsInteractionEnabled' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetIsLocked
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetIsLocked final
{
public:
	bool                                          bInIsLocked;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetIsLocked) == 0x000001, "Wrong alignment on CommonButtonBase_SetIsLocked");
static_assert(sizeof(CommonButtonBase_SetIsLocked) == 0x000001, "Wrong size on CommonButtonBase_SetIsLocked");
static_assert(offsetof(CommonButtonBase_SetIsLocked, bInIsLocked) == 0x000000, "Member 'CommonButtonBase_SetIsLocked::bInIsLocked' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetIsSelectable
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetIsSelectable final
{
public:
	bool                                          bInIsSelectable;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetIsSelectable) == 0x000001, "Wrong alignment on CommonButtonBase_SetIsSelectable");
static_assert(sizeof(CommonButtonBase_SetIsSelectable) == 0x000001, "Wrong size on CommonButtonBase_SetIsSelectable");
static_assert(offsetof(CommonButtonBase_SetIsSelectable, bInIsSelectable) == 0x000000, "Member 'CommonButtonBase_SetIsSelectable::bInIsSelectable' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetIsSelected
// 0x0002 (0x0002 - 0x0000)
struct CommonButtonBase_SetIsSelected final
{
public:
	bool                                          InSelected;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGiveClickFeedback;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetIsSelected) == 0x000001, "Wrong alignment on CommonButtonBase_SetIsSelected");
static_assert(sizeof(CommonButtonBase_SetIsSelected) == 0x000002, "Wrong size on CommonButtonBase_SetIsSelected");
static_assert(offsetof(CommonButtonBase_SetIsSelected, InSelected) == 0x000000, "Member 'CommonButtonBase_SetIsSelected::InSelected' has a wrong offset!");
static_assert(offsetof(CommonButtonBase_SetIsSelected, bGiveClickFeedback) == 0x000001, "Member 'CommonButtonBase_SetIsSelected::bGiveClickFeedback' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetIsToggleable
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetIsToggleable final
{
public:
	bool                                          bInIsToggleable;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetIsToggleable) == 0x000001, "Wrong alignment on CommonButtonBase_SetIsToggleable");
static_assert(sizeof(CommonButtonBase_SetIsToggleable) == 0x000001, "Wrong size on CommonButtonBase_SetIsToggleable");
static_assert(offsetof(CommonButtonBase_SetIsToggleable, bInIsToggleable) == 0x000000, "Member 'CommonButtonBase_SetIsToggleable::bInIsToggleable' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetLockedHoveredSoundOverride
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_SetLockedHoveredSoundOverride final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetLockedHoveredSoundOverride) == 0x000008, "Wrong alignment on CommonButtonBase_SetLockedHoveredSoundOverride");
static_assert(sizeof(CommonButtonBase_SetLockedHoveredSoundOverride) == 0x000008, "Wrong size on CommonButtonBase_SetLockedHoveredSoundOverride");
static_assert(offsetof(CommonButtonBase_SetLockedHoveredSoundOverride, Sound) == 0x000000, "Member 'CommonButtonBase_SetLockedHoveredSoundOverride::Sound' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetLockedPressedSoundOverride
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_SetLockedPressedSoundOverride final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetLockedPressedSoundOverride) == 0x000008, "Wrong alignment on CommonButtonBase_SetLockedPressedSoundOverride");
static_assert(sizeof(CommonButtonBase_SetLockedPressedSoundOverride) == 0x000008, "Wrong size on CommonButtonBase_SetLockedPressedSoundOverride");
static_assert(offsetof(CommonButtonBase_SetLockedPressedSoundOverride, Sound) == 0x000000, "Member 'CommonButtonBase_SetLockedPressedSoundOverride::Sound' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetMinDimensions
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_SetMinDimensions final
{
public:
	int32                                         InMinWidth;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMinHeight;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetMinDimensions) == 0x000004, "Wrong alignment on CommonButtonBase_SetMinDimensions");
static_assert(sizeof(CommonButtonBase_SetMinDimensions) == 0x000008, "Wrong size on CommonButtonBase_SetMinDimensions");
static_assert(offsetof(CommonButtonBase_SetMinDimensions, InMinWidth) == 0x000000, "Member 'CommonButtonBase_SetMinDimensions::InMinWidth' has a wrong offset!");
static_assert(offsetof(CommonButtonBase_SetMinDimensions, InMinHeight) == 0x000004, "Member 'CommonButtonBase_SetMinDimensions::InMinHeight' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetPressedSoundOverride
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_SetPressedSoundOverride final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetPressedSoundOverride) == 0x000008, "Wrong alignment on CommonButtonBase_SetPressedSoundOverride");
static_assert(sizeof(CommonButtonBase_SetPressedSoundOverride) == 0x000008, "Wrong size on CommonButtonBase_SetPressedSoundOverride");
static_assert(offsetof(CommonButtonBase_SetPressedSoundOverride, Sound) == 0x000000, "Member 'CommonButtonBase_SetPressedSoundOverride::Sound' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetPressMethod
// 0x0001 (0x0001 - 0x0000)
struct CommonButtonBase_SetPressMethod final
{
public:
	EButtonPressMethod                            InPressMethod;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetPressMethod) == 0x000001, "Wrong alignment on CommonButtonBase_SetPressMethod");
static_assert(sizeof(CommonButtonBase_SetPressMethod) == 0x000001, "Wrong size on CommonButtonBase_SetPressMethod");
static_assert(offsetof(CommonButtonBase_SetPressMethod, InPressMethod) == 0x000000, "Member 'CommonButtonBase_SetPressMethod::InPressMethod' has a wrong offset!");

// Function CommonUI.CommonButtonBase.SetSelectedHoveredSoundOverride
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonBase_SetSelectedHoveredSoundOverride final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommonButtonBase_SetSelectedHoveredSoundOverride) == 0x000008, "Wrong alignment on CommonButtonBase_SetSelectedHoveredSoundOverride");
static_assert(sizeof(CommonButtonBase_SetSelectedHoveredSoundOverride) == 0x000008, "Wrong size on CommonButtonBase_SetSelectedHoveredSoundOverride");
static_assert(offsetof(CommonButtonBase_SetSelectedHoveredSoundOverride, Sound) == 0x000000, "Member 'CommonButtonBase_SetSelectedHoveredSoundOverride::Sound' has a wrong offset!");

