#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfirmDeleteLevel_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConfirmDeleteLevel_W.ConfirmDeleteLevel_W_C
// 0x0040 (0x0300 - 0x02C0)
class UConfirmDeleteLevel_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_103;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Delete_Button;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_52;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Filename;                                          // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ULocalLevelSlot_W_C*                    NewVar;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_ConfirmQuit_Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_ConfirmQuit_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_ConfirmDeleteLevel_W(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConfirmDeleteLevel_W_C">();
	}
	static class UConfirmDeleteLevel_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfirmDeleteLevel_W_C>();
	}
};
static_assert(alignof(UConfirmDeleteLevel_W_C) == 0x000008, "Wrong alignment on UConfirmDeleteLevel_W_C");
static_assert(sizeof(UConfirmDeleteLevel_W_C) == 0x000300, "Wrong size on UConfirmDeleteLevel_W_C");
static_assert(offsetof(UConfirmDeleteLevel_W_C, UberGraphFrame) == 0x0002C0, "Member 'UConfirmDeleteLevel_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConfirmDeleteLevel_W_C, Button_103) == 0x0002C8, "Member 'UConfirmDeleteLevel_W_C::Button_103' has a wrong offset!");
static_assert(offsetof(UConfirmDeleteLevel_W_C, Delete_Button) == 0x0002D0, "Member 'UConfirmDeleteLevel_W_C::Delete_Button' has a wrong offset!");
static_assert(offsetof(UConfirmDeleteLevel_W_C, TextBlock) == 0x0002D8, "Member 'UConfirmDeleteLevel_W_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UConfirmDeleteLevel_W_C, TextBlock_52) == 0x0002E0, "Member 'UConfirmDeleteLevel_W_C::TextBlock_52' has a wrong offset!");
static_assert(offsetof(UConfirmDeleteLevel_W_C, Filename) == 0x0002E8, "Member 'UConfirmDeleteLevel_W_C::Filename' has a wrong offset!");
static_assert(offsetof(UConfirmDeleteLevel_W_C, NewVar) == 0x0002F8, "Member 'UConfirmDeleteLevel_W_C::NewVar' has a wrong offset!");

}

