#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConstructionLift_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ConstructionLift_BP.ConstructionLift_BP_C.ExecuteUbergraph_ConstructionLift_BP
// 0x0178 (0x0178 - 0x0000)
struct ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB7[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Startb;                         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB8[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB9[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAtLocation_PitchMultiplier_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CBA[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAtLocation_VolumeMultiplier_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP) == 0x000008, "Wrong alignment on ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP");
static_assert(sizeof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP) == 0x000178, "Wrong size on ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, EntryPoint) == 0x000000, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_RLerp_ReturnValue) == 0x000010, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, Temp_bool_Variable) == 0x000028, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, Temp_bool_Variable_1) == 0x000029, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002B, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_HasAuthority_ReturnValue) == 0x00002C, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000030, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_GetTimelineLength_ReturnValue) == 0x000118, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, K2Node_CustomEvent_Startb) == 0x00011C, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::K2Node_CustomEvent_Startb' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000120, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, Temp_bool_Variable_2) == 0x000128, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000129, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000130, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000148, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000150, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_SpawnSoundAtLocation_PitchMultiplier_ImplicitCast) == 0x000158, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_SpawnSoundAtLocation_PitchMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000160, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_Delay_Duration_ImplicitCast) == 0x000168, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_Delay_Duration_ImplicitCast_1) == 0x00016C, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP, CallFunc_SpawnSoundAtLocation_VolumeMultiplier_ImplicitCast) == 0x000170, "Member 'ConstructionLift_BP_C_ExecuteUbergraph_ConstructionLift_BP::CallFunc_SpawnSoundAtLocation_VolumeMultiplier_ImplicitCast' has a wrong offset!");

// Function ConstructionLift_BP.ConstructionLift_BP_C.Repeat
// 0x0001 (0x0001 - 0x0000)
struct ConstructionLift_BP_C_Repeat final
{
public:
	bool                                          Startb;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConstructionLift_BP_C_Repeat) == 0x000001, "Wrong alignment on ConstructionLift_BP_C_Repeat");
static_assert(sizeof(ConstructionLift_BP_C_Repeat) == 0x000001, "Wrong size on ConstructionLift_BP_C_Repeat");
static_assert(offsetof(ConstructionLift_BP_C_Repeat, Startb) == 0x000000, "Member 'ConstructionLift_BP_C_Repeat::Startb' has a wrong offset!");

}

