#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "Constraints_structs.hpp"
#include "Constraints_classes.hpp"
#include "RigVM_classes.hpp"
#include "ControlRig_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AnimationCore_structs.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class ControlRig.ControlRigShapeLibraryLink
// 0x0018 (0x0118 - 0x0100)
class UControlRigShapeLibraryLink final : public UNameSpacedUserData
{
public:
	class UControlRigShapeLibrary*                ShapeLibrary;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ShapeNames;                                        // 0x0108(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void SetShapeLibrary(class UControlRigShapeLibrary* InShapeLibrary);

	class UControlRigShapeLibrary* GetShapeLibrary() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigShapeLibraryLink">();
	}
	static class UControlRigShapeLibraryLink* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigShapeLibraryLink>();
	}
};
static_assert(alignof(UControlRigShapeLibraryLink) == 0x000008, "Wrong alignment on UControlRigShapeLibraryLink");
static_assert(sizeof(UControlRigShapeLibraryLink) == 0x000118, "Wrong size on UControlRigShapeLibraryLink");
static_assert(offsetof(UControlRigShapeLibraryLink, ShapeLibrary) == 0x000100, "Member 'UControlRigShapeLibraryLink::ShapeLibrary' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibraryLink, ShapeNames) == 0x000108, "Member 'UControlRigShapeLibraryLink::ShapeNames' has a wrong offset!");

// Class ControlRig.RigHierarchy
// 0x0358 (0x0380 - 0x0028)
class alignas(0x10) URigHierarchy final : public UObject
{
public:
	uint8                                         Pad_229A[0x18];                                    // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ModifiedEventDynamic;                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_229B[0x48];                                    // 0x0050(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        TopologyVersion;                                   // 0x0098(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        MetadataVersion;                                   // 0x009A(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        MetadataTagVersion;                                // 0x009C(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableDirtyPropagation;                           // 0x009E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_229C[0x99];                                    // 0x009F(0x0099)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TransformStackIndex;                               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_229D[0x74];                                    // 0x013C(0x0074)(Fixing Size After Last Property [ Dumper-7 ])
	class URigHierarchyController*                HierarchyController;                               // 0x01B0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_229E[0x58];                                    // 0x01B8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FRigElementKey, struct FRigElementKey> PreviousNameMap;                                   // 0x0210(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_229F[0x80];                                    // 0x0260(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	class URigHierarchy*                          HierarchyForCacheValidation;                       // 0x02E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_22A0[0x98];                                    // 0x02E8(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FEulerTransform GetEulerTransformFromControlValue(const struct FRigControlValue& InValue);
	static float GetFloatFromControlValue(const struct FRigControlValue& InValue);
	static int32 GetIntFromControlValue(const struct FRigControlValue& InValue);
	static struct FRotator GetRotatorFromControlValue(const struct FRigControlValue& InValue);
	static struct FTransform GetTransformFromControlValue(const struct FRigControlValue& InValue);
	static struct FTransformNoScale GetTransformNoScaleFromControlValue(const struct FRigControlValue& InValue);
	static struct FVector2D GetVector2DFromControlValue(const struct FRigControlValue& InValue);
	static struct FVector GetVectorFromControlValue(const struct FRigControlValue& InValue);
	static struct FRigControlValue MakeControlValueFromBool(bool InValue);
	static struct FRigControlValue MakeControlValueFromEulerTransform(const struct FEulerTransform& InValue);
	static struct FRigControlValue MakeControlValueFromFloat(float InValue);
	static struct FRigControlValue MakeControlValueFromInt(int32 InValue);
	static struct FRigControlValue MakeControlValueFromRotator(const struct FRotator& InValue);
	static struct FRigControlValue MakeControlValueFromTransform(const struct FTransform& InValue);
	static struct FRigControlValue MakeControlValueFromTransformNoScale(const struct FTransformNoScale& InValue);
	static struct FRigControlValue MakeControlValueFromVector(const struct FVector& InValue);
	static struct FRigControlValue MakeControlValueFromVector2D(const struct FVector2D& InValue);

	void CopyHierarchy(class URigHierarchy* InHierarchy);
	void CopyPose(class URigHierarchy* InHierarchy, bool bCurrent, bool bInitial, bool bWeights, bool bMatchPoseInGlobalIfNeeded);
	class URigHierarchyController* GetController(bool bCreateIfNeeded);
	TArray<class FName> GetMetadataNames(const struct FRigElementKey& InItem);
	ERigMetadataType GetMetadataType(const struct FRigElementKey& InItem, class FName InMetadataName);
	bool RemoveAllMetadata(const struct FRigElementKey& InItem);
	bool RemoveMetadata(const struct FRigElementKey& InItem, class FName InMetadataName);
	void Reset();
	void ResetCurveValues();
	void ResetPoseToInitial(ERigElementType InTypeFilter);
	void ResetToDefault();
	void SendAutoKeyEvent(const struct FRigElementKey& InElement, float InOffsetInSeconds, bool bAsynchronous);
	bool SetBoolArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<bool>& InValue);
	bool SetBoolMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, bool InValue);
	void SetControlOffsetTransform(const struct FRigElementKey& InKey, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommands);
	void SetControlOffsetTransformByIndex(int32 InElementIndex, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommands);
	void SetControlPreferredEulerAngles(const struct FRigElementKey& InKey, const struct FVector& InEulerAngles, EEulerRotationOrder InRotationOrder, bool bInitial, bool bFixEulerFlips);
	void SetControlPreferredEulerAnglesByIndex(int32 InElementIndex, const struct FVector& InEulerAngles, EEulerRotationOrder InRotationOrder, bool bInitial, bool bFixEulerFlips);
	void SetControlPreferredRotationOrder(const struct FRigElementKey& InKey, EEulerRotationOrder InRotationOrder);
	void SetControlPreferredRotationOrderByIndex(int32 InElementIndex, EEulerRotationOrder InRotationOrder);
	void SetControlPreferredRotator(const struct FRigElementKey& InKey, const struct FRotator& InRotator, bool bInitial, bool bFixEulerFlips);
	void SetControlPreferredRotatorByIndex(int32 InElementIndex, const struct FRotator& InRotator, bool bInitial, bool bFixEulerFlips);
	void SetControlSettings(const struct FRigElementKey& InKey, const struct FRigControlSettings& InSettings, bool bSetupUndo, bool bForce, bool bPrintPythonCommands);
	void SetControlSettingsByIndex(int32 InElementIndex, const struct FRigControlSettings& InSettings, bool bSetupUndo, bool bForce, bool bPrintPythonCommands);
	void SetControlShapeTransform(const struct FRigElementKey& InKey, const struct FTransform& InTransform, bool bInitial, bool bSetupUndo);
	void SetControlShapeTransformByIndex(int32 InElementIndex, const struct FTransform& InTransform, bool bInitial, bool bSetupUndo);
	void SetControlValue(const struct FRigElementKey& InKey, const struct FRigControlValue& InValue, ERigControlValueType InValueType, bool bSetupUndo, bool bPrintPythonCommands);
	void SetControlValueByIndex(int32 InElementIndex, const struct FRigControlValue& InValue, ERigControlValueType InValueType, bool bSetupUndo, bool bPrintPythonCommands);
	void SetControlVisibility(const struct FRigElementKey& InKey, bool bVisibility);
	void SetControlVisibilityByIndex(int32 InElementIndex, bool bVisibility);
	void SetCurveValue(const struct FRigElementKey& InKey, float InValue, bool bSetupUndo);
	void SetCurveValueByIndex(int32 InElementIndex, float InValue, bool bSetupUndo);
	bool SetFloatArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<float>& InValue);
	bool SetFloatMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, float InValue);
	void SetGlobalTransform(const struct FRigElementKey& InKey, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommand);
	void SetGlobalTransformByIndex(int32 InElementIndex, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommand);
	bool SetInt32ArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<int32>& InValue);
	bool SetInt32Metadata(const struct FRigElementKey& InItem, class FName InMetadataName, int32 InValue);
	bool SetLinearColorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FLinearColor>& InValue);
	bool SetLinearColorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FLinearColor& InValue);
	void SetLocalTransform(const struct FRigElementKey& InKey, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommands);
	void SetLocalTransformByIndex(int32 InElementIndex, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommands);
	bool SetNameArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<class FName>& InValue);
	bool SetNameMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, class FName InValue);
	bool SetParentWeight(const struct FRigElementKey& InChild, const struct FRigElementKey& InParent, const struct FRigElementWeight& InWeight, bool bInitial, bool bAffectChildren);
	bool SetParentWeightArray(const struct FRigElementKey& InChild, const TArray<struct FRigElementWeight>& InWeights, bool bInitial, bool bAffectChildren);
	void SetPose_ForBlueprint(const struct FRigPose& InPose);
	bool SetQuatArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FQuat>& InValue);
	bool SetQuatMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FQuat& InValue);
	bool SetRigElementKeyArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FRigElementKey>& InValue);
	bool SetRigElementKeyMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FRigElementKey& InValue);
	bool SetRotatorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FRotator>& InValue);
	bool SetRotatorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FRotator& InValue);
	bool SetTag(const struct FRigElementKey& InItem, class FName InTag);
	bool SetTransformArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FTransform>& InValue);
	bool SetTransformMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FTransform& InValue);
	bool SetVectorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FVector>& InValue);
	bool SetVectorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FVector& InValue);
	bool SwitchToDefaultParent(const struct FRigElementKey& InChild, bool bInitial, bool bAffectChildren);
	bool SwitchToParent(const struct FRigElementKey& InChild, const struct FRigElementKey& InParent, bool bInitial, bool bAffectChildren);
	bool SwitchToWorldSpace(const struct FRigElementKey& InChild, bool bInitial, bool bAffectChildren);
	void UnsetCurveValue(const struct FRigElementKey& InKey, bool bSetupUndo);
	void UnsetCurveValueByIndex(int32 InElementIndex, bool bSetupUndo);

	bool Contains_ForBlueprint(const struct FRigElementKey& InKey) const;
	struct FRigBoneElement FindBone_ForBlueprintOnly(const struct FRigElementKey& InKey) const;
	struct FRigControlElement FindControl_ForBlueprintOnly(const struct FRigElementKey& InKey) const;
	struct FRigNullElement FindNull_ForBlueprintOnly(const struct FRigElementKey& InKey) const;
	TArray<struct FRigElementKey> GetAllKeys_ForBlueprint(bool bTraverse) const;
	TArray<struct FRigElementKey> GetBoneKeys(bool bTraverse) const;
	TArray<bool> GetBoolArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	bool GetBoolMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, bool DefaultValue) const;
	TArray<struct FRigElementKey> GetChildren(const struct FRigElementKey& InKey, bool bRecursive) const;
	TArray<struct FRigElementKey> GetControlKeys(bool bTraverse) const;
	struct FVector GetControlPreferredEulerAngles(const struct FRigElementKey& InKey, EEulerRotationOrder InRotationOrder, bool bInitial) const;
	struct FVector GetControlPreferredEulerAnglesByIndex(int32 InElementIndex, EEulerRotationOrder InRotationOrder, bool bInitial) const;
	EEulerRotationOrder GetControlPreferredEulerRotationOrder(const struct FRigElementKey& InKey, bool bFromSettings) const;
	EEulerRotationOrder GetControlPreferredEulerRotationOrderByIndex(int32 InElementIndex, bool bFromSettings) const;
	struct FRotator GetControlPreferredRotator(const struct FRigElementKey& InKey, bool bInitial) const;
	struct FRotator GetControlPreferredRotatorByIndex(int32 InElementIndex, bool bInitial) const;
	struct FRigControlValue GetControlValue(const struct FRigElementKey& InKey, ERigControlValueType InValueType) const;
	struct FRigControlValue GetControlValueByIndex(int32 InElementIndex, ERigControlValueType InValueType) const;
	TArray<struct FRigElementKey> GetCurveKeys() const;
	float GetCurveValue(const struct FRigElementKey& InKey) const;
	float GetCurveValueByIndex(int32 InElementIndex) const;
	struct FRigElementKey GetDefaultParent(const struct FRigElementKey& InKey) const;
	struct FRigElementKey GetFirstParent(const struct FRigElementKey& InKey) const;
	TArray<float> GetFloatArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	float GetFloatMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, float DefaultValue) const;
	struct FTransform GetGlobalControlOffsetTransform(const struct FRigElementKey& InKey, bool bInitial) const;
	struct FTransform GetGlobalControlOffsetTransformByIndex(int32 InElementIndex, bool bInitial) const;
	struct FTransform GetGlobalControlShapeTransform(const struct FRigElementKey& InKey, bool bInitial) const;
	struct FTransform GetGlobalControlShapeTransformByIndex(int32 InElementIndex, bool bInitial) const;
	struct FTransform GetGlobalTransform(const struct FRigElementKey& InKey, bool bInitial) const;
	struct FTransform GetGlobalTransformByIndex(int32 InElementIndex, bool bInitial) const;
	int32 GetIndex_ForBlueprint(const struct FRigElementKey& InKey) const;
	TArray<int32> GetInt32ArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	int32 GetInt32Metadata(const struct FRigElementKey& InItem, class FName InMetadataName, int32 DefaultValue) const;
	struct FRigElementKey GetKey(int32 InElementIndex) const;
	TArray<struct FRigElementKey> GetKeys(const TArray<int32>& InElementIndices) const;
	TArray<struct FLinearColor> GetLinearColorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	struct FLinearColor GetLinearColorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FLinearColor& DefaultValue) const;
	struct FTransform GetLocalControlShapeTransform(const struct FRigElementKey& InKey, bool bInitial) const;
	struct FTransform GetLocalControlShapeTransformByIndex(int32 InElementIndex, bool bInitial) const;
	int32 GetLocalIndex_ForBlueprint(const struct FRigElementKey& InKey) const;
	struct FTransform GetLocalTransform(const struct FRigElementKey& InKey, bool bInitial) const;
	struct FTransform GetLocalTransformByIndex(int32 InElementIndex, bool bInitial) const;
	TArray<class FName> GetNameArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	class FName GetNameMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, class FName DefaultValue) const;
	TArray<struct FRigElementKey> GetNullKeys(bool bTraverse) const;
	int32 GetNumberOfParents(const struct FRigElementKey& InKey) const;
	TArray<struct FRigElementKey> GetParents(const struct FRigElementKey& InKey, bool bRecursive) const;
	struct FTransform GetParentTransform(const struct FRigElementKey& InKey, bool bInitial) const;
	struct FTransform GetParentTransformByIndex(int32 InElementIndex, bool bInitial) const;
	struct FRigElementWeight GetParentWeight(const struct FRigElementKey& InChild, const struct FRigElementKey& InParent, bool bInitial) const;
	TArray<struct FRigElementWeight> GetParentWeightArray(const struct FRigElementKey& InChild, bool bInitial) const;
	struct FRigPose GetPose(bool bInitial) const;
	class FName GetPreviousName(const struct FRigElementKey& InKey) const;
	struct FRigElementKey GetPreviousParent(const struct FRigElementKey& InKey) const;
	TArray<struct FQuat> GetQuatArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	struct FQuat GetQuatMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FQuat& DefaultValue) const;
	TArray<struct FRigElementKey> GetReferenceKeys(bool bTraverse) const;
	TArray<struct FRigElementKey> GetRigElementKeyArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	struct FRigElementKey GetRigElementKeyMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FRigElementKey& DefaultValue) const;
	TArray<struct FRigElementKey> GetRigidBodyKeys(bool bTraverse) const;
	TArray<struct FRigElementKey> GetRootElementKeys() const;
	TArray<struct FRotator> GetRotatorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	struct FRotator GetRotatorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FRotator& DefaultValue) const;
	TArray<struct FRigElementKey> GetSelectedKeys(ERigElementType InTypeFilter) const;
	TArray<class FName> GetTags(const struct FRigElementKey& InItem) const;
	TArray<struct FTransform> GetTransformArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	struct FTransform GetTransformMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FTransform& DefaultValue) const;
	TArray<struct FVector> GetVectorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const;
	struct FVector GetVectorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FVector& DefaultValue) const;
	bool HasTag(const struct FRigElementKey& InItem, class FName InTag) const;
	bool IsControllerAvailable() const;
	bool IsCurveValueSet(const struct FRigElementKey& InKey) const;
	bool IsCurveValueSetByIndex(int32 InElementIndex) const;
	bool IsParentedTo(const struct FRigElementKey& InChild, const struct FRigElementKey& InParent) const;
	bool IsProcedural(const struct FRigElementKey& InKey) const;
	bool IsSelected(const struct FRigElementKey& InKey) const;
	bool IsSelectedByIndex(int32 InIndex) const;
	bool IsValidIndex(int32 InElementIndex) const;
	int32 Num() const;
	TArray<struct FRigElementKey> SortKeys(const TArray<struct FRigElementKey>& InKeys) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigHierarchy">();
	}
	static class URigHierarchy* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigHierarchy>();
	}
};
static_assert(alignof(URigHierarchy) == 0x000010, "Wrong alignment on URigHierarchy");
static_assert(sizeof(URigHierarchy) == 0x000380, "Wrong size on URigHierarchy");
static_assert(offsetof(URigHierarchy, ModifiedEventDynamic) == 0x000040, "Member 'URigHierarchy::ModifiedEventDynamic' has a wrong offset!");
static_assert(offsetof(URigHierarchy, TopologyVersion) == 0x000098, "Member 'URigHierarchy::TopologyVersion' has a wrong offset!");
static_assert(offsetof(URigHierarchy, MetadataVersion) == 0x00009A, "Member 'URigHierarchy::MetadataVersion' has a wrong offset!");
static_assert(offsetof(URigHierarchy, MetadataTagVersion) == 0x00009C, "Member 'URigHierarchy::MetadataTagVersion' has a wrong offset!");
static_assert(offsetof(URigHierarchy, bEnableDirtyPropagation) == 0x00009E, "Member 'URigHierarchy::bEnableDirtyPropagation' has a wrong offset!");
static_assert(offsetof(URigHierarchy, TransformStackIndex) == 0x000138, "Member 'URigHierarchy::TransformStackIndex' has a wrong offset!");
static_assert(offsetof(URigHierarchy, HierarchyController) == 0x0001B0, "Member 'URigHierarchy::HierarchyController' has a wrong offset!");
static_assert(offsetof(URigHierarchy, PreviousNameMap) == 0x000210, "Member 'URigHierarchy::PreviousNameMap' has a wrong offset!");
static_assert(offsetof(URigHierarchy, HierarchyForCacheValidation) == 0x0002E0, "Member 'URigHierarchy::HierarchyForCacheValidation' has a wrong offset!");

// Class ControlRig.TransformableControlHandle
// 0x0030 (0x0088 - 0x0058)
class UTransformableControlHandle final : public UTransformableHandle
{
public:
	TSoftObjectPtr<class UControlRig>             ControlRig;                                        // 0x0058(0x0028)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ControlName;                                       // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TransformableControlHandle">();
	}
	static class UTransformableControlHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransformableControlHandle>();
	}
};
static_assert(alignof(UTransformableControlHandle) == 0x000008, "Wrong alignment on UTransformableControlHandle");
static_assert(sizeof(UTransformableControlHandle) == 0x000088, "Wrong size on UTransformableControlHandle");
static_assert(offsetof(UTransformableControlHandle, ControlRig) == 0x000058, "Member 'UTransformableControlHandle::ControlRig' has a wrong offset!");
static_assert(offsetof(UTransformableControlHandle, ControlName) == 0x000080, "Member 'UTransformableControlHandle::ControlName' has a wrong offset!");

// Class ControlRig.ControlRig
// 0x02D8 (0x0610 - 0x0338)
class UControlRig : public URigVMHost
{
public:
	uint8                                         Pad_2340[0x8];                                     // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ERigExecutionType                             ExecutionType;                                     // 0x0340(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2341[0x3];                                     // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigHierarchySettings                  HierarchySettings;                                 // 0x0344(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	TMap<struct FRigElementKey, struct FRigControlElementCustomization> ControlCustomizations;                             // 0x0348(0x0050)(Protected, NativeAccessSpecifierProtected)
	class URigHierarchy*                          DynamicHierarchy;                                  // 0x0398(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UControlRigShapeLibrary>> ShapeLibraries;                                    // 0x03A0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FString, class FString>            ShapeLibraryNameMap;                               // 0x03B0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2342[0x18];                                    // 0x0400(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationDataSourceRegistry*           DataSourceRegistry;                                // 0x0418(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2343[0x90];                                    // 0x0420(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigInfluenceMapPerEvent               Influences;                                        // 0x04B0(0x0060)(NativeAccessSpecifierPrivate)
	class UControlRig*                            InteractionRig;                                    // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UControlRig>                InteractionRigClass;                               // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2344[0xD0];                                    // 0x0520(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastSparseDelegateProperty_             OnControlSelected_BP;                              // 0x05F0(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2345[0x1F];                                    // 0x05F1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<class UControlRig*> FindControlRigs(class UObject* Param_Outer, TSubclassOf<class UControlRig> OptionalClass);

	bool ClearControlSelection();
	class URigHierarchy* GetHierarchy();
	void OnControlSelectedBP__DelegateSignature(class UControlRig* Rig, const struct FRigControlElement& Control, bool bSelected);
	void RequestConstruction();
	void SelectControl(const class FName& InControlName, bool bSelect);
	void SetInteractionRig(class UControlRig* InInteractionRig);
	void SetInteractionRigClass(TSubclassOf<class UControlRig> InInteractionRigClass);

	class UTransformableControlHandle* CreateTransformableControlHandle(class UObject* Param_Outer, const class FName& ControlName) const;
	TArray<class FName> CurrentControlSelection() const;
	class AActor* GetHostingActor() const;
	class UControlRig* GetInteractionRig() const;
	TSubclassOf<class UControlRig> GetInteractionRigClass() const;
	bool IsControlSelected(const class FName& InControlName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRig">();
	}
	static class UControlRig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRig>();
	}
};
static_assert(alignof(UControlRig) == 0x000008, "Wrong alignment on UControlRig");
static_assert(sizeof(UControlRig) == 0x000610, "Wrong size on UControlRig");
static_assert(offsetof(UControlRig, ExecutionType) == 0x000340, "Member 'UControlRig::ExecutionType' has a wrong offset!");
static_assert(offsetof(UControlRig, HierarchySettings) == 0x000344, "Member 'UControlRig::HierarchySettings' has a wrong offset!");
static_assert(offsetof(UControlRig, ControlCustomizations) == 0x000348, "Member 'UControlRig::ControlCustomizations' has a wrong offset!");
static_assert(offsetof(UControlRig, DynamicHierarchy) == 0x000398, "Member 'UControlRig::DynamicHierarchy' has a wrong offset!");
static_assert(offsetof(UControlRig, ShapeLibraries) == 0x0003A0, "Member 'UControlRig::ShapeLibraries' has a wrong offset!");
static_assert(offsetof(UControlRig, ShapeLibraryNameMap) == 0x0003B0, "Member 'UControlRig::ShapeLibraryNameMap' has a wrong offset!");
static_assert(offsetof(UControlRig, DataSourceRegistry) == 0x000418, "Member 'UControlRig::DataSourceRegistry' has a wrong offset!");
static_assert(offsetof(UControlRig, Influences) == 0x0004B0, "Member 'UControlRig::Influences' has a wrong offset!");
static_assert(offsetof(UControlRig, InteractionRig) == 0x000510, "Member 'UControlRig::InteractionRig' has a wrong offset!");
static_assert(offsetof(UControlRig, InteractionRigClass) == 0x000518, "Member 'UControlRig::InteractionRigClass' has a wrong offset!");
static_assert(offsetof(UControlRig, OnControlSelected_BP) == 0x0005F0, "Member 'UControlRig::OnControlSelected_BP' has a wrong offset!");

// Class ControlRig.ControlRigAnimInstance
// 0x0000 (0x0350 - 0x0350)
class UControlRigAnimInstance final : public UAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigAnimInstance">();
	}
	static class UControlRigAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigAnimInstance>();
	}
};
static_assert(alignof(UControlRigAnimInstance) == 0x000010, "Wrong alignment on UControlRigAnimInstance");
static_assert(sizeof(UControlRigAnimInstance) == 0x000350, "Wrong size on UControlRigAnimInstance");

// Class ControlRig.ControlRigBlueprintGeneratedClass
// 0x0000 (0x0390 - 0x0390)
class UControlRigBlueprintGeneratedClass final : public URigVMBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigBlueprintGeneratedClass">();
	}
	static class UControlRigBlueprintGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigBlueprintGeneratedClass>();
	}
};
static_assert(alignof(UControlRigBlueprintGeneratedClass) == 0x000008, "Wrong alignment on UControlRigBlueprintGeneratedClass");
static_assert(sizeof(UControlRigBlueprintGeneratedClass) == 0x000390, "Wrong size on UControlRigBlueprintGeneratedClass");

// Class ControlRig.ControlRigComponent
// 0x0160 (0x06D0 - 0x0570)
class UControlRigComponent final : public UPrimitiveComponent
{
public:
	TSubclassOf<class UControlRig>                ControlRigClass;                                   // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPreInitializeDelegate;                           // 0x0578(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPostInitializeDelegate;                          // 0x0588(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPreConstructionDelegate;                         // 0x0598(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPostConstructionDelegate;                        // 0x05A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPreForwardsSolveDelegate;                        // 0x05B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPostForwardsSolveDelegate;                       // 0x05C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FControlRigComponentMappedElement> UserDefinedElements;                               // 0x05D8(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FControlRigComponentMappedElement> MappedElements;                                    // 0x05E8(0x0010)(Edit, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bEnableLazyEvaluation;                             // 0x05F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_234A[0x3];                                     // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LazyEvaluationPositionThreshold;                   // 0x05FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LazyEvaluationRotationThreshold;                   // 0x0600(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LazyEvaluationScaleThreshold;                      // 0x0604(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetTransformBeforeTick;                         // 0x0608(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetInitialsBeforeConstruction;                  // 0x0609(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateRigOnTick;                                  // 0x060A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateInEditor;                                   // 0x060B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawBones;                                        // 0x060C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugDrawing;                                 // 0x060D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_234B[0x2];                                     // 0x060E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UControlRig*                            ControlRig;                                        // 0x0610(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_234C[0xB8];                                    // 0x0618(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddMappedCompleteSkeletalMesh(class USkeletalMeshComponent* SkeletalMeshComponent);
	void AddMappedComponents(const TArray<struct FControlRigComponentMappedComponent>& Components);
	void AddMappedElements(const TArray<struct FControlRigComponentMappedElement>& NewMappedElements);
	void AddMappedSkeletalMesh(class USkeletalMeshComponent* SkeletalMeshComponent, const TArray<struct FControlRigComponentMappedBone>& Bones, const TArray<struct FControlRigComponentMappedCurve>& Curves);
	bool CanExecute();
	void ClearMappedElements();
	bool DoesElementExist(class FName Param_Name, ERigElementType ElementType);
	struct FTransform GetBoneTransform(class FName BoneName, EControlRigComponentSpace Space);
	bool GetControlBool(class FName ControlName);
	float GetControlFloat(class FName ControlName);
	int32 GetControlInt(class FName ControlName);
	struct FTransform GetControlOffset(class FName ControlName, EControlRigComponentSpace Space);
	struct FVector GetControlPosition(class FName ControlName, EControlRigComponentSpace Space);
	class UControlRig* GetControlRig();
	struct FRotator GetControlRotator(class FName ControlName, EControlRigComponentSpace Space);
	struct FVector GetControlScale(class FName ControlName, EControlRigComponentSpace Space);
	struct FTransform GetControlTransform(class FName ControlName, EControlRigComponentSpace Space);
	struct FVector2D GetControlVector2D(class FName ControlName);
	TArray<class FName> GetElementNames(ERigElementType ElementType);
	struct FTransform GetInitialBoneTransform(class FName BoneName, EControlRigComponentSpace Space);
	struct FTransform GetInitialSpaceTransform(class FName SpaceName, EControlRigComponentSpace Space);
	struct FTransform GetSpaceTransform(class FName SpaceName, EControlRigComponentSpace Space);
	void Initialize();
	void OnPostConstruction(class UControlRigComponent* Component);
	void OnPostForwardsSolve(class UControlRigComponent* Component);
	void OnPostInitialize(class UControlRigComponent* Component);
	void OnPreConstruction(class UControlRigComponent* Component);
	void OnPreForwardsSolve(class UControlRigComponent* Component);
	void OnPreInitialize(class UControlRigComponent* Component);
	void SetBoneInitialTransformsFromSkeletalMesh(class USkeletalMesh* InSkeletalMesh);
	void SetBoneTransform(class FName BoneName, const struct FTransform& Transform, EControlRigComponentSpace Space, float Weight, bool bPropagateToChildren);
	void SetControlBool(class FName ControlName, bool Value);
	void SetControlFloat(class FName ControlName, float Value);
	void SetControlInt(class FName ControlName, int32 Value);
	void SetControlOffset(class FName ControlName, const struct FTransform& OffsetTransform, EControlRigComponentSpace Space);
	void SetControlPosition(class FName ControlName, const struct FVector& Value, EControlRigComponentSpace Space);
	void SetControlRigClass(TSubclassOf<class UControlRig> InControlRigClass);
	void SetControlRotator(class FName ControlName, const struct FRotator& Value, EControlRigComponentSpace Space);
	void SetControlScale(class FName ControlName, const struct FVector& Value, EControlRigComponentSpace Space);
	void SetControlTransform(class FName ControlName, const struct FTransform& Value, EControlRigComponentSpace Space);
	void SetControlVector2D(class FName ControlName, const struct FVector2D& Value);
	void SetInitialBoneTransform(class FName BoneName, const struct FTransform& InitialTransform, EControlRigComponentSpace Space, bool bPropagateToChildren);
	void SetInitialSpaceTransform(class FName SpaceName, const struct FTransform& InitialTransform, EControlRigComponentSpace Space);
	void SetMappedElements(const TArray<struct FControlRigComponentMappedElement>& NewMappedElements);
	void SetObjectBinding(class UObject* InObjectToBind);
	void Update(float DeltaTime);

	float GetAbsoluteTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigComponent">();
	}
	static class UControlRigComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigComponent>();
	}
};
static_assert(alignof(UControlRigComponent) == 0x000010, "Wrong alignment on UControlRigComponent");
static_assert(sizeof(UControlRigComponent) == 0x0006D0, "Wrong size on UControlRigComponent");
static_assert(offsetof(UControlRigComponent, ControlRigClass) == 0x000570, "Member 'UControlRigComponent::ControlRigClass' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPreInitializeDelegate) == 0x000578, "Member 'UControlRigComponent::OnPreInitializeDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPostInitializeDelegate) == 0x000588, "Member 'UControlRigComponent::OnPostInitializeDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPreConstructionDelegate) == 0x000598, "Member 'UControlRigComponent::OnPreConstructionDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPostConstructionDelegate) == 0x0005A8, "Member 'UControlRigComponent::OnPostConstructionDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPreForwardsSolveDelegate) == 0x0005B8, "Member 'UControlRigComponent::OnPreForwardsSolveDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPostForwardsSolveDelegate) == 0x0005C8, "Member 'UControlRigComponent::OnPostForwardsSolveDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, UserDefinedElements) == 0x0005D8, "Member 'UControlRigComponent::UserDefinedElements' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, MappedElements) == 0x0005E8, "Member 'UControlRigComponent::MappedElements' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bEnableLazyEvaluation) == 0x0005F8, "Member 'UControlRigComponent::bEnableLazyEvaluation' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, LazyEvaluationPositionThreshold) == 0x0005FC, "Member 'UControlRigComponent::LazyEvaluationPositionThreshold' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, LazyEvaluationRotationThreshold) == 0x000600, "Member 'UControlRigComponent::LazyEvaluationRotationThreshold' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, LazyEvaluationScaleThreshold) == 0x000604, "Member 'UControlRigComponent::LazyEvaluationScaleThreshold' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bResetTransformBeforeTick) == 0x000608, "Member 'UControlRigComponent::bResetTransformBeforeTick' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bResetInitialsBeforeConstruction) == 0x000609, "Member 'UControlRigComponent::bResetInitialsBeforeConstruction' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bUpdateRigOnTick) == 0x00060A, "Member 'UControlRigComponent::bUpdateRigOnTick' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bUpdateInEditor) == 0x00060B, "Member 'UControlRigComponent::bUpdateInEditor' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bDrawBones) == 0x00060C, "Member 'UControlRigComponent::bDrawBones' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bShowDebugDrawing) == 0x00060D, "Member 'UControlRigComponent::bShowDebugDrawing' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, ControlRig) == 0x000610, "Member 'UControlRigComponent::ControlRig' has a wrong offset!");

// Class ControlRig.ControlRigControlActor
// 0x00B0 (0x0348 - 0x0298)
class AControlRigControlActor final : public AActor
{
public:
	class AActor*                                 ActorToTrack;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UControlRig>                ControlRigClass;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRefreshOnTick;                                    // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSelectable;                                     // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2368[0x6];                                     // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MaterialOverride;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ColorParameter;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastShadows;                                      // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2369[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        ActorRootComponent;                                // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UControlRig>             ControlRig;                                        // 0x02D8(0x0028)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           ControlNames;                                      // 0x0300(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                     ShapeTransforms;                                   // 0x0310(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UStaticMeshComponent*>           Components;                                        // 0x0320(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x0330(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class FName                                   ColorParameterName;                                // 0x0340(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Clear();
	void Refresh();
	void ResetControlActor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigControlActor">();
	}
	static class AControlRigControlActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AControlRigControlActor>();
	}
};
static_assert(alignof(AControlRigControlActor) == 0x000008, "Wrong alignment on AControlRigControlActor");
static_assert(sizeof(AControlRigControlActor) == 0x000348, "Wrong size on AControlRigControlActor");
static_assert(offsetof(AControlRigControlActor, ActorToTrack) == 0x000298, "Member 'AControlRigControlActor::ActorToTrack' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ControlRigClass) == 0x0002A0, "Member 'AControlRigControlActor::ControlRigClass' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, bRefreshOnTick) == 0x0002A8, "Member 'AControlRigControlActor::bRefreshOnTick' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, bIsSelectable) == 0x0002A9, "Member 'AControlRigControlActor::bIsSelectable' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, MaterialOverride) == 0x0002B0, "Member 'AControlRigControlActor::MaterialOverride' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ColorParameter) == 0x0002B8, "Member 'AControlRigControlActor::ColorParameter' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, bCastShadows) == 0x0002C8, "Member 'AControlRigControlActor::bCastShadows' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ActorRootComponent) == 0x0002D0, "Member 'AControlRigControlActor::ActorRootComponent' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ControlRig) == 0x0002D8, "Member 'AControlRigControlActor::ControlRig' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ControlNames) == 0x000300, "Member 'AControlRigControlActor::ControlNames' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ShapeTransforms) == 0x000310, "Member 'AControlRigControlActor::ShapeTransforms' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, Components) == 0x000320, "Member 'AControlRigControlActor::Components' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, Materials) == 0x000330, "Member 'AControlRigControlActor::Materials' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ColorParameterName) == 0x000340, "Member 'AControlRigControlActor::ColorParameterName' has a wrong offset!");

// Class ControlRig.ControlRigShapeActor
// 0x0048 (0x02E0 - 0x0298)
class AControlRigShapeActor final : public AActor
{
public:
	class USceneComponent*                        ActorRootComponent;                                // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ControlRigIndex;                                   // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UControlRig>             ControlRig;                                        // 0x02AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ControlName;                                       // 0x02B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ShapeName;                                         // 0x02BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ColorParameterName;                                // 0x02C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_236A[0x10];                                    // 0x02CC(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bSelected : 1;                                     // 0x02DC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bHovered : 1;                                      // 0x02DC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_236B[0x3];                                     // 0x02DD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnabledChanged(bool bIsEnabled);
	void OnHoveredChanged(bool bIsSelected);
	void OnManipulatingChanged(bool bIsManipulating);
	void OnSelectionChanged(bool bIsSelected);
	void OnTransformChanged(const struct FTransform& NewTransform);
	void SetEnabled(bool bInEnabled);
	void SetGlobalTransform(const struct FTransform& InTransform);
	void SetHovered(bool bInHovered);
	void SetSelectable(bool bInSelectable);
	void SetSelected(bool bInSelected);

	struct FTransform GetGlobalTransform() const;
	bool IsEnabled() const;
	bool IsHovered() const;
	bool IsSelectedInEditor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigShapeActor">();
	}
	static class AControlRigShapeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AControlRigShapeActor>();
	}
};
static_assert(alignof(AControlRigShapeActor) == 0x000008, "Wrong alignment on AControlRigShapeActor");
static_assert(sizeof(AControlRigShapeActor) == 0x0002E0, "Wrong size on AControlRigShapeActor");
static_assert(offsetof(AControlRigShapeActor, ActorRootComponent) == 0x000298, "Member 'AControlRigShapeActor::ActorRootComponent' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, StaticMeshComponent) == 0x0002A0, "Member 'AControlRigShapeActor::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ControlRigIndex) == 0x0002A8, "Member 'AControlRigShapeActor::ControlRigIndex' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ControlRig) == 0x0002AC, "Member 'AControlRigShapeActor::ControlRig' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ControlName) == 0x0002B4, "Member 'AControlRigShapeActor::ControlName' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ShapeName) == 0x0002BC, "Member 'AControlRigShapeActor::ShapeName' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ColorParameterName) == 0x0002C4, "Member 'AControlRigShapeActor::ColorParameterName' has a wrong offset!");

// Class ControlRig.ControlRigShapeLibrary
// 0x0128 (0x0150 - 0x0028)
class UControlRigShapeLibrary final : public UObject
{
public:
	uint8                                         Pad_236C[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigShapeDefinition             DefaultShape;                                      // 0x0030(0x00A0)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               DefaultMaterial;                                   // 0x00D0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               XRayMaterial;                                      // 0x00F8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialColorParameter;                            // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FControlRigShapeDefinition>     Shapes;                                            // 0x0128(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_236D[0x18];                                    // 0x0138(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigShapeLibrary">();
	}
	static class UControlRigShapeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigShapeLibrary>();
	}
};
static_assert(alignof(UControlRigShapeLibrary) == 0x000010, "Wrong alignment on UControlRigShapeLibrary");
static_assert(sizeof(UControlRigShapeLibrary) == 0x000150, "Wrong size on UControlRigShapeLibrary");
static_assert(offsetof(UControlRigShapeLibrary, DefaultShape) == 0x000030, "Member 'UControlRigShapeLibrary::DefaultShape' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibrary, DefaultMaterial) == 0x0000D0, "Member 'UControlRigShapeLibrary::DefaultMaterial' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibrary, XRayMaterial) == 0x0000F8, "Member 'UControlRigShapeLibrary::XRayMaterial' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibrary, MaterialColorParameter) == 0x000120, "Member 'UControlRigShapeLibrary::MaterialColorParameter' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibrary, Shapes) == 0x000128, "Member 'UControlRigShapeLibrary::Shapes' has a wrong offset!");

// Class ControlRig.ControlRigTestData
// 0x0128 (0x0150 - 0x0028)
class UControlRigTestData final : public UObject
{
public:
	struct FSoftObjectPath                        ControlRigObjectPath;                              // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FControlRigTestDataFrame               Initial;                                           // 0x0048(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FControlRigTestDataFrame>       InputFrames;                                       // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FControlRigTestDataFrame>       OutputFrames;                                      // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<int32>                                 FramesToSkip;                                      // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	double                                        Tolerance;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_236E[0x40];                                    // 0x0110(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UControlRigTestData* CreateNewAsset(const class FString& InDesiredPackagePath, const class FString& InBlueprintPathName);

	bool Record(class UControlRig* InControlRig, double InRecordingDuration);
	void ReleaseReplay();
