#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Constraints_structs.hpp"
#include "RigVM_structs.hpp"
#include "MovieSceneTracks_structs.hpp"


namespace SDK
{

// Enum ControlRig.ERigElementType
// NumValues: 0x000C
enum class ERigElementType : uint8
{
	None                                     = 0,
	Bone                                     = 1,
	Null                                     = 2,
	Space                                    = 2,
	Control                                  = 4,
	Curve                                    = 8,
	RigidBody                                = 16,
	Reference                                = 32,
	Last                                     = 64,
	All                                      = 63,
	ToResetAfterConstructionEvent            = 13,
	ERigElementType_MAX                      = 65,
};

// Enum ControlRig.ERigHierarchyNotification
// NumValues: 0x0010
enum class ERigHierarchyNotification : uint8
{
	ElementAdded                             = 0,
	ElementRemoved                           = 1,
	ElementRenamed                           = 2,
	ElementSelected                          = 3,
	ElementDeselected                        = 4,
	ParentChanged                            = 5,
	HierarchyReset                           = 6,
	ControlSettingChanged                    = 7,
	ControlVisibilityChanged                 = 8,
	ControlDrivenListChanged                 = 9,
	ControlShapeTransformChanged             = 10,
	ParentWeightsChanged                     = 11,
	InteractionBracketOpened                 = 12,
	InteractionBracketClosed                 = 13,
	ElementReordered                         = 14,
	Max                                      = 15,
};

// Enum ControlRig.ERigControlTransformChannel
// NumValues: 0x000A
enum class ERigControlTransformChannel : uint8
{
	TranslationX                             = 0,
	TranslationY                             = 1,
	TranslationZ                             = 2,
	Pitch                                    = 3,
	Yaw                                      = 4,
	Roll                                     = 5,
	ScaleX                                   = 6,
	ScaleY                                   = 7,
	ScaleZ                                   = 8,
	ERigControlTransformChannel_MAX          = 9,
};

// Enum ControlRig.ERigControlVisibility
// NumValues: 0x0003
enum class ERigControlVisibility : uint8
{
	UserDefined                              = 0,
	BasedOnSelection                         = 1,
	ERigControlVisibility_MAX                = 2,
};

// Enum ControlRig.ERigControlAxis
// NumValues: 0x0004
enum class ERigControlAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	ERigControlAxis_MAX                      = 3,
};

// Enum ControlRig.ERigControlType
// NumValues: 0x000B
enum class ERigControlType : uint8
{
	Bool                                     = 0,
	Float                                    = 1,
	Integer                                  = 2,
	Vector2D                                 = 3,
	Position                                 = 4,
	Scale                                    = 5,
	Rotator                                  = 6,
	Transform                                = 7,
	TransformNoScale                         = 8,
	EulerTransform                           = 9,
	ERigControlType_MAX                      = 10,
};

// Enum ControlRig.ERigControlAnimationType
// NumValues: 0x0005
enum class ERigControlAnimationType : uint8
{
	AnimationControl                         = 0,
	AnimationChannel                         = 1,
	ProxyControl                             = 2,
	VisualCue                                = 3,
	ERigControlAnimationType_MAX             = 4,
};

// Enum ControlRig.ERigExecutionType
// NumValues: 0x0003
enum class ERigExecutionType : uint8
{
	Runtime                                  = 0,
	Editing                                  = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigTransformStackEntryType
// NumValues: 0x0005
enum class ERigTransformStackEntryType : uint8
{
	TransformPose                            = 0,
	ControlOffset                            = 1,
	ControlShape                             = 2,
	CurveValue                               = 3,
	ERigTransformStackEntryType_MAX          = 4,
};

// Enum ControlRig.ERigTransformType
// NumValues: 0x0006
enum class ERigTransformType : uint8
{
	InitialLocal                             = 0,
	CurrentLocal                             = 1,
	InitialGlobal                            = 2,
	CurrentGlobal                            = 3,
	NumTransformTypes                        = 4,
	ERigTransformType_MAX                    = 5,
};

// Enum ControlRig.EControlRigInteractionType
// NumValues: 0x0006
enum class EControlRigInteractionType : uint8
{
	None                                     = 0,
	Translate                                = 1,
	Rotate                                   = 2,
	Scale                                    = 4,
	All                                      = 7,
	EControlRigInteractionType_MAX           = 8,
};

// Enum ControlRig.EControlRigVectorKind
// NumValues: 0x0003
enum class EControlRigVectorKind : uint8
{
	Direction                                = 0,
	Location                                 = 1,
	EControlRigVectorKind_MAX                = 2,
};

// Enum ControlRig.EControlRigComponentSpace
// NumValues: 0x0006
enum class EControlRigComponentSpace : uint8
{
	WorldSpace                               = 0,
	ActorSpace                               = 1,
	ComponentSpace                           = 2,
	RigSpace                                 = 3,
	LocalSpace                               = 4,
	Max                                      = 5,
};

// Enum ControlRig.EControlRigComponentMapDirection
// NumValues: 0x0003
enum class EControlRigComponentMapDirection : uint8
{
	Input                                    = 0,
	Output                                   = 1,
	EControlRigComponentMapDirection_MAX     = 2,
};

// Enum ControlRig.ETransformSpaceMode
// NumValues: 0x0005
enum class ETransformSpaceMode : uint8
{
	LocalSpace                               = 0,
	GlobalSpace                              = 1,
	BaseSpace                                = 2,
	BaseJoint                                = 3,
	Max                                      = 4,
};

// Enum ControlRig.ETransformGetterType
// NumValues: 0x0003
enum class ETransformGetterType : uint8
{
	Initial                                  = 0,
	Current                                  = 1,
	Max                                      = 2,
};

// Enum ControlRig.EControlRigTestDataPlaybackMode
// NumValues: 0x0004
enum class EControlRigTestDataPlaybackMode : uint8
{
	Live                                     = 0,
	ReplayInputs                             = 1,
	GroundTruth                              = 2,
	Max                                      = 3,
};

// Enum ControlRig.ECRSimConstraintType
// NumValues: 0x0005
enum class ECRSimConstraintType : uint8
{
	Distance                                 = 0,
	DistanceFromA                            = 1,
	DistanceFromB                            = 2,
	Plane                                    = 3,
	ECRSimConstraintType_MAX                 = 4,
};

// Enum ControlRig.ECRSimPointForceType
// NumValues: 0x0002
enum class ECRSimPointForceType : uint8
{
	Direction                                = 0,
	ECRSimPointForceType_MAX                 = 1,
};

// Enum ControlRig.ECRSimSoftCollisionType
// NumValues: 0x0004
enum class ECRSimSoftCollisionType : uint8
{
	Plane                                    = 0,
	Sphere                                   = 1,
	Cone                                     = 2,
	ECRSimSoftCollisionType_MAX              = 3,
};

// Enum ControlRig.EControlRigFKRigExecuteMode
// NumValues: 0x0004
enum class EControlRigFKRigExecuteMode : uint8
{
	Replace                                  = 0,
	Additive                                 = 1,
	Direct                                   = 2,
	Max                                      = 3,
};

// Enum ControlRig.ERigBoneType
// NumValues: 0x0003
enum class ERigBoneType : uint8
{
	Imported                                 = 0,
	User                                     = 1,
	ERigBoneType_MAX                         = 2,
};

// Enum ControlRig.ERigMetadataType
// NumValues: 0x0016
enum class ERigMetadataType : uint8
{
	Bool                                     = 0,
	BoolArray                                = 1,
	Float                                    = 2,
	FloatArray                               = 3,
	Int32                                    = 4,
	Int32Array                               = 5,
	Name                                     = 6,
	NameArray                                = 7,
	Vector                                   = 8,
	VectorArray                              = 9,
	Rotator                                  = 10,
	RotatorArray                             = 11,
	Quat                                     = 12,
	QuatArray                                = 13,
	Transform                                = 14,
	TransformArray                           = 15,
	LinearColor                              = 16,
	LinearColorArray                         = 17,
	RigElementKey                            = 18,
	RigElementKeyArray                       = 19,
	Invalid                                  = 20,
	ERigMetadataType_MAX                     = 21,
};

// Enum ControlRig.ERigEvent
// NumValues: 0x0005
enum class ERigEvent : uint8
{
	None                                     = 0,
	RequestAutoKey                           = 1,
	OpenUndoBracket                          = 2,
	CloseUndoBracket                         = 3,
	Max                                      = 4,
};

// Enum ControlRig.EControlRigSetKey
// NumValues: 0x0004
enum class EControlRigSetKey : uint8
{
	DoNotCare                                = 0,
	Always                                   = 1,
	Never                                    = 2,
	EControlRigSetKey_MAX                    = 3,
};

// Enum ControlRig.ERigControlValueType
// NumValues: 0x0005
enum class ERigControlValueType : uint8
{
	Initial                                  = 0,
	Current                                  = 1,
	Minimum                                  = 2,
	Maximum                                  = 3,
	ERigControlValueType_MAX                 = 4,
};

// Enum ControlRig.ERigSpaceType
// NumValues: 0x0005
enum class ERigSpaceType : uint8
{
	Global                                   = 0,
	Bone                                     = 1,
	Control                                  = 2,
	Space                                    = 3,
	ERigSpaceType_MAX                        = 4,
};

// Enum ControlRig.EMovieSceneControlRigSpaceType
// NumValues: 0x0004
enum class EMovieSceneControlRigSpaceType : uint8
{
	Parent                                   = 0,
	World                                    = 1,
	ControlRig                               = 2,
	EMovieSceneControlRigSpaceType_MAX       = 3,
};

// Enum ControlRig.EControlRigDrawHierarchyMode
// NumValues: 0x0002
enum class EControlRigDrawHierarchyMode : uint8
{
	Axes                                     = 0,
	Max                                      = 1,
};

// Enum ControlRig.EAimMode
// NumValues: 0x0003
enum class EAimMode : uint8
{
	AimAtTarget                              = 0,
	OrientToTarget                           = 1,
	MAX                                      = 2,
};

// Enum ControlRig.EApplyTransformMode
// NumValues: 0x0003
enum class EApplyTransformMode : uint8
{
	Override                                 = 0,
	Additive                                 = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigSwitchParentMode
// NumValues: 0x0004
enum class ERigSwitchParentMode : uint8
{
	World                                    = 0,
	DefaultParent                            = 1,
	ParentItem                               = 2,
	ERigSwitchParentMode_MAX                 = 3,
};

// Enum ControlRig.EControlRigCurveAlignment
// NumValues: 0x0003
enum class EControlRigCurveAlignment : uint8
{
	Front                                    = 0,
	Stretched                                = 1,
	EControlRigCurveAlignment_MAX            = 2,
};

// Enum ControlRig.EControlRigModifyBoneMode
// NumValues: 0x0005
enum class EControlRigModifyBoneMode : uint8
{
	OverrideLocal                            = 0,
	OverrideGlobal                           = 1,
	AdditiveLocal                            = 2,
	AdditiveGlobal                           = 3,
	Max                                      = 4,
};

// Enum ControlRig.EConstraintInterpType
// NumValues: 0x0003
enum class EConstraintInterpType : uint8
{
	Average                                  = 0,
	Shortest                                 = 1,
	Max                                      = 2,
};

// ScriptStruct ControlRig.RigControlModifiedContext
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x04) FRigControlModifiedContext final
{
public:
	uint8                                         Pad_204D[0x18];                                    // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigControlModifiedContext) == 0x000004, "Wrong alignment on FRigControlModifiedContext");
static_assert(sizeof(FRigControlModifiedContext) == 0x000018, "Wrong size on FRigControlModifiedContext");

// ScriptStruct ControlRig.RigComputedTransform
// 0x0060 (0x0060 - 0x0000)
struct FRigComputedTransform final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigComputedTransform) == 0x000010, "Wrong alignment on FRigComputedTransform");
static_assert(sizeof(FRigComputedTransform) == 0x000060, "Wrong size on FRigComputedTransform");
static_assert(offsetof(FRigComputedTransform, Transform) == 0x000000, "Member 'FRigComputedTransform::Transform' has a wrong offset!");

// ScriptStruct ControlRig.RigLocalAndGlobalTransform
// 0x00D0 (0x00D0 - 0x0000)
struct FRigLocalAndGlobalTransform final
{
public:
	struct FRigComputedTransform                  Local;                                             // 0x0000(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigComputedTransform                  Global;                                            // 0x0060(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_204E[0x10];                                    // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigLocalAndGlobalTransform) == 0x000010, "Wrong alignment on FRigLocalAndGlobalTransform");
static_assert(sizeof(FRigLocalAndGlobalTransform) == 0x0000D0, "Wrong size on FRigLocalAndGlobalTransform");
static_assert(offsetof(FRigLocalAndGlobalTransform, Local) == 0x000000, "Member 'FRigLocalAndGlobalTransform::Local' has a wrong offset!");
static_assert(offsetof(FRigLocalAndGlobalTransform, Global) == 0x000060, "Member 'FRigLocalAndGlobalTransform::Global' has a wrong offset!");

// ScriptStruct ControlRig.RigCurrentAndInitialTransform
// 0x01A0 (0x01A0 - 0x0000)
struct FRigCurrentAndInitialTransform final
{
public:
	struct FRigLocalAndGlobalTransform            Current;                                           // 0x0000(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigLocalAndGlobalTransform            Initial;                                           // 0x00D0(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigCurrentAndInitialTransform) == 0x000010, "Wrong alignment on FRigCurrentAndInitialTransform");
static_assert(sizeof(FRigCurrentAndInitialTransform) == 0x0001A0, "Wrong size on FRigCurrentAndInitialTransform");
static_assert(offsetof(FRigCurrentAndInitialTransform, Current) == 0x000000, "Member 'FRigCurrentAndInitialTransform::Current' has a wrong offset!");
static_assert(offsetof(FRigCurrentAndInitialTransform, Initial) == 0x0000D0, "Member 'FRigCurrentAndInitialTransform::Initial' has a wrong offset!");

// ScriptStruct ControlRig.RigElementKey
// 0x000C (0x000C - 0x0000)
struct FRigElementKey final
{
public:
	ERigElementType                               Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_204F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigElementKey) == 0x000004, "Wrong alignment on FRigElementKey");
static_assert(sizeof(FRigElementKey) == 0x00000C, "Wrong size on FRigElementKey");
static_assert(offsetof(FRigElementKey, Type) == 0x000000, "Member 'FRigElementKey::Type' has a wrong offset!");
static_assert(offsetof(FRigElementKey, Name) == 0x000004, "Member 'FRigElementKey::Name' has a wrong offset!");

// ScriptStruct ControlRig.RigBaseElement
// 0x00E8 (0x00E8 - 0x0000)
struct FRigBaseElement
{
public:
	uint8                                         Pad_2050[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         Key;                                               // 0x0008(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2051[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NameString;                                        // 0x0018(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Index;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SubIndex;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2052[0xA8];                                    // 0x0030(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CreatedAtInstructionIndex;                         // 0x00D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2053[0x8];                                     // 0x00DC(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSelected;                                         // 0x00E4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2054[0x3];                                     // 0x00E5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigBaseElement) == 0x000008, "Wrong alignment on FRigBaseElement");
static_assert(sizeof(FRigBaseElement) == 0x0000E8, "Wrong size on FRigBaseElement");
static_assert(offsetof(FRigBaseElement, Key) == 0x000008, "Member 'FRigBaseElement::Key' has a wrong offset!");
static_assert(offsetof(FRigBaseElement, NameString) == 0x000018, "Member 'FRigBaseElement::NameString' has a wrong offset!");
static_assert(offsetof(FRigBaseElement, Index) == 0x000028, "Member 'FRigBaseElement::Index' has a wrong offset!");
static_assert(offsetof(FRigBaseElement, SubIndex) == 0x00002C, "Member 'FRigBaseElement::SubIndex' has a wrong offset!");
static_assert(offsetof(FRigBaseElement, CreatedAtInstructionIndex) == 0x0000D8, "Member 'FRigBaseElement::CreatedAtInstructionIndex' has a wrong offset!");
static_assert(offsetof(FRigBaseElement, bSelected) == 0x0000E4, "Member 'FRigBaseElement::bSelected' has a wrong offset!");

// ScriptStruct ControlRig.RigTransformElement
// 0x01E8 (0x02D0 - 0x00E8)
struct FRigTransformElement : public FRigBaseElement
{
public:
	uint8                                         Pad_2055[0x8];                                     // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigCurrentAndInitialTransform         Pose;                                              // 0x00F0(0x01A0)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2056[0x40];                                    // 0x0290(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigTransformElement) == 0x000010, "Wrong alignment on FRigTransformElement");
static_assert(sizeof(FRigTransformElement) == 0x0002D0, "Wrong size on FRigTransformElement");
static_assert(offsetof(FRigTransformElement, Pose) == 0x0000F0, "Member 'FRigTransformElement::Pose' has a wrong offset!");

// ScriptStruct ControlRig.RigHierarchySettings
// 0x0004 (0x0004 - 0x0000)
struct FRigHierarchySettings final
{
public:
	int32                                         ProceduralElementLimit;                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigHierarchySettings) == 0x000004, "Wrong alignment on FRigHierarchySettings");
static_assert(sizeof(FRigHierarchySettings) == 0x000004, "Wrong size on FRigHierarchySettings");
static_assert(offsetof(FRigHierarchySettings, ProceduralElementLimit) == 0x000000, "Member 'FRigHierarchySettings::ProceduralElementLimit' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigTestDataVariable
// 0x0020 (0x0020 - 0x0000)
struct FControlRigTestDataVariable final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CPPType;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlRigTestDataVariable) == 0x000008, "Wrong alignment on FControlRigTestDataVariable");
static_assert(sizeof(FControlRigTestDataVariable) == 0x000020, "Wrong size on FControlRigTestDataVariable");
static_assert(offsetof(FControlRigTestDataVariable, Name) == 0x000000, "Member 'FControlRigTestDataVariable::Name' has a wrong offset!");
static_assert(offsetof(FControlRigTestDataVariable, CPPType) == 0x000008, "Member 'FControlRigTestDataVariable::CPPType' has a wrong offset!");
static_assert(offsetof(FControlRigTestDataVariable, Value) == 0x000010, "Member 'FControlRigTestDataVariable::Value' has a wrong offset!");

// ScriptStruct ControlRig.CachedRigElement
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FCachedRigElement final
{
public:
	struct FRigElementKey                         Key;                                               // 0x0000(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        Index;                                             // 0x000C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2057[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ContainerVersion;                                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2058[0xC];                                     // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCachedRigElement) == 0x000008, "Wrong alignment on FCachedRigElement");
static_assert(sizeof(FCachedRigElement) == 0x000020, "Wrong size on FCachedRigElement");
static_assert(offsetof(FCachedRigElement, Key) == 0x000000, "Member 'FCachedRigElement::Key' has a wrong offset!");
static_assert(offsetof(FCachedRigElement, Index) == 0x00000C, "Member 'FCachedRigElement::Index' has a wrong offset!");
static_assert(offsetof(FCachedRigElement, ContainerVersion) == 0x000010, "Member 'FCachedRigElement::ContainerVersion' has a wrong offset!");

// ScriptStruct ControlRig.RigPoseElement
// 0x00F0 (0x00F0 - 0x0000)
struct FRigPoseElement final
{
public:
	struct FCachedRigElement                      Index;                                             // 0x0000(0x0020)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             GlobalTransform;                                   // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             LocalTransform;                                    // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurveValue;                                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2059[0xC];                                     // 0x00E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigPoseElement) == 0x000010, "Wrong alignment on FRigPoseElement");
static_assert(sizeof(FRigPoseElement) == 0x0000F0, "Wrong size on FRigPoseElement");
static_assert(offsetof(FRigPoseElement, Index) == 0x000000, "Member 'FRigPoseElement::Index' has a wrong offset!");
static_assert(offsetof(FRigPoseElement, GlobalTransform) == 0x000020, "Member 'FRigPoseElement::GlobalTransform' has a wrong offset!");
static_assert(offsetof(FRigPoseElement, LocalTransform) == 0x000080, "Member 'FRigPoseElement::LocalTransform' has a wrong offset!");
static_assert(offsetof(FRigPoseElement, CurveValue) == 0x0000E0, "Member 'FRigPoseElement::CurveValue' has a wrong offset!");

// ScriptStruct ControlRig.RigPose
// 0x0070 (0x0070 - 0x0000)
struct FRigPose final
{
public:
	TArray<struct FRigPoseElement>                Elements;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         HierarchyTopologyVersion;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PoseHash;                                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_205A[0x58];                                    // 0x0018(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigPose) == 0x000008, "Wrong alignment on FRigPose");
static_assert(sizeof(FRigPose) == 0x000070, "Wrong size on FRigPose");
static_assert(offsetof(FRigPose, Elements) == 0x000000, "Member 'FRigPose::Elements' has a wrong offset!");
static_assert(offsetof(FRigPose, HierarchyTopologyVersion) == 0x000010, "Member 'FRigPose::HierarchyTopologyVersion' has a wrong offset!");
static_assert(offsetof(FRigPose, PoseHash) == 0x000014, "Member 'FRigPose::PoseHash' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigTestDataFrame
// 0x0090 (0x0090 - 0x0000)
struct FControlRigTestDataFrame final
{
public:
	double                                        AbsoluteTime;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FControlRigTestDataVariable>    Variables;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FRigPose                               Pose;                                              // 0x0020(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlRigTestDataFrame) == 0x000008, "Wrong alignment on FControlRigTestDataFrame");
static_assert(sizeof(FControlRigTestDataFrame) == 0x000090, "Wrong size on FControlRigTestDataFrame");
static_assert(offsetof(FControlRigTestDataFrame, AbsoluteTime) == 0x000000, "Member 'FControlRigTestDataFrame::AbsoluteTime' has a wrong offset!");
static_assert(offsetof(FControlRigTestDataFrame, DeltaTime) == 0x000008, "Member 'FControlRigTestDataFrame::DeltaTime' has a wrong offset!");
static_assert(offsetof(FControlRigTestDataFrame, Variables) == 0x000010, "Member 'FControlRigTestDataFrame::Variables' has a wrong offset!");
static_assert(offsetof(FControlRigTestDataFrame, Pose) == 0x000020, "Member 'FControlRigTestDataFrame::Pose' has a wrong offset!");

// ScriptStruct ControlRig.RigElementKeyCollection
// 0x0010 (0x0010 - 0x0000)
struct FRigElementKeyCollection final
{
public:
	TArray<struct FRigElementKey>                 Keys;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigElementKeyCollection) == 0x000008, "Wrong alignment on FRigElementKeyCollection");
static_assert(sizeof(FRigElementKeyCollection) == 0x000010, "Wrong size on FRigElementKeyCollection");
static_assert(offsetof(FRigElementKeyCollection, Keys) == 0x000000, "Member 'FRigElementKeyCollection::Keys' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit : public FRigVMStruct
{
};
static_assert(alignof(FRigUnit) == 0x000008, "Wrong alignment on FRigUnit");
static_assert(sizeof(FRigUnit) == 0x000008, "Wrong size on FRigUnit");

// ScriptStruct ControlRig.RigUnit_CollectionBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_CollectionBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_CollectionBase) == 0x000008, "Wrong alignment on FRigUnit_CollectionBase");
static_assert(sizeof(FRigUnit_CollectionBase) == 0x000008, "Wrong size on FRigUnit_CollectionBase");

// ScriptStruct ControlRig.RigUnit_CollectionNameSearch
// 0x0020 (0x0028 - 0x0008)
struct FRigUnit_CollectionNameSearch final : public FRigUnit_CollectionBase
{
public:
	class FName                                   PartialName;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigElementType                               TypeToSearch;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_205B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKeyCollection               Collection;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_CollectionNameSearch) == 0x000008, "Wrong alignment on FRigUnit_CollectionNameSearch");
static_assert(sizeof(FRigUnit_CollectionNameSearch) == 0x000028, "Wrong size on FRigUnit_CollectionNameSearch");
static_assert(offsetof(FRigUnit_CollectionNameSearch, PartialName) == 0x000008, "Member 'FRigUnit_CollectionNameSearch::PartialName' has a wrong offset!");
static_assert(offsetof(FRigUnit_CollectionNameSearch, TypeToSearch) == 0x000010, "Member 'FRigUnit_CollectionNameSearch::TypeToSearch' has a wrong offset!");
static_assert(offsetof(FRigUnit_CollectionNameSearch, Collection) == 0x000018, "Member 'FRigUnit_CollectionNameSearch::Collection' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigComponentMappedBone
// 0x0010 (0x0010 - 0x0000)
struct FControlRigComponentMappedBone final
{
public:
	class FName                                   Source;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Target;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlRigComponentMappedBone) == 0x000004, "Wrong alignment on FControlRigComponentMappedBone");
static_assert(sizeof(FControlRigComponentMappedBone) == 0x000010, "Wrong size on FControlRigComponentMappedBone");
static_assert(offsetof(FControlRigComponentMappedBone, Source) == 0x000000, "Member 'FControlRigComponentMappedBone::Source' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedBone, Target) == 0x000008, "Member 'FControlRigComponentMappedBone::Target' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigExecuteContext
// 0x0060 (0x0150 - 0x00F0)
struct FControlRigExecuteContext final : public FRigVMExecuteContext
{
public:
	uint8                                         Pad_205C[0x60];                                    // 0x00F0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FControlRigExecuteContext) == 0x000010, "Wrong alignment on FControlRigExecuteContext");
static_assert(sizeof(FControlRigExecuteContext) == 0x000150, "Wrong size on FControlRigExecuteContext");

// ScriptStruct ControlRig.RigUnit_GetAnimationChannelBase
// 0x0028 (0x0030 - 0x0008)
struct FRigUnit_GetAnimationChannelBase : public FRigUnit
{
public:
	class FName                                   Control;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Channel;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_205D[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         CachedChannelKey;                                  // 0x001C(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CachedChannelHash;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_205E[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_GetAnimationChannelBase) == 0x000008, "Wrong alignment on FRigUnit_GetAnimationChannelBase");
static_assert(sizeof(FRigUnit_GetAnimationChannelBase) == 0x000030, "Wrong size on FRigUnit_GetAnimationChannelBase");
static_assert(offsetof(FRigUnit_GetAnimationChannelBase, Control) == 0x000008, "Member 'FRigUnit_GetAnimationChannelBase::Control' has a wrong offset!");
static_assert(offsetof(FRigUnit_GetAnimationChannelBase, Channel) == 0x000010, "Member 'FRigUnit_GetAnimationChannelBase::Channel' has a wrong offset!");
static_assert(offsetof(FRigUnit_GetAnimationChannelBase, bInitial) == 0x000018, "Member 'FRigUnit_GetAnimationChannelBase::bInitial' has a wrong offset!");
static_assert(offsetof(FRigUnit_GetAnimationChannelBase, CachedChannelKey) == 0x00001C, "Member 'FRigUnit_GetAnimationChannelBase::CachedChannelKey' has a wrong offset!");
static_assert(offsetof(FRigUnit_GetAnimationChannelBase, CachedChannelHash) == 0x000028, "Member 'FRigUnit_GetAnimationChannelBase::CachedChannelHash' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SetAnimationChannelBase
// 0x0150 (0x0180 - 0x0030)
struct FRigUnit_SetAnimationChannelBase : public FRigUnit_GetAnimationChannelBase
{
public:
	struct FControlRigExecuteContext              ExecuteContext;                                    // 0x0030(0x0150)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_SetAnimationChannelBase) == 0x000010, "Wrong alignment on FRigUnit_SetAnimationChannelBase");
static_assert(sizeof(FRigUnit_SetAnimationChannelBase) == 0x000180, "Wrong size on FRigUnit_SetAnimationChannelBase");
static_assert(offsetof(FRigUnit_SetAnimationChannelBase, ExecuteContext) == 0x000030, "Member 'FRigUnit_SetAnimationChannelBase::ExecuteContext' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SetIntAnimationChannel
// 0x0010 (0x0190 - 0x0180)
struct FRigUnit_SetIntAnimationChannel final : public FRigUnit_SetAnimationChannelBase
{
public:
	int32                                         Value;                                             // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_205F[0xC];                                     // 0x0184(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_SetIntAnimationChannel) == 0x000010, "Wrong alignment on FRigUnit_SetIntAnimationChannel");
static_assert(sizeof(FRigUnit_SetIntAnimationChannel) == 0x000190, "Wrong size on FRigUnit_SetIntAnimationChannel");
static_assert(offsetof(FRigUnit_SetIntAnimationChannel, Value) == 0x000180, "Member 'FRigUnit_SetIntAnimationChannel::Value' has a wrong offset!");

// ScriptStruct ControlRig.CRSimPointForce
// 0x0028 (0x0028 - 0x0000)
struct FCRSimPointForce final
{
public:
	ECRSimPointForceType                          ForceType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2060[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Vector;                                            // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Coefficient;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2061[0x3];                                     // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCRSimPointForce) == 0x000008, "Wrong alignment on FCRSimPointForce");
static_assert(sizeof(FCRSimPointForce) == 0x000028, "Wrong size on FCRSimPointForce");
static_assert(offsetof(FCRSimPointForce, ForceType) == 0x000000, "Member 'FCRSimPointForce::ForceType' has a wrong offset!");
static_assert(offsetof(FCRSimPointForce, Vector) == 0x000008, "Member 'FCRSimPointForce::Vector' has a wrong offset!");
static_assert(offsetof(FCRSimPointForce, Coefficient) == 0x000020, "Member 'FCRSimPointForce::Coefficient' has a wrong offset!");
static_assert(offsetof(FCRSimPointForce, bNormalize) == 0x000024, "Member 'FCRSimPointForce::bNormalize' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_HierarchyAddControl_ShapeSettings
// 0x0080 (0x0080 - 0x0000)
struct FRigUnit_HierarchyAddControl_ShapeSettings final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2062[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2063[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0020(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_HierarchyAddControl_ShapeSettings) == 0x000010, "Wrong alignment on FRigUnit_HierarchyAddControl_ShapeSettings");
static_assert(sizeof(FRigUnit_HierarchyAddControl_ShapeSettings) == 0x000080, "Wrong size on FRigUnit_HierarchyAddControl_ShapeSettings");
static_assert(offsetof(FRigUnit_HierarchyAddControl_ShapeSettings, bVisible) == 0x000000, "Member 'FRigUnit_HierarchyAddControl_ShapeSettings::bVisible' has a wrong offset!");
static_assert(offsetof(FRigUnit_HierarchyAddControl_ShapeSettings, Name) == 0x000004, "Member 'FRigUnit_HierarchyAddControl_ShapeSettings::Name' has a wrong offset!");
static_assert(offsetof(FRigUnit_HierarchyAddControl_ShapeSettings, Color) == 0x00000C, "Member 'FRigUnit_HierarchyAddControl_ShapeSettings::Color' has a wrong offset!");
static_assert(offsetof(FRigUnit_HierarchyAddControl_ShapeSettings, Transform) == 0x000020, "Member 'FRigUnit_HierarchyAddControl_ShapeSettings::Transform' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AimConstraint_WorkData
// 0x0010 (0x0010 - 0x0000)
struct FRigUnit_AimConstraint_WorkData final
{
public:
	TArray<struct FConstraintData>                ConstraintData;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_AimConstraint_WorkData) == 0x000008, "Wrong alignment on FRigUnit_AimConstraint_WorkData");
static_assert(sizeof(FRigUnit_AimConstraint_WorkData) == 0x000010, "Wrong size on FRigUnit_AimConstraint_WorkData");
static_assert(offsetof(FRigUnit_AimConstraint_WorkData, ConstraintData) == 0x000000, "Member 'FRigUnit_AimConstraint_WorkData::ConstraintData' has a wrong offset!");

// ScriptStruct ControlRig.AimTarget
// 0x0090 (0x0090 - 0x0000)
struct FAimTarget final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2064[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AlignVector;                                       // 0x0070(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2065[0x8];                                     // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAimTarget) == 0x000010, "Wrong alignment on FAimTarget");
static_assert(sizeof(FAimTarget) == 0x000090, "Wrong size on FAimTarget");
static_assert(offsetof(FAimTarget, Weight) == 0x000000, "Member 'FAimTarget::Weight' has a wrong offset!");
static_assert(offsetof(FAimTarget, Transform) == 0x000010, "Member 'FAimTarget::Transform' has a wrong offset!");
static_assert(offsetof(FAimTarget, AlignVector) == 0x000070, "Member 'FAimTarget::AlignVector' has a wrong offset!");

// ScriptStruct ControlRig.RigUnitMutable
// 0x0158 (0x0160 - 0x0008)
struct FRigUnitMutable : public FRigUnit
{
public:
	uint8                                         Pad_2066[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigExecuteContext              ExecuteContext;                                    // 0x0010(0x0150)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnitMutable) == 0x000010, "Wrong alignment on FRigUnitMutable");
static_assert(sizeof(FRigUnitMutable) == 0x000160, "Wrong size on FRigUnitMutable");
static_assert(offsetof(FRigUnitMutable, ExecuteContext) == 0x000010, "Member 'FRigUnitMutable::ExecuteContext' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AimConstraint
// 0x0070 (0x01D0 - 0x0160)
struct FRigUnit_AimConstraint final : public FRigUnitMutable
{
public:
	class FName                                   Joint;                                             // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAimMode                                      AimMode;                                           // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAimMode                                      UpMode;                                            // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2067[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AimVector;                                         // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UpVector;                                          // 0x0188(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAimTarget>                     AimTargets;                                        // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAimTarget>                     UpTargets;                                         // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRigUnit_AimConstraint_WorkData        WorkData;                                          // 0x01C0(0x0010)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_AimConstraint) == 0x000010, "Wrong alignment on FRigUnit_AimConstraint");
static_assert(sizeof(FRigUnit_AimConstraint) == 0x0001D0, "Wrong size on FRigUnit_AimConstraint");
static_assert(offsetof(FRigUnit_AimConstraint, Joint) == 0x000160, "Member 'FRigUnit_AimConstraint::Joint' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimConstraint, AimMode) == 0x000168, "Member 'FRigUnit_AimConstraint::AimMode' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimConstraint, UpMode) == 0x000169, "Member 'FRigUnit_AimConstraint::UpMode' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimConstraint, AimVector) == 0x000170, "Member 'FRigUnit_AimConstraint::AimVector' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimConstraint, UpVector) == 0x000188, "Member 'FRigUnit_AimConstraint::UpVector' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimConstraint, AimTargets) == 0x0001A0, "Member 'FRigUnit_AimConstraint::AimTargets' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimConstraint, UpTargets) == 0x0001B0, "Member 'FRigUnit_AimConstraint::UpTargets' has a wrong offset!");
static_assert(offsetof(FRigUnit_AimConstraint, WorkData) == 0x0001C0, "Member 'FRigUnit_AimConstraint::WorkData' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SlideChain_WorkData
// 0x0048 (0x0048 - 0x0000)
struct FRigUnit_SlideChain_WorkData final
{
public:
	float                                         ChainLength;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2068[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ItemSegments;                                      // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCachedRigElement>              CachedItems;                                       // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     Transforms;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     BlendedTransforms;                                 // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_SlideChain_WorkData) == 0x000008, "Wrong alignment on FRigUnit_SlideChain_WorkData");
static_assert(sizeof(FRigUnit_SlideChain_WorkData) == 0x000048, "Wrong size on FRigUnit_SlideChain_WorkData");
static_assert(offsetof(FRigUnit_SlideChain_WorkData, ChainLength) == 0x000000, "Member 'FRigUnit_SlideChain_WorkData::ChainLength' has a wrong offset!");
static_assert(offsetof(FRigUnit_SlideChain_WorkData, ItemSegments) == 0x000008, "Member 'FRigUnit_SlideChain_WorkData::ItemSegments' has a wrong offset!");
static_assert(offsetof(FRigUnit_SlideChain_WorkData, CachedItems) == 0x000018, "Member 'FRigUnit_SlideChain_WorkData::CachedItems' has a wrong offset!");
static_assert(offsetof(FRigUnit_SlideChain_WorkData, Transforms) == 0x000028, "Member 'FRigUnit_SlideChain_WorkData::Transforms' has a wrong offset!");
static_assert(offsetof(FRigUnit_SlideChain_WorkData, BlendedTransforms) == 0x000038, "Member 'FRigUnit_SlideChain_WorkData::BlendedTransforms' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_HighlevelBaseMutable
// 0x0000 (0x0160 - 0x0160)
struct FRigUnit_HighlevelBaseMutable : public FRigUnitMutable
{
};
static_assert(alignof(FRigUnit_HighlevelBaseMutable) == 0x000010, "Wrong alignment on FRigUnit_HighlevelBaseMutable");
static_assert(sizeof(FRigUnit_HighlevelBaseMutable) == 0x000160, "Wrong size on FRigUnit_HighlevelBaseMutable");

// ScriptStruct ControlRig.RigUnit_SlideChain
// 0x0060 (0x01C0 - 0x0160)
struct FRigUnit_SlideChain final : public FRigUnit_HighlevelBaseMutable
{
public:
	class FName                                   StartBone;                                         // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EndBone;                                           // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlideAmount;                                       // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x0174(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2069[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_SlideChain_WorkData           WorkData;                                          // 0x0178(0x0048)(Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_SlideChain) == 0x000010, "Wrong alignment on FRigUnit_SlideChain");
static_assert(sizeof(FRigUnit_SlideChain) == 0x0001C0, "Wrong size on FRigUnit_SlideChain");
static_assert(offsetof(FRigUnit_SlideChain, StartBone) == 0x000160, "Member 'FRigUnit_SlideChain::StartBone' has a wrong offset!");
static_assert(offsetof(FRigUnit_SlideChain, EndBone) == 0x000168, "Member 'FRigUnit_SlideChain::EndBone' has a wrong offset!");
static_assert(offsetof(FRigUnit_SlideChain, SlideAmount) == 0x000170, "Member 'FRigUnit_SlideChain::SlideAmount' has a wrong offset!");
static_assert(offsetof(FRigUnit_SlideChain, bPropagateToChildren) == 0x000174, "Member 'FRigUnit_SlideChain::bPropagateToChildren' has a wrong offset!");
static_assert(offsetof(FRigUnit_SlideChain, WorkData) == 0x000178, "Member 'FRigUnit_SlideChain::WorkData' has a wrong offset!");

// ScriptStruct ControlRig.RigElement
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FRigElement
{
public:
	uint8                                         Pad_206A[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_206B[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigElement) == 0x000008, "Wrong alignment on FRigElement");
static_assert(sizeof(FRigElement) == 0x000018, "Wrong size on FRigElement");
static_assert(offsetof(FRigElement, Name) == 0x000008, "Member 'FRigElement::Name' has a wrong offset!");
static_assert(offsetof(FRigElement, Index) == 0x000010, "Member 'FRigElement::Index' has a wrong offset!");

// ScriptStruct ControlRig.RigSpace
// 0x00D8 (0x00F0 - 0x0018)
struct FRigSpace final : public FRigElement
{
public:
	ERigSpaceType                                 SpaceType;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_206C[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParentName;                                        // 0x001C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentIndex;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_206D[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InitialTransform;                                  // 0x0030(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             LocalTransform;                                    // 0x0090(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigSpace) == 0x000010, "Wrong alignment on FRigSpace");
static_assert(sizeof(FRigSpace) == 0x0000F0, "Wrong size on FRigSpace");
static_assert(offsetof(FRigSpace, SpaceType) == 0x000018, "Member 'FRigSpace::SpaceType' has a wrong offset!");
static_assert(offsetof(FRigSpace, ParentName) == 0x00001C, "Member 'FRigSpace::ParentName' has a wrong offset!");
static_assert(offsetof(FRigSpace, ParentIndex) == 0x000024, "Member 'FRigSpace::ParentIndex' has a wrong offset!");
static_assert(offsetof(FRigSpace, InitialTransform) == 0x000030, "Member 'FRigSpace::InitialTransform' has a wrong offset!");
static_assert(offsetof(FRigSpace, LocalTransform) == 0x000090, "Member 'FRigSpace::LocalTransform' has a wrong offset!");

// ScriptStruct ControlRig.RigSpaceHierarchy
// 0x0010 (0x0010 - 0x0000)
struct FRigSpaceHierarchy final
{
public:
	TArray<struct FRigSpace>                      Spaces;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
};
