#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "RigVM_structs.hpp"


namespace SDK::Params
{

// Function ControlRig.ControlRigShapeLibraryLink.SetShapeLibrary
// 0x0008 (0x0008 - 0x0000)
struct ControlRigShapeLibraryLink_SetShapeLibrary final
{
public:
	class UControlRigShapeLibrary*                InShapeLibrary;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRigShapeLibraryLink_SetShapeLibrary) == 0x000008, "Wrong alignment on ControlRigShapeLibraryLink_SetShapeLibrary");
static_assert(sizeof(ControlRigShapeLibraryLink_SetShapeLibrary) == 0x000008, "Wrong size on ControlRigShapeLibraryLink_SetShapeLibrary");
static_assert(offsetof(ControlRigShapeLibraryLink_SetShapeLibrary, InShapeLibrary) == 0x000000, "Member 'ControlRigShapeLibraryLink_SetShapeLibrary::InShapeLibrary' has a wrong offset!");

// Function ControlRig.ControlRigShapeLibraryLink.GetShapeLibrary
// 0x0008 (0x0008 - 0x0000)
struct ControlRigShapeLibraryLink_GetShapeLibrary final
{
public:
	class UControlRigShapeLibrary*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRigShapeLibraryLink_GetShapeLibrary) == 0x000008, "Wrong alignment on ControlRigShapeLibraryLink_GetShapeLibrary");
static_assert(sizeof(ControlRigShapeLibraryLink_GetShapeLibrary) == 0x000008, "Wrong size on ControlRigShapeLibraryLink_GetShapeLibrary");
static_assert(offsetof(ControlRigShapeLibraryLink_GetShapeLibrary, ReturnValue) == 0x000000, "Member 'ControlRigShapeLibraryLink_GetShapeLibrary::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetEulerTransformFromControlValue
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_GetEulerTransformFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A1[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEulerTransform                        ReturnValue;                                       // 0x0088(0x0048)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetEulerTransformFromControlValue) == 0x000008, "Wrong alignment on RigHierarchy_GetEulerTransformFromControlValue");
static_assert(sizeof(RigHierarchy_GetEulerTransformFromControlValue) == 0x0000D0, "Wrong size on RigHierarchy_GetEulerTransformFromControlValue");
static_assert(offsetof(RigHierarchy_GetEulerTransformFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetEulerTransformFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetEulerTransformFromControlValue, ReturnValue) == 0x000088, "Member 'RigHierarchy_GetEulerTransformFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetFloatFromControlValue
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_GetFloatFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0084(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetFloatFromControlValue) == 0x000004, "Wrong alignment on RigHierarchy_GetFloatFromControlValue");
static_assert(sizeof(RigHierarchy_GetFloatFromControlValue) == 0x000088, "Wrong size on RigHierarchy_GetFloatFromControlValue");
static_assert(offsetof(RigHierarchy_GetFloatFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetFloatFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetFloatFromControlValue, ReturnValue) == 0x000084, "Member 'RigHierarchy_GetFloatFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetIntFromControlValue
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_GetIntFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0084(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetIntFromControlValue) == 0x000004, "Wrong alignment on RigHierarchy_GetIntFromControlValue");
static_assert(sizeof(RigHierarchy_GetIntFromControlValue) == 0x000088, "Wrong size on RigHierarchy_GetIntFromControlValue");
static_assert(offsetof(RigHierarchy_GetIntFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetIntFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetIntFromControlValue, ReturnValue) == 0x000084, "Member 'RigHierarchy_GetIntFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetRotatorFromControlValue
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_GetRotatorFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A2[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0088(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetRotatorFromControlValue) == 0x000008, "Wrong alignment on RigHierarchy_GetRotatorFromControlValue");
static_assert(sizeof(RigHierarchy_GetRotatorFromControlValue) == 0x0000A0, "Wrong size on RigHierarchy_GetRotatorFromControlValue");
static_assert(offsetof(RigHierarchy_GetRotatorFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetRotatorFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetRotatorFromControlValue, ReturnValue) == 0x000088, "Member 'RigHierarchy_GetRotatorFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetTransformFromControlValue
// 0x00F0 (0x00F0 - 0x0000)
struct RigHierarchy_GetTransformFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A3[0xC];                                     // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0090(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetTransformFromControlValue) == 0x000010, "Wrong alignment on RigHierarchy_GetTransformFromControlValue");
static_assert(sizeof(RigHierarchy_GetTransformFromControlValue) == 0x0000F0, "Wrong size on RigHierarchy_GetTransformFromControlValue");
static_assert(offsetof(RigHierarchy_GetTransformFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetTransformFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetTransformFromControlValue, ReturnValue) == 0x000090, "Member 'RigHierarchy_GetTransformFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetTransformNoScaleFromControlValue
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_GetTransformNoScaleFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A4[0xC];                                     // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformNoScale                      ReturnValue;                                       // 0x0090(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetTransformNoScaleFromControlValue) == 0x000010, "Wrong alignment on RigHierarchy_GetTransformNoScaleFromControlValue");
static_assert(sizeof(RigHierarchy_GetTransformNoScaleFromControlValue) == 0x0000D0, "Wrong size on RigHierarchy_GetTransformNoScaleFromControlValue");
static_assert(offsetof(RigHierarchy_GetTransformNoScaleFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetTransformNoScaleFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetTransformNoScaleFromControlValue, ReturnValue) == 0x000090, "Member 'RigHierarchy_GetTransformNoScaleFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetVector2DFromControlValue
// 0x0098 (0x0098 - 0x0000)
struct RigHierarchy_GetVector2DFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A5[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0088(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetVector2DFromControlValue) == 0x000008, "Wrong alignment on RigHierarchy_GetVector2DFromControlValue");
static_assert(sizeof(RigHierarchy_GetVector2DFromControlValue) == 0x000098, "Wrong size on RigHierarchy_GetVector2DFromControlValue");
static_assert(offsetof(RigHierarchy_GetVector2DFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetVector2DFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetVector2DFromControlValue, ReturnValue) == 0x000088, "Member 'RigHierarchy_GetVector2DFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetVectorFromControlValue
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_GetVectorFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A6[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0088(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetVectorFromControlValue) == 0x000008, "Wrong alignment on RigHierarchy_GetVectorFromControlValue");
static_assert(sizeof(RigHierarchy_GetVectorFromControlValue) == 0x0000A0, "Wrong size on RigHierarchy_GetVectorFromControlValue");
static_assert(offsetof(RigHierarchy_GetVectorFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetVectorFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetVectorFromControlValue, ReturnValue) == 0x000088, "Member 'RigHierarchy_GetVectorFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromBool
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromBool final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_MakeControlValueFromBool) == 0x000004, "Wrong alignment on RigHierarchy_MakeControlValueFromBool");
static_assert(sizeof(RigHierarchy_MakeControlValueFromBool) == 0x000088, "Wrong size on RigHierarchy_MakeControlValueFromBool");
static_assert(offsetof(RigHierarchy_MakeControlValueFromBool, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromBool::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromBool, ReturnValue) == 0x000004, "Member 'RigHierarchy_MakeControlValueFromBool::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromEulerTransform
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_MakeControlValueFromEulerTransform final
{
public:
	struct FEulerTransform                        InValue;                                           // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0048(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A8[0x4];                                     // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromEulerTransform) == 0x000008, "Wrong alignment on RigHierarchy_MakeControlValueFromEulerTransform");
static_assert(sizeof(RigHierarchy_MakeControlValueFromEulerTransform) == 0x0000D0, "Wrong size on RigHierarchy_MakeControlValueFromEulerTransform");
static_assert(offsetof(RigHierarchy_MakeControlValueFromEulerTransform, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromEulerTransform::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromEulerTransform, ReturnValue) == 0x000048, "Member 'RigHierarchy_MakeControlValueFromEulerTransform::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromFloat
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromFloat final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_MakeControlValueFromFloat) == 0x000004, "Wrong alignment on RigHierarchy_MakeControlValueFromFloat");
static_assert(sizeof(RigHierarchy_MakeControlValueFromFloat) == 0x000088, "Wrong size on RigHierarchy_MakeControlValueFromFloat");
static_assert(offsetof(RigHierarchy_MakeControlValueFromFloat, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromFloat::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromFloat, ReturnValue) == 0x000004, "Member 'RigHierarchy_MakeControlValueFromFloat::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromInt
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromInt final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_MakeControlValueFromInt) == 0x000004, "Wrong alignment on RigHierarchy_MakeControlValueFromInt");
static_assert(sizeof(RigHierarchy_MakeControlValueFromInt) == 0x000088, "Wrong size on RigHierarchy_MakeControlValueFromInt");
static_assert(offsetof(RigHierarchy_MakeControlValueFromInt, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromInt::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromInt, ReturnValue) == 0x000004, "Member 'RigHierarchy_MakeControlValueFromInt::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromRotator
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_MakeControlValueFromRotator final
{
public:
	struct FRotator                               InValue;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0018(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A9[0x4];                                     // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromRotator) == 0x000008, "Wrong alignment on RigHierarchy_MakeControlValueFromRotator");
static_assert(sizeof(RigHierarchy_MakeControlValueFromRotator) == 0x0000A0, "Wrong size on RigHierarchy_MakeControlValueFromRotator");
static_assert(offsetof(RigHierarchy_MakeControlValueFromRotator, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromRotator::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromRotator, ReturnValue) == 0x000018, "Member 'RigHierarchy_MakeControlValueFromRotator::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromTransform
// 0x00F0 (0x00F0 - 0x0000)
struct RigHierarchy_MakeControlValueFromTransform final
{
public:
	struct FTransform                             InValue;                                           // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0060(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22AA[0xC];                                     // 0x00E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromTransform) == 0x000010, "Wrong alignment on RigHierarchy_MakeControlValueFromTransform");
static_assert(sizeof(RigHierarchy_MakeControlValueFromTransform) == 0x0000F0, "Wrong size on RigHierarchy_MakeControlValueFromTransform");
static_assert(offsetof(RigHierarchy_MakeControlValueFromTransform, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromTransform::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromTransform, ReturnValue) == 0x000060, "Member 'RigHierarchy_MakeControlValueFromTransform::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromTransformNoScale
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_MakeControlValueFromTransformNoScale final
{
public:
	struct FTransformNoScale                      InValue;                                           // 0x0000(0x0040)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0040(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22AB[0xC];                                     // 0x00C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromTransformNoScale) == 0x000010, "Wrong alignment on RigHierarchy_MakeControlValueFromTransformNoScale");
static_assert(sizeof(RigHierarchy_MakeControlValueFromTransformNoScale) == 0x0000D0, "Wrong size on RigHierarchy_MakeControlValueFromTransformNoScale");
static_assert(offsetof(RigHierarchy_MakeControlValueFromTransformNoScale, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromTransformNoScale::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromTransformNoScale, ReturnValue) == 0x000040, "Member 'RigHierarchy_MakeControlValueFromTransformNoScale::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromVector
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_MakeControlValueFromVector final
{
public:
	struct FVector                                InValue;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0018(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22AC[0x4];                                     // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromVector) == 0x000008, "Wrong alignment on RigHierarchy_MakeControlValueFromVector");
static_assert(sizeof(RigHierarchy_MakeControlValueFromVector) == 0x0000A0, "Wrong size on RigHierarchy_MakeControlValueFromVector");
static_assert(offsetof(RigHierarchy_MakeControlValueFromVector, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromVector::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromVector, ReturnValue) == 0x000018, "Member 'RigHierarchy_MakeControlValueFromVector::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromVector2D
// 0x0098 (0x0098 - 0x0000)
struct RigHierarchy_MakeControlValueFromVector2D final
{
public:
	struct FVector2D                              InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0010(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22AD[0x4];                                     // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromVector2D) == 0x000008, "Wrong alignment on RigHierarchy_MakeControlValueFromVector2D");
static_assert(sizeof(RigHierarchy_MakeControlValueFromVector2D) == 0x000098, "Wrong size on RigHierarchy_MakeControlValueFromVector2D");
static_assert(offsetof(RigHierarchy_MakeControlValueFromVector2D, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromVector2D::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromVector2D, ReturnValue) == 0x000010, "Member 'RigHierarchy_MakeControlValueFromVector2D::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.CopyHierarchy
// 0x0008 (0x0008 - 0x0000)
struct RigHierarchy_CopyHierarchy final
{
public:
	class URigHierarchy*                          InHierarchy;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_CopyHierarchy) == 0x000008, "Wrong alignment on RigHierarchy_CopyHierarchy");
static_assert(sizeof(RigHierarchy_CopyHierarchy) == 0x000008, "Wrong size on RigHierarchy_CopyHierarchy");
static_assert(offsetof(RigHierarchy_CopyHierarchy, InHierarchy) == 0x000000, "Member 'RigHierarchy_CopyHierarchy::InHierarchy' has a wrong offset!");

// Function ControlRig.RigHierarchy.CopyPose
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_CopyPose final
{
public:
	class URigHierarchy*                          InHierarchy;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCurrent;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeights;                                          // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchPoseInGlobalIfNeeded;                        // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22AE[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_CopyPose) == 0x000008, "Wrong alignment on RigHierarchy_CopyPose");
static_assert(sizeof(RigHierarchy_CopyPose) == 0x000010, "Wrong size on RigHierarchy_CopyPose");
static_assert(offsetof(RigHierarchy_CopyPose, InHierarchy) == 0x000000, "Member 'RigHierarchy_CopyPose::InHierarchy' has a wrong offset!");
static_assert(offsetof(RigHierarchy_CopyPose, bCurrent) == 0x000008, "Member 'RigHierarchy_CopyPose::bCurrent' has a wrong offset!");
static_assert(offsetof(RigHierarchy_CopyPose, bInitial) == 0x000009, "Member 'RigHierarchy_CopyPose::bInitial' has a wrong offset!");
static_assert(offsetof(RigHierarchy_CopyPose, bWeights) == 0x00000A, "Member 'RigHierarchy_CopyPose::bWeights' has a wrong offset!");
static_assert(offsetof(RigHierarchy_CopyPose, bMatchPoseInGlobalIfNeeded) == 0x00000B, "Member 'RigHierarchy_CopyPose::bMatchPoseInGlobalIfNeeded' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetController
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_GetController final
{
public:
	bool                                          bCreateIfNeeded;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22AF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URigHierarchyController*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetController) == 0x000008, "Wrong alignment on RigHierarchy_GetController");
static_assert(sizeof(RigHierarchy_GetController) == 0x000010, "Wrong size on RigHierarchy_GetController");
static_assert(offsetof(RigHierarchy_GetController, bCreateIfNeeded) == 0x000000, "Member 'RigHierarchy_GetController::bCreateIfNeeded' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetController, ReturnValue) == 0x000008, "Member 'RigHierarchy_GetController::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetMetadataNames
// 0x0020 (0x0020 - 0x0000)
struct RigHierarchy_GetMetadataNames final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetMetadataNames) == 0x000008, "Wrong alignment on RigHierarchy_GetMetadataNames");
static_assert(sizeof(RigHierarchy_GetMetadataNames) == 0x000020, "Wrong size on RigHierarchy_GetMetadataNames");
static_assert(offsetof(RigHierarchy_GetMetadataNames, InItem) == 0x000000, "Member 'RigHierarchy_GetMetadataNames::InItem' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetMetadataNames, ReturnValue) == 0x000010, "Member 'RigHierarchy_GetMetadataNames::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetMetadataType
// 0x0018 (0x0018 - 0x0000)
struct RigHierarchy_GetMetadataType final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InMetadataName;                                    // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigMetadataType                              ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B1[0x3];                                     // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_GetMetadataType) == 0x000004, "Wrong alignment on RigHierarchy_GetMetadataType");
static_assert(sizeof(RigHierarchy_GetMetadataType) == 0x000018, "Wrong size on RigHierarchy_GetMetadataType");
static_assert(offsetof(RigHierarchy_GetMetadataType, InItem) == 0x000000, "Member 'RigHierarchy_GetMetadataType::InItem' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetMetadataType, InMetadataName) == 0x00000C, "Member 'RigHierarchy_GetMetadataType::InMetadataName' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetMetadataType, ReturnValue) == 0x000014, "Member 'RigHierarchy_GetMetadataType::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.RemoveAllMetadata
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_RemoveAllMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B2[0x3];                                     // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_RemoveAllMetadata) == 0x000004, "Wrong alignment on RigHierarchy_RemoveAllMetadata");
static_assert(sizeof(RigHierarchy_RemoveAllMetadata) == 0x000010, "Wrong size on RigHierarchy_RemoveAllMetadata");
static_assert(offsetof(RigHierarchy_RemoveAllMetadata, InItem) == 0x000000, "Member 'RigHierarchy_RemoveAllMetadata::InItem' has a wrong offset!");
static_assert(offsetof(RigHierarchy_RemoveAllMetadata, ReturnValue) == 0x00000C, "Member 'RigHierarchy_RemoveAllMetadata::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.RemoveMetadata
// 0x0018 (0x0018 - 0x0000)
struct RigHierarchy_RemoveMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InMetadataName;                                    // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B3[0x3];                                     // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_RemoveMetadata) == 0x000004, "Wrong alignment on RigHierarchy_RemoveMetadata");
static_assert(sizeof(RigHierarchy_RemoveMetadata) == 0x000018, "Wrong size on RigHierarchy_RemoveMetadata");
static_assert(offsetof(RigHierarchy_RemoveMetadata, InItem) == 0x000000, "Member 'RigHierarchy_RemoveMetadata::InItem' has a wrong offset!");
static_assert(offsetof(RigHierarchy_RemoveMetadata, InMetadataName) == 0x00000C, "Member 'RigHierarchy_RemoveMetadata::InMetadataName' has a wrong offset!");
static_assert(offsetof(RigHierarchy_RemoveMetadata, ReturnValue) == 0x000014, "Member 'RigHierarchy_RemoveMetadata::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.ResetPoseToInitial
// 0x0001 (0x0001 - 0x0000)
struct RigHierarchy_ResetPoseToInitial final
{
public:
	ERigElementType                               InTypeFilter;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_ResetPoseToInitial) == 0x000001, "Wrong alignment on RigHierarchy_ResetPoseToInitial");
static_assert(sizeof(RigHierarchy_ResetPoseToInitial) == 0x000001, "Wrong size on RigHierarchy_ResetPoseToInitial");
static_assert(offsetof(RigHierarchy_ResetPoseToInitial, InTypeFilter) == 0x000000, "Member 'RigHierarchy_ResetPoseToInitial::InTypeFilter' has a wrong offset!");

// Function ControlRig.RigHierarchy.SendAutoKeyEvent
// 0x0014 (0x0014 - 0x0000)
struct RigHierarchy_SendAutoKeyEvent final
{
public:
	struct FRigElementKey                         InElement;                                         // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InOffsetInSeconds;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsynchronous;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B4[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SendAutoKeyEvent) == 0x000004, "Wrong alignment on RigHierarchy_SendAutoKeyEvent");
static_assert(sizeof(RigHierarchy_SendAutoKeyEvent) == 0x000014, "Wrong size on RigHierarchy_SendAutoKeyEvent");
static_assert(offsetof(RigHierarchy_SendAutoKeyEvent, InElement) == 0x000000, "Member 'RigHierarchy_SendAutoKeyEvent::InElement' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SendAutoKeyEvent, InOffsetInSeconds) == 0x00000C, "Member 'RigHierarchy_SendAutoKeyEvent::InOffsetInSeconds' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SendAutoKeyEvent, bAsynchronous) == 0x000010, "Member 'RigHierarchy_SendAutoKeyEvent::bAsynchronous' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetBoolArrayMetadata
// 0x0030 (0x0030 - 0x0000)
struct RigHierarchy_SetBoolArrayMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InMetadataName;                                    // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B5[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  InValue;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B6[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetBoolArrayMetadata) == 0x000008, "Wrong alignment on RigHierarchy_SetBoolArrayMetadata");
static_assert(sizeof(RigHierarchy_SetBoolArrayMetadata) == 0x000030, "Wrong size on RigHierarchy_SetBoolArrayMetadata");
static_assert(offsetof(RigHierarchy_SetBoolArrayMetadata, InItem) == 0x000000, "Member 'RigHierarchy_SetBoolArrayMetadata::InItem' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetBoolArrayMetadata, InMetadataName) == 0x00000C, "Member 'RigHierarchy_SetBoolArrayMetadata::InMetadataName' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetBoolArrayMetadata, InValue) == 0x000018, "Member 'RigHierarchy_SetBoolArrayMetadata::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetBoolArrayMetadata, ReturnValue) == 0x000028, "Member 'RigHierarchy_SetBoolArrayMetadata::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetBoolMetadata
// 0x0018 (0x0018 - 0x0000)
struct RigHierarchy_SetBoolMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InMetadataName;                                    // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InValue;                                           // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B7[0x2];                                     // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetBoolMetadata) == 0x000004, "Wrong alignment on RigHierarchy_SetBoolMetadata");
static_assert(sizeof(RigHierarchy_SetBoolMetadata) == 0x000018, "Wrong size on RigHierarchy_SetBoolMetadata");
static_assert(offsetof(RigHierarchy_SetBoolMetadata, InItem) == 0x000000, "Member 'RigHierarchy_SetBoolMetadata::InItem' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetBoolMetadata, InMetadataName) == 0x00000C, "Member 'RigHierarchy_SetBoolMetadata::InMetadataName' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetBoolMetadata, InValue) == 0x000014, "Member 'RigHierarchy_SetBoolMetadata::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetBoolMetadata, ReturnValue) == 0x000015, "Member 'RigHierarchy_SetBoolMetadata::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetControlOffsetTransform
// 0x0080 (0x0080 - 0x0000)
struct RigHierarchy_SetControlOffsetTransform final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B8[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectChildren;                                   // 0x0071(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0072(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x0073(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22B9[0xC];                                     // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetControlOffsetTransform) == 0x000010, "Wrong alignment on RigHierarchy_SetControlOffsetTransform");
static_assert(sizeof(RigHierarchy_SetControlOffsetTransform) == 0x000080, "Wrong size on RigHierarchy_SetControlOffsetTransform");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransform, InKey) == 0x000000, "Member 'RigHierarchy_SetControlOffsetTransform::InKey' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransform, InTransform) == 0x000010, "Member 'RigHierarchy_SetControlOffsetTransform::InTransform' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransform, bInitial) == 0x000070, "Member 'RigHierarchy_SetControlOffsetTransform::bInitial' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransform, bAffectChildren) == 0x000071, "Member 'RigHierarchy_SetControlOffsetTransform::bAffectChildren' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransform, bSetupUndo) == 0x000072, "Member 'RigHierarchy_SetControlOffsetTransform::bSetupUndo' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransform, bPrintPythonCommands) == 0x000073, "Member 'RigHierarchy_SetControlOffsetTransform::bPrintPythonCommands' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetControlOffsetTransformByIndex
// 0x0080 (0x0080 - 0x0000)
struct RigHierarchy_SetControlOffsetTransformByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22BA[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectChildren;                                   // 0x0071(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0072(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x0073(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22BB[0xC];                                     // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetControlOffsetTransformByIndex) == 0x000010, "Wrong alignment on RigHierarchy_SetControlOffsetTransformByIndex");
static_assert(sizeof(RigHierarchy_SetControlOffsetTransformByIndex) == 0x000080, "Wrong size on RigHierarchy_SetControlOffsetTransformByIndex");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransformByIndex, InElementIndex) == 0x000000, "Member 'RigHierarchy_SetControlOffsetTransformByIndex::InElementIndex' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransformByIndex, InTransform) == 0x000010, "Member 'RigHierarchy_SetControlOffsetTransformByIndex::InTransform' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransformByIndex, bInitial) == 0x000070, "Member 'RigHierarchy_SetControlOffsetTransformByIndex::bInitial' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransformByIndex, bAffectChildren) == 0x000071, "Member 'RigHierarchy_SetControlOffsetTransformByIndex::bAffectChildren' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransformByIndex, bSetupUndo) == 0x000072, "Member 'RigHierarchy_SetControlOffsetTransformByIndex::bSetupUndo' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlOffsetTransformByIndex, bPrintPythonCommands) == 0x000073, "Member 'RigHierarchy_SetControlOffsetTransformByIndex::bPrintPythonCommands' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetControlPreferredEulerAngles
// 0x0030 (0x0030 - 0x0000)
struct RigHierarchy_SetControlPreferredEulerAngles final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22BC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InEulerAngles;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEulerRotationOrder                           InRotationOrder;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixEulerFlips;                                    // 0x002A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22BD[0x5];                                     // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetControlPreferredEulerAngles) == 0x000008, "Wrong alignment on RigHierarchy_SetControlPreferredEulerAngles");
static_assert(sizeof(RigHierarchy_SetControlPreferredEulerAngles) == 0x000030, "Wrong size on RigHierarchy_SetControlPreferredEulerAngles");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAngles, InKey) == 0x000000, "Member 'RigHierarchy_SetControlPreferredEulerAngles::InKey' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAngles, InEulerAngles) == 0x000010, "Member 'RigHierarchy_SetControlPreferredEulerAngles::InEulerAngles' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAngles, InRotationOrder) == 0x000028, "Member 'RigHierarchy_SetControlPreferredEulerAngles::InRotationOrder' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAngles, bInitial) == 0x000029, "Member 'RigHierarchy_SetControlPreferredEulerAngles::bInitial' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAngles, bFixEulerFlips) == 0x00002A, "Member 'RigHierarchy_SetControlPreferredEulerAngles::bFixEulerFlips' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetControlPreferredEulerAnglesByIndex
// 0x0028 (0x0028 - 0x0000)
struct RigHierarchy_SetControlPreferredEulerAnglesByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22BE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InEulerAngles;                                     // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEulerRotationOrder                           InRotationOrder;                                   // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixEulerFlips;                                    // 0x0022(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22BF[0x5];                                     // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetControlPreferredEulerAnglesByIndex) == 0x000008, "Wrong alignment on RigHierarchy_SetControlPreferredEulerAnglesByIndex");
static_assert(sizeof(RigHierarchy_SetControlPreferredEulerAnglesByIndex) == 0x000028, "Wrong size on RigHierarchy_SetControlPreferredEulerAnglesByIndex");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAnglesByIndex, InElementIndex) == 0x000000, "Member 'RigHierarchy_SetControlPreferredEulerAnglesByIndex::InElementIndex' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAnglesByIndex, InEulerAngles) == 0x000008, "Member 'RigHierarchy_SetControlPreferredEulerAnglesByIndex::InEulerAngles' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAnglesByIndex, InRotationOrder) == 0x000020, "Member 'RigHierarchy_SetControlPreferredEulerAnglesByIndex::InRotationOrder' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAnglesByIndex, bInitial) == 0x000021, "Member 'RigHierarchy_SetControlPreferredEulerAnglesByIndex::bInitial' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredEulerAnglesByIndex, bFixEulerFlips) == 0x000022, "Member 'RigHierarchy_SetControlPreferredEulerAnglesByIndex::bFixEulerFlips' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetControlPreferredRotationOrder
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_SetControlPreferredRotationOrder final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEulerRotationOrder                           InRotationOrder;                                   // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C0[0x3];                                     // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetControlPreferredRotationOrder) == 0x000004, "Wrong alignment on RigHierarchy_SetControlPreferredRotationOrder");
static_assert(sizeof(RigHierarchy_SetControlPreferredRotationOrder) == 0x000010, "Wrong size on RigHierarchy_SetControlPreferredRotationOrder");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotationOrder, InKey) == 0x000000, "Member 'RigHierarchy_SetControlPreferredRotationOrder::InKey' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotationOrder, InRotationOrder) == 0x00000C, "Member 'RigHierarchy_SetControlPreferredRotationOrder::InRotationOrder' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetControlPreferredRotationOrderByIndex
// 0x0008 (0x0008 - 0x0000)
struct RigHierarchy_SetControlPreferredRotationOrderByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEulerRotationOrder                           InRotationOrder;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C1[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetControlPreferredRotationOrderByIndex) == 0x000004, "Wrong alignment on RigHierarchy_SetControlPreferredRotationOrderByIndex");
static_assert(sizeof(RigHierarchy_SetControlPreferredRotationOrderByIndex) == 0x000008, "Wrong size on RigHierarchy_SetControlPreferredRotationOrderByIndex");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotationOrderByIndex, InElementIndex) == 0x000000, "Member 'RigHierarchy_SetControlPreferredRotationOrderByIndex::InElementIndex' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotationOrderByIndex, InRotationOrder) == 0x000004, "Member 'RigHierarchy_SetControlPreferredRotationOrderByIndex::InRotationOrder' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetControlPreferredRotator
// 0x0030 (0x0030 - 0x0000)
struct RigHierarchy_SetControlPreferredRotator final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InRotator;                                         // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixEulerFlips;                                    // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C3[0x6];                                     // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetControlPreferredRotator) == 0x000008, "Wrong alignment on RigHierarchy_SetControlPreferredRotator");
static_assert(sizeof(RigHierarchy_SetControlPreferredRotator) == 0x000030, "Wrong size on RigHierarchy_SetControlPreferredRotator");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotator, InKey) == 0x000000, "Member 'RigHierarchy_SetControlPreferredRotator::InKey' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotator, InRotator) == 0x000010, "Member 'RigHierarchy_SetControlPreferredRotator::InRotator' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotator, bInitial) == 0x000028, "Member 'RigHierarchy_SetControlPreferredRotator::bInitial' has a wrong offset!");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotator, bFixEulerFlips) == 0x000029, "Member 'RigHierarchy_SetControlPreferredRotator::bFixEulerFlips' has a wrong offset!");

// Function ControlRig.RigHierarchy.SetControlPreferredRotatorByIndex
// 0x0028 (0x0028 - 0x0000)
struct RigHierarchy_SetControlPreferredRotatorByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InRotator;                                         // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixEulerFlips;                                    // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C5[0x6];                                     // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_SetControlPreferredRotatorByIndex) == 0x000008, "Wrong alignment on RigHierarchy_SetControlPreferredRotatorByIndex");
static_assert(sizeof(RigHierarchy_SetControlPreferredRotatorByIndex) == 0x000028, "Wrong size on RigHierarchy_SetControlPreferredRotatorByIndex");
static_assert(offsetof(RigHierarchy_SetControlPreferredRotatorByIndex, InElementIndex) == 0x000000, "Member 'RigHierarchy_SetControlPreferredRotatorByIndex::InElementIndex' has a wrong offset!");
