#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct DataflowCore.DataflowConnection
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FDataflowConnection
{
public:
	uint8                                         Pad_117[0x40];                                     // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowConnection) == 0x000008, "Wrong alignment on FDataflowConnection");
static_assert(sizeof(FDataflowConnection) == 0x000040, "Wrong size on FDataflowConnection");

// ScriptStruct DataflowCore.DataflowInput
// 0x0008 (0x0048 - 0x0040)
struct FDataflowInput final : public FDataflowConnection
{
public:
	uint8                                         Pad_118[0x8];                                      // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowInput) == 0x000008, "Wrong alignment on FDataflowInput");
static_assert(sizeof(FDataflowInput) == 0x000048, "Wrong size on FDataflowInput");

// ScriptStruct DataflowCore.DataflowOutput
// 0x0028 (0x0068 - 0x0040)
struct FDataflowOutput final : public FDataflowConnection
{
public:
	uint8                                         Pad_119[0x28];                                     // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowOutput) == 0x000008, "Wrong alignment on FDataflowOutput");
static_assert(sizeof(FDataflowOutput) == 0x000068, "Wrong size on FDataflowOutput");

// ScriptStruct DataflowCore.DataflowNode
// 0x00E8 (0x00E8 - 0x0000)
struct alignas(0x08) FDataflowNode
{
public:
	uint8                                         Pad_11A[0xC8];                                     // 0x0000(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bActive;                                           // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11B[0x1F];                                     // 0x00C9(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowNode) == 0x000008, "Wrong alignment on FDataflowNode");
static_assert(sizeof(FDataflowNode) == 0x0000E8, "Wrong size on FDataflowNode");
static_assert(offsetof(FDataflowNode, bActive) == 0x0000C8, "Member 'FDataflowNode::bActive' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowOverrideNode
// 0x0020 (0x0108 - 0x00E8)
struct FDataflowOverrideNode : public FDataflowNode
{
public:
	class FName                                   Key;                                               // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Default;                                           // 0x00F0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverriden;                                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowOverrideNode) == 0x000008, "Wrong alignment on FDataflowOverrideNode");
static_assert(sizeof(FDataflowOverrideNode) == 0x000108, "Wrong size on FDataflowOverrideNode");
static_assert(offsetof(FDataflowOverrideNode, Key) == 0x0000E8, "Member 'FDataflowOverrideNode::Key' has a wrong offset!");
static_assert(offsetof(FDataflowOverrideNode, Default) == 0x0000F0, "Member 'FDataflowOverrideNode::Default' has a wrong offset!");
static_assert(offsetof(FDataflowOverrideNode, IsOverriden) == 0x000100, "Member 'FDataflowOverrideNode::IsOverriden' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowSelection
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FDataflowSelection
{
public:
	uint8                                         Pad_11D[0x20];                                     // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowSelection) == 0x000008, "Wrong alignment on FDataflowSelection");
static_assert(sizeof(FDataflowSelection) == 0x000020, "Wrong size on FDataflowSelection");

// ScriptStruct DataflowCore.DataflowTransformSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowTransformSelection final : public FDataflowSelection
{
};
static_assert(alignof(FDataflowTransformSelection) == 0x000008, "Wrong alignment on FDataflowTransformSelection");
static_assert(sizeof(FDataflowTransformSelection) == 0x000020, "Wrong size on FDataflowTransformSelection");

// ScriptStruct DataflowCore.DataflowVertexSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowVertexSelection final : public FDataflowSelection
{
};
static_assert(alignof(FDataflowVertexSelection) == 0x000008, "Wrong alignment on FDataflowVertexSelection");
static_assert(sizeof(FDataflowVertexSelection) == 0x000020, "Wrong size on FDataflowVertexSelection");

// ScriptStruct DataflowCore.DataflowFaceSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowFaceSelection final : public FDataflowSelection
{
};
static_assert(alignof(FDataflowFaceSelection) == 0x000008, "Wrong alignment on FDataflowFaceSelection");
static_assert(sizeof(FDataflowFaceSelection) == 0x000020, "Wrong size on FDataflowFaceSelection");

// ScriptStruct DataflowCore.NodeColors
// 0x0020 (0x0020 - 0x0000)
struct FNodeColors final
{
public:
	struct FLinearColor                           NodeTitleColor;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeBodyTintColor;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNodeColors) == 0x000004, "Wrong alignment on FNodeColors");
static_assert(sizeof(FNodeColors) == 0x000020, "Wrong size on FNodeColors");
static_assert(offsetof(FNodeColors, NodeTitleColor) == 0x000000, "Member 'FNodeColors::NodeTitleColor' has a wrong offset!");
static_assert(offsetof(FNodeColors, NodeBodyTintColor) == 0x000010, "Member 'FNodeColors::NodeBodyTintColor' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowTerminalNode
// 0x0000 (0x00E8 - 0x00E8)
struct FDataflowTerminalNode : public FDataflowNode
{
};
static_assert(alignof(FDataflowTerminalNode) == 0x000008, "Wrong alignment on FDataflowTerminalNode");
static_assert(sizeof(FDataflowTerminalNode) == 0x0000E8, "Wrong size on FDataflowTerminalNode");

}

