#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Decaler_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function Decaler_BP.Decaler_BP_C.BndEvt__BP_ModSeesaw_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Decaler_BP_C_BndEvt__BP_ModSeesaw_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Decaler_BP_C_BndEvt__BP_ModSeesaw_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on Decaler_BP_C_BndEvt__BP_ModSeesaw_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature");
static_assert(sizeof(Decaler_BP_C_BndEvt__BP_ModSeesaw_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature) == 0x000010, "Wrong size on Decaler_BP_C_BndEvt__BP_ModSeesaw_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature");
static_assert(offsetof(Decaler_BP_C_BndEvt__BP_ModSeesaw_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature, PropertyName) == 0x000000, "Member 'Decaler_BP_C_BndEvt__BP_ModSeesaw_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature::PropertyName' has a wrong offset!");

// Function Decaler_BP.Decaler_BP_C.BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Decaler_BP_C_BndEvt__Decaler_BP_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Decaler_BP.Decaler_BP_C.ExecuteUbergraph_Decaler_BP
// 0x0408 (0x0408 - 0x0000)
struct Decaler_BP_C_ExecuteUbergraph_Decaler_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game_1;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game_2;                    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00A8(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0200(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Character_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0318(0x0010)(ReferenceParm)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        CallFunc_Array_Get_Item;                           // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_PropertyName;           // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEProperty                          CallFunc_GetPropertyByName_Property;               // 0x0370(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyByName_ReturnValue;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_BoolProperty_C*                   K2Node_DynamicCast_AsIGLE_Bool_Property;           // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP) == 0x000008, "Wrong alignment on Decaler_BP_C_ExecuteUbergraph_Decaler_BP");
static_assert(sizeof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP) == 0x000408, "Wrong size on Decaler_BP_C_ExecuteUbergraph_Decaler_BP");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, EntryPoint) == 0x000000, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_GetGameMode_ReturnValue) == 0x000030, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_IsServer_ReturnValue) == 0x000038, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_AsGM_Game) == 0x000040, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_AsGM_Game' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_GetGameMode_ReturnValue_1) == 0x000050, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_IsServer_ReturnValue_1) == 0x000058, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_AsGM_Game_1) == 0x000060, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_AsGM_Game_1' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, Temp_bool_Has_Been_Initd_Variable) == 0x000069, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_GetGameMode_ReturnValue_2) == 0x000070, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_GetGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_AsGM_Game_2) == 0x000078, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_AsGM_Game_2' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_IsServer_ReturnValue_2) == 0x000081, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_HasAuthority_ReturnValue) == 0x000082, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000088, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x000090, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x000098, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000A0, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000A4, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x0000A8, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_AsPawn) == 0x000190, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_bSuccess_3) == 0x000198, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_BreakVector_X) == 0x0001A0, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_BreakVector_Y) == 0x0001A8, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_BreakVector_Z) == 0x0001B0, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_BreakVector_X_1) == 0x0001B8, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_BreakVector_Y_1) == 0x0001C0, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_BreakVector_Z_1) == 0x0001C8, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_MakeVector_ReturnValue) == 0x0001D0, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_VLerp_ReturnValue) == 0x0001E8, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000200, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_GetForwardVector_ReturnValue) == 0x0002E8, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000300, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_GetAllActorsOfClass_OutActors) == 0x000318, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, Temp_bool_IsClosed_Variable) == 0x000328, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_Array_Get_Item) == 0x000330, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_AsBPI_Character) == 0x000338, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_bSuccess_4) == 0x000348, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_Array_Length_ReturnValue) == 0x00034C, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000350, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000351, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_ComponentBoundEvent_PropertyName) == 0x000358, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_ComponentBoundEvent_PropertyName' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_SwitchString_CmpSuccess) == 0x000368, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_GetPropertyByName_Property) == 0x000370, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_GetPropertyByName_Property' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, CallFunc_GetPropertyByName_ReturnValue) == 0x0003F0, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::CallFunc_GetPropertyByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_AsIGLE_Bool_Property) == 0x0003F8, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_AsIGLE_Bool_Property' has a wrong offset!");
static_assert(offsetof(Decaler_BP_C_ExecuteUbergraph_Decaler_BP, K2Node_DynamicCast_bSuccess_5) == 0x000400, "Member 'Decaler_BP_C_ExecuteUbergraph_Decaler_BP::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

}

