#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Devil_AnimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Devil_AnimBP.Devil_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Devil_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Devil_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Devil_AnimBP_C_AnimGraph");
static_assert(sizeof(Devil_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Devil_AnimBP_C_AnimGraph");
static_assert(offsetof(Devil_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Devil_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Devil_AnimBP.Devil_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Devil_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Devil_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Devil_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Devil_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Devil_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Devil_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Devil_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Devil_AnimBP.Devil_AnimBP_C.ExecuteUbergraph_Devil_AnimBP
// 0x0060 (0x0060 - 0x0000)
struct Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4F[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E50[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP) == 0x000008, "Wrong alignment on Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP");
static_assert(sizeof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP) == 0x000060, "Wrong size on Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, EntryPoint) == 0x000000, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000004, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1) == 0x00000C, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, K2Node_Event_DeltaTimeX) == 0x000014, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_GetMovementComponent_ReturnValue) == 0x000020, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_IsFalling_ReturnValue) == 0x000029, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_GetVelocity_ReturnValue) == 0x000030, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_VSize_ReturnValue) == 0x000048, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000058, "Member 'Devil_AnimBP_C_ExecuteUbergraph_Devil_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

}

