#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DownloadSubscribedWorkshop_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SteamCorePro_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DownloadSubscribedWorkshop_W.DownloadSubscribedWorkshop_W_C
// 0x0068 (0x0328 - 0x02C0)
class UDownloadSubscribedWorkshop_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           Download_ProgressBar;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemTitle;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             State_Text;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FRemoteStorageSubscribePublishedFileResult DataItem;                                          // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UCustomGI_C*                            CustomGI;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Downloaded;                                        // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDownloaded;                                      // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FPublishedFileID                       Published_File_ID;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	class FString                                 UGC_Name;                                          // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ChangeFollowButtonState(bool Followed, bool NeedsUpdate);
	void Construct();
	void ExecuteUbergraph_DownloadSubscribedWorkshop_W(int32 EntryPoint);
	void OnCallback_35F27610440B47DF2C1E9B966B71FC53(const struct FRemoteStorageSubscribePublishedFileResult& Data, bool bWasSuccessful);
	void OnCallback_773A01644FC9EF4EF48F248D980CB154(const struct FDownloadItemResult& Data, bool bWasSuccessful);
	void OnDownloaded__DelegateSignature(bool Success);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DownloadSubscribedWorkshop_W_C">();
	}
	static class UDownloadSubscribedWorkshop_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadSubscribedWorkshop_W_C>();
	}
};
static_assert(alignof(UDownloadSubscribedWorkshop_W_C) == 0x000008, "Wrong alignment on UDownloadSubscribedWorkshop_W_C");
static_assert(sizeof(UDownloadSubscribedWorkshop_W_C) == 0x000328, "Wrong size on UDownloadSubscribedWorkshop_W_C");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, UberGraphFrame) == 0x0002C0, "Member 'UDownloadSubscribedWorkshop_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, Download_ProgressBar) == 0x0002C8, "Member 'UDownloadSubscribedWorkshop_W_C::Download_ProgressBar' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, ItemTitle) == 0x0002D0, "Member 'UDownloadSubscribedWorkshop_W_C::ItemTitle' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, State_Text) == 0x0002D8, "Member 'UDownloadSubscribedWorkshop_W_C::State_Text' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, DataItem) == 0x0002E0, "Member 'UDownloadSubscribedWorkshop_W_C::DataItem' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, CustomGI) == 0x0002F0, "Member 'UDownloadSubscribedWorkshop_W_C::CustomGI' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, Downloaded) == 0x0002F8, "Member 'UDownloadSubscribedWorkshop_W_C::Downloaded' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, OnDownloaded) == 0x000300, "Member 'UDownloadSubscribedWorkshop_W_C::OnDownloaded' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, Published_File_ID) == 0x000310, "Member 'UDownloadSubscribedWorkshop_W_C::Published_File_ID' has a wrong offset!");
static_assert(offsetof(UDownloadSubscribedWorkshop_W_C, UGC_Name) == 0x000318, "Member 'UDownloadSubscribedWorkshop_W_C::UGC_Name' has a wrong offset!");

}

