#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drive_AnimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Drive_AnimBP.Drive_AnimBP_C
// 0x0910 (0x0C60 - 0x0350)
class UDrive_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2EA7[0x8];                                     // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0388(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03B0(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x03D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x03F8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0520(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0540(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0588(0x0020)()
	uint8                                         Pad_2EA8[0x8];                                     // 0x05A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x05B0(0x0280)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0830(0x0020)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0850(0x0280)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0AD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0B38(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0B58(0x00C8)()
	struct FVector                                LeftHandLocation;                                  // 0x0C20(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightHandLocation;                                 // 0x0C38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VehicleSpeed;                                      // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DriveCarosse;                                      // 0x0C58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Drive_AnimBP_AnimGraphNode_ModifyBone_006E89954D0F93F77D5E6596E363784F();
	void ExecuteUbergraph_Drive_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Drive_AnimBP_C">();
	}
	static class UDrive_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrive_AnimBP_C>();
	}
};
static_assert(alignof(UDrive_AnimBP_C) == 0x000010, "Wrong alignment on UDrive_AnimBP_C");
static_assert(sizeof(UDrive_AnimBP_C) == 0x000C60, "Wrong size on UDrive_AnimBP_C");
static_assert(offsetof(UDrive_AnimBP_C, UberGraphFrame) == 0x000350, "Member 'UDrive_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UDrive_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UDrive_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_Root) == 0x000368, "Member 'UDrive_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000388, "Member 'UDrive_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0003B0, "Member 'UDrive_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0003D8, "Member 'UDrive_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0003F8, "Member 'UDrive_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000520, "Member 'UDrive_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000540, "Member 'UDrive_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000588, "Member 'UDrive_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_TwoBoneIK_1) == 0x0005B0, "Member 'UDrive_AnimBP_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000830, "Member 'UDrive_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_TwoBoneIK) == 0x000850, "Member 'UDrive_AnimBP_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000AD0, "Member 'UDrive_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000AF0, "Member 'UDrive_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_StateResult) == 0x000B38, "Member 'UDrive_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, AnimGraphNode_StateMachine) == 0x000B58, "Member 'UDrive_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, LeftHandLocation) == 0x000C20, "Member 'UDrive_AnimBP_C::LeftHandLocation' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, RightHandLocation) == 0x000C38, "Member 'UDrive_AnimBP_C::RightHandLocation' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, VehicleSpeed) == 0x000C50, "Member 'UDrive_AnimBP_C::VehicleSpeed' has a wrong offset!");
static_assert(offsetof(UDrive_AnimBP_C, DriveCarosse) == 0x000C58, "Member 'UDrive_AnimBP_C::DriveCarosse' has a wrong offset!");

}

