#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drive_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Drive_AnimBP.Drive_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x011F (0x0120 - 0x0001)
struct Drive_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_2EA4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_66;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_67;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_68;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_69;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA5[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_70;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_71;                               // 0x0020(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_72;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_73;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_74;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_75;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA6[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_76;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_77;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_78;                                  // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_79;                               // 0x0068(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0088(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0108(0x0018)()
};
static_assert(alignof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Drive_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000120, "Wrong size on Drive_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_66) == 0x000004, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_66' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_67) == 0x00000C, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_67' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_68) == 0x000014, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_68' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_69) == 0x000018, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_69' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_70) == 0x00001C, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_70' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_71) == 0x000020, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_71' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_72) == 0x00004C, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_72' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_73) == 0x000050, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_73' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_74) == 0x000051, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_74' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_75) == 0x000052, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_75' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_76) == 0x000054, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_76' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_77) == 0x00005C, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_77' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_78) == 0x000064, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_78' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_79) == 0x000068, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_79' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000088, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Drive_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000108, "Member 'Drive_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

