#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndAngelDevil_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EndAngelDevil_BP.EndAngelDevil_BP_C.ExecuteUbergraph_EndAngelDevil_BP
// 0x0C50 (0x0C50 - 0x0000)
struct EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_BackToMainMenu_C*                    CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364C[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364D[0x8];                                     // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevil_AnimBP_C*                        K2Node_DynamicCast_AsDevil_Anim_BP;                // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364E[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFS_MasterField_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0310(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364F[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x0448(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_3;                      // 0x0590(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_3;     // 0x05A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0698(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_4;                      // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_4;     // 0x0710(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0820(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_CrashMeteor_C*                      CallFunc_Array_Get_Item;                           // 0x0908(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CrashMeteor_C*                      CallFunc_Array_Get_Item_1;                         // 0x0910(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CrashMeteor_C*                      CallFunc_Array_Get_Item_2;                         // 0x0918(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0920(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0928(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x0930(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0958(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0970(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x0988(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0A70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x0A88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_5;                      // 0x0AA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_5;     // 0x0AB8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0BA0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AExponentialHeightFog*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0BA8(0x0010)(ReferenceParm)
	class AExponentialHeightFog*                  CallFunc_Array_Get_Item_3;                         // 0x0BB8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0BC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3650[0x3];                                     // 0x0BC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0BC8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Character_C*>                CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0BD0(0x0010)(ReferenceParm)
	class ABP_Character_C*                        CallFunc_Array_Get_Item_4;                         // 0x0BE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0BEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3651[0x3];                                     // 0x0BED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0BF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0BF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3652[0x3];                                     // 0x0BF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0BF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x0BFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3653[0x3];                                     // 0x0BFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpire_BP_C*                            CallFunc_Array_Get_Item_5;                         // 0x0C00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpire_BP_C*                            CallFunc_Array_Get_Item_6;                         // 0x0C08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpire_BP_C*                            CallFunc_Array_Get_Item_7;                         // 0x0C10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpire_BP_C*                            CallFunc_Array_Get_Item_8;                         // 0x0C18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpire_BP_C*                            CallFunc_Array_Get_Item_9;                         // 0x0C20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast; // 0x0C30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3654[0x4];                                     // 0x0C34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0C38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0C40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0C44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP) == 0x000010, "Wrong alignment on EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP");
static_assert(sizeof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP) == 0x000C50, "Wrong size on EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, EntryPoint) == 0x000000, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000028, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000040, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Lerp_ReturnValue_1) == 0x000058, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_LinearColorLerp_ReturnValue) == 0x000060, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x000070, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Create_ReturnValue) == 0x000088, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, Temp_int_Loop_Counter_Variable) == 0x000090, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, Temp_int_Array_Index_Variable) == 0x000098, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x0000D0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, K2Node_DynamicCast_AsDevil_Anim_BP) == 0x000140, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::K2Node_DynamicCast_AsDevil_Anim_BP' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000150, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000158, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000160, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000178, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_VLerp_ReturnValue) == 0x000190, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001A8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetPlayerController_ReturnValue) == 0x000290, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetRightVector_ReturnValue) == 0x000298, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002B0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002C8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0002E0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_VLerp_ReturnValue_1) == 0x0002F8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000310, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, Temp_int_Array_Index_Variable_1) == 0x0003F8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000400, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000418, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_VLerp_ReturnValue_2) == 0x000430, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_SetWorldLocation_SweepHitResult_2) == 0x000448, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_SetWorldLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000530, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetForwardVector_ReturnValue) == 0x000548, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000560, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000578, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_VLerp_ReturnValue_3) == 0x000590, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_VLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_SetWorldLocation_SweepHitResult_3) == 0x0005A8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_SetWorldLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetPlayerController_ReturnValue_1) == 0x000690, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x000698, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetForwardVector_ReturnValue_1) == 0x0006B0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0006C8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0006E0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_VLerp_ReturnValue_4) == 0x0006F8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_VLerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_SetWorldLocation_SweepHitResult_4) == 0x000710, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_SetWorldLocation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0007F8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000800, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_MakeRotator_ReturnValue) == 0x000808, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000820, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item) == 0x000908, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_1) == 0x000910, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_2) == 0x000918, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_SpawnSound2D_ReturnValue) == 0x000920, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000928, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x000930, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000948, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000950, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_MakeRotator_ReturnValue_1) == 0x000958, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetForwardVector_ReturnValue_2) == 0x000970, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x000988, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000A70, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Add_VectorVector_ReturnValue_5) == 0x000A88, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_VLerp_ReturnValue_5) == 0x000AA0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_VLerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_K2_SetWorldLocation_SweepHitResult_5) == 0x000AB8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_K2_SetWorldLocation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000BA0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetAllActorsOfClass_OutActors) == 0x000BA8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_3) == 0x000BB8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Length_ReturnValue) == 0x000BC0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_ActorHasTag_ReturnValue) == 0x000BC4, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetPlayerController_ReturnValue_2) == 0x000BC8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000BD0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_4) == 0x000BE0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000BE8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000BEC, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, Temp_int_Loop_Counter_Variable_1) == 0x000BF0, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000BF4, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000BF8, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x000BFC, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_5) == 0x000C00, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_6) == 0x000C08, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_7) == 0x000C10, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_8) == 0x000C18, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Array_Get_Item_9) == 0x000C20, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000C28, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast) == 0x000C30, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000C38, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000C40, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000C44, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000C48, "Member 'EndAngelDevil_BP_C_ExecuteUbergraph_EndAngelDevil_BP::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function EndAngelDevil_BP.EndAngelDevil_BP_C.HideGeneric
// 0x0038 (0x0038 - 0x0000)
struct EndAngelDevil_BP_C_HideGeneric final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGeneric_BP_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3655[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGeneric_BP_C*                          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3656[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndAngelDevil_BP_C_HideGeneric) == 0x000008, "Wrong alignment on EndAngelDevil_BP_C_HideGeneric");
static_assert(sizeof(EndAngelDevil_BP_C_HideGeneric) == 0x000038, "Wrong size on EndAngelDevil_BP_C_HideGeneric");
static_assert(offsetof(EndAngelDevil_BP_C_HideGeneric, Temp_int_Array_Index_Variable) == 0x000000, "Member 'EndAngelDevil_BP_C_HideGeneric::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_HideGeneric, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'EndAngelDevil_BP_C_HideGeneric::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EndAngelDevil_BP_C_HideGeneric, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'EndAngelDevil_BP_C_HideGeneric::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
