#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnhancedInput

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.ResetMappingToDefault
// 0x0008 (0x0008 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_ResetMappingToDefault final
{
public:
	class FName                                   InMappingName;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_ResetMappingToDefault) == 0x000004, "Wrong alignment on EnhancedPlayerMappableKeyProfile_ResetMappingToDefault");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_ResetMappingToDefault) == 0x000008, "Wrong size on EnhancedPlayerMappableKeyProfile_ResetMappingToDefault");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_ResetMappingToDefault, InMappingName) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_ResetMappingToDefault::InMappingName' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.SetDisplayName
// 0x0018 (0x0018 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_SetDisplayName final
{
public:
	class FText                                   NewDisplayName;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_SetDisplayName) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_SetDisplayName");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_SetDisplayName) == 0x000018, "Wrong size on EnhancedPlayerMappableKeyProfile_SetDisplayName");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_SetDisplayName, NewDisplayName) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_SetDisplayName::NewDisplayName' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.DoesMappingPassQueryOptions
// 0x00C0 (0x00C0 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions final
{
public:
	struct FPlayerKeyMapping                      PlayerMapping;                                     // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerMappableKeyQueryOptions         Options;                                           // 0x0090(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2A[0x7];                                     // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions) == 0x0000C0, "Wrong size on EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions, PlayerMapping) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions::PlayerMapping' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions, Options) == 0x000090, "Member 'EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions::Options' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions, ReturnValue) == 0x0000B8, "Member 'EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetMappedKeysInRow
// 0x0020 (0x0020 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           OutKeys;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2B[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow) == 0x000020, "Wrong size on EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow, MappingName) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow::MappingName' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow, OutKeys) == 0x000008, "Member 'EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow::OutKeys' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow, ReturnValue) == 0x000018, "Member 'EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetMappingNamesForKey
// 0x0030 (0x0030 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OutMappingNames;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2C[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey) == 0x000030, "Wrong size on EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey, InKey) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey::InKey' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey, OutMappingNames) == 0x000018, "Member 'EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey::OutMappingNames' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey, ReturnValue) == 0x000028, "Member 'EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetPlayerMappingRows
// 0x0050 (0x0050 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows final
{
public:
	TMap<class FName, struct FKeyMappingRow>      ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows) == 0x000050, "Wrong size on EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows, ReturnValue) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetProfileDisplayName
// 0x0018 (0x0018 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetProfileDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_GetProfileDisplayName) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_GetProfileDisplayName");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_GetProfileDisplayName) == 0x000018, "Wrong size on EnhancedPlayerMappableKeyProfile_GetProfileDisplayName");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetProfileDisplayName, ReturnValue) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_GetProfileDisplayName::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetProfileIdentifer
// 0x0008 (0x0008 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetProfileIdentifer final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_GetProfileIdentifer) == 0x000004, "Wrong alignment on EnhancedPlayerMappableKeyProfile_GetProfileIdentifer");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_GetProfileIdentifer) == 0x000008, "Wrong size on EnhancedPlayerMappableKeyProfile_GetProfileIdentifer");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_GetProfileIdentifer, ReturnValue) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_GetProfileIdentifer::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.K2_FindKeyMapping
// 0x00D0 (0x00D0 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping final
{
public:
	struct FPlayerKeyMapping                      OutKeyMapping;                                     // 0x0000(0x0090)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMapPlayerKeyArgs                      InArgs;                                            // 0x0090(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping) == 0x0000D0, "Wrong size on EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping, OutKeyMapping) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping::OutKeyMapping' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping, InArgs) == 0x000090, "Member 'EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping::InArgs' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.QueryPlayerMappedKeys
// 0x0040 (0x0040 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys final
{
public:
	struct FPlayerMappableKeyQueryOptions         Options;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           OutKeys;                                           // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2D[0x4];                                     // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys) == 0x000040, "Wrong size on EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys, Options) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys::Options' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys, OutKeys) == 0x000028, "Member 'EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys::OutKeys' has a wrong offset!");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys, ReturnValue) == 0x000038, "Member 'EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.ToString
// 0x0010 (0x0010 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_ToString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedPlayerMappableKeyProfile_ToString) == 0x000008, "Wrong alignment on EnhancedPlayerMappableKeyProfile_ToString");
static_assert(sizeof(EnhancedPlayerMappableKeyProfile_ToString) == 0x000010, "Wrong size on EnhancedPlayerMappableKeyProfile_ToString");
static_assert(offsetof(EnhancedPlayerMappableKeyProfile_ToString, ReturnValue) == 0x000000, "Member 'EnhancedPlayerMappableKeyProfile_ToString::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.CreateNewKeyProfile
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputUserSettings_CreateNewKeyProfile final
{
public:
	struct FPlayerMappableKeyProfileCreationArgs  InArgs;                                            // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UEnhancedPlayerMappableKeyProfile*      ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_CreateNewKeyProfile) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_CreateNewKeyProfile");
static_assert(sizeof(EnhancedInputUserSettings_CreateNewKeyProfile) == 0x000040, "Wrong size on EnhancedInputUserSettings_CreateNewKeyProfile");
static_assert(offsetof(EnhancedInputUserSettings_CreateNewKeyProfile, InArgs) == 0x000000, "Member 'EnhancedInputUserSettings_CreateNewKeyProfile::InArgs' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_CreateNewKeyProfile, ReturnValue) == 0x000038, "Member 'EnhancedInputUserSettings_CreateNewKeyProfile::ReturnValue' has a wrong offset!");

// DelegateFunction EnhancedInput.EnhancedInputUserSettings.EnhancedInputUserSettingsChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputUserSettings_EnhancedInputUserSettingsChanged__DelegateSignature final
{
public:
	class UEnhancedInputUserSettings*             Settings;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_EnhancedInputUserSettingsChanged__DelegateSignature) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_EnhancedInputUserSettingsChanged__DelegateSignature");
static_assert(sizeof(EnhancedInputUserSettings_EnhancedInputUserSettingsChanged__DelegateSignature) == 0x000008, "Wrong size on EnhancedInputUserSettings_EnhancedInputUserSettingsChanged__DelegateSignature");
static_assert(offsetof(EnhancedInputUserSettings_EnhancedInputUserSettingsChanged__DelegateSignature, Settings) == 0x000000, "Member 'EnhancedInputUserSettings_EnhancedInputUserSettingsChanged__DelegateSignature::Settings' has a wrong offset!");

// DelegateFunction EnhancedInput.EnhancedInputUserSettings.MappableKeyProfileChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputUserSettings_MappableKeyProfileChanged__DelegateSignature final
{
public:
	const class UEnhancedPlayerMappableKeyProfile* NewProfile;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_MappableKeyProfileChanged__DelegateSignature) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_MappableKeyProfileChanged__DelegateSignature");
static_assert(sizeof(EnhancedInputUserSettings_MappableKeyProfileChanged__DelegateSignature) == 0x000008, "Wrong size on EnhancedInputUserSettings_MappableKeyProfileChanged__DelegateSignature");
static_assert(offsetof(EnhancedInputUserSettings_MappableKeyProfileChanged__DelegateSignature, NewProfile) == 0x000000, "Member 'EnhancedInputUserSettings_MappableKeyProfileChanged__DelegateSignature::NewProfile' has a wrong offset!");

// DelegateFunction EnhancedInput.EnhancedInputUserSettings.MappingContextRegisteredWithSettings__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputUserSettings_MappingContextRegisteredWithSettings__DelegateSignature final
{
public:
	const class UInputMappingContext*             IMC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_MappingContextRegisteredWithSettings__DelegateSignature) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_MappingContextRegisteredWithSettings__DelegateSignature");
static_assert(sizeof(EnhancedInputUserSettings_MappingContextRegisteredWithSettings__DelegateSignature) == 0x000008, "Wrong size on EnhancedInputUserSettings_MappingContextRegisteredWithSettings__DelegateSignature");
static_assert(offsetof(EnhancedInputUserSettings_MappingContextRegisteredWithSettings__DelegateSignature, IMC) == 0x000000, "Member 'EnhancedInputUserSettings_MappingContextRegisteredWithSettings__DelegateSignature::IMC' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.MapPlayerKey
// 0x0060 (0x0060 - 0x0000)
struct EnhancedInputUserSettings_MapPlayerKey final
{
public:
	struct FMapPlayerKeyArgs                      InArgs;                                            // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0040(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_MapPlayerKey) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_MapPlayerKey");
static_assert(sizeof(EnhancedInputUserSettings_MapPlayerKey) == 0x000060, "Wrong size on EnhancedInputUserSettings_MapPlayerKey");
static_assert(offsetof(EnhancedInputUserSettings_MapPlayerKey, InArgs) == 0x000000, "Member 'EnhancedInputUserSettings_MapPlayerKey::InArgs' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_MapPlayerKey, FailureReason) == 0x000040, "Member 'EnhancedInputUserSettings_MapPlayerKey::FailureReason' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.RegisterInputMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputUserSettings_RegisterInputMappingContext final
{
public:
	const class UInputMappingContext*             IMC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C30[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputUserSettings_RegisterInputMappingContext) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_RegisterInputMappingContext");
static_assert(sizeof(EnhancedInputUserSettings_RegisterInputMappingContext) == 0x000010, "Wrong size on EnhancedInputUserSettings_RegisterInputMappingContext");
static_assert(offsetof(EnhancedInputUserSettings_RegisterInputMappingContext, IMC) == 0x000000, "Member 'EnhancedInputUserSettings_RegisterInputMappingContext::IMC' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_RegisterInputMappingContext, ReturnValue) == 0x000008, "Member 'EnhancedInputUserSettings_RegisterInputMappingContext::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.RegisterInputMappingContexts
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputUserSettings_RegisterInputMappingContexts final
{
public:
	TSet<class UInputMappingContext*>             MappingContexts;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C31[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputUserSettings_RegisterInputMappingContexts) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_RegisterInputMappingContexts");
static_assert(sizeof(EnhancedInputUserSettings_RegisterInputMappingContexts) == 0x000058, "Wrong size on EnhancedInputUserSettings_RegisterInputMappingContexts");
static_assert(offsetof(EnhancedInputUserSettings_RegisterInputMappingContexts, MappingContexts) == 0x000000, "Member 'EnhancedInputUserSettings_RegisterInputMappingContexts::MappingContexts' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_RegisterInputMappingContexts, ReturnValue) == 0x000050, "Member 'EnhancedInputUserSettings_RegisterInputMappingContexts::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.ResetAllPlayerKeysInRow
// 0x0060 (0x0060 - 0x0000)
struct EnhancedInputUserSettings_ResetAllPlayerKeysInRow final
{
public:
	struct FMapPlayerKeyArgs                      InArgs;                                            // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0040(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_ResetAllPlayerKeysInRow) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_ResetAllPlayerKeysInRow");
static_assert(sizeof(EnhancedInputUserSettings_ResetAllPlayerKeysInRow) == 0x000060, "Wrong size on EnhancedInputUserSettings_ResetAllPlayerKeysInRow");
static_assert(offsetof(EnhancedInputUserSettings_ResetAllPlayerKeysInRow, InArgs) == 0x000000, "Member 'EnhancedInputUserSettings_ResetAllPlayerKeysInRow::InArgs' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_ResetAllPlayerKeysInRow, FailureReason) == 0x000040, "Member 'EnhancedInputUserSettings_ResetAllPlayerKeysInRow::FailureReason' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.ResetKeyProfileToDefault
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputUserSettings_ResetKeyProfileToDefault final
{
public:
	struct FGameplayTag                           ProfileId;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0008(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_ResetKeyProfileToDefault) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_ResetKeyProfileToDefault");
static_assert(sizeof(EnhancedInputUserSettings_ResetKeyProfileToDefault) == 0x000028, "Wrong size on EnhancedInputUserSettings_ResetKeyProfileToDefault");
static_assert(offsetof(EnhancedInputUserSettings_ResetKeyProfileToDefault, ProfileId) == 0x000000, "Member 'EnhancedInputUserSettings_ResetKeyProfileToDefault::ProfileId' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_ResetKeyProfileToDefault, FailureReason) == 0x000008, "Member 'EnhancedInputUserSettings_ResetKeyProfileToDefault::FailureReason' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.SetKeyProfile
// 0x000C (0x000C - 0x0000)
struct EnhancedInputUserSettings_SetKeyProfile final
{
public:
	struct FGameplayTag                           InProfileId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C32[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputUserSettings_SetKeyProfile) == 0x000004, "Wrong alignment on EnhancedInputUserSettings_SetKeyProfile");
static_assert(sizeof(EnhancedInputUserSettings_SetKeyProfile) == 0x00000C, "Wrong size on EnhancedInputUserSettings_SetKeyProfile");
static_assert(offsetof(EnhancedInputUserSettings_SetKeyProfile, InProfileId) == 0x000000, "Member 'EnhancedInputUserSettings_SetKeyProfile::InProfileId' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_SetKeyProfile, ReturnValue) == 0x000008, "Member 'EnhancedInputUserSettings_SetKeyProfile::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.UnMapPlayerKey
// 0x0060 (0x0060 - 0x0000)
struct EnhancedInputUserSettings_UnMapPlayerKey final
{
public:
	struct FMapPlayerKeyArgs                      InArgs;                                            // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0040(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_UnMapPlayerKey) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_UnMapPlayerKey");
static_assert(sizeof(EnhancedInputUserSettings_UnMapPlayerKey) == 0x000060, "Wrong size on EnhancedInputUserSettings_UnMapPlayerKey");
static_assert(offsetof(EnhancedInputUserSettings_UnMapPlayerKey, InArgs) == 0x000000, "Member 'EnhancedInputUserSettings_UnMapPlayerKey::InArgs' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_UnMapPlayerKey, FailureReason) == 0x000040, "Member 'EnhancedInputUserSettings_UnMapPlayerKey::FailureReason' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.UnregisterInputMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputUserSettings_UnregisterInputMappingContext final
{
public:
	const class UInputMappingContext*             IMC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C33[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputUserSettings_UnregisterInputMappingContext) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_UnregisterInputMappingContext");
static_assert(sizeof(EnhancedInputUserSettings_UnregisterInputMappingContext) == 0x000010, "Wrong size on EnhancedInputUserSettings_UnregisterInputMappingContext");
static_assert(offsetof(EnhancedInputUserSettings_UnregisterInputMappingContext, IMC) == 0x000000, "Member 'EnhancedInputUserSettings_UnregisterInputMappingContext::IMC' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_UnregisterInputMappingContext, ReturnValue) == 0x000008, "Member 'EnhancedInputUserSettings_UnregisterInputMappingContext::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.UnregisterInputMappingContexts
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputUserSettings_UnregisterInputMappingContexts final
{
public:
	TSet<class UInputMappingContext*>             MappingContexts;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C34[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputUserSettings_UnregisterInputMappingContexts) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_UnregisterInputMappingContexts");
static_assert(sizeof(EnhancedInputUserSettings_UnregisterInputMappingContexts) == 0x000058, "Wrong size on EnhancedInputUserSettings_UnregisterInputMappingContexts");
static_assert(offsetof(EnhancedInputUserSettings_UnregisterInputMappingContexts, MappingContexts) == 0x000000, "Member 'EnhancedInputUserSettings_UnregisterInputMappingContexts::MappingContexts' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_UnregisterInputMappingContexts, ReturnValue) == 0x000050, "Member 'EnhancedInputUserSettings_UnregisterInputMappingContexts::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.FindMappingsInRow
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputUserSettings_FindMappingsInRow final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<struct FPlayerKeyMapping>                ReturnValue;                                       // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_FindMappingsInRow) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_FindMappingsInRow");
static_assert(sizeof(EnhancedInputUserSettings_FindMappingsInRow) == 0x000058, "Wrong size on EnhancedInputUserSettings_FindMappingsInRow");
static_assert(offsetof(EnhancedInputUserSettings_FindMappingsInRow, MappingName) == 0x000000, "Member 'EnhancedInputUserSettings_FindMappingsInRow::MappingName' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_FindMappingsInRow, ReturnValue) == 0x000008, "Member 'EnhancedInputUserSettings_FindMappingsInRow::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.GetCurrentKeyProfile
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputUserSettings_GetCurrentKeyProfile final
{
public:
	class UEnhancedPlayerMappableKeyProfile*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_GetCurrentKeyProfile) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_GetCurrentKeyProfile");
static_assert(sizeof(EnhancedInputUserSettings_GetCurrentKeyProfile) == 0x000008, "Wrong size on EnhancedInputUserSettings_GetCurrentKeyProfile");
static_assert(offsetof(EnhancedInputUserSettings_GetCurrentKeyProfile, ReturnValue) == 0x000000, "Member 'EnhancedInputUserSettings_GetCurrentKeyProfile::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.GetCurrentKeyProfileIdentifier
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier) == 0x000004, "Wrong alignment on EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier");
static_assert(sizeof(EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier) == 0x000008, "Wrong size on EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier");
static_assert(offsetof(EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier, ReturnValue) == 0x000000, "Member 'EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.GetKeyProfileWithIdentifier
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputUserSettings_GetKeyProfileWithIdentifier final
{
public:
	struct FGameplayTag                           ProfileId;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEnhancedPlayerMappableKeyProfile*      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputUserSettings_GetKeyProfileWithIdentifier) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_GetKeyProfileWithIdentifier");
static_assert(sizeof(EnhancedInputUserSettings_GetKeyProfileWithIdentifier) == 0x000010, "Wrong size on EnhancedInputUserSettings_GetKeyProfileWithIdentifier");
static_assert(offsetof(EnhancedInputUserSettings_GetKeyProfileWithIdentifier, ProfileId) == 0x000000, "Member 'EnhancedInputUserSettings_GetKeyProfileWithIdentifier::ProfileId' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_GetKeyProfileWithIdentifier, ReturnValue) == 0x000008, "Member 'EnhancedInputUserSettings_GetKeyProfileWithIdentifier::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputUserSettings.IsMappingContextRegistered
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputUserSettings_IsMappingContextRegistered final
{
public:
	const class UInputMappingContext*             IMC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C35[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputUserSettings_IsMappingContextRegistered) == 0x000008, "Wrong alignment on EnhancedInputUserSettings_IsMappingContextRegistered");
static_assert(sizeof(EnhancedInputUserSettings_IsMappingContextRegistered) == 0x000010, "Wrong size on EnhancedInputUserSettings_IsMappingContextRegistered");
static_assert(offsetof(EnhancedInputUserSettings_IsMappingContextRegistered, IMC) == 0x000000, "Member 'EnhancedInputUserSettings_IsMappingContextRegistered::IMC' has a wrong offset!");
static_assert(offsetof(EnhancedInputUserSettings_IsMappingContextRegistered, ReturnValue) == 0x000008, "Member 'EnhancedInputUserSettings_IsMappingContextRegistered::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputComponent.GetBoundActionValue
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputComponent_GetBoundActionValue final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputComponent_GetBoundActionValue) == 0x000008, "Wrong alignment on EnhancedInputComponent_GetBoundActionValue");
static_assert(sizeof(EnhancedInputComponent_GetBoundActionValue) == 0x000028, "Wrong size on EnhancedInputComponent_GetBoundActionValue");
static_assert(offsetof(EnhancedInputComponent_GetBoundActionValue, Action) == 0x000000, "Member 'EnhancedInputComponent_GetBoundActionValue::Action' has a wrong offset!");
static_assert(offsetof(EnhancedInputComponent_GetBoundActionValue, ReturnValue) == 0x000008, "Member 'EnhancedInputComponent_GetBoundActionValue::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.BreakInputActionValue
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputLibrary_BreakInputActionValue final
{
public:
	struct FInputActionValue                      InActionValue;                                     // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        X;                                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionValueType                         Type;                                              // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C38[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputLibrary_BreakInputActionValue) == 0x000008, "Wrong alignment on EnhancedInputLibrary_BreakInputActionValue");
static_assert(sizeof(EnhancedInputLibrary_BreakInputActionValue) == 0x000040, "Wrong size on EnhancedInputLibrary_BreakInputActionValue");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, InActionValue) == 0x000000, "Member 'EnhancedInputLibrary_BreakInputActionValue::InActionValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, X) == 0x000020, "Member 'EnhancedInputLibrary_BreakInputActionValue::X' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, Y) == 0x000028, "Member 'EnhancedInputLibrary_BreakInputActionValue::Y' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, Z) == 0x000030, "Member 'EnhancedInputLibrary_BreakInputActionValue::Z' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, Type) == 0x000038, "Member 'EnhancedInputLibrary_BreakInputActionValue::Type' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis1D
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis1D final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToAxis1D) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToAxis1D");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToAxis1D) == 0x000028, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToAxis1D");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis1D, InValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis1D::InValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis1D, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis1D::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis2D
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis2D final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToAxis2D) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToAxis2D");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToAxis2D) == 0x000030, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToAxis2D");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis2D, InValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis2D::InValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis2D, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis2D::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis3D
// 0x0038 (0x0038 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis3D final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToAxis3D) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToAxis3D");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToAxis3D) == 0x000038, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToAxis3D");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis3D, ActionValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis3D::ActionValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis3D, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis3D::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToBool
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToBool final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C39[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToBool) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToBool");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToBool) == 0x000028, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToBool");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToBool, InValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToBool::InValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToBool, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToBool::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToString
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToString final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToString) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToString");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToString) == 0x000030, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToString");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToString, ActionValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToString::ActionValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToString, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToString::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetBoundActionValue
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_GetBoundActionValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetBoundActionValue) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetBoundActionValue");
static_assert(sizeof(EnhancedInputLibrary_GetBoundActionValue) == 0x000030, "Wrong size on EnhancedInputLibrary_GetBoundActionValue");
static_assert(offsetof(EnhancedInputLibrary_GetBoundActionValue, Actor) == 0x000000, "Member 'EnhancedInputLibrary_GetBoundActionValue::Actor' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_GetBoundActionValue, Action) == 0x000008, "Member 'EnhancedInputLibrary_GetBoundActionValue::Action' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_GetBoundActionValue, ReturnValue) == 0x000010, "Member 'EnhancedInputLibrary_GetBoundActionValue::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetFirstPlayerMappableKeySlot
// 0x0004 (0x0004 - 0x0000)
struct EnhancedInputLibrary_GetFirstPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetFirstPlayerMappableKeySlot) == 0x000004, "Wrong alignment on EnhancedInputLibrary_GetFirstPlayerMappableKeySlot");
static_assert(sizeof(EnhancedInputLibrary_GetFirstPlayerMappableKeySlot) == 0x000004, "Wrong size on EnhancedInputLibrary_GetFirstPlayerMappableKeySlot");
static_assert(offsetof(EnhancedInputLibrary_GetFirstPlayerMappableKeySlot, ReturnValue) == 0x000000, "Member 'EnhancedInputLibrary_GetFirstPlayerMappableKeySlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetFourthPlayerMappableKeySlot
// 0x0004 (0x0004 - 0x0000)
struct EnhancedInputLibrary_GetFourthPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetFourthPlayerMappableKeySlot) == 0x000004, "Wrong alignment on EnhancedInputLibrary_GetFourthPlayerMappableKeySlot");
static_assert(sizeof(EnhancedInputLibrary_GetFourthPlayerMappableKeySlot) == 0x000004, "Wrong size on EnhancedInputLibrary_GetFourthPlayerMappableKeySlot");
static_assert(offsetof(EnhancedInputLibrary_GetFourthPlayerMappableKeySlot, ReturnValue) == 0x000000, "Member 'EnhancedInputLibrary_GetFourthPlayerMappableKeySlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetMappingName
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_GetMappingName final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetMappingName) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetMappingName");
static_assert(sizeof(EnhancedInputLibrary_GetMappingName) == 0x000058, "Wrong size on EnhancedInputLibrary_GetMappingName");
static_assert(offsetof(EnhancedInputLibrary_GetMappingName, ActionKeyMapping) == 0x000000, "Member 'EnhancedInputLibrary_GetMappingName::ActionKeyMapping' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_GetMappingName, ReturnValue) == 0x000050, "Member 'EnhancedInputLibrary_GetMappingName::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetPlayerMappableKeySettings
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_GetPlayerMappableKeySettings final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerMappableKeySettings*             ReturnValue;                                       // 0x0050(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetPlayerMappableKeySettings) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetPlayerMappableKeySettings");
static_assert(sizeof(EnhancedInputLibrary_GetPlayerMappableKeySettings) == 0x000058, "Wrong size on EnhancedInputLibrary_GetPlayerMappableKeySettings");
static_assert(offsetof(EnhancedInputLibrary_GetPlayerMappableKeySettings, ActionKeyMapping) == 0x000000, "Member 'EnhancedInputLibrary_GetPlayerMappableKeySettings::ActionKeyMapping' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_GetPlayerMappableKeySettings, ReturnValue) == 0x000050, "Member 'EnhancedInputLibrary_GetPlayerMappableKeySettings::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetSecondPlayerMappableKeySlot
// 0x0004 (0x0004 - 0x0000)
struct EnhancedInputLibrary_GetSecondPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetSecondPlayerMappableKeySlot) == 0x000004, "Wrong alignment on EnhancedInputLibrary_GetSecondPlayerMappableKeySlot");
static_assert(sizeof(EnhancedInputLibrary_GetSecondPlayerMappableKeySlot) == 0x000004, "Wrong size on EnhancedInputLibrary_GetSecondPlayerMappableKeySlot");
static_assert(offsetof(EnhancedInputLibrary_GetSecondPlayerMappableKeySlot, ReturnValue) == 0x000000, "Member 'EnhancedInputLibrary_GetSecondPlayerMappableKeySlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetThirdPlayerMappableKeySlot
// 0x0004 (0x0004 - 0x0000)
struct EnhancedInputLibrary_GetThirdPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetThirdPlayerMappableKeySlot) == 0x000004, "Wrong alignment on EnhancedInputLibrary_GetThirdPlayerMappableKeySlot");
static_assert(sizeof(EnhancedInputLibrary_GetThirdPlayerMappableKeySlot) == 0x000004, "Wrong size on EnhancedInputLibrary_GetThirdPlayerMappableKeySlot");
static_assert(offsetof(EnhancedInputLibrary_GetThirdPlayerMappableKeySlot, ReturnValue) == 0x000000, "Member 'EnhancedInputLibrary_GetThirdPlayerMappableKeySlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.IsActionKeyMappingPlayerMappable
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_IsActionKeyMappingPlayerMappable final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C3A[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputLibrary_IsActionKeyMappingPlayerMappable) == 0x000008, "Wrong alignment on EnhancedInputLibrary_IsActionKeyMappingPlayerMappable");
static_assert(sizeof(EnhancedInputLibrary_IsActionKeyMappingPlayerMappable) == 0x000058, "Wrong size on EnhancedInputLibrary_IsActionKeyMappingPlayerMappable");
static_assert(offsetof(EnhancedInputLibrary_IsActionKeyMappingPlayerMappable, ActionKeyMapping) == 0x000000, "Member 'EnhancedInputLibrary_IsActionKeyMappingPlayerMappable::ActionKeyMapping' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_IsActionKeyMappingPlayerMappable, ReturnValue) == 0x000050, "Member 'EnhancedInputLibrary_IsActionKeyMappingPlayerMappable::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.MakeInputActionValue
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_MakeInputActionValue final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      MatchValueType;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0038(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_MakeInputActionValue) == 0x000008, "Wrong alignment on EnhancedInputLibrary_MakeInputActionValue");
static_assert(sizeof(EnhancedInputLibrary_MakeInputActionValue) == 0x000058, "Wrong size on EnhancedInputLibrary_MakeInputActionValue");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, X) == 0x000000, "Member 'EnhancedInputLibrary_MakeInputActionValue::X' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, Y) == 0x000008, "Member 'EnhancedInputLibrary_MakeInputActionValue::Y' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, Z) == 0x000010, "Member 'EnhancedInputLibrary_MakeInputActionValue::Z' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, MatchValueType) == 0x000018, "Member 'EnhancedInputLibrary_MakeInputActionValue::MatchValueType' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, ReturnValue) == 0x000038, "Member 'EnhancedInputLibrary_MakeInputActionValue::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.MakeInputActionValueOfType
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputLibrary_MakeInputActionValueOfType final
{
public:
