#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnhancedInput

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "DeveloperSettings_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class EnhancedInput.EnhancedPlayerMappableKeyProfile
// 0x0078 (0x00A0 - 0x0028)
class UEnhancedPlayerMappableKeyProfile final : public UObject
{
public:
	struct FGameplayTag                           ProfileIdentifier;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPlatformUserId                        OwningUserId;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C29[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0038(0x0018)(Edit, BlueprintVisible, SaveGame, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FKeyMappingRow>      PlayerMappedKeys;                                  // 0x0050(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void ResetMappingToDefault(const class FName InMappingName);
	void ResetToDefault();
	void SetDisplayName(const class FText& NewDisplayName);

	bool DoesMappingPassQueryOptions(const struct FPlayerKeyMapping& PlayerMapping, const struct FPlayerMappableKeyQueryOptions& Options) const;
	void DumpProfileToLog() const;
	int32 GetMappedKeysInRow(const class FName MappingName, TArray<struct FKey>* OutKeys) const;
	int32 GetMappingNamesForKey(const struct FKey& InKey, TArray<class FName>* OutMappingNames) const;
	const TMap<class FName, struct FKeyMappingRow> GetPlayerMappingRows() const;
	const class FText GetProfileDisplayName() const;
	const struct FGameplayTag GetProfileIdentifer() const;
	void K2_FindKeyMapping(struct FPlayerKeyMapping* OutKeyMapping, const struct FMapPlayerKeyArgs& InArgs) const;
	int32 QueryPlayerMappedKeys(const struct FPlayerMappableKeyQueryOptions& Options, TArray<struct FKey>* OutKeys) const;
	class FString ToString() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedPlayerMappableKeyProfile">();
	}
	static class UEnhancedPlayerMappableKeyProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedPlayerMappableKeyProfile>();
	}
};
static_assert(alignof(UEnhancedPlayerMappableKeyProfile) == 0x000008, "Wrong alignment on UEnhancedPlayerMappableKeyProfile");
static_assert(sizeof(UEnhancedPlayerMappableKeyProfile) == 0x0000A0, "Wrong size on UEnhancedPlayerMappableKeyProfile");
static_assert(offsetof(UEnhancedPlayerMappableKeyProfile, ProfileIdentifier) == 0x000028, "Member 'UEnhancedPlayerMappableKeyProfile::ProfileIdentifier' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerMappableKeyProfile, OwningUserId) == 0x000030, "Member 'UEnhancedPlayerMappableKeyProfile::OwningUserId' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerMappableKeyProfile, DisplayName) == 0x000038, "Member 'UEnhancedPlayerMappableKeyProfile::DisplayName' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerMappableKeyProfile, PlayerMappedKeys) == 0x000050, "Member 'UEnhancedPlayerMappableKeyProfile::PlayerMappedKeys' has a wrong offset!");

// Class EnhancedInput.EnhancedInputUserSettings
// 0x00F8 (0x0120 - 0x0028)
class UEnhancedInputUserSettings final : public USaveGame
{
public:
	uint8                                         Pad_1C2E[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSettingsChanged;                                 // 0x0030(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSettingsApplied;                                 // 0x0040(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2F[0x20];                                    // 0x0050(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CurrentProfileIdentifier;                          // 0x0070(0x0008)(SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UEnhancedPlayerMappableKeyProfile*> SavedKeyProfiles;                                  // 0x0078(0x0050)(SaveGame, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ULocalPlayer>            OwningLocalPlayer;                                 // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class UInputMappingContext*>             RegisteredMappingContexts;                         // 0x00D0(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void ApplySettings();
	void AsyncSaveSettings();
	class UEnhancedPlayerMappableKeyProfile* CreateNewKeyProfile(const struct FPlayerMappableKeyProfileCreationArgs& InArgs);
	void EnhancedInputUserSettingsApplied__DelegateSignature();
	void EnhancedInputUserSettingsChanged__DelegateSignature(class UEnhancedInputUserSettings* Settings);
	void MappableKeyProfileChanged__DelegateSignature(const class UEnhancedPlayerMappableKeyProfile* NewProfile);
	void MappingContextRegisteredWithSettings__DelegateSignature(const class UInputMappingContext* IMC);
	void MapPlayerKey(const struct FMapPlayerKeyArgs& InArgs, struct FGameplayTagContainer* FailureReason);
	bool RegisterInputMappingContext(const class UInputMappingContext* IMC);
	bool RegisterInputMappingContexts(const TSet<class UInputMappingContext*>& MappingContexts);
	void ResetAllPlayerKeysInRow(const struct FMapPlayerKeyArgs& InArgs, struct FGameplayTagContainer* FailureReason);
	void ResetKeyProfileToDefault(const struct FGameplayTag& ProfileId, struct FGameplayTagContainer* FailureReason);
	void SaveSettings();
	bool SetKeyProfile(const struct FGameplayTag& InProfileId);
	void UnMapPlayerKey(const struct FMapPlayerKeyArgs& InArgs, struct FGameplayTagContainer* FailureReason);
	bool UnregisterInputMappingContext(const class UInputMappingContext* IMC);
	bool UnregisterInputMappingContexts(const TSet<class UInputMappingContext*>& MappingContexts);

	const TSet<struct FPlayerKeyMapping> FindMappingsInRow(const class FName MappingName) const;
	class UEnhancedPlayerMappableKeyProfile* GetCurrentKeyProfile() const;
	const struct FGameplayTag GetCurrentKeyProfileIdentifier() const;
	class UEnhancedPlayerMappableKeyProfile* GetKeyProfileWithIdentifier(const struct FGameplayTag& ProfileId) const;
	bool IsMappingContextRegistered(const class UInputMappingContext* IMC) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputUserSettings">();
	}
	static class UEnhancedInputUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputUserSettings>();
	}
};
static_assert(alignof(UEnhancedInputUserSettings) == 0x000008, "Wrong alignment on UEnhancedInputUserSettings");
static_assert(sizeof(UEnhancedInputUserSettings) == 0x000120, "Wrong size on UEnhancedInputUserSettings");
static_assert(offsetof(UEnhancedInputUserSettings, OnSettingsChanged) == 0x000030, "Member 'UEnhancedInputUserSettings::OnSettingsChanged' has a wrong offset!");
static_assert(offsetof(UEnhancedInputUserSettings, OnSettingsApplied) == 0x000040, "Member 'UEnhancedInputUserSettings::OnSettingsApplied' has a wrong offset!");
static_assert(offsetof(UEnhancedInputUserSettings, CurrentProfileIdentifier) == 0x000070, "Member 'UEnhancedInputUserSettings::CurrentProfileIdentifier' has a wrong offset!");
static_assert(offsetof(UEnhancedInputUserSettings, SavedKeyProfiles) == 0x000078, "Member 'UEnhancedInputUserSettings::SavedKeyProfiles' has a wrong offset!");
static_assert(offsetof(UEnhancedInputUserSettings, OwningLocalPlayer) == 0x0000C8, "Member 'UEnhancedInputUserSettings::OwningLocalPlayer' has a wrong offset!");
static_assert(offsetof(UEnhancedInputUserSettings, RegisteredMappingContexts) == 0x0000D0, "Member 'UEnhancedInputUserSettings::RegisteredMappingContexts' has a wrong offset!");

// Class EnhancedInput.EnhancedInputActionDelegateBinding
// 0x0010 (0x0038 - 0x0028)
class UEnhancedInputActionDelegateBinding final : public UInputDelegateBinding
{
public:
	TArray<struct FBlueprintEnhancedInputActionBinding> InputActionDelegateBindings;                       // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputActionDelegateBinding">();
	}
	static class UEnhancedInputActionDelegateBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputActionDelegateBinding>();
	}
};
static_assert(alignof(UEnhancedInputActionDelegateBinding) == 0x000008, "Wrong alignment on UEnhancedInputActionDelegateBinding");
static_assert(sizeof(UEnhancedInputActionDelegateBinding) == 0x000038, "Wrong size on UEnhancedInputActionDelegateBinding");
static_assert(offsetof(UEnhancedInputActionDelegateBinding, InputActionDelegateBindings) == 0x000028, "Member 'UEnhancedInputActionDelegateBinding::InputActionDelegateBindings' has a wrong offset!");

// Class EnhancedInput.EnhancedInputActionValueBinding
// 0x0010 (0x0038 - 0x0028)
class UEnhancedInputActionValueBinding final : public UInputDelegateBinding
{
public:
	TArray<struct FBlueprintEnhancedInputActionBinding> InputActionValueBindings;                          // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputActionValueBinding">();
	}
	static class UEnhancedInputActionValueBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputActionValueBinding>();
	}
};
static_assert(alignof(UEnhancedInputActionValueBinding) == 0x000008, "Wrong alignment on UEnhancedInputActionValueBinding");
static_assert(sizeof(UEnhancedInputActionValueBinding) == 0x000038, "Wrong size on UEnhancedInputActionValueBinding");
static_assert(offsetof(UEnhancedInputActionValueBinding, InputActionValueBindings) == 0x000028, "Member 'UEnhancedInputActionValueBinding::InputActionValueBindings' has a wrong offset!");

// Class EnhancedInput.EnhancedInputComponent
// 0x0038 (0x0160 - 0x0128)
class UEnhancedInputComponent final : public UInputComponent
{
public:
	uint8                                         Pad_1C36[0x38];                                    // 0x0128(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FInputActionValue GetBoundActionValue(const class UInputAction* Action) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputComponent">();
	}
	static class UEnhancedInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputComponent>();
	}
};
static_assert(alignof(UEnhancedInputComponent) == 0x000008, "Wrong alignment on UEnhancedInputComponent");
static_assert(sizeof(UEnhancedInputComponent) == 0x000160, "Wrong size on UEnhancedInputComponent");

// Class EnhancedInput.EnhancedInputDeveloperSettings
// 0x00B0 (0x00E8 - 0x0038)
class UEnhancedInputDeveloperSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	TArray<struct FDefaultContextSetting>         DefaultMappingContexts;                            // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDefaultContextSetting>         DefaultWorldSubsystemMappingContexts;              // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FPerPlatformSettings                   PlatformSettings;                                  // 0x0058(0x0010)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   UserSettingsClass;                                 // 0x0068(0x0028)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultPlayerMappableKeyProfileClass;              // 0x0090(0x0028)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultWorldInputClass;                            // 0x00B8(0x0028)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSendTriggeredEventsWhenInputIsFlushed : 1;        // 0x00E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableUserSettings : 1;                           // 0x00E0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableDefaultMappingContexts : 1;                 // 0x00E0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldOnlyTriggerLastActionInChord : 1;           // 0x00E0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLogOnDeprecatedConfigUsed : 1;                    // 0x00E0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableWorldSubsystem : 1;                         // 0x00E0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldLogAllWorldSubsystemInputs : 1;             // 0x00E0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1C37[0x7];                                     // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputDeveloperSettings">();
	}
	static class UEnhancedInputDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputDeveloperSettings>();
	}
};
static_assert(alignof(UEnhancedInputDeveloperSettings) == 0x000008, "Wrong alignment on UEnhancedInputDeveloperSettings");
static_assert(sizeof(UEnhancedInputDeveloperSettings) == 0x0000E8, "Wrong size on UEnhancedInputDeveloperSettings");
static_assert(offsetof(UEnhancedInputDeveloperSettings, DefaultMappingContexts) == 0x000038, "Member 'UEnhancedInputDeveloperSettings::DefaultMappingContexts' has a wrong offset!");
static_assert(offsetof(UEnhancedInputDeveloperSettings, DefaultWorldSubsystemMappingContexts) == 0x000048, "Member 'UEnhancedInputDeveloperSettings::DefaultWorldSubsystemMappingContexts' has a wrong offset!");
static_assert(offsetof(UEnhancedInputDeveloperSettings, PlatformSettings) == 0x000058, "Member 'UEnhancedInputDeveloperSettings::PlatformSettings' has a wrong offset!");
static_assert(offsetof(UEnhancedInputDeveloperSettings, UserSettingsClass) == 0x000068, "Member 'UEnhancedInputDeveloperSettings::UserSettingsClass' has a wrong offset!");
static_assert(offsetof(UEnhancedInputDeveloperSettings, DefaultPlayerMappableKeyProfileClass) == 0x000090, "Member 'UEnhancedInputDeveloperSettings::DefaultPlayerMappableKeyProfileClass' has a wrong offset!");
static_assert(offsetof(UEnhancedInputDeveloperSettings, DefaultWorldInputClass) == 0x0000B8, "Member 'UEnhancedInputDeveloperSettings::DefaultWorldInputClass' has a wrong offset!");

// Class EnhancedInput.EnhancedInputLibrary
// 0x0000 (0x0028 - 0x0028)
class UEnhancedInputLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BreakInputActionValue(const struct FInputActionValue& InActionValue, double* X, double* Y, double* Z, EInputActionValueType* Type);
	static double Conv_InputActionValueToAxis1D(const struct FInputActionValue& InValue);
	static struct FVector2D Conv_InputActionValueToAxis2D(const struct FInputActionValue& InValue);
	static struct FVector Conv_InputActionValueToAxis3D(const struct FInputActionValue& ActionValue);
	static bool Conv_InputActionValueToBool(const struct FInputActionValue& InValue);
	static class FString Conv_InputActionValueToString(const struct FInputActionValue& ActionValue);
	static struct FInputActionValue GetBoundActionValue(class AActor* Actor, const class UInputAction* Action);
	static struct FPlayerMappableKeySlot GetFirstPlayerMappableKeySlot();
	static struct FPlayerMappableKeySlot GetFourthPlayerMappableKeySlot();
	static class FName GetMappingName(const struct FEnhancedActionKeyMapping& ActionKeyMapping);
	static class UPlayerMappableKeySettings* GetPlayerMappableKeySettings(const struct FEnhancedActionKeyMapping& ActionKeyMapping);
	static struct FPlayerMappableKeySlot GetSecondPlayerMappableKeySlot();
	static struct FPlayerMappableKeySlot GetThirdPlayerMappableKeySlot();
	static bool IsActionKeyMappingPlayerMappable(const struct FEnhancedActionKeyMapping& ActionKeyMapping);
	static struct FInputActionValue MakeInputActionValue(double X, double Y, double Z, const struct FInputActionValue& MatchValueType);
	static struct FInputActionValue MakeInputActionValueOfType(double X, double Y, double Z, const EInputActionValueType ValueType);
	static void RequestRebuildControlMappingsUsingContext(const class UInputMappingContext* Context, bool bForceImmediately);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputLibrary">();
	}
	static class UEnhancedInputLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputLibrary>();
	}
};
static_assert(alignof(UEnhancedInputLibrary) == 0x000008, "Wrong alignment on UEnhancedInputLibrary");
static_assert(sizeof(UEnhancedInputLibrary) == 0x000028, "Wrong size on UEnhancedInputLibrary");

// Class EnhancedInput.EnhancedInputPlatformData
// 0x0050 (0x0078 - 0x0028)
class UEnhancedInputPlatformData final : public UObject
{
public:
	TMap<class UInputMappingContext*, class UInputMappingContext*> MappingContextRedirects;                           // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	const class UInputMappingContext* GetContextRedirect(class UInputMappingContext* InContext) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputPlatformData">();
	}
	static class UEnhancedInputPlatformData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputPlatformData>();
	}
};
static_assert(alignof(UEnhancedInputPlatformData) == 0x000008, "Wrong alignment on UEnhancedInputPlatformData");
static_assert(sizeof(UEnhancedInputPlatformData) == 0x000078, "Wrong size on UEnhancedInputPlatformData");
static_assert(offsetof(UEnhancedInputPlatformData, MappingContextRedirects) == 0x000028, "Member 'UEnhancedInputPlatformData::MappingContextRedirects' has a wrong offset!");

// Class EnhancedInput.EnhancedInputPlatformSettings
// 0x0028 (0x0068 - 0x0040)
class UEnhancedInputPlatformSettings final : public UPlatformSettings
{
public:
	TArray<TSoftClassPtr<class UClass>>           InputData;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, Config, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UEnhancedInputPlatformData>> InputDataClasses;                                  // 0x0050(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bShouldLogMappingContextRedirects;                 // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C3D[0x7];                                     // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputPlatformSettings">();
	}
	static class UEnhancedInputPlatformSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputPlatformSettings>();
	}
};
static_assert(alignof(UEnhancedInputPlatformSettings) == 0x000008, "Wrong alignment on UEnhancedInputPlatformSettings");
static_assert(sizeof(UEnhancedInputPlatformSettings) == 0x000068, "Wrong size on UEnhancedInputPlatformSettings");
static_assert(offsetof(UEnhancedInputPlatformSettings, InputData) == 0x000040, "Member 'UEnhancedInputPlatformSettings::InputData' has a wrong offset!");
static_assert(offsetof(UEnhancedInputPlatformSettings, InputDataClasses) == 0x000050, "Member 'UEnhancedInputPlatformSettings::InputDataClasses' has a wrong offset!");
static_assert(offsetof(UEnhancedInputPlatformSettings, bShouldLogMappingContextRedirects) == 0x000060, "Member 'UEnhancedInputPlatformSettings::bShouldLogMappingContextRedirects' has a wrong offset!");

// Class EnhancedInput.EnhancedInputSubsystemInterface
// 0x0000 (0x0028 - 0x0028)
class IEnhancedInputSubsystemInterface final : public IInterface
{
public:
	void AddMappingContext(const class UInputMappingContext* MappingContext, int32 Priority, const struct FModifyContextOptions& Options);
	void AddPlayerMappableConfig(const class UPlayerMappableInputConfig* Config, const struct FModifyContextOptions& Options);
	void ClearAllMappings();
	void InjectInputForAction(const class UInputAction* Action, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void InjectInputForPlayerMapping(const class FName MappingName, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void InjectInputVectorForAction(const class UInputAction* Action, const struct FVector& Value, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void InjectInputVectorForPlayerMapping(const class FName MappingName, const struct FVector& Value, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	int32 K2_AddPlayerMappedKeyInSlot(const class FName MappingName, const struct FKey& NewKey, const struct FPlayerMappableKeySlot& KeySlot, const struct FModifyContextOptions& Options);
	int32 K2_RemovePlayerMappedKeyInSlot(const class FName MappingName, const struct FPlayerMappableKeySlot& KeySlot, const struct FModifyContextOptions& Options);
	void OnUserKeyProfileChanged(const class UEnhancedPlayerMappableKeyProfile* InNewProfile);
	void OnUserSettingsChanged(class UEnhancedInputUserSettings* Settings);
	EMappingQueryResult QueryMapKeyInActiveContextSet(const class UInputMappingContext* InputContext, const class UInputAction* Action, const struct FKey& Key, TArray<struct FMappingQueryIssue>* OutIssues, EMappingQueryIssue BlockingIssues);
	EMappingQueryResult QueryMapKeyInContextSet(const TArray<class UInputMappingContext*>& PrioritizedActiveContexts, const class UInputMappingContext* InputContext, const class UInputAction* Action, const struct FKey& Key, TArray<struct FMappingQueryIssue>* OutIssues, EMappingQueryIssue BlockingIssues);
	void RemoveAllPlayerMappedKeys(const struct FModifyContextOptions& Options);
	int32 RemoveAllPlayerMappedKeysForMapping(const class FName MappingName, const struct FModifyContextOptions& Options);
	void RemoveMappingContext(const class UInputMappingContext* MappingContext, const struct FModifyContextOptions& Options);
	void RemovePlayerMappableConfig(const class UPlayerMappableInputConfig* Config, const struct FModifyContextOptions& Options);
	void RequestRebuildControlMappings(const struct FModifyContextOptions& Options, EInputMappingRebuildType RebuildType);
	void StartContinuousInputInjectionForAction(const class UInputAction* Action, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void StartContinuousInputInjectionForPlayerMapping(const class FName MappingName, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void StopContinuousInputInjectionForAction(const class UInputAction* Action);
	void StopContinuousInputInjectionForPlayerMapping(const class FName MappingName);

	TArray<struct FEnhancedActionKeyMapping> GetAllPlayerMappableActionKeyMappings() const;
	TArray<struct FKey> GetAllPlayerMappedKeys(const class FName MappingName) const;
	class UEnhancedInputUserSettings* GetUserSettings() const;
	bool HasMappingContext(const class UInputMappingContext* MappingContext, int32* OutFoundPriority) const;
	struct FKey K2_GetPlayerMappedKeyInSlot(const class FName MappingName, const struct FPlayerMappableKeySlot& KeySlot) const;
	TArray<struct FKey> QueryKeysMappedToAction(const class UInputAction* Action) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputSubsystemInterface">();
	}
	static class IEnhancedInputSubsystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEnhancedInputSubsystemInterface>();
	}
};
static_assert(alignof(IEnhancedInputSubsystemInterface) == 0x000008, "Wrong alignment on IEnhancedInputSubsystemInterface");
static_assert(sizeof(IEnhancedInputSubsystemInterface) == 0x000028, "Wrong size on IEnhancedInputSubsystemInterface");

// Class EnhancedInput.EnhancedInputLocalPlayerSubsystem
// 0x01B8 (0x01E8 - 0x0030)
class UEnhancedInputLocalPlayerSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_1C4A[0x1A0];                                   // 0x0030(0x01A0)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ControlMappingsRebuiltDelegate;                    // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UEnhancedInputUserSettings*             UserSettings;                                      // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputLocalPlayerSubsystem">();
	}
	static class UEnhancedInputLocalPlayerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputLocalPlayerSubsystem>();
	}
};
static_assert(alignof(UEnhancedInputLocalPlayerSubsystem) == 0x000008, "Wrong alignment on UEnhancedInputLocalPlayerSubsystem");
static_assert(sizeof(UEnhancedInputLocalPlayerSubsystem) == 0x0001E8, "Wrong size on UEnhancedInputLocalPlayerSubsystem");
static_assert(offsetof(UEnhancedInputLocalPlayerSubsystem, ControlMappingsRebuiltDelegate) == 0x0001D0, "Member 'UEnhancedInputLocalPlayerSubsystem::ControlMappingsRebuiltDelegate' has a wrong offset!");
static_assert(offsetof(UEnhancedInputLocalPlayerSubsystem, UserSettings) == 0x0001E0, "Member 'UEnhancedInputLocalPlayerSubsystem::UserSettings' has a wrong offset!");

// Class EnhancedInput.EnhancedInputWorldSubsystem
// 0x01C8 (0x01F8 - 0x0030)
class UEnhancedInputWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_1C4B[0x1A0];                                   // 0x0030(0x01A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedPlayerInput*                   PlayerInput;                                       // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C4C[0x10];                                    // 0x01D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UInputComponent>> CurrentInputStack;                                 // 0x01E8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void AddActorInputComponent(class AActor* Actor);
	bool RemoveActorInputComponent(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputWorldSubsystem">();
	}
	static class UEnhancedInputWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputWorldSubsystem>();
	}
};
static_assert(alignof(UEnhancedInputWorldSubsystem) == 0x000008, "Wrong alignment on UEnhancedInputWorldSubsystem");
static_assert(sizeof(UEnhancedInputWorldSubsystem) == 0x0001F8, "Wrong size on UEnhancedInputWorldSubsystem");
static_assert(offsetof(UEnhancedInputWorldSubsystem, PlayerInput) == 0x0001D0, "Member 'UEnhancedInputWorldSubsystem::PlayerInput' has a wrong offset!");
static_assert(offsetof(UEnhancedInputWorldSubsystem, CurrentInputStack) == 0x0001E8, "Member 'UEnhancedInputWorldSubsystem::CurrentInputStack' has a wrong offset!");

// Class EnhancedInput.EnhancedPlayerInput
// 0x0358 (0x07F0 - 0x0498)
class UEnhancedPlayerInput final : public UPlayerInput
{
public:
	TMap<class UInputAction*, struct FKeyConsumptionOptions> KeyConsumptionData;                                // 0x0498(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<class UInputMappingContext*, int32>      AppliedInputContexts;                              // 0x04E8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FEnhancedActionKeyMapping>      EnhancedActionMappings;                            // 0x0538(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C4E[0x50];                                    // 0x0548(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInputAction*, struct FInputActionInstance> ActionInstanceData;                                // 0x0598(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C4F[0xA0];                                    // 0x05E8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FKey, struct FVector>             KeysPressedThisTick;                               // 0x0688(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class UInputAction*, struct FInjectedInputArray> InputsInjectedThisTick;                            // 0x06D8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TSet<class UInputAction*>                     LastInjectedActions;                               // 0x0728(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C50[0x78];                                    // 0x0778(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedPlayerInput">();
	}
	static class UEnhancedPlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedPlayerInput>();
	}
};
static_assert(alignof(UEnhancedPlayerInput) == 0x000008, "Wrong alignment on UEnhancedPlayerInput");
static_assert(sizeof(UEnhancedPlayerInput) == 0x0007F0, "Wrong size on UEnhancedPlayerInput");
static_assert(offsetof(UEnhancedPlayerInput, KeyConsumptionData) == 0x000498, "Member 'UEnhancedPlayerInput::KeyConsumptionData' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerInput, AppliedInputContexts) == 0x0004E8, "Member 'UEnhancedPlayerInput::AppliedInputContexts' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerInput, EnhancedActionMappings) == 0x000538, "Member 'UEnhancedPlayerInput::EnhancedActionMappings' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerInput, ActionInstanceData) == 0x000598, "Member 'UEnhancedPlayerInput::ActionInstanceData' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerInput, KeysPressedThisTick) == 0x000688, "Member 'UEnhancedPlayerInput::KeysPressedThisTick' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerInput, InputsInjectedThisTick) == 0x0006D8, "Member 'UEnhancedPlayerInput::InputsInjectedThisTick' has a wrong offset!");
static_assert(offsetof(UEnhancedPlayerInput, LastInjectedActions) == 0x000728, "Member 'UEnhancedPlayerInput::LastInjectedActions' has a wrong offset!");

// Class EnhancedInput.InputAction
// 0x0050 (0x0080 - 0x0030)
class UInputAction final : public UDataAsset
{
public:
	class FText                                   ActionDescription;                                 // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bTriggerWhenPaused;                                // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumeInput;                                     // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumesActionAndAxisMappings;                    // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReserveAllMappings;                               // 0x004B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TriggerEventsThatConsumeLegacyKeys;                // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionValueType                         ValueType;                                         // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionAccumulationBehavior              AccumulationBehavior;                              // 0x0051(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C51[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class UPlayerMappableKeySettings*             PlayerMappableKeySettings;                         // 0x0078(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputAction">();
	}
	static class UInputAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputAction>();
	}
};
static_assert(alignof(UInputAction) == 0x000008, "Wrong alignment on UInputAction");
static_assert(sizeof(UInputAction) == 0x000080, "Wrong size on UInputAction");
static_assert(offsetof(UInputAction, ActionDescription) == 0x000030, "Member 'UInputAction::ActionDescription' has a wrong offset!");
static_assert(offsetof(UInputAction, bTriggerWhenPaused) == 0x000048, "Member 'UInputAction::bTriggerWhenPaused' has a wrong offset!");
static_assert(offsetof(UInputAction, bConsumeInput) == 0x000049, "Member 'UInputAction::bConsumeInput' has a wrong offset!");
static_assert(offsetof(UInputAction, bConsumesActionAndAxisMappings) == 0x00004A, "Member 'UInputAction::bConsumesActionAndAxisMappings' has a wrong offset!");
static_assert(offsetof(UInputAction, bReserveAllMappings) == 0x00004B, "Member 'UInputAction::bReserveAllMappings' has a wrong offset!");
static_assert(offsetof(UInputAction, TriggerEventsThatConsumeLegacyKeys) == 0x00004C, "Member 'UInputAction::TriggerEventsThatConsumeLegacyKeys' has a wrong offset!");
static_assert(offsetof(UInputAction, ValueType) == 0x000050, "Member 'UInputAction::ValueType' has a wrong offset!");
static_assert(offsetof(UInputAction, AccumulationBehavior) == 0x000051, "Member 'UInputAction::AccumulationBehavior' has a wrong offset!");
static_assert(offsetof(UInputAction, Triggers) == 0x000058, "Member 'UInputAction::Triggers' has a wrong offset!");
static_assert(offsetof(UInputAction, Modifiers) == 0x000068, "Member 'UInputAction::Modifiers' has a wrong offset!");
static_assert(offsetof(UInputAction, PlayerMappableKeySettings) == 0x000078, "Member 'UInputAction::PlayerMappableKeySettings' has a wrong offset!");

// Class EnhancedInput.InputDebugKeyDelegateBinding
// 0x0010 (0x0038 - 0x0028)
class UInputDebugKeyDelegateBinding final : public UInputDelegateBinding
{
public:
	TArray<struct FBlueprintInputDebugKeyDelegateBinding> InputDebugKeyDelegateBindings;                     // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputDebugKeyDelegateBinding">();
	}
	static class UInputDebugKeyDelegateBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputDebugKeyDelegateBinding>();
	}
};
static_assert(alignof(UInputDebugKeyDelegateBinding) == 0x000008, "Wrong alignment on UInputDebugKeyDelegateBinding");
static_assert(sizeof(UInputDebugKeyDelegateBinding) == 0x000038, "Wrong size on UInputDebugKeyDelegateBinding");
static_assert(offsetof(UInputDebugKeyDelegateBinding, InputDebugKeyDelegateBindings) == 0x000028, "Member 'UInputDebugKeyDelegateBinding::InputDebugKeyDelegateBindings' has a wrong offset!");

// Class EnhancedInput.InputMappingContext
// 0x0028 (0x0058 - 0x0030)
class UInputMappingContext final : public UDataAsset
{
public:
	TArray<struct FEnhancedActionKeyMapping>      Mappings;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FText                                   ContextDescription;                                // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	struct FEnhancedActionKeyMapping MapKey(const class UInputAction* Action, const struct FKey& ToKey);
	void UnmapAction(const class UInputAction* Action);
	void UnmapAll();
	void UnmapAllKeysFromAction(const class UInputAction* Action);
	void UnmapKey(const class UInputAction* Action, const struct FKey& Key);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputMappingContext">();
	}
	static class UInputMappingContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputMappingContext>();
	}
};
static_assert(alignof(UInputMappingContext) == 0x000008, "Wrong alignment on UInputMappingContext");
static_assert(sizeof(UInputMappingContext) == 0x000058, "Wrong size on UInputMappingContext");
static_assert(offsetof(UInputMappingContext, Mappings) == 0x000030, "Member 'UInputMappingContext::Mappings' has a wrong offset!");
static_assert(offsetof(UInputMappingContext, ContextDescription) == 0x000040, "Member 'UInputMappingContext::ContextDescription' has a wrong offset!");

// Class EnhancedInput.InputModifier
// 0x0000 (0x0028 - 0x0028)
class UInputModifier : public UObject
{
public:
	struct FLinearColor GetVisualizationColor(const struct FInputActionValue& SampleValue, const struct FInputActionValue& FinalValue) const;
	struct FInputActionValue ModifyRaw(const class UEnhancedPlayerInput* PlayerInput, const struct FInputActionValue& CurrentValue, float DeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifier">();
	}
	static class UInputModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifier>();
	}
};
static_assert(alignof(UInputModifier) == 0x000008, "Wrong alignment on UInputModifier");
static_assert(sizeof(UInputModifier) == 0x000028, "Wrong size on UInputModifier");

// Class EnhancedInput.InputModifierDeadZone
// 0x0010 (0x0038 - 0x0028)
class UInputModifierDeadZone final : public UInputModifier
{
public:
	float                                         LowerThreshold;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpperThreshold;                                    // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeadZoneType                                 Type;                                              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C53[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierDeadZone">();
	}
	static class UInputModifierDeadZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierDeadZone>();
	}
};
static_assert(alignof(UInputModifierDeadZone) == 0x000008, "Wrong alignment on UInputModifierDeadZone");
static_assert(sizeof(UInputModifierDeadZone) == 0x000038, "Wrong size on UInputModifierDeadZone");
static_assert(offsetof(UInputModifierDeadZone, LowerThreshold) == 0x000028, "Member 'UInputModifierDeadZone::LowerThreshold' has a wrong offset!");
static_assert(offsetof(UInputModifierDeadZone, UpperThreshold) == 0x00002C, "Member 'UInputModifierDeadZone::UpperThreshold' has a wrong offset!");
static_assert(offsetof(UInputModifierDeadZone, Type) == 0x000030, "Member 'UInputModifierDeadZone::Type' has a wrong offset!");

// Class EnhancedInput.InputModifierScalar
// 0x0018 (0x0040 - 0x0028)
class UInputModifierScalar final : public UInputModifier
{
public:
	struct FVector                                Scalar;                                            // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierScalar">();
	}
	static class UInputModifierScalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierScalar>();
	}
};
static_assert(alignof(UInputModifierScalar) == 0x000008, "Wrong alignment on UInputModifierScalar");
static_assert(sizeof(UInputModifierScalar) == 0x000040, "Wrong size on UInputModifierScalar");
static_assert(offsetof(UInputModifierScalar, Scalar) == 0x000028, "Member 'UInputModifierScalar::Scalar' has a wrong offset!");

// Class EnhancedInput.InputModifierScaleByDeltaTime
// 0x0000 (0x0028 - 0x0028)
class UInputModifierScaleByDeltaTime final : public UInputModifier
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierScaleByDeltaTime">();
	}
	static class UInputModifierScaleByDeltaTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierScaleByDeltaTime>();
	}
};
static_assert(alignof(UInputModifierScaleByDeltaTime) == 0x000008, "Wrong alignment on UInputModifierScaleByDeltaTime");
static_assert(sizeof(UInputModifierScaleByDeltaTime) == 0x000028, "Wrong size on UInputModifierScaleByDeltaTime");

// Class EnhancedInput.InputModifierNegate
// 0x0008 (0x0030 - 0x0028)
class UInputModifierNegate final : public UInputModifier
{
public:
	bool                                          bX;                                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bY;                                                // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bZ;                                                // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C54[0x5];                                     // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierNegate">();
	}
	static class UInputModifierNegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierNegate>();
	}
};
static_assert(alignof(UInputModifierNegate) == 0x000008, "Wrong alignment on UInputModifierNegate");
static_assert(sizeof(UInputModifierNegate) == 0x000030, "Wrong size on UInputModifierNegate");
static_assert(offsetof(UInputModifierNegate, bX) == 0x000028, "Member 'UInputModifierNegate::bX' has a wrong offset!");
static_assert(offsetof(UInputModifierNegate, bY) == 0x000029, "Member 'UInputModifierNegate::bY' has a wrong offset!");
static_assert(offsetof(UInputModifierNegate, bZ) == 0x00002A, "Member 'UInputModifierNegate::bZ' has a wrong offset!");

// Class EnhancedInput.InputModifierSmooth
// 0x0030 (0x0058 - 0x0028)
class UInputModifierSmooth final : public UInputModifier
{
public:
	uint8                                         Pad_1C55[0x30];                                    // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierSmooth">();
	}
	static class UInputModifierSmooth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierSmooth>();
	}
};
static_assert(alignof(UInputModifierSmooth) == 0x000008, "Wrong alignment on UInputModifierSmooth");
static_assert(sizeof(UInputModifierSmooth) == 0x000058, "Wrong size on UInputModifierSmooth");

// Class EnhancedInput.InputModifierResponseCurveExponential
// 0x0018 (0x0040 - 0x0028)
class UInputModifierResponseCurveExponential final : public UInputModifier
{
public:
	struct FVector                                CurveExponent;                                     // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierResponseCurveExponential">();
	}
	static class UInputModifierResponseCurveExponential* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierResponseCurveExponential>();
	}
};
static_assert(alignof(UInputModifierResponseCurveExponential) == 0x000008, "Wrong alignment on UInputModifierResponseCurveExponential");
static_assert(sizeof(UInputModifierResponseCurveExponential) == 0x000040, "Wrong size on UInputModifierResponseCurveExponential");
static_assert(offsetof(UInputModifierResponseCurveExponential, CurveExponent) == 0x000028, "Member 'UInputModifierResponseCurveExponential::CurveExponent' has a wrong offset!");

// Class EnhancedInput.InputModifierResponseCurveUser
// 0x0018 (0x0040 - 0x0028)
class UInputModifierResponseCurveUser final : public UInputModifier
{
public:
	class UCurveFloat*                            ResponseX;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ResponseY;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ResponseZ;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierResponseCurveUser">();
	}
	static class UInputModifierResponseCurveUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierResponseCurveUser>();
	}
};
static_assert(alignof(UInputModifierResponseCurveUser) == 0x000008, "Wrong alignment on UInputModifierResponseCurveUser");
static_assert(sizeof(UInputModifierResponseCurveUser) == 0x000040, "Wrong size on UInputModifierResponseCurveUser");
static_assert(offsetof(UInputModifierResponseCurveUser, ResponseX) == 0x000028, "Member 'UInputModifierResponseCurveUser::ResponseX' has a wrong offset!");
static_assert(offsetof(UInputModifierResponseCurveUser, ResponseY) == 0x000030, "Member 'UInputModifierResponseCurveUser::ResponseY' has a wrong offset!");
static_assert(offsetof(UInputModifierResponseCurveUser, ResponseZ) == 0x000038, "Member 'UInputModifierResponseCurveUser::ResponseZ' has a wrong offset!");

// Class EnhancedInput.InputModifierFOVScaling
// 0x0008 (0x0030 - 0x0028)
class UInputModifierFOVScaling final : public UInputModifier
{
public:
	float                                         FOVScale;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFOVScalingType                               FOVScalingType;                                    // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C56[0x3];                                     // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierFOVScaling">();
	}
	static class UInputModifierFOVScaling* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierFOVScaling>();
	}
};
static_assert(alignof(UInputModifierFOVScaling) == 0x000008, "Wrong alignment on UInputModifierFOVScaling");
static_assert(sizeof(UInputModifierFOVScaling) == 0x000030, "Wrong size on UInputModifierFOVScaling");
static_assert(offsetof(UInputModifierFOVScaling, FOVScale) == 0x000028, "Member 'UInputModifierFOVScaling::FOVScale' has a wrong offset!");
static_assert(offsetof(UInputModifierFOVScaling, FOVScalingType) == 0x00002C, "Member 'UInputModifierFOVScaling::FOVScalingType' has a wrong offset!");

// Class EnhancedInput.InputModifierToWorldSpace
// 0x0000 (0x0028 - 0x0028)
class UInputModifierToWorldSpace final : public UInputModifier
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierToWorldSpace">();
	}
	static class UInputModifierToWorldSpace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierToWorldSpace>();
	}
};
static_assert(alignof(UInputModifierToWorldSpace) == 0x000008, "Wrong alignment on UInputModifierToWorldSpace");
static_assert(sizeof(UInputModifierToWorldSpace) == 0x000028, "Wrong size on UInputModifierToWorldSpace");

// Class EnhancedInput.InputModifierSwizzleAxis
// 0x0008 (0x0030 - 0x0028)
class UInputModifierSwizzleAxis final : public UInputModifier
{
public:
	EInputAxisSwizzle                             Order;                                             // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C57[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputModifierSwizzleAxis">();
	}
	static class UInputModifierSwizzleAxis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierSwizzleAxis>();
	}
};
static_assert(alignof(UInputModifierSwizzleAxis) == 0x000008, "Wrong alignment on UInputModifierSwizzleAxis");
static_assert(sizeof(UInputModifierSwizzleAxis) == 0x000030, "Wrong size on UInputModifierSwizzleAxis");
static_assert(offsetof(UInputModifierSwizzleAxis, Order) == 0x000028, "Member 'UInputModifierSwizzleAxis::Order' has a wrong offset!");

// Class EnhancedInput.InputTrigger
// 0x0028 (0x0050 - 0x0028)
class UInputTrigger : public UObject
{
public:
	float                                         ActuationThreshold;                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAlwaysTick;                                 // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C58[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      LastValue;                                         // 0x0030(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	ETriggerState UpdateState(const class UEnhancedPlayerInput* PlayerInput, const struct FInputActionValue& ModifiedValue, float DeltaTime);

	ETriggerType GetTriggerType() const;
	bool IsActuated(const struct FInputActionValue& ForValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputTrigger">();
	}
	static class UInputTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTrigger>();
	}
};
static_assert(alignof(UInputTrigger) == 0x000008, "Wrong alignment on UInputTrigger");
static_assert(sizeof(UInputTrigger) == 0x000050, "Wrong size on UInputTrigger");
static_assert(offsetof(UInputTrigger, ActuationThreshold) == 0x000028, "Member 'UInputTrigger::ActuationThreshold' has a wrong offset!");
static_assert(offsetof(UInputTrigger, bShouldAlwaysTick) == 0x00002C, "Member 'UInputTrigger::bShouldAlwaysTick' has a wrong offset!");
static_assert(offsetof(UInputTrigger, LastValue) == 0x000030, "Member 'UInputTrigger::LastValue' has a wrong offset!");

// Class EnhancedInput.InputTriggerTimedBase
// 0x0008 (0x0058 - 0x0050)
class UInputTriggerTimedBase : public UInputTrigger
{
public:
	float                                         HeldDuration;                                      // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAffectedByTimeDilation;                           // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C5B[0x3];                                     // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputTriggerTimedBase">();
	}
	static class UInputTriggerTimedBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerTimedBase>();
	}
};
static_assert(alignof(UInputTriggerTimedBase) == 0x000008, "Wrong alignment on UInputTriggerTimedBase");
static_assert(sizeof(UInputTriggerTimedBase) == 0x000058, "Wrong size on UInputTriggerTimedBase");
static_assert(offsetof(UInputTriggerTimedBase, HeldDuration) == 0x000050, "Member 'UInputTriggerTimedBase::HeldDuration' has a wrong offset!");
static_assert(offsetof(UInputTriggerTimedBase, bAffectedByTimeDilation) == 0x000054, "Member 'UInputTriggerTimedBase::bAffectedByTimeDilation' has a wrong offset!");

// Class EnhancedInput.InputTriggerDown
// 0x0000 (0x0050 - 0x0050)
class UInputTriggerDown final : public UInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputTriggerDown">();
	}
	static class UInputTriggerDown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerDown>();
	}
};
static_assert(alignof(UInputTriggerDown) == 0x000008, "Wrong alignment on UInputTriggerDown");
static_assert(sizeof(UInputTriggerDown) == 0x000050, "Wrong size on UInputTriggerDown");

// Class EnhancedInput.InputTriggerPressed
// 0x0000 (0x0050 - 0x0050)
class UInputTriggerPressed final : public UInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputTriggerPressed">();
	}
	static class UInputTriggerPressed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerPressed>();
	}
};
static_assert(alignof(UInputTriggerPressed) == 0x000008, "Wrong alignment on UInputTriggerPressed");
static_assert(sizeof(UInputTriggerPressed) == 0x000050, "Wrong size on UInputTriggerPressed");

// Class EnhancedInput.InputTriggerReleased
// 0x0000 (0x0050 - 0x0050)
class UInputTriggerReleased final : public UInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputTriggerReleased">();
	}
	static class UInputTriggerReleased* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerReleased>();
	}
};
static_assert(alignof(UInputTriggerReleased) == 0x000008, "Wrong alignment on UInputTriggerReleased");
static_assert(sizeof(UInputTriggerReleased) == 0x000050, "Wrong size on UInputTriggerReleased");

// Class EnhancedInput.InputTriggerHold
// 0x0010 (0x0068 - 0x0058)
class UInputTriggerHold final : public UInputTriggerTimedBase
{
public:
	uint8                                         Pad_1C5C[0x4];                                     // 0x0058(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoldTimeThreshold;                                 // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOneShot;                                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
