#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FallingRock_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FallingRock_BP.FallingRock_BP_C.BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DDB[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'FallingRock_BP_C_BndEvt__FallingRock_BP_SM_Rock_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function FallingRock_BP.FallingRock_BP_C.ExecuteUbergraph_FallingRock_BP
// 0x0400 (0x0400 - 0x0000)
struct FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DDC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DDD[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0180(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DDE[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DDF[0x6];                                     // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0308(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP) == 0x000008, "Wrong alignment on FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP");
static_assert(sizeof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP) == 0x000400, "Wrong size on FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, EntryPoint) == 0x000000, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000010, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_VLerp_ReturnValue) == 0x000028, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_VLerp_ReturnValue_1) == 0x000040, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000058, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000060, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000148, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000150, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000158, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000160, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x000168, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x000170, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000178, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x00017C, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x000180, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, K2Node_DynamicCast_AsBPI_Character) == 0x000268, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_GetDisplayName_ReturnValue) == 0x000280, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_GetForwardVector_ReturnValue) == 0x000290, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_GetPlayerPawn_ReturnValue) == 0x0002A8, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002B0, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002C8, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_RandomBool_ReturnValue) == 0x0002C9, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_SelectFloat_ReturnValue_1) == 0x0002D0, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0002D8, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_SelectFloat_ReturnValue_2) == 0x0002E0, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0002E8, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_MakeRotator_ReturnValue) == 0x0002F0, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000308, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0003F0, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0003F4, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0003F8, "Member 'FallingRock_BP_C_ExecuteUbergraph_FallingRock_BP::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");

// Function FallingRock_BP.FallingRock_BP_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct FallingRock_BP_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FallingRock_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on FallingRock_BP_C_UserConstructionScript");
static_assert(sizeof(FallingRock_BP_C_UserConstructionScript) == 0x000030, "Wrong size on FallingRock_BP_C_UserConstructionScript");
static_assert(offsetof(FallingRock_BP_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'FallingRock_BP_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FallingRock_BP_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000018, "Member 'FallingRock_BP_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");

}

