#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_Settings

#include "Basic.hpp"

#include "E_SettingCategory_structs.hpp"
#include "S_SavedSetting_structs.hpp"
#include "S_Setting_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FL_Settings.FL_Settings_C.Debug
// 0x0060 (0x0060 - 0x0000)
struct FL_Settings_C_Debug final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save;  // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowDebug_Debug;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF4[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PrintString_Duration_ImplicitCast;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_Settings_C_Debug) == 0x000008, "Wrong alignment on FL_Settings_C_Debug");
static_assert(sizeof(FL_Settings_C_Debug) == 0x000060, "Wrong size on FL_Settings_C_Debug");
static_assert(offsetof(FL_Settings_C_Debug, InString) == 0x000000, "Member 'FL_Settings_C_Debug::InString' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, TextColor) == 0x000010, "Member 'FL_Settings_C_Debug::TextColor' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, Duration) == 0x000020, "Member 'FL_Settings_C_Debug::Duration' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, __WorldContext) == 0x000028, "Member 'FL_Settings_C_Debug::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'FL_Settings_C_Debug::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, CallFunc_GetPlayerController_ReturnValue_1) == 0x000038, "Member 'FL_Settings_C_Debug::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'FL_Settings_C_Debug::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, K2Node_DynamicCast_AsBPI_Game_Instance_with_Save) == 0x000048, "Member 'FL_Settings_C_Debug::K2Node_DynamicCast_AsBPI_Game_Instance_with_Save' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'FL_Settings_C_Debug::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, CallFunc_GetShowDebug_Debug) == 0x000059, "Member 'FL_Settings_C_Debug::CallFunc_GetShowDebug_Debug' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_Debug, CallFunc_PrintString_Duration_ImplicitCast) == 0x00005C, "Member 'FL_Settings_C_Debug::CallFunc_PrintString_Duration_ImplicitCast' has a wrong offset!");

// Function FL_Settings.FL_Settings_C.GetSaveGame
// 0x0040 (0x0040 - 0x0000)
struct FL_Settings_C_GetSaveGame final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UV_SaveGame_C*                          SaveGame;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UV_SaveGame_C*                          CallFunc_GetSaveGameObject_SaveGame;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_Settings_C_GetSaveGame) == 0x000008, "Wrong alignment on FL_Settings_C_GetSaveGame");
static_assert(sizeof(FL_Settings_C_GetSaveGame) == 0x000040, "Wrong size on FL_Settings_C_GetSaveGame");
static_assert(offsetof(FL_Settings_C_GetSaveGame, __WorldContext) == 0x000000, "Member 'FL_Settings_C_GetSaveGame::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSaveGame, SaveGame) == 0x000008, "Member 'FL_Settings_C_GetSaveGame::SaveGame' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSaveGame, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'FL_Settings_C_GetSaveGame::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSaveGame, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'FL_Settings_C_GetSaveGame::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSaveGame, K2Node_DynamicCast_AsBPI_Game_Instance_with_Save) == 0x000020, "Member 'FL_Settings_C_GetSaveGame::K2Node_DynamicCast_AsBPI_Game_Instance_with_Save' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSaveGame, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'FL_Settings_C_GetSaveGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSaveGame, CallFunc_GetSaveGameObject_SaveGame) == 0x000038, "Member 'FL_Settings_C_GetSaveGame::CallFunc_GetSaveGameObject_SaveGame' has a wrong offset!");

// Function FL_Settings.FL_Settings_C.GetSettingCategory
// 0x00E0 (0x00E0 - 0x0000)
struct FL_Settings_C_GetSettingCategory final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_SettingCategory                             Category;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF6[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0028(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF7[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Setting                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_Settings_C_GetSettingCategory) == 0x000008, "Wrong alignment on FL_Settings_C_GetSettingCategory");
static_assert(sizeof(FL_Settings_C_GetSettingCategory) == 0x0000E0, "Wrong size on FL_Settings_C_GetSettingCategory");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, Identifier) == 0x000000, "Member 'FL_Settings_C_GetSettingCategory::Identifier' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, __WorldContext) == 0x000010, "Member 'FL_Settings_C_GetSettingCategory::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, Category) == 0x000018, "Member 'FL_Settings_C_GetSettingCategory::Category' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'FL_Settings_C_GetSettingCategory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'FL_Settings_C_GetSettingCategory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'FL_Settings_C_GetSettingCategory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000028, "Member 'FL_Settings_C_GetSettingCategory::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, CallFunc_Array_Get_Item) == 0x000038, "Member 'FL_Settings_C_GetSettingCategory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'FL_Settings_C_GetSettingCategory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'FL_Settings_C_GetSettingCategory::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D8, "Member 'FL_Settings_C_GetSettingCategory::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, CallFunc_Less_IntInt_ReturnValue) == 0x0000D9, "Member 'FL_Settings_C_GetSettingCategory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingCategory, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000DA, "Member 'FL_Settings_C_GetSettingCategory::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function FL_Settings.FL_Settings_C.GetSettingDefaultValue
// 0x0108 (0x0108 - 0x0000)
struct FL_Settings_C_GetSettingDefaultValue final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FloatDefaultValue;                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DefaultComboSelection;                             // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF9[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0048(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CFA[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Setting                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CFB[0x5];                                     // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_FloatDefaultValue_ImplicitCast; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_Settings_C_GetSettingDefaultValue) == 0x000008, "Wrong alignment on FL_Settings_C_GetSettingDefaultValue");
static_assert(sizeof(FL_Settings_C_GetSettingDefaultValue) == 0x000108, "Wrong size on FL_Settings_C_GetSettingDefaultValue");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, ID) == 0x000000, "Member 'FL_Settings_C_GetSettingDefaultValue::ID' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, __WorldContext) == 0x000010, "Member 'FL_Settings_C_GetSettingDefaultValue::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, ReturnValue) == 0x000018, "Member 'FL_Settings_C_GetSettingDefaultValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, FloatDefaultValue) == 0x000020, "Member 'FL_Settings_C_GetSettingDefaultValue::FloatDefaultValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, DefaultComboSelection) == 0x000028, "Member 'FL_Settings_C_GetSettingDefaultValue::DefaultComboSelection' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, Temp_int_Array_Index_Variable) == 0x000038, "Member 'FL_Settings_C_GetSettingDefaultValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'FL_Settings_C_GetSettingDefaultValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'FL_Settings_C_GetSettingDefaultValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000048, "Member 'FL_Settings_C_GetSettingDefaultValue::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, CallFunc_Array_Get_Item) == 0x000058, "Member 'FL_Settings_C_GetSettingDefaultValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'FL_Settings_C_GetSettingDefaultValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'FL_Settings_C_GetSettingDefaultValue::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F8, "Member 'FL_Settings_C_GetSettingDefaultValue::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, CallFunc_Less_IntInt_ReturnValue) == 0x0000F9, "Member 'FL_Settings_C_GetSettingDefaultValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000FA, "Member 'FL_Settings_C_GetSettingDefaultValue::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingDefaultValue, K2Node_FunctionResult_FloatDefaultValue_ImplicitCast) == 0x000100, "Member 'FL_Settings_C_GetSettingDefaultValue::K2Node_FunctionResult_FloatDefaultValue_ImplicitCast' has a wrong offset!");

// Function FL_Settings.FL_Settings_C.GetSettingFromArray
// 0x0080 (0x0080 - 0x0000)
struct FL_Settings_C_GetSettingFromArray final
{
public:
	TArray<struct FS_SavedSetting>                Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Setting;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CFC[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CFD[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SavedSetting                        CallFunc_Array_Get_Item;                           // 0x0050(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CFE[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_Settings_C_GetSettingFromArray) == 0x000008, "Wrong alignment on FL_Settings_C_GetSettingFromArray");
static_assert(sizeof(FL_Settings_C_GetSettingFromArray) == 0x000080, "Wrong size on FL_Settings_C_GetSettingFromArray");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, Array) == 0x000000, "Member 'FL_Settings_C_GetSettingFromArray::Array' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, Setting) == 0x000010, "Member 'FL_Settings_C_GetSettingFromArray::Setting' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, __WorldContext) == 0x000020, "Member 'FL_Settings_C_GetSettingFromArray::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, ReturnValue) == 0x000028, "Member 'FL_Settings_C_GetSettingFromArray::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, Value) == 0x000030, "Member 'FL_Settings_C_GetSettingFromArray::Value' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'FL_Settings_C_GetSettingFromArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, Temp_int_Array_Index_Variable) == 0x000044, "Member 'FL_Settings_C_GetSettingFromArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'FL_Settings_C_GetSettingFromArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, CallFunc_Array_Get_Item) == 0x000050, "Member 'FL_Settings_C_GetSettingFromArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'FL_Settings_C_GetSettingFromArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'FL_Settings_C_GetSettingFromArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_Settings_C_GetSettingFromArray, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000078, "Member 'FL_Settings_C_GetSettingFromArray::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

}

