#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flower_bowl_02_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass flower_bowl_02_BP.flower_bowl_02_BP_C
// 0x0068 (0x0300 - 0x0298)
class AFlower_bowl_02_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Creeper_4;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Creeper_3;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Creeper_2;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Creeper_1;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lupin;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bowl;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Creeper_array;                                     // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRandomStream                          Stream;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	TArray<class UMaterialInterface*>             Lupin_colour_array;                                // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Lupin_colour_picker;                               // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"flower_bowl_02_BP_C">();
	}
	static class AFlower_bowl_02_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFlower_bowl_02_BP_C>();
	}
};
static_assert(alignof(AFlower_bowl_02_BP_C) == 0x000008, "Wrong alignment on AFlower_bowl_02_BP_C");
static_assert(sizeof(AFlower_bowl_02_BP_C) == 0x000300, "Wrong size on AFlower_bowl_02_BP_C");
static_assert(offsetof(AFlower_bowl_02_BP_C, Creeper_4) == 0x000298, "Member 'AFlower_bowl_02_BP_C::Creeper_4' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, Creeper_3) == 0x0002A0, "Member 'AFlower_bowl_02_BP_C::Creeper_3' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, Creeper_2) == 0x0002A8, "Member 'AFlower_bowl_02_BP_C::Creeper_2' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, Creeper_1) == 0x0002B0, "Member 'AFlower_bowl_02_BP_C::Creeper_1' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, Lupin) == 0x0002B8, "Member 'AFlower_bowl_02_BP_C::Lupin' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, bowl) == 0x0002C0, "Member 'AFlower_bowl_02_BP_C::bowl' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, SharedRoot) == 0x0002C8, "Member 'AFlower_bowl_02_BP_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, Creeper_array) == 0x0002D0, "Member 'AFlower_bowl_02_BP_C::Creeper_array' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, Stream) == 0x0002E0, "Member 'AFlower_bowl_02_BP_C::Stream' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, Lupin_colour_array) == 0x0002E8, "Member 'AFlower_bowl_02_BP_C::Lupin_colour_array' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_02_BP_C, Lupin_colour_picker) == 0x0002F8, "Member 'AFlower_bowl_02_BP_C::Lupin_colour_picker' has a wrong offset!");

}

