#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flower_bowl_01_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass flower_bowl_01_BP.flower_bowl_01_BP_C
// 0x0040 (0x02D8 - 0x0298)
class AFlower_bowl_01_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Creeping_jenny_01;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   E;                                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dianthus17_StaticMeshComponent0;                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geranium19_StaticMeshComponent0;                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geranium18_StaticMeshComponent0;                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dianthus18_StaticMeshComponent0;                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bowl9_StaticMeshComponent0;                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"flower_bowl_01_BP_C">();
	}
	static class AFlower_bowl_01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFlower_bowl_01_BP_C>();
	}
};
static_assert(alignof(AFlower_bowl_01_BP_C) == 0x000008, "Wrong alignment on AFlower_bowl_01_BP_C");
static_assert(sizeof(AFlower_bowl_01_BP_C) == 0x0002D8, "Wrong size on AFlower_bowl_01_BP_C");
static_assert(offsetof(AFlower_bowl_01_BP_C, Creeping_jenny_01) == 0x000298, "Member 'AFlower_bowl_01_BP_C::Creeping_jenny_01' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_01_BP_C, E) == 0x0002A0, "Member 'AFlower_bowl_01_BP_C::E' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_01_BP_C, Dianthus17_StaticMeshComponent0) == 0x0002A8, "Member 'AFlower_bowl_01_BP_C::Dianthus17_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_01_BP_C, Geranium19_StaticMeshComponent0) == 0x0002B0, "Member 'AFlower_bowl_01_BP_C::Geranium19_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_01_BP_C, Geranium18_StaticMeshComponent0) == 0x0002B8, "Member 'AFlower_bowl_01_BP_C::Geranium18_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_01_BP_C, Dianthus18_StaticMeshComponent0) == 0x0002C0, "Member 'AFlower_bowl_01_BP_C::Dianthus18_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_01_BP_C, bowl9_StaticMeshComponent0) == 0x0002C8, "Member 'AFlower_bowl_01_BP_C::bowl9_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AFlower_bowl_01_BP_C, SharedRoot) == 0x0002D0, "Member 'AFlower_bowl_01_BP_C::SharedRoot' has a wrong offset!");

}

