#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Footstep_AnimNotify

#include "Basic.hpp"

#include "FootstepType_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Footstep_AnimNotify.Footstep_AnimNotify_C
// 0x0030 (0x0068 - 0x0038)
class UFootstep_AnimNotify_C final : public UAnimNotify
{
public:
	class USoundBase*                             Sound;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPointName;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFootstepType                                 FootstepType;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EB0[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VolumeMultiplier;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PitchMultiplier;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideMaskCurve;                                 // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Right;                                             // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          LeftAndRight;                                      // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Footstep_AnimNotify_C">();
	}
	static class UFootstep_AnimNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstep_AnimNotify_C>();
	}
};
static_assert(alignof(UFootstep_AnimNotify_C) == 0x000008, "Wrong alignment on UFootstep_AnimNotify_C");
static_assert(sizeof(UFootstep_AnimNotify_C) == 0x000068, "Wrong size on UFootstep_AnimNotify_C");
static_assert(offsetof(UFootstep_AnimNotify_C, Sound) == 0x000038, "Member 'UFootstep_AnimNotify_C::Sound' has a wrong offset!");
static_assert(offsetof(UFootstep_AnimNotify_C, AttachPointName) == 0x000040, "Member 'UFootstep_AnimNotify_C::AttachPointName' has a wrong offset!");
static_assert(offsetof(UFootstep_AnimNotify_C, FootstepType) == 0x000048, "Member 'UFootstep_AnimNotify_C::FootstepType' has a wrong offset!");
static_assert(offsetof(UFootstep_AnimNotify_C, VolumeMultiplier) == 0x000050, "Member 'UFootstep_AnimNotify_C::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UFootstep_AnimNotify_C, PitchMultiplier) == 0x000058, "Member 'UFootstep_AnimNotify_C::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UFootstep_AnimNotify_C, OverrideMaskCurve) == 0x000060, "Member 'UFootstep_AnimNotify_C::OverrideMaskCurve' has a wrong offset!");
static_assert(offsetof(UFootstep_AnimNotify_C, Right) == 0x000061, "Member 'UFootstep_AnimNotify_C::Right' has a wrong offset!");
static_assert(offsetof(UFootstep_AnimNotify_C, LeftAndRight) == 0x000062, "Member 'UFootstep_AnimNotify_C::LeftAndRight' has a wrong offset!");

}

