#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FS_MasterField

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Chaos_structs.hpp"


namespace SDK::Params
{

// Function FS_MasterField.FS_MasterField_C.CalculateNoise
// 0x01E0 (0x01E0 - 0x0000)
struct FS_MasterField_C_CalculateNoise final
{
public:
	class UNoiseField*                            OutputPin;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x00B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNoiseField*                            CallFunc_AddComponent_ReturnValue;                 // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNoiseField*                            CallFunc_SetNoiseField_ReturnValue;                // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNoiseField_MinRange_ImplicitCast;      // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNoiseField_MaxRange_ImplicitCast;      // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_MasterField_C_CalculateNoise) == 0x000010, "Wrong alignment on FS_MasterField_C_CalculateNoise");
static_assert(sizeof(FS_MasterField_C_CalculateNoise) == 0x0001E0, "Wrong size on FS_MasterField_C_CalculateNoise");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, OutputPin) == 0x000000, "Member 'FS_MasterField_C_CalculateNoise::OutputPin' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000020, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000038, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000050, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, Temp_struct_Variable) == 0x0000B0, "Member 'FS_MasterField_C_CalculateNoise::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_BreakTransform_Location) == 0x000110, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_BreakTransform_Rotation) == 0x000128, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_BreakTransform_Scale) == 0x000140, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_AddComponent_ReturnValue) == 0x000158, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_BreakVector2D_X) == 0x0001C0, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_BreakVector2D_Y) == 0x0001C8, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_SetNoiseField_ReturnValue) == 0x0001D0, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_SetNoiseField_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_SetNoiseField_MinRange_ImplicitCast) == 0x0001D8, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_SetNoiseField_MinRange_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_CalculateNoise, CallFunc_SetNoiseField_MaxRange_ImplicitCast) == 0x0001DC, "Member 'FS_MasterField_C_CalculateNoise::CallFunc_SetNoiseField_MaxRange_ImplicitCast' has a wrong offset!");

// Function FS_MasterField.FS_MasterField_C.DisplayTextSetup
// 0x00F8 (0x00F8 - 0x0000)
struct FS_MasterField_C_DisplayTextSetup final
{
public:
	double                                        CallFunc_BreakVector2D_X;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F0[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0030(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0048(0x0018)()
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x0070(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_4;          // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_5;          // 0x00A0(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_6;          // 0x00B8(0x0018)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x00D0(0x0018)()
	TArray<class UTextRenderComponent*>           K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(FS_MasterField_C_DisplayTextSetup) == 0x000008, "Wrong alignment on FS_MasterField_C_DisplayTextSetup");
static_assert(sizeof(FS_MasterField_C_DisplayTextSetup) == 0x0000F8, "Wrong size on FS_MasterField_C_DisplayTextSetup");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_BreakVector2D_X) == 0x000000, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'FS_MasterField_C_DisplayTextSetup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000030, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x000048, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_BreakVector2D_X_1) == 0x000060, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_BreakVector2D_Y_1) == 0x000068, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_Conv_DoubleToText_ReturnValue_3) == 0x000070, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_Conv_DoubleToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_Conv_DoubleToText_ReturnValue_4) == 0x000088, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_Conv_DoubleToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_Conv_DoubleToText_ReturnValue_5) == 0x0000A0, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_Conv_DoubleToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_Conv_DoubleToText_ReturnValue_6) == 0x0000B8, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_Conv_DoubleToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, CallFunc_Conv_BoolToText_ReturnValue) == 0x0000D0, "Member 'FS_MasterField_C_DisplayTextSetup::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_DisplayTextSetup, K2Node_MakeArray_Array) == 0x0000E8, "Member 'FS_MasterField_C_DisplayTextSetup::K2Node_MakeArray_Array' has a wrong offset!");

// Function FS_MasterField.FS_MasterField_C.ExecuteUbergraph_FS_MasterField
// 0x0910 (0x0910 - 0x0000)
struct FS_MasterField_C_ExecuteUbergraph_FS_MasterField final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoiseField*                            CallFunc_CalculateNoise_OutputPin;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UReturnResultsTerminal*                 CallFunc_SetReturnResultsTerminal_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F2[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F3[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F4[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_FalloffShapeSwitch_OperatorFieldOut;      // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F5[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F6[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F7[0x8];                                     // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x00F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_AddComponent_ReturnValue;                 // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F8[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0160(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformInteger*                        CallFunc_AddComponent_ReturnValue_1;               // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39F9[0x8];                                     // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_2;                            // 0x01D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformInteger*                        CallFunc_SetUniformInteger_ReturnValue;            // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         CallFunc_AddComponent_ReturnValue_2;               // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_3;                            // 0x0240(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         CallFunc_SetUniformVector_ReturnValue;             // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         CallFunc_AddComponent_ReturnValue_3;               // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_4;                            // 0x02B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         CallFunc_SetUniformVector_ReturnValue_1;           // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue_4;               // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_5;                            // 0x0320(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_6;                            // 0x0380(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue_5;               // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformScalar*                         CallFunc_AddComponent_ReturnValue_6;               // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformScalar*                         CallFunc_SetUniformScalar_ReturnValue;             // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39FA[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_7;                            // 0x0400(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URandomVector*                          CallFunc_AddComponent_ReturnValue_7;               // 0x0460(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URandomVector*                          CallFunc_SetRandomVector_ReturnValue;              // 0x0468(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue;             // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_FalloffShapeSwitch_OperatorFieldOut_1;    // 0x0478(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_1;           // 0x0480(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_SetCullingField_ReturnValue;              // 0x0488(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39FB[0x5];                                     // 0x0493(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFieldSystemMetaDataProcessingResolution* CallFunc_SetMetaDataaProcessingResolutionType_ReturnValue; // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_8;                            // 0x04A0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformScalar*                         CallFunc_AddComponent_ReturnValue_8;               // 0x0500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39FC[0x8];                                     // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_9;                            // 0x0510(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformScalar*                         CallFunc_SetUniformScalar_ReturnValue_1;           // 0x0570(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          CallFunc_AddComponent_ReturnValue_9;               // 0x0578(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_10;                           // 0x0580(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          CallFunc_SetRadialVector_ReturnValue;              // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue_10;              // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_FalloffShapeSwitch_OperatorFieldOut_2;    // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoiseField*                            CallFunc_CalculateNoise_OutputPin_1;               // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_FalloffAndCullSwitch_Main_CullingField;   // 0x0600(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_2;           // 0x0608(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_FalloffAndCullSwitch_Main_CullingField_1; // 0x0610(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoiseField*                            CallFunc_CalculateNoise_OutputPin_2;               // 0x0618(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_11;                           // 0x0620(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_12;                           // 0x0680(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue_11;              // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_AddComponent_ReturnValue_12;              // 0x06E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_3;           // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39FD[0x8];                                     // 0x06F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_13;                           // 0x0700(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_FalloffAndCullSwitch_Main_CullingField_2; // 0x0760(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue_13;              // 0x0768(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoiseField*                            CallFunc_CalculateNoise_OutputPin_3;               // 0x0770(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39FE[0x8];                                     // 0x0778(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_14;                           // 0x0780(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_15;                           // 0x07E0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue_14;              // 0x0840(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue_15;              // 0x0848(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_16;                           // 0x0850(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_4;           // 0x08B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue_16;              // 0x08B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_5;           // 0x08C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_6;           // 0x08C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_7;           // 0x08D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_FalloffAndCullSwitch_Main_CullingField_3; // 0x08D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_SetCullingField_ReturnValue_1;            // 0x08E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetUniformScalar_Magnitude_ImplicitCast;  // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetUniformScalar_Magnitude_ImplicitCast_1; // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRadialVector_Magnitude_ImplicitCast;   // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetUniformVector_Magnitude_ImplicitCast;  // 0x08FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_2;            // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField) == 0x000010, "Wrong alignment on FS_MasterField_C_ExecuteUbergraph_FS_MasterField");
static_assert(sizeof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField) == 0x000910, "Wrong size on FS_MasterField_C_ExecuteUbergraph_FS_MasterField");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, EntryPoint) == 0x000000, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::EntryPoint' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_CalculateNoise_OutputPin) == 0x000008, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_CalculateNoise_OutputPin' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetReturnResultsTerminal_ReturnValue) == 0x000010, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetReturnResultsTerminal_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_bool_IsClosed_Variable) == 0x00001C, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_bool_Has_Been_Initd_Variable) == 0x000038, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000040, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000048, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_GetUpVector_ReturnValue) == 0x000060, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_BreakVector2D_X) == 0x000078, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_BreakVector2D_Y) == 0x000080, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_MakeVector2D_ReturnValue) == 0x000088, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_FalloffShapeSwitch_OperatorFieldOut) == 0x000098, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_FalloffShapeSwitch_OperatorFieldOut' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Abs_ReturnValue) == 0x0000A0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000B8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_BooleanAND_ReturnValue) == 0x0000C9, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable) == 0x0000F0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue) == 0x000150, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_BooleanAND_ReturnValue_1) == 0x000158, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_1) == 0x000160, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_1) == 0x0001C0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_2) == 0x0001D0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetUniformInteger_ReturnValue) == 0x000230, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetUniformInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_2) == 0x000238, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_3) == 0x000240, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetUniformVector_ReturnValue) == 0x0002A0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetUniformVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_3) == 0x0002A8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_4) == 0x0002B0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetUniformVector_ReturnValue_1) == 0x000310, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetUniformVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_4) == 0x000318, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_5) == 0x000320, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_6) == 0x000380, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_5) == 0x0003E0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_6) == 0x0003E8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetUniformScalar_ReturnValue) == 0x0003F0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetUniformScalar_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_BooleanAND_ReturnValue_2) == 0x0003F8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_7) == 0x000400, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_7) == 0x000460, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetRandomVector_ReturnValue) == 0x000468, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetRandomVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetOperatorField_ReturnValue) == 0x000470, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetOperatorField_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_FalloffShapeSwitch_OperatorFieldOut_1) == 0x000478, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_FalloffShapeSwitch_OperatorFieldOut_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetOperatorField_ReturnValue_1) == 0x000480, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetOperatorField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetCullingField_ReturnValue) == 0x000488, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetCullingField_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, K2Node_SwitchEnum_CmpSuccess) == 0x000490, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, K2Node_SwitchEnum_CmpSuccess_1) == 0x000491, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, K2Node_SwitchEnum_CmpSuccess_2) == 0x000492, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetMetaDataaProcessingResolutionType_ReturnValue) == 0x000498, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetMetaDataaProcessingResolutionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_8) == 0x0004A0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_8) == 0x000500, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_9) == 0x000510, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetUniformScalar_ReturnValue_1) == 0x000570, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetUniformScalar_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_9) == 0x000578, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_10) == 0x000580, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetRadialVector_ReturnValue) == 0x0005E0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetRadialVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_10) == 0x0005E8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_FalloffShapeSwitch_OperatorFieldOut_2) == 0x0005F0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_FalloffShapeSwitch_OperatorFieldOut_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_CalculateNoise_OutputPin_1) == 0x0005F8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_CalculateNoise_OutputPin_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_FalloffAndCullSwitch_Main_CullingField) == 0x000600, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_FalloffAndCullSwitch_Main_CullingField' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetOperatorField_ReturnValue_2) == 0x000608, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetOperatorField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_FalloffAndCullSwitch_Main_CullingField_1) == 0x000610, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_FalloffAndCullSwitch_Main_CullingField_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_CalculateNoise_OutputPin_2) == 0x000618, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_CalculateNoise_OutputPin_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_11) == 0x000620, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_12) == 0x000680, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_11) == 0x0006E0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_12) == 0x0006E8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetOperatorField_ReturnValue_3) == 0x0006F0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetOperatorField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_13) == 0x000700, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_FalloffAndCullSwitch_Main_CullingField_2) == 0x000760, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_FalloffAndCullSwitch_Main_CullingField_2' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_13) == 0x000768, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_CalculateNoise_OutputPin_3) == 0x000770, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_CalculateNoise_OutputPin_3' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_14) == 0x000780, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_14' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_15) == 0x0007E0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_15' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_14) == 0x000840, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_15) == 0x000848, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, Temp_struct_Variable_16) == 0x000850, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::Temp_struct_Variable_16' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetOperatorField_ReturnValue_4) == 0x0008B0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetOperatorField_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_AddComponent_ReturnValue_16) == 0x0008B8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_AddComponent_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetOperatorField_ReturnValue_5) == 0x0008C0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetOperatorField_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetOperatorField_ReturnValue_6) == 0x0008C8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetOperatorField_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetOperatorField_ReturnValue_7) == 0x0008D0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetOperatorField_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_FalloffAndCullSwitch_Main_CullingField_3) == 0x0008D8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_FalloffAndCullSwitch_Main_CullingField_3' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetCullingField_ReturnValue_1) == 0x0008E0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetCullingField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetUniformScalar_Magnitude_ImplicitCast) == 0x0008E8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetUniformScalar_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetUniformScalar_Magnitude_ImplicitCast_1) == 0x0008EC, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetUniformScalar_Magnitude_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Delay_Duration_ImplicitCast) == 0x0008F0, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetRadialVector_Magnitude_ImplicitCast) == 0x0008F4, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetRadialVector_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Delay_Duration_ImplicitCast_1) == 0x0008F8, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_SetUniformVector_Magnitude_ImplicitCast) == 0x0008FC, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_SetUniformVector_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FS_MasterField_C_ExecuteUbergraph_FS_MasterField, CallFunc_Delay_Duration_ImplicitCast_2) == 0x000900, "Member 'FS_MasterField_C_ExecuteUbergraph_FS_MasterField::CallFunc_Delay_Duration_ImplicitCast_2' has a wrong offset!");

// Function FS_MasterField.FS_MasterField_C.FalloffAndCullSwitch_Main
// 0x0810 (0x0810 - 0x0000)
struct FS_MasterField_C_FalloffAndCullSwitch_Main final
{
public:
	double                                        Magnitude;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFieldFalloffType                             FalloffType;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39FF[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Param_FalloffMinMax;                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         OperatorField;                                     // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CullingField;                                      // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocalVar_0;                                     // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A00[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0050(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_AddComponent_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A01[0x8];                                     // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x00D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxFalloff*                            CallFunc_AddComponent_ReturnValue_1;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A02[0x8];                                     // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_2;                            // 0x0150(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
