#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_Game

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GM_Game.GM_Game_C
// 0x0018 (0x0350 - 0x0338)
class AGM_Game_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         GivenCharacter;                                    // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GM_Game(int32 EntryPoint);
	bool IsA_CarOccupied();
	void K2_OnLogout(class AController* ExitingController);
	void K2_PostLogin(class APlayerController* NewPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GM_Game_C">();
	}
	static class AGM_Game_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGM_Game_C>();
	}
};
static_assert(alignof(AGM_Game_C) == 0x000008, "Wrong alignment on AGM_Game_C");
static_assert(sizeof(AGM_Game_C) == 0x000350, "Wrong size on AGM_Game_C");
static_assert(offsetof(AGM_Game_C, UberGraphFrame) == 0x000338, "Member 'AGM_Game_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGM_Game_C, DefaultSceneRoot) == 0x000340, "Member 'AGM_Game_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGM_Game_C, GivenCharacter) == 0x000348, "Member 'AGM_Game_C::GivenCharacter' has a wrong offset!");

}

