#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Grass_edge_corner_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass grass_edge_corner_BP.grass_edge_corner_BP_C
// 0x0020 (0x02B8 - 0x0298)
class AGrass_edge_corner_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Hedge_straight1;                                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hedge_straight;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"grass_edge_corner_BP_C">();
	}
	static class AGrass_edge_corner_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGrass_edge_corner_BP_C>();
	}
};
static_assert(alignof(AGrass_edge_corner_BP_C) == 0x000008, "Wrong alignment on AGrass_edge_corner_BP_C");
static_assert(sizeof(AGrass_edge_corner_BP_C) == 0x0002B8, "Wrong size on AGrass_edge_corner_BP_C");
static_assert(offsetof(AGrass_edge_corner_BP_C, Hedge_straight1) == 0x000298, "Member 'AGrass_edge_corner_BP_C::Hedge_straight1' has a wrong offset!");
static_assert(offsetof(AGrass_edge_corner_BP_C, Hedge_straight) == 0x0002A0, "Member 'AGrass_edge_corner_BP_C::Hedge_straight' has a wrong offset!");
static_assert(offsetof(AGrass_edge_corner_BP_C, StaticMeshComponent0) == 0x0002A8, "Member 'AGrass_edge_corner_BP_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AGrass_edge_corner_BP_C, SharedRoot) == 0x0002B0, "Member 'AGrass_edge_corner_BP_C::SharedRoot' has a wrong offset!");

}

