#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Grass_corner_large_inverse_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass grass_corner_large_inverse_BP.grass_corner_large_inverse_BP_C
// 0x0018 (0x02B0 - 0x0298)
class AGrass_corner_large_inverse_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Hedge_large_inverse;                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"grass_corner_large_inverse_BP_C">();
	}
	static class AGrass_corner_large_inverse_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGrass_corner_large_inverse_BP_C>();
	}
};
static_assert(alignof(AGrass_corner_large_inverse_BP_C) == 0x000008, "Wrong alignment on AGrass_corner_large_inverse_BP_C");
static_assert(sizeof(AGrass_corner_large_inverse_BP_C) == 0x0002B0, "Wrong size on AGrass_corner_large_inverse_BP_C");
static_assert(offsetof(AGrass_corner_large_inverse_BP_C, Hedge_large_inverse) == 0x000298, "Member 'AGrass_corner_large_inverse_BP_C::Hedge_large_inverse' has a wrong offset!");
static_assert(offsetof(AGrass_corner_large_inverse_BP_C, StaticMeshComponent0) == 0x0002A0, "Member 'AGrass_corner_large_inverse_BP_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AGrass_corner_large_inverse_BP_C, SharedRoot) == 0x0002A8, "Member 'AGrass_corner_large_inverse_BP_C::SharedRoot' has a wrong offset!");

}

