#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GS_Game

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_PhysxChainLocation_structs.hpp"
#include "S_TchatElement_structs.hpp"
#include "SteamCorePro_structs.hpp"
#include "E_ChoosenChar_structs.hpp"
#include "S_SteamIDAndSkin_structs.hpp"


namespace SDK::Params
{

// Function GS_Game.GS_Game_C.ActorToHideInLobby
// 0x0038 (0x0038 - 0x0000)
struct GS_Game_C_ActorToHideInLobby final
{
public:
	bool                                          bNewHidden;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_320C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_320D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_ActorToHideInLobby) == 0x000008, "Wrong alignment on GS_Game_C_ActorToHideInLobby");
static_assert(sizeof(GS_Game_C_ActorToHideInLobby) == 0x000038, "Wrong size on GS_Game_C_ActorToHideInLobby");
static_assert(offsetof(GS_Game_C_ActorToHideInLobby, bNewHidden) == 0x000000, "Member 'GS_Game_C_ActorToHideInLobby::bNewHidden' has a wrong offset!");
static_assert(offsetof(GS_Game_C_ActorToHideInLobby, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GS_Game_C_ActorToHideInLobby::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_ActorToHideInLobby, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GS_Game_C_ActorToHideInLobby::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_ActorToHideInLobby, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GS_Game_C_ActorToHideInLobby::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_ActorToHideInLobby, CallFunc_GetAllActorsWithTag_OutActors) == 0x000010, "Member 'GS_Game_C_ActorToHideInLobby::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(GS_Game_C_ActorToHideInLobby, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'GS_Game_C_ActorToHideInLobby::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_ActorToHideInLobby, CallFunc_Array_Get_Item) == 0x000028, "Member 'GS_Game_C_ActorToHideInLobby::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_ActorToHideInLobby, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'GS_Game_C_ActorToHideInLobby::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GS_Game.GS_Game_C.AddChatElemAll
// 0x0030 (0x0030 - 0x0000)
struct GS_Game_C_AddChatElemAll final
{
public:
	struct FS_TchatElement                        NewElem;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AddChatElemAll) == 0x000008, "Wrong alignment on GS_Game_C_AddChatElemAll");
static_assert(sizeof(GS_Game_C_AddChatElemAll) == 0x000030, "Wrong size on GS_Game_C_AddChatElemAll");
static_assert(offsetof(GS_Game_C_AddChatElemAll, NewElem) == 0x000000, "Member 'GS_Game_C_AddChatElemAll::NewElem' has a wrong offset!");

// Function GS_Game.GS_Game_C.AddFirstSafeLocation
// 0x0020 (0x0020 - 0x0000)
struct GS_Game_C_AddFirstSafeLocation final
{
public:
	TArray<class ABP_RescuePoint_C*>              CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0000(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_320E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RescuePoint_C*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AddFirstSafeLocation) == 0x000008, "Wrong alignment on GS_Game_C_AddFirstSafeLocation");
static_assert(sizeof(GS_Game_C_AddFirstSafeLocation) == 0x000020, "Wrong size on GS_Game_C_AddFirstSafeLocation");
static_assert(offsetof(GS_Game_C_AddFirstSafeLocation, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000000, "Member 'GS_Game_C_AddFirstSafeLocation::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddFirstSafeLocation, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000010, "Member 'GS_Game_C_AddFirstSafeLocation::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddFirstSafeLocation, CallFunc_Array_Get_Item) == 0x000018, "Member 'GS_Game_C_AddFirstSafeLocation::CallFunc_Array_Get_Item' has a wrong offset!");

// Function GS_Game.GS_Game_C.AddLocalMP_Players
// 0x0090 (0x0090 - 0x0000)
struct GS_Game_C_AddLocalMP_Players final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerController_C> K2Node_DynamicCast_AsBPI_Player_Controller;        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_320F[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue_2;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue_3;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue_4;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue_5;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue_6;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_ChoosenChar                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3210[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance;            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3211[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayersInSession_PlayersInSession;     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AddLocalMP_Players) == 0x000008, "Wrong alignment on GS_Game_C_AddLocalMP_Players");
static_assert(sizeof(GS_Game_C_AddLocalMP_Players) == 0x000090, "Wrong size on GS_Game_C_AddLocalMP_Players");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GS_Game_C_AddLocalMP_Players::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GS_Game_C_AddLocalMP_Players::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, K2Node_DynamicCast_AsBPI_Player_Controller) == 0x000010, "Member 'GS_Game_C_AddLocalMP_Players::K2Node_DynamicCast_AsBPI_Player_Controller' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GS_Game_C_AddLocalMP_Players::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_CreatePlayer_ReturnValue) == 0x000028, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_CreatePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_CreatePlayer_ReturnValue_1) == 0x000030, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_CreatePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_CreatePlayer_ReturnValue_2) == 0x000038, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_CreatePlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_CreatePlayer_ReturnValue_3) == 0x000040, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_CreatePlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_CreatePlayer_ReturnValue_4) == 0x000048, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_CreatePlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_CreatePlayer_ReturnValue_5) == 0x000050, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_CreatePlayer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_CreatePlayer_ReturnValue_6) == 0x000058, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_CreatePlayer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_Array_Get_Item) == 0x000068, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, K2Node_DynamicCast_AsBPI_Game_Instance) == 0x000070, "Member 'GS_Game_C_AddLocalMP_Players::K2Node_DynamicCast_AsBPI_Game_Instance' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'GS_Game_C_AddLocalMP_Players::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_GetPlayersInSession_PlayersInSession) == 0x000084, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_GetPlayersInSession_PlayersInSession' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, K2Node_SwitchInteger_CmpSuccess) == 0x00008D, "Member 'GS_Game_C_AddLocalMP_Players::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AddLocalMP_Players, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x00008E, "Member 'GS_Game_C_AddLocalMP_Players::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");

// Function GS_Game.GS_Game_C.AddRescuePoint
// 0x0008 (0x0008 - 0x0000)
struct GS_Game_C_AddRescuePoint final
{
public:
	class ABP_RescuePoint_C*                      RescuePoint;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AddRescuePoint) == 0x000008, "Wrong alignment on GS_Game_C_AddRescuePoint");
static_assert(sizeof(GS_Game_C_AddRescuePoint) == 0x000008, "Wrong size on GS_Game_C_AddRescuePoint");
static_assert(offsetof(GS_Game_C_AddRescuePoint, RescuePoint) == 0x000000, "Member 'GS_Game_C_AddRescuePoint::RescuePoint' has a wrong offset!");

// Function GS_Game.GS_Game_C.AssignGamepad
// 0x0030 (0x0030 - 0x0000)
struct GS_Game_C_AssignGamepad final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GamepadIndex;                                      // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWM_InputManager*                       CallFunc_Get_WM_InputManager_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWM_HID_Joystick*                       CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3212[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AssignGamepad) == 0x000008, "Wrong alignment on GS_Game_C_AssignGamepad");
static_assert(sizeof(GS_Game_C_AssignGamepad) == 0x000030, "Wrong size on GS_Game_C_AssignGamepad");
static_assert(offsetof(GS_Game_C_AssignGamepad, PlayerIndex) == 0x000000, "Member 'GS_Game_C_AssignGamepad::PlayerIndex' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AssignGamepad, GamepadIndex) == 0x000004, "Member 'GS_Game_C_AssignGamepad::GamepadIndex' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AssignGamepad, CallFunc_Get_WM_InputManager_ReturnValue) == 0x000008, "Member 'GS_Game_C_AssignGamepad::CallFunc_Get_WM_InputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AssignGamepad, CallFunc_Map_Find_Value) == 0x000010, "Member 'GS_Game_C_AssignGamepad::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AssignGamepad, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'GS_Game_C_AssignGamepad::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AssignGamepad, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'GS_Game_C_AssignGamepad::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

// Function GS_Game.GS_Game_C.AttachToFirstCharacter
// 0x0030 (0x0030 - 0x0000)
struct GS_Game_C_AttachToFirstCharacter final
{
public:
	class APawn*                                  Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3213[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AttachToFirstCharacter) == 0x000008, "Wrong alignment on GS_Game_C_AttachToFirstCharacter");
static_assert(sizeof(GS_Game_C_AttachToFirstCharacter) == 0x000030, "Wrong size on GS_Game_C_AttachToFirstCharacter");
static_assert(offsetof(GS_Game_C_AttachToFirstCharacter, Character) == 0x000000, "Member 'GS_Game_C_AttachToFirstCharacter::Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToFirstCharacter, K2Node_DynamicCast_AsBPI_Character) == 0x000008, "Member 'GS_Game_C_AttachToFirstCharacter::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToFirstCharacter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GS_Game_C_AttachToFirstCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToFirstCharacter, CallFunc_Array_Get_Item) == 0x000020, "Member 'GS_Game_C_AttachToFirstCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToFirstCharacter, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GS_Game_C_AttachToFirstCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GS_Game.GS_Game_C.AttachToLastCharacter
// 0x0030 (0x0030 - 0x0000)
struct GS_Game_C_AttachToLastCharacter final
{
public:
	class APawn*                                  Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3214[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AttachToLastCharacter) == 0x000008, "Wrong alignment on GS_Game_C_AttachToLastCharacter");
static_assert(sizeof(GS_Game_C_AttachToLastCharacter) == 0x000030, "Wrong size on GS_Game_C_AttachToLastCharacter");
static_assert(offsetof(GS_Game_C_AttachToLastCharacter, Character) == 0x000000, "Member 'GS_Game_C_AttachToLastCharacter::Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToLastCharacter, K2Node_DynamicCast_AsBPI_Character) == 0x000008, "Member 'GS_Game_C_AttachToLastCharacter::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToLastCharacter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GS_Game_C_AttachToLastCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToLastCharacter, CallFunc_Array_LastIndex_ReturnValue) == 0x00001C, "Member 'GS_Game_C_AttachToLastCharacter::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToLastCharacter, CallFunc_Array_Get_Item) == 0x000020, "Member 'GS_Game_C_AttachToLastCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToLastCharacter, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GS_Game_C_AttachToLastCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GS_Game.GS_Game_C.AttachToNextCharacter
// 0x0038 (0x0038 - 0x0000)
struct GS_Game_C_AttachToNextCharacter final
{
public:
	class APawn*                                  Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3215[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AttachToNextCharacter) == 0x000008, "Wrong alignment on GS_Game_C_AttachToNextCharacter");
static_assert(sizeof(GS_Game_C_AttachToNextCharacter) == 0x000038, "Wrong size on GS_Game_C_AttachToNextCharacter");
static_assert(offsetof(GS_Game_C_AttachToNextCharacter, Character) == 0x000000, "Member 'GS_Game_C_AttachToNextCharacter::Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToNextCharacter, Param_Index) == 0x000008, "Member 'GS_Game_C_AttachToNextCharacter::Param_Index' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToNextCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GS_Game_C_AttachToNextCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToNextCharacter, K2Node_DynamicCast_AsBPI_Character) == 0x000010, "Member 'GS_Game_C_AttachToNextCharacter::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToNextCharacter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GS_Game_C_AttachToNextCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToNextCharacter, CallFunc_Array_Get_Item) == 0x000028, "Member 'GS_Game_C_AttachToNextCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToNextCharacter, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GS_Game_C_AttachToNextCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GS_Game.GS_Game_C.AttachToPreviousCharacter
// 0x0050 (0x0050 - 0x0000)
struct GS_Game_C_AttachToPreviousCharacter final
{
public:
	class APawn*                                  Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3216[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3217[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AttachToPreviousCharacter) == 0x000008, "Wrong alignment on GS_Game_C_AttachToPreviousCharacter");
static_assert(sizeof(GS_Game_C_AttachToPreviousCharacter) == 0x000050, "Wrong size on GS_Game_C_AttachToPreviousCharacter");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, Character) == 0x000000, "Member 'GS_Game_C_AttachToPreviousCharacter::Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, Param_Index) == 0x000008, "Member 'GS_Game_C_AttachToPreviousCharacter::Param_Index' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'GS_Game_C_AttachToPreviousCharacter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, K2Node_DynamicCast_AsBPI_Character) == 0x000010, "Member 'GS_Game_C_AttachToPreviousCharacter::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GS_Game_C_AttachToPreviousCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, CallFunc_Array_Get_Item) == 0x000028, "Member 'GS_Game_C_AttachToPreviousCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GS_Game_C_AttachToPreviousCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, K2Node_DynamicCast_AsBPI_Character_1) == 0x000038, "Member 'GS_Game_C_AttachToPreviousCharacter::K2Node_DynamicCast_AsBPI_Character_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AttachToPreviousCharacter, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'GS_Game_C_AttachToPreviousCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GS_Game.GS_Game_C.AutoAttachment
// 0x00E0 (0x00E0 - 0x0000)
struct GS_Game_C_AutoAttachment final
{
public:
	bool                                          OpenedChainLocal;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3218[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              PCs;                                               // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         LocalIndex;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3219[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  LocalCharacter;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321A[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321B[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321C[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321D[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321E[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321F[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3220[0x2];                                     // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3221[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_AutoAttachment) == 0x000008, "Wrong alignment on GS_Game_C_AutoAttachment");
static_assert(sizeof(GS_Game_C_AutoAttachment) == 0x0000E0, "Wrong size on GS_Game_C_AutoAttachment");
static_assert(offsetof(GS_Game_C_AutoAttachment, OpenedChainLocal) == 0x000000, "Member 'GS_Game_C_AutoAttachment::OpenedChainLocal' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, PCs) == 0x000008, "Member 'GS_Game_C_AutoAttachment::PCs' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, LocalIndex) == 0x000018, "Member 'GS_Game_C_AutoAttachment::LocalIndex' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, LocalCharacter) == 0x000020, "Member 'GS_Game_C_AutoAttachment::LocalCharacter' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, Temp_int_Array_Index_Variable) == 0x000028, "Member 'GS_Game_C_AutoAttachment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'GS_Game_C_AutoAttachment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'GS_Game_C_AutoAttachment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'GS_Game_C_AutoAttachment::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'GS_Game_C_AutoAttachment::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'GS_Game_C_AutoAttachment::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, Temp_int_Loop_Counter_Variable_2) == 0x000044, "Member 'GS_Game_C_AutoAttachment::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'GS_Game_C_AutoAttachment::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'GS_Game_C_AutoAttachment::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, Temp_int_Array_Index_Variable_2) == 0x000050, "Member 'GS_Game_C_AutoAttachment::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_HasAuthority_ReturnValue) == 0x000054, "Member 'GS_Game_C_AutoAttachment::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'GS_Game_C_AutoAttachment::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, K2Node_DynamicCast_AsCustom_GI) == 0x000060, "Member 'GS_Game_C_AutoAttachment::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'GS_Game_C_AutoAttachment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_Get_Item) == 0x000070, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_K2_GetPawn_ReturnValue) == 0x000078, "Member 'GS_Game_C_AutoAttachment::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_GetAllActorsOfClass_OutActors) == 0x000088, "Member 'GS_Game_C_AutoAttachment::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'GS_Game_C_AutoAttachment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, K2Node_DynamicCast_AsBPI_Character) == 0x0000B0, "Member 'GS_Game_C_AutoAttachment::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'GS_Game_C_AutoAttachment::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_Length_ReturnValue_2) == 0x0000C4, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_Length_ReturnValue_3) == 0x0000C8, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000CC, "Member 'GS_Game_C_AutoAttachment::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000CD, "Member 'GS_Game_C_AutoAttachment::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_Add_ReturnValue) == 0x0000D0, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D4, "Member 'GS_Game_C_AutoAttachment::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_Array_LastIndex_ReturnValue) == 0x0000D8, "Member 'GS_Game_C_AutoAttachment::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_AutoAttachment, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000DC, "Member 'GS_Game_C_AutoAttachment::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function GS_Game.GS_Game_C.BackupProgress
// 0x0020 (0x0020 - 0x0000)
struct GS_Game_C_BackupProgress final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3222[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_BackupProgress) == 0x000008, "Wrong alignment on GS_Game_C_BackupProgress");
static_assert(sizeof(GS_Game_C_BackupProgress) == 0x000020, "Wrong size on GS_Game_C_BackupProgress");
static_assert(offsetof(GS_Game_C_BackupProgress, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'GS_Game_C_BackupProgress::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_BackupProgress, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'GS_Game_C_BackupProgress::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_BackupProgress, K2Node_DynamicCast_AsCustom_GI) == 0x000010, "Member 'GS_Game_C_BackupProgress::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(GS_Game_C_BackupProgress, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GS_Game_C_BackupProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_BackupProgress, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'GS_Game_C_BackupProgress::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function GS_Game.GS_Game_C.CheckIfEveryoneHasLoadedLevels
// 0x0038 (0x0038 - 0x0000)
struct GS_Game_C_CheckIfEveryoneHasLoadedLevels final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3223[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3224[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3225[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_Game_C*                             K2Node_DynamicCast_AsPS_Game;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_CheckIfEveryoneHasLoadedLevels) == 0x000008, "Wrong alignment on GS_Game_C_CheckIfEveryoneHasLoadedLevels");
static_assert(sizeof(GS_Game_C_CheckIfEveryoneHasLoadedLevels) == 0x000038, "Wrong size on GS_Game_C_CheckIfEveryoneHasLoadedLevels");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, ReturnValue) == 0x000000, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, CallFunc_Array_Get_Item) == 0x000018, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, K2Node_DynamicCast_AsPS_Game) == 0x000028, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::K2Node_DynamicCast_AsPS_Game' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CheckIfEveryoneHasLoadedLevels, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GS_Game_C_CheckIfEveryoneHasLoadedLevels::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GS_Game.GS_Game_C.CountCustomPS
// 0x0050 (0x0050 - 0x0000)
struct GS_Game_C_CountCustomPS final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ps;                                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3226[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3227[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_Game_C*                             K2Node_DynamicCast_AsPS_Game;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_CountCustomPS) == 0x000008, "Wrong alignment on GS_Game_C_CountCustomPS");
static_assert(sizeof(GS_Game_C_CountCustomPS) == 0x000050, "Wrong size on GS_Game_C_CountCustomPS");
static_assert(offsetof(GS_Game_C_CountCustomPS, Count) == 0x000000, "Member 'GS_Game_C_CountCustomPS::Count' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, Ps) == 0x000004, "Member 'GS_Game_C_CountCustomPS::Ps' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GS_Game_C_CountCustomPS::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GS_Game_C_CountCustomPS::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, Temp_int_Array_Index_Variable) == 0x000010, "Member 'GS_Game_C_CountCustomPS::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, Temp_int_Variable) == 0x000014, "Member 'GS_Game_C_CountCustomPS::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'GS_Game_C_CountCustomPS::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'GS_Game_C_CountCustomPS::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, CallFunc_Array_Get_Item) == 0x000030, "Member 'GS_Game_C_CountCustomPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'GS_Game_C_CountCustomPS::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, K2Node_DynamicCast_AsPS_Game) == 0x000040, "Member 'GS_Game_C_CountCustomPS::K2Node_DynamicCast_AsPS_Game' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GS_Game_C_CountCustomPS::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GS_Game_C_CountCustomPS, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'GS_Game_C_CountCustomPS::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GS_Game.GS_Game_C.CountSpawnedCharacters
// 0x0020 (0x0020 - 0x0000)
struct GS_Game_C_CountSpawnedCharacters final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3228[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GS_Game_C_CountSpawnedCharacters) == 0x000008, "Wrong alignment on GS_Game_C_CountSpawnedCharacters");
static_assert(sizeof(GS_Game_C_CountSpawnedCharacters) == 0x000020, "Wrong size on GS_Game_C_CountSpawnedCharacters");
static_assert(offsetof(GS_Game_C_CountSpawnedCharacters, ReturnValue) == 0x000000, "Member 'GS_Game_C_CountSpawnedCharacters::ReturnValue' has a wrong offset!");
