#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Horse_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Horse_AnimBP.Horse_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x011F (0x0120 - 0x0001)
struct Horse_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_3614[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_43;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_44;                               // 0x000C(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_45;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_46;                                  // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_47;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_48;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3615[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_49;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_50;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_51;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_52;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3616[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_53;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_54;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_55;                                  // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_56;                               // 0x0068(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0088(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0108(0x0018)()
};
static_assert(alignof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Horse_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000120, "Wrong size on Horse_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_43) == 0x000004, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_43' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_44) == 0x00000C, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_44' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_45) == 0x000038, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_45' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_46) == 0x000040, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_46' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_47) == 0x000044, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_47' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_48) == 0x000048, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_48' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_49) == 0x00004C, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_49' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_50) == 0x000050, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_50' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_51) == 0x000051, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_51' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_52) == 0x000052, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_52' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_53) == 0x000054, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_53' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_54) == 0x00005C, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_54' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_55) == 0x000064, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_55' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_56) == 0x000068, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_56' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000088, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000108, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Horse_AnimBP.Horse_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct Horse_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_3617[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Horse_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Horse_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Horse_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on Horse_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Horse_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Horse_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

