#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Horse_AnimBP

#include "Basic.hpp"

#include "Horse_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Horse_AnimBP.Horse_AnimBP_C
// 0x0280 (0x05D0 - 0x0350)
class UHorse_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3618[0x8];                                     // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Horse_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0358(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_3619[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0430(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0450(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04E0(0x00C8)()
	double                                        Horizontal;                                        // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Vertical;                                          // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 VehicleRef;                                        // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Grounded;                                          // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_GallopSound();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Horse_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Horse_AnimBP_C">();
	}
	static class UHorse_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHorse_AnimBP_C>();
	}
};
static_assert(alignof(UHorse_AnimBP_C) == 0x000010, "Wrong alignment on UHorse_AnimBP_C");
static_assert(sizeof(UHorse_AnimBP_C) == 0x0005D0, "Wrong size on UHorse_AnimBP_C");
static_assert(offsetof(UHorse_AnimBP_C, UberGraphFrame) == 0x000350, "Member 'UHorse_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, __AnimBlueprintMutables) == 0x000358, "Member 'UHorse_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UHorse_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UHorse_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimGraphNode_Root) == 0x000378, "Member 'UHorse_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000398, "Member 'UHorse_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0003C0, "Member 'UHorse_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0003E8, "Member 'UHorse_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000430, "Member 'UHorse_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x000450, "Member 'UHorse_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimGraphNode_StateResult) == 0x0004C0, "Member 'UHorse_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, AnimGraphNode_StateMachine) == 0x0004E0, "Member 'UHorse_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, Horizontal) == 0x0005A8, "Member 'UHorse_AnimBP_C::Horizontal' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, Vertical) == 0x0005B0, "Member 'UHorse_AnimBP_C::Vertical' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, VehicleRef) == 0x0005B8, "Member 'UHorse_AnimBP_C::VehicleRef' has a wrong offset!");
static_assert(offsetof(UHorse_AnimBP_C, Grounded) == 0x0005C0, "Member 'UHorse_AnimBP_C::Grounded' has a wrong offset!");

}

