#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hosta_10_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass hosta_10_BP.hosta_10_BP_C
// 0x00A8 (0x0340 - 0x0298)
class AHosta_10_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Flower_bed_long_StaticMeshComponent0;              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_short_StaticMeshComponent0;             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pennisetum6_StaticMeshComponent0;                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Elderberry_large6_StaticMeshComponent0;            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_5_StaticMeshComponent0;                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle5_StaticMeshComponent0;     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_9_StaticMeshComponent0;                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_8_StaticMeshComponent0;                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Elderberry_small5_StaticMeshComponent0;            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Elderberry_large2_StaticMeshComponent0;            // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pennisetum_large2_StaticMeshComponent0;            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle4_StaticMeshComponent0;     // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_6_StaticMeshComponent0;                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_7_StaticMeshComponent0;                      // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pennisetum2_StaticMeshComponent0;                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pennisetum_large6_StaticMeshComponent0;            // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle3_StaticMeshComponent0;     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Elderberry_large7_StaticMeshComponent0;            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle6_StaticMeshComponent0;     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_10_StaticMeshComponent0;                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"hosta_10_BP_C">();
	}
	static class AHosta_10_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHosta_10_BP_C>();
	}
};
static_assert(alignof(AHosta_10_BP_C) == 0x000008, "Wrong alignment on AHosta_10_BP_C");
static_assert(sizeof(AHosta_10_BP_C) == 0x000340, "Wrong size on AHosta_10_BP_C");
static_assert(offsetof(AHosta_10_BP_C, Flower_bed_long_StaticMeshComponent0) == 0x000298, "Member 'AHosta_10_BP_C::Flower_bed_long_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Flower_bed_short_StaticMeshComponent0) == 0x0002A0, "Member 'AHosta_10_BP_C::Flower_bed_short_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Pennisetum6_StaticMeshComponent0) == 0x0002A8, "Member 'AHosta_10_BP_C::Pennisetum6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Elderberry_large6_StaticMeshComponent0) == 0x0002B0, "Member 'AHosta_10_BP_C::Elderberry_large6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Hosta_5_StaticMeshComponent0) == 0x0002B8, "Member 'AHosta_10_BP_C::Hosta_5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Flower_bed_small_circle5_StaticMeshComponent0) == 0x0002C0, "Member 'AHosta_10_BP_C::Flower_bed_small_circle5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Hosta_9_StaticMeshComponent0) == 0x0002C8, "Member 'AHosta_10_BP_C::Hosta_9_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Hosta_8_StaticMeshComponent0) == 0x0002D0, "Member 'AHosta_10_BP_C::Hosta_8_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Elderberry_small5_StaticMeshComponent0) == 0x0002D8, "Member 'AHosta_10_BP_C::Elderberry_small5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Elderberry_large2_StaticMeshComponent0) == 0x0002E0, "Member 'AHosta_10_BP_C::Elderberry_large2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Pennisetum_large2_StaticMeshComponent0) == 0x0002E8, "Member 'AHosta_10_BP_C::Pennisetum_large2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Flower_bed_small_circle4_StaticMeshComponent0) == 0x0002F0, "Member 'AHosta_10_BP_C::Flower_bed_small_circle4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Hosta_6_StaticMeshComponent0) == 0x0002F8, "Member 'AHosta_10_BP_C::Hosta_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Hosta_7_StaticMeshComponent0) == 0x000300, "Member 'AHosta_10_BP_C::Hosta_7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Pennisetum2_StaticMeshComponent0) == 0x000308, "Member 'AHosta_10_BP_C::Pennisetum2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Pennisetum_large6_StaticMeshComponent0) == 0x000310, "Member 'AHosta_10_BP_C::Pennisetum_large6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Flower_bed_small_circle3_StaticMeshComponent0) == 0x000318, "Member 'AHosta_10_BP_C::Flower_bed_small_circle3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Elderberry_large7_StaticMeshComponent0) == 0x000320, "Member 'AHosta_10_BP_C::Elderberry_large7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Flower_bed_small_circle6_StaticMeshComponent0) == 0x000328, "Member 'AHosta_10_BP_C::Flower_bed_small_circle6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, Hosta_10_StaticMeshComponent0) == 0x000330, "Member 'AHosta_10_BP_C::Hosta_10_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHosta_10_BP_C, SharedRoot) == 0x000338, "Member 'AHosta_10_BP_C::SharedRoot' has a wrong offset!");

}

