#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hydrangea_large_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass hydrangea_large_BP.hydrangea_large_BP_C
// 0x0068 (0x0300 - 0x0298)
class AHydrangea_large_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Allium1;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geranium_large;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Allium;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Elderberry_small;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dianthus_large;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hydrangea1;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hydrangea_large1;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hydrangea_large;                                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_long;                                   // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle4_StaticMeshComponent0;     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle5_StaticMeshComponent0;     // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle6_StaticMeshComponent0;     // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"hydrangea_large_BP_C">();
	}
	static class AHydrangea_large_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHydrangea_large_BP_C>();
	}
};
static_assert(alignof(AHydrangea_large_BP_C) == 0x000008, "Wrong alignment on AHydrangea_large_BP_C");
static_assert(sizeof(AHydrangea_large_BP_C) == 0x000300, "Wrong size on AHydrangea_large_BP_C");
static_assert(offsetof(AHydrangea_large_BP_C, Allium1) == 0x000298, "Member 'AHydrangea_large_BP_C::Allium1' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Geranium_large) == 0x0002A0, "Member 'AHydrangea_large_BP_C::Geranium_large' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Allium) == 0x0002A8, "Member 'AHydrangea_large_BP_C::Allium' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Elderberry_small) == 0x0002B0, "Member 'AHydrangea_large_BP_C::Elderberry_small' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Dianthus_large) == 0x0002B8, "Member 'AHydrangea_large_BP_C::Dianthus_large' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Hydrangea1) == 0x0002C0, "Member 'AHydrangea_large_BP_C::Hydrangea1' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Hydrangea_large1) == 0x0002C8, "Member 'AHydrangea_large_BP_C::Hydrangea_large1' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Hydrangea_large) == 0x0002D0, "Member 'AHydrangea_large_BP_C::Hydrangea_large' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Flower_bed_long) == 0x0002D8, "Member 'AHydrangea_large_BP_C::Flower_bed_long' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Flower_bed_small_circle4_StaticMeshComponent0) == 0x0002E0, "Member 'AHydrangea_large_BP_C::Flower_bed_small_circle4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Flower_bed_small_circle5_StaticMeshComponent0) == 0x0002E8, "Member 'AHydrangea_large_BP_C::Flower_bed_small_circle5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, Flower_bed_small_circle6_StaticMeshComponent0) == 0x0002F0, "Member 'AHydrangea_large_BP_C::Flower_bed_small_circle6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_BP_C, SharedRoot) == 0x0002F8, "Member 'AHydrangea_large_BP_C::SharedRoot' has a wrong offset!");

}

