#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hydrangea_large_corner_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass hydrangea_large_corner_BP.hydrangea_large_corner_BP_C
// 0x0038 (0x02D0 - 0x0298)
class AHydrangea_large_corner_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Flower_bed_small_circle4_StaticMeshComponent0;     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle5_StaticMeshComponent0;     // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_small_circle6_StaticMeshComponent0;     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hydrangea_wall_StaticMeshComponent0;               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hydrangea_wall10_StaticMeshComponent0;             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hydrangea_large_corner_StaticMeshComponent0;       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"hydrangea_large_corner_BP_C">();
	}
	static class AHydrangea_large_corner_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHydrangea_large_corner_BP_C>();
	}
};
static_assert(alignof(AHydrangea_large_corner_BP_C) == 0x000008, "Wrong alignment on AHydrangea_large_corner_BP_C");
static_assert(sizeof(AHydrangea_large_corner_BP_C) == 0x0002D0, "Wrong size on AHydrangea_large_corner_BP_C");
static_assert(offsetof(AHydrangea_large_corner_BP_C, Flower_bed_small_circle4_StaticMeshComponent0) == 0x000298, "Member 'AHydrangea_large_corner_BP_C::Flower_bed_small_circle4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_corner_BP_C, Flower_bed_small_circle5_StaticMeshComponent0) == 0x0002A0, "Member 'AHydrangea_large_corner_BP_C::Flower_bed_small_circle5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_corner_BP_C, Flower_bed_small_circle6_StaticMeshComponent0) == 0x0002A8, "Member 'AHydrangea_large_corner_BP_C::Flower_bed_small_circle6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_corner_BP_C, Hydrangea_wall_StaticMeshComponent0) == 0x0002B0, "Member 'AHydrangea_large_corner_BP_C::Hydrangea_wall_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_corner_BP_C, Hydrangea_wall10_StaticMeshComponent0) == 0x0002B8, "Member 'AHydrangea_large_corner_BP_C::Hydrangea_wall10_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_corner_BP_C, Hydrangea_large_corner_StaticMeshComponent0) == 0x0002C0, "Member 'AHydrangea_large_corner_BP_C::Hydrangea_large_corner_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AHydrangea_large_corner_BP_C, SharedRoot) == 0x0002C8, "Member 'AHydrangea_large_corner_BP_C::SharedRoot' has a wrong offset!");

}

