#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_A_TranslationGizmo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "IGLE_E_GizmoSpace_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IGLE_A_TranslationGizmo.IGLE_A_TranslationGizmo_C
// 0x00C8 (0x0360 - 0x0298)
class AIGLE_A_TranslationGizmo_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Translation;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TranslationY;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TranslationZ;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TranslationX;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MatTranslationX;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TranslationXColor;                                 // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MatTranslationY;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MatTranslationZ;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TranslationYColor;                                 // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TranslationZColor;                                 // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MatTranslationSphere;                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TranslationSphereColor;                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreUseDeltaDesiredTranslation;                     // 0x0328(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIGLE_A_Gizmo_C*                        Gizmo;                                             // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                PreUseDeltaTranslation;                            // 0x0348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IGLE_A_TranslationGizmo(int32 EntryPoint);
	void GenerateGizmo(class AIGLE_A_Gizmo_C* GizmoOuter);
	void GenerateTranslationGizmo();
	void OptimalCrossProductForCamera(const struct FVector& BaseAxisForward, const struct FVector& TestAForward, const struct FVector& TestBForward, const struct FVector& CameraForward, struct FVector* OptimalCrossBetweenBaseAndTest);
	void OptimalPlaneNormalForCameraAndHitAxis(class UPrimitiveComponent* HitComponent, const struct FVector& CameraDir, struct FVector* PlaneNormal);
	void OrientTranslationArrows(const struct FRotator& WorldRotation);
	void TickGizmo();
	void UpdateGizmoSpace(EIGLE_E_GizmoSpace New_Gizmo_Space);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_A_TranslationGizmo_C">();
	}
	static class AIGLE_A_TranslationGizmo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIGLE_A_TranslationGizmo_C>();
	}
};
static_assert(alignof(AIGLE_A_TranslationGizmo_C) == 0x000008, "Wrong alignment on AIGLE_A_TranslationGizmo_C");
static_assert(sizeof(AIGLE_A_TranslationGizmo_C) == 0x000360, "Wrong size on AIGLE_A_TranslationGizmo_C");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, UberGraphFrame) == 0x000298, "Member 'AIGLE_A_TranslationGizmo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, Translation) == 0x0002A0, "Member 'AIGLE_A_TranslationGizmo_C::Translation' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, Root) == 0x0002A8, "Member 'AIGLE_A_TranslationGizmo_C::Root' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, TranslationY) == 0x0002B0, "Member 'AIGLE_A_TranslationGizmo_C::TranslationY' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, TranslationZ) == 0x0002B8, "Member 'AIGLE_A_TranslationGizmo_C::TranslationZ' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, TranslationX) == 0x0002C0, "Member 'AIGLE_A_TranslationGizmo_C::TranslationX' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, MatTranslationX) == 0x0002C8, "Member 'AIGLE_A_TranslationGizmo_C::MatTranslationX' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, TranslationXColor) == 0x0002D0, "Member 'AIGLE_A_TranslationGizmo_C::TranslationXColor' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, MatTranslationY) == 0x0002E0, "Member 'AIGLE_A_TranslationGizmo_C::MatTranslationY' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, MatTranslationZ) == 0x0002E8, "Member 'AIGLE_A_TranslationGizmo_C::MatTranslationZ' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, TranslationYColor) == 0x0002F0, "Member 'AIGLE_A_TranslationGizmo_C::TranslationYColor' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, TranslationZColor) == 0x000300, "Member 'AIGLE_A_TranslationGizmo_C::TranslationZColor' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, MatTranslationSphere) == 0x000310, "Member 'AIGLE_A_TranslationGizmo_C::MatTranslationSphere' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, TranslationSphereColor) == 0x000318, "Member 'AIGLE_A_TranslationGizmo_C::TranslationSphereColor' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, PreUseDeltaDesiredTranslation) == 0x000328, "Member 'AIGLE_A_TranslationGizmo_C::PreUseDeltaDesiredTranslation' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, Gizmo) == 0x000340, "Member 'AIGLE_A_TranslationGizmo_C::Gizmo' has a wrong offset!");
static_assert(offsetof(AIGLE_A_TranslationGizmo_C, PreUseDeltaTranslation) == 0x000348, "Member 'AIGLE_A_TranslationGizmo_C::PreUseDeltaTranslation' has a wrong offset!");

}

