#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_BoolFalseWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function IGLE_BoolFalseWidget.IGLE_BoolFalseWidget_C.Check_Uncheck
// 0x0005 (0x0005 - 0x0000)
struct IGLE_BoolFalseWidget_C_Check_Uncheck final
{
public:
	bool                                          Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_BoolFalseWidget_C_Check_Uncheck) == 0x000001, "Wrong alignment on IGLE_BoolFalseWidget_C_Check_Uncheck");
static_assert(sizeof(IGLE_BoolFalseWidget_C_Check_Uncheck) == 0x000005, "Wrong size on IGLE_BoolFalseWidget_C_Check_Uncheck");
static_assert(offsetof(IGLE_BoolFalseWidget_C_Check_Uncheck, Index_0) == 0x000000, "Member 'IGLE_BoolFalseWidget_C_Check_Uncheck::Index_0' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_Check_Uncheck, Temp_bool_Variable) == 0x000001, "Member 'IGLE_BoolFalseWidget_C_Check_Uncheck::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_Check_Uncheck, Temp_byte_Variable) == 0x000002, "Member 'IGLE_BoolFalseWidget_C_Check_Uncheck::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_Check_Uncheck, Temp_byte_Variable_1) == 0x000003, "Member 'IGLE_BoolFalseWidget_C_Check_Uncheck::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_Check_Uncheck, K2Node_Select_Default) == 0x000004, "Member 'IGLE_BoolFalseWidget_C_Check_Uncheck::K2Node_Select_Default' has a wrong offset!");

// Function IGLE_BoolFalseWidget.IGLE_BoolFalseWidget_C.ExecuteUbergraph_IGLE_BoolFalseWidget
// 0x0048 (0x0048 - 0x0000)
struct IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_BoolFalseProperty_C*              K2Node_DynamicCast_AsIGLE_Bool_False_Property;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_BoolFalseProperty_C*              K2Node_DynamicCast_AsIGLE_Bool_False_Property_1;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_TryCallOnPropertyValueChanged_Success; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget) == 0x000008, "Wrong alignment on IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget");
static_assert(sizeof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget) == 0x000048, "Wrong size on IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, EntryPoint) == 0x000000, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, Temp_bool_Variable) == 0x000004, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, Temp_byte_Variable) == 0x000005, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, Temp_byte_Variable_1) == 0x000006, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000007, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, Temp_bool_Has_Been_Initd_Variable) == 0x000008, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, Temp_bool_IsClosed_Variable) == 0x000009, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, K2Node_DynamicCast_AsIGLE_Bool_False_Property) == 0x000010, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::K2Node_DynamicCast_AsIGLE_Bool_False_Property' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, K2Node_DynamicCast_AsIGLE_Bool_False_Property_1) == 0x000020, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::K2Node_DynamicCast_AsIGLE_Bool_False_Property_1' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, CallFunc_IGLE_TryCallOnPropertyValueChanged_Success) == 0x000029, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::CallFunc_IGLE_TryCallOnPropertyValueChanged_Success' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, K2Node_Select_Default) == 0x000040, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'IGLE_BoolFalseWidget_C_ExecuteUbergraph_IGLE_BoolFalseWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

