#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_Action_DeletePlacables

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "IGLE_ActionBuffer_Base_classes.hpp"
#include "InGameLevelEditor_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IGLE_Action_DeletePlacables.IGLE_Action_DeletePlacables_C
// 0x0040 (0x0078 - 0x0038)
class UIGLE_Action_DeletePlacables_C final : public UIGLE_ActionBuffer_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IGLE_Action_DeletePlacables_C;      // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         DeletedPlacables;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	class AIGLE_Pawn_EditorBase_C*                EditorPawn;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FIGLEPlacableSave>              DeletedPlacables_Save;                             // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         DeletionUndonePlacables;                           // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_IGLE_Action_DeletePlacables(int32 EntryPoint);
	void GetFriendlyActionName(class FString* OutName);
	void Initialize();
	void RedoAction();
	void UndoAction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_Action_DeletePlacables_C">();
	}
	static class UIGLE_Action_DeletePlacables_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_Action_DeletePlacables_C>();
	}
};
static_assert(alignof(UIGLE_Action_DeletePlacables_C) == 0x000008, "Wrong alignment on UIGLE_Action_DeletePlacables_C");
static_assert(sizeof(UIGLE_Action_DeletePlacables_C) == 0x000078, "Wrong size on UIGLE_Action_DeletePlacables_C");
static_assert(offsetof(UIGLE_Action_DeletePlacables_C, UberGraphFrame_IGLE_Action_DeletePlacables_C) == 0x000038, "Member 'UIGLE_Action_DeletePlacables_C::UberGraphFrame_IGLE_Action_DeletePlacables_C' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_DeletePlacables_C, DeletedPlacables) == 0x000040, "Member 'UIGLE_Action_DeletePlacables_C::DeletedPlacables' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_DeletePlacables_C, EditorPawn) == 0x000050, "Member 'UIGLE_Action_DeletePlacables_C::EditorPawn' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_DeletePlacables_C, DeletedPlacables_Save) == 0x000058, "Member 'UIGLE_Action_DeletePlacables_C::DeletedPlacables_Save' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_DeletePlacables_C, DeletionUndonePlacables) == 0x000068, "Member 'UIGLE_Action_DeletePlacables_C::DeletionUndonePlacables' has a wrong offset!");

}

