#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_PlacableDescription

#include "Basic.hpp"


namespace SDK::Params
{

// Function IGLE_W_PlacableDescription.IGLE_W_PlacableDescription_C.ExecuteUbergraph_IGLE_W_PlacableDescription
// 0x0028 (0x0028 - 0x0000)
struct IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Description;                    // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription) == 0x000008, "Wrong alignment on IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription");
static_assert(sizeof(IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription) == 0x000028, "Wrong size on IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription");
static_assert(offsetof(IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription, EntryPoint) == 0x000000, "Member 'IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription, K2Node_CustomEvent_Description) == 0x000010, "Member 'IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'IGLE_W_PlacableDescription_C_ExecuteUbergraph_IGLE_W_PlacableDescription::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function IGLE_W_PlacableDescription.IGLE_W_PlacableDescription_C.ShowDescription
// 0x0010 (0x0010 - 0x0000)
struct IGLE_W_PlacableDescription_C_ShowDescription final
{
public:
	class FString                                 Description_0;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableDescription_C_ShowDescription) == 0x000008, "Wrong alignment on IGLE_W_PlacableDescription_C_ShowDescription");
static_assert(sizeof(IGLE_W_PlacableDescription_C_ShowDescription) == 0x000010, "Wrong size on IGLE_W_PlacableDescription_C_ShowDescription");
static_assert(offsetof(IGLE_W_PlacableDescription_C_ShowDescription, Description_0) == 0x000000, "Member 'IGLE_W_PlacableDescription_C_ShowDescription::Description_0' has a wrong offset!");

}

