#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_SceneOutliner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_SceneOutliner.IGLE_W_SceneOutliner_C
// 0x0090 (0x0350 - 0x02C0)
class UIGLE_W_SceneOutliner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UListView*                              ListView_72;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_EditableTextBox_C*                SearchBox;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class AActor*, class UIGLE_W_SceneOutliner_Entry_C*> PlacableEntries;                                   // 0x02D8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class AIGLE_Pawn_EditorBase_C*                Parent;                                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ActorSelected;                                     // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UUserWidget*>                    CurrentFullItemList;                               // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ActorSelected__DelegateSignature(class AActor* Actor);
	void BndEvt__SearchBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void ExecuteUbergraph_IGLE_W_SceneOutliner(int32 EntryPoint);
	void FilterEntries(const class FString& Substring);
	void OnPlacableDeletedInEditor(class AActor* PlacableActor);
	void OnPlacablePlacedInEditor(class AActor* PlacableActor);
	void OnSelectionUpdated(class AActor* Actor, bool CreateUndoAction);
	void PrepareSearchArray(const class FText& InText, TArray<class UObject*>* Result);
	void SortOutlinerChildrenBySearchTerm(const class FString& SearchString);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_SceneOutliner_C">();
	}
	static class UIGLE_W_SceneOutliner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_SceneOutliner_C>();
	}
};
static_assert(alignof(UIGLE_W_SceneOutliner_C) == 0x000008, "Wrong alignment on UIGLE_W_SceneOutliner_C");
static_assert(sizeof(UIGLE_W_SceneOutliner_C) == 0x000350, "Wrong size on UIGLE_W_SceneOutliner_C");
static_assert(offsetof(UIGLE_W_SceneOutliner_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_SceneOutliner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_C, ListView_72) == 0x0002C8, "Member 'UIGLE_W_SceneOutliner_C::ListView_72' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_C, SearchBox) == 0x0002D0, "Member 'UIGLE_W_SceneOutliner_C::SearchBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_C, PlacableEntries) == 0x0002D8, "Member 'UIGLE_W_SceneOutliner_C::PlacableEntries' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_C, Parent) == 0x000328, "Member 'UIGLE_W_SceneOutliner_C::Parent' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_C, ActorSelected) == 0x000330, "Member 'UIGLE_W_SceneOutliner_C::ActorSelected' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_C, CurrentFullItemList) == 0x000340, "Member 'UIGLE_W_SceneOutliner_C::CurrentFullItemList' has a wrong offset!");

}

