#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_EditorHUD

#include "Basic.hpp"

#include "InGameLevelEditor_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IGLE_W_EditorHUD.IGLE_W_EditorHUD_C.BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct IGLE_W_EditorHUD_C_BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(IGLE_W_EditorHUD_C_BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature) == 0x000008, "Wrong alignment on IGLE_W_EditorHUD_C_BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature");
static_assert(sizeof(IGLE_W_EditorHUD_C_BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature) == 0x000018, "Wrong size on IGLE_W_EditorHUD_C_BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature");
static_assert(offsetof(IGLE_W_EditorHUD_C_BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature, Text) == 0x000000, "Member 'IGLE_W_EditorHUD_C_BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature::Text' has a wrong offset!");

// Function IGLE_W_EditorHUD.IGLE_W_EditorHUD_C.ExecuteUbergraph_IGLE_W_EditorHUD
// 0x0408 (0x0408 - 0x0000)
struct IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0020(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FVector2D& DeltaVector)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds; // 0x0078(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_DeltaVector_2;                  // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_1; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_1;          // 0x0100(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue_1;               // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds_1; // 0x0148(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector2D& DeltaVector)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_4;                        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_4;                        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_DeltaVector_1;                  // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_5;                        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_5;                        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_DeltaVector;                    // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_2; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_6;                        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_6;                        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_2;          // 0x0240(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue_2;               // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds_2; // 0x0288(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X_7;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_7;                        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_2;  // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_8;                        // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_8;                        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector2D& DeltaVector)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0300(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_3; // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_Set_ToArray_Result;                       // 0x0368(0x0010)(ReferenceParm)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_CategoryName;                   // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x03B0(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_PrepareSearchArray_Result;                // 0x03D0(0x0010)(ReferenceParm)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_2;        // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1; // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD) == 0x000008, "Wrong alignment on IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD");
static_assert(sizeof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD) == 0x000408, "Wrong size on IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, EntryPoint) == 0x000000, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, Temp_object_Variable) == 0x000008, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, Temp_bool_Variable) == 0x000010, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn) == 0x000018, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetCachedGeometry_ReturnValue) == 0x000020, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetLocalSize_ReturnValue) == 0x000068, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds) == 0x000078, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X) == 0x0000A0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y) == 0x0000A8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_CustomEvent_DeltaVector_2) == 0x0000B0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_CustomEvent_DeltaVector_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000C0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X_1) == 0x0000D0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y_1) == 0x0000D8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X_2) == 0x0000E0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y_2) == 0x0000E8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_1) == 0x0000F0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetCachedGeometry_ReturnValue_1) == 0x000100, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetCachedGeometry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetLocalSize_ReturnValue_1) == 0x000138, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetLocalSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds_1) == 0x000148, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X_3) == 0x000170, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y_3) == 0x000178, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000180, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x000190, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X_4) == 0x0001A0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y_4) == 0x0001A8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001B0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_CustomEvent_DeltaVector_1) == 0x0001B8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_CustomEvent_DeltaVector_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X_5) == 0x0001D0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y_5) == 0x0001D8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001E0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001E8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001F0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001F8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_FClamp_ReturnValue) == 0x000200, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000208, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_FClamp_ReturnValue_1) == 0x000210, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_CustomEvent_DeltaVector) == 0x000218, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_CustomEvent_DeltaVector' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_2) == 0x000228, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X_6) == 0x000230, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y_6) == 0x000238, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetCachedGeometry_ReturnValue_2) == 0x000240, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetCachedGeometry_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetLocalSize_ReturnValue_2) == 0x000278, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetLocalSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds_2) == 0x000288, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_GetWidgetGeometryViewportBounds_ViewportBounds_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X_7) == 0x0002B0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X_7' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y_7) == 0x0002B8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y_7' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Subtract_Vector2DVector2D_ReturnValue_2) == 0x0002C0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Subtract_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_X_8) == 0x0002D0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_X_8' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_BreakVector2D_Y_8) == 0x0002D8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_BreakVector2D_Y_8' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002E0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0002F0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0002F8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_Event_MyGeometry) == 0x000300, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_Event_InDeltaTime) == 0x000338, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000340, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_3) == 0x000348, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000350, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_IsValid_ReturnValue) == 0x000358, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_FClamp_ReturnValue_2) == 0x000360, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Set_ToArray_Result) == 0x000368, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Set_Length_ReturnValue) == 0x000378, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Array_Get_Item) == 0x000380, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000388, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Array_Length_ReturnValue) == 0x00038C, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Greater_IntInt_ReturnValue) == 0x000390, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_Select_Default) == 0x000398, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_CustomEvent_CategoryName) == 0x0003A0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_CustomEvent_CategoryName' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, K2Node_ComponentBoundEvent_Text) == 0x0003B0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_TextIsEmpty_ReturnValue) == 0x0003C8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_PrepareSearchArray_Result) == 0x0003D0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_PrepareSearchArray_Result' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0003E0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0003E8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0003F0, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x0003F4, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_Add_DoubleDouble_A_ImplicitCast_2) == 0x0003F8, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_Add_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1) == 0x000400, "Member 'IGLE_W_EditorHUD_C_ExecuteUbergraph_IGLE_W_EditorHUD::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1' has a wrong offset!");

// Function IGLE_W_EditorHUD.IGLE_W_EditorHUD_C.OnMouseResized_OutlinerPropertiesResizer
// 0x0010 (0x0010 - 0x0000)
struct IGLE_W_EditorHUD_C_OnMouseResized_OutlinerPropertiesResizer final
{
public:
	struct FVector2D                              DeltaVector;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_EditorHUD_C_OnMouseResized_OutlinerPropertiesResizer) == 0x000008, "Wrong alignment on IGLE_W_EditorHUD_C_OnMouseResized_OutlinerPropertiesResizer");
static_assert(sizeof(IGLE_W_EditorHUD_C_OnMouseResized_OutlinerPropertiesResizer) == 0x000010, "Wrong size on IGLE_W_EditorHUD_C_OnMouseResized_OutlinerPropertiesResizer");
static_assert(offsetof(IGLE_W_EditorHUD_C_OnMouseResized_OutlinerPropertiesResizer, DeltaVector) == 0x000000, "Member 'IGLE_W_EditorHUD_C_OnMouseResized_OutlinerPropertiesResizer::DeltaVector' has a wrong offset!");

// Function IGLE_W_EditorHUD.IGLE_W_EditorHUD_C.OnMouseResized_PlacablesResizer
// 0x0010 (0x0010 - 0x0000)
struct IGLE_W_EditorHUD_C_OnMouseResized_PlacablesResizer final
{
public:
	struct FVector2D                              DeltaVector;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_EditorHUD_C_OnMouseResized_PlacablesResizer) == 0x000008, "Wrong alignment on IGLE_W_EditorHUD_C_OnMouseResized_PlacablesResizer");
static_assert(sizeof(IGLE_W_EditorHUD_C_OnMouseResized_PlacablesResizer) == 0x000010, "Wrong size on IGLE_W_EditorHUD_C_OnMouseResized_PlacablesResizer");
static_assert(offsetof(IGLE_W_EditorHUD_C_OnMouseResized_PlacablesResizer, DeltaVector) == 0x000000, "Member 'IGLE_W_EditorHUD_C_OnMouseResized_PlacablesResizer::DeltaVector' has a wrong offset!");

// Function IGLE_W_EditorHUD.IGLE_W_EditorHUD_C.OnMouseResized_PropertiesPannelResizer
// 0x0010 (0x0010 - 0x0000)
struct IGLE_W_EditorHUD_C_OnMouseResized_PropertiesPannelResizer final
{
public:
	struct FVector2D                              DeltaVector;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_EditorHUD_C_OnMouseResized_PropertiesPannelResizer) == 0x000008, "Wrong alignment on IGLE_W_EditorHUD_C_OnMouseResized_PropertiesPannelResizer");
static_assert(sizeof(IGLE_W_EditorHUD_C_OnMouseResized_PropertiesPannelResizer) == 0x000010, "Wrong size on IGLE_W_EditorHUD_C_OnMouseResized_PropertiesPannelResizer");
static_assert(offsetof(IGLE_W_EditorHUD_C_OnMouseResized_PropertiesPannelResizer, DeltaVector) == 0x000000, "Member 'IGLE_W_EditorHUD_C_OnMouseResized_PropertiesPannelResizer::DeltaVector' has a wrong offset!");

// Function IGLE_W_EditorHUD.IGLE_W_EditorHUD_C.PopulateCategories
// 0x01D0 (0x01D0 - 0x0000)
struct IGLE_W_EditorHUD_C_PopulateCategories final
{
public:
	TMap<class FString, struct FIGLEPlacableActorInfo> CategoryToPlacable;                                // 0x0000(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEPlacableActorInfo                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0090(0x00C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIGLE_W_PlacableCategoryEntry_C*        CallFunc_Create_ReturnValue;                       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIGLE_W_PlacableCategoryEntry_C*        CallFunc_Create_ReturnValue_1;                     // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0188(0x0010)(ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_EditorHUD_C_PopulateCategories) == 0x000008, "Wrong alignment on IGLE_W_EditorHUD_C_PopulateCategories");
static_assert(sizeof(IGLE_W_EditorHUD_C_PopulateCategories) == 0x0001D0, "Wrong size on IGLE_W_EditorHUD_C_PopulateCategories");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CategoryToPlacable) == 0x000000, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CategoryToPlacable' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, Temp_int_Array_Index_Variable) == 0x000060, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000068, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, Temp_int_Array_Index_Variable_1) == 0x000080, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Array_Get_Item) == 0x000084, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_GetDataTableRowFromName_OutRow) == 0x000090, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000150, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000151, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, Temp_int_Loop_Counter_Variable_2) == 0x000154, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Add_IntInt_ReturnValue_2) == 0x000158, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, Temp_int_Array_Index_Variable_2) == 0x00015C, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_GetOwningPlayer_ReturnValue) == 0x000160, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Create_ReturnValue) == 0x000168, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_AddChild_ReturnValue) == 0x000170, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000178, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Create_ReturnValue_1) == 0x000180, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Map_Keys_Keys) == 0x000188, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_AddChild_ReturnValue_1) == 0x000198, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Array_Get_Item_1) == 0x0001A0, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Array_Get_Item_2) == 0x0001B0, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Contains_ReturnValue) == 0x0001C0, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Contains_ReturnValue_1) == 0x0001C1, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Array_Length_ReturnValue_1) == 0x0001C4, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Array_Length_ReturnValue_2) == 0x0001C8, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001CC, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_EditorHUD_C_PopulateCategories, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001CD, "Member 'IGLE_W_EditorHUD_C_PopulateCategories::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function IGLE_W_EditorHUD.IGLE_W_EditorHUD_C.PopulatePlacablesGrid
// 0x0270 (0x0270 - 0x0000)
struct IGLE_W_EditorHUD_C_PopulatePlacablesGrid final
{
public:
	class FString                                 CategoryFilter;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    Items;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         IndexOffset;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildrenPerRow;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0054(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPlayerScreenWidgetGeometry_ReturnValue; // 0x00D4(0x0038)(IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIGLEPlacableActorInfo                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0138(0x00C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition_1;          // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition_1;       // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
