#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_A_TranslationGizmo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "IGLE_E_GizmoSpace_structs.hpp"


namespace SDK::Params
{

// Function IGLE_A_TranslationGizmo.IGLE_A_TranslationGizmo_C.ExecuteUbergraph_IGLE_A_TranslationGizmo
// 0x06F8 (0x06F8 - 0x0000)
struct IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EIGLE_E_GizmoSpace                            K2Node_Event_New_Gizmo_Space;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AIGLE_A_Gizmo_C*                        K2Node_Event_GizmoOuter;                           // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ViewSpaceScanLine_Start;                  // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ViewSpaceScanLine_End;                    // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select_Default_1;                           // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select_Default_2;                           // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_3;                // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_WorldPosToIGLEViewPoint_IGLE_View_Point___X__Y_; // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_OptimalPlaneNormalForCameraAndHitAxis_PlaneNormal; // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldSnapForMode_ShouldSnap;             // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_LinePlaneIntersection_OriginNormal_T;     // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LinePlaneIntersection_OriginNormal_Intersection; // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LinePlaneIntersection_OriginNormal_ReturnValue; // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_SnappedToGrid_ReturnValue;         // 0x05D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x05E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0600(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x3];                                      // 0x06E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_SnappedToGrid_InGridSize_ImplicitCast; // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo) == 0x000008, "Wrong alignment on IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo");
static_assert(sizeof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo) == 0x0006F8, "Wrong size on IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, EntryPoint) == 0x000000, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, Temp_real_Variable) == 0x000008, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, K2Node_Event_New_Gizmo_Space) == 0x000012, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::K2Node_Event_New_Gizmo_Space' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, Temp_bool_Variable) == 0x000013, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, Temp_real_Variable_1) == 0x000018, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, Temp_bool_Variable_1) == 0x000038, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_bBlockingHit) == 0x000039, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_bInitialOverlap) == 0x00003A, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Time) == 0x00003C, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Distance) == 0x000040, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Location) == 0x000048, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ImpactPoint) == 0x000060, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Normal) == 0x000078, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ImpactNormal) == 0x000090, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_PhysMat) == 0x0000A8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitActor) == 0x0000B0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitComponent) == 0x0000B8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitBoneName) == 0x0000C0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_BoneName) == 0x0000C8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitItem) == 0x0000D0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ElementIndex) == 0x0000D4, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_FaceIndex) == 0x0000D8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_TraceStart) == 0x0000E0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_TraceEnd) == 0x0000F8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000110, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000111, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000112, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Time_1) == 0x000114, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Distance_1) == 0x000118, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Location_1) == 0x000120, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000138, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Normal_1) == 0x000150, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000168, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_PhysMat_1) == 0x000180, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitActor_1) == 0x000188, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitComponent_1) == 0x000190, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitBoneName_1) == 0x000198, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_BoneName_1) == 0x0001A0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitItem_1) == 0x0001A8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ElementIndex_1) == 0x0001AC, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_FaceIndex_1) == 0x0001B0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_TraceStart_1) == 0x0001B8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_TraceEnd_1) == 0x0001D0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_bBlockingHit_2) == 0x0001E8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x0001E9, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Time_2) == 0x0001EC, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Distance_2) == 0x0001F0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Location_2) == 0x0001F8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ImpactPoint_2) == 0x000210, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Normal_2) == 0x000228, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ImpactNormal_2) == 0x000240, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_PhysMat_2) == 0x000258, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitActor_2) == 0x000260, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitComponent_2) == 0x000268, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitBoneName_2) == 0x000270, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_BoneName_2) == 0x000278, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_BoneName_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitItem_2) == 0x000280, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ElementIndex_2) == 0x000284, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ElementIndex_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_FaceIndex_2) == 0x000288, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_FaceIndex_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_TraceStart_2) == 0x000290, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_TraceStart_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_TraceEnd_2) == 0x0002A8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_TraceEnd_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_GetUpVector_ReturnValue) == 0x0002C0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_IsValid_ReturnValue) == 0x0002D8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002D9, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, K2Node_Event_GizmoOuter) == 0x0002E0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::K2Node_Event_GizmoOuter' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, K2Node_Select_Default) == 0x0002E8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, Temp_bool_Variable_2) == 0x0002F0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_ViewSpaceScanLine_Start) == 0x0002F8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_ViewSpaceScanLine_Start' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_ViewSpaceScanLine_End) == 0x000310, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_ViewSpaceScanLine_End' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, Temp_bool_Variable_3) == 0x000328, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000330, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, K2Node_Select_Default_1) == 0x000348, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, K2Node_Select_Default_2) == 0x000350, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000358, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_bBlockingHit_3) == 0x000370, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_bBlockingHit_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_bInitialOverlap_3) == 0x000371, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_bInitialOverlap_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Time_3) == 0x000374, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Time_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Distance_3) == 0x000378, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Distance_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Location_3) == 0x000380, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Location_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ImpactPoint_3) == 0x000398, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ImpactPoint_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_Normal_3) == 0x0003B0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_Normal_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ImpactNormal_3) == 0x0003C8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ImpactNormal_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_PhysMat_3) == 0x0003E0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_PhysMat_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitActor_3) == 0x0003E8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitActor_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitComponent_3) == 0x0003F0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitComponent_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitBoneName_3) == 0x0003F8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitBoneName_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_BoneName_3) == 0x000400, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_BoneName_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_HitItem_3) == 0x000408, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_HitItem_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_ElementIndex_3) == 0x00040C, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_ElementIndex_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_FaceIndex_3) == 0x000410, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_FaceIndex_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_TraceStart_3) == 0x000418, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_TraceStart_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakHitResult_TraceEnd_3) == 0x000430, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakHitResult_TraceEnd_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000448, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000460, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Add_VectorVector_ReturnValue) == 0x000478, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_WorldPosToIGLEViewPoint_IGLE_View_Point___X__Y_) == 0x000490, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_WorldPosToIGLEViewPoint_IGLE_View_Point___X__Y_' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakVector2D_X) == 0x0004A0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakVector2D_Y) == 0x0004A8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0004B0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_GetForwardVector_ReturnValue) == 0x0004B8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_OptimalPlaneNormalForCameraAndHitAxis_PlaneNormal) == 0x0004D0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_OptimalPlaneNormalForCameraAndHitAxis_PlaneNormal' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_ShouldSnapForMode_ShouldSnap) == 0x0004E8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_ShouldSnapForMode_ShouldSnap' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_LinePlaneIntersection_OriginNormal_T) == 0x0004EC, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_LinePlaneIntersection_OriginNormal_T' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_LinePlaneIntersection_OriginNormal_Intersection) == 0x0004F0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_LinePlaneIntersection_OriginNormal_Intersection' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_LinePlaneIntersection_OriginNormal_ReturnValue) == 0x000508, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_LinePlaneIntersection_OriginNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Dot_VectorVector_ReturnValue) == 0x000510, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000518, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, K2Node_Select_Default_3) == 0x000520, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000528, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000540, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakTransform_Location) == 0x000558, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakTransform_Rotation) == 0x000570, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_BreakTransform_Scale) == 0x000588, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0005A0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Subtract_VectorVector_ReturnValue_3) == 0x0005B8, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Subtract_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo, CallFunc_Vector_SnappedToGrid_ReturnValue) == 0x0005D0, "Member 'IGLE_A_TranslationGizmo_C_ExecuteUbergraph_IGLE_A_TranslationGizmo::CallFunc_Vector_SnappedToGrid_ReturnValue' has a wrong offset!");
