#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_EditorHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_EditorHUD.IGLE_W_EditorHUD_C
// 0x0108 (0x03C8 - 0x02C0)
class UIGLE_W_EditorHUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Documentation;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             CategoriesScrollBox;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_BrowserSearch_C*                  IGLE_BrowserSearch_C_0;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_ActionLog_C*                    IGLE_W_ActionLog;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_PlacableCategoryEntry_C*        IGLE_W_PlacableCategoryEntry_All;                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_PropertiesPannel_C*             IGLE_W_PropertiesPannel;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_SceneOutliner_C*                IGLE_W_SceneOutliner;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_Viewport_C*                     IGLE_W_Viewport;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_ViewportSettings_C*             IGLE_W_ViewportSettings;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_ResizerHandle_C*                OutlinerPropertiesResizer;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               OutlinerPropertiesSizeBox;                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PlacablesBorder;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_ResizerHandle_C*                PlacablesResizer;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlacablesSizeBox;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ProperiesPannelSizeBox;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_ResizerHandle_C*                PropertiesPannelResizer;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTileView*                              TileView_236;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UClass*, class UTexture*>          GeneratedPlacableIcons;                            // 0x0350(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FString                                 SelectedPlacableCategory;                          // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        HorizontalPlacableWidgetSize;                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CurrentFullItemList;                               // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__IGLE_W_EditorHUD_Button_Documentation_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__IGLE_W_EditorHUD_IGLE_BrowserSearch_C_0_K2Node_ComponentBoundEvent_0_OnTextChanged__DelegateSignature(const class FText& Text);
	void Construct();
	void ExecuteUbergraph_IGLE_W_EditorHUD(int32 EntryPoint);
	void OnMouseResized_OutlinerPropertiesResizer(const struct FVector2D& DeltaVector);
	void OnMouseResized_PlacablesResizer(const struct FVector2D& DeltaVector);
	void OnMouseResized_PropertiesPannelResizer(const struct FVector2D& DeltaVector);
	void PopulateCategories();
	void PopulatePlacablesGrid(const class FString& CategoryFilter);
	void PrepareSearchArray(const class FText& InText, TArray<class UObject*>* Result);
	void SwitchPlacableCategories(const class FString& CategoryName);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateCameraSpeed(double Speed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_EditorHUD_C">();
	}
	static class UIGLE_W_EditorHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_EditorHUD_C>();
	}
};
static_assert(alignof(UIGLE_W_EditorHUD_C) == 0x000008, "Wrong alignment on UIGLE_W_EditorHUD_C");
static_assert(sizeof(UIGLE_W_EditorHUD_C) == 0x0003C8, "Wrong size on UIGLE_W_EditorHUD_C");
static_assert(offsetof(UIGLE_W_EditorHUD_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_EditorHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, Button_Documentation) == 0x0002C8, "Member 'UIGLE_W_EditorHUD_C::Button_Documentation' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, CategoriesScrollBox) == 0x0002D0, "Member 'UIGLE_W_EditorHUD_C::CategoriesScrollBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, IGLE_BrowserSearch_C_0) == 0x0002D8, "Member 'UIGLE_W_EditorHUD_C::IGLE_BrowserSearch_C_0' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, IGLE_W_ActionLog) == 0x0002E0, "Member 'UIGLE_W_EditorHUD_C::IGLE_W_ActionLog' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, IGLE_W_PlacableCategoryEntry_All) == 0x0002E8, "Member 'UIGLE_W_EditorHUD_C::IGLE_W_PlacableCategoryEntry_All' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, IGLE_W_PropertiesPannel) == 0x0002F0, "Member 'UIGLE_W_EditorHUD_C::IGLE_W_PropertiesPannel' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, IGLE_W_SceneOutliner) == 0x0002F8, "Member 'UIGLE_W_EditorHUD_C::IGLE_W_SceneOutliner' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, IGLE_W_Viewport) == 0x000300, "Member 'UIGLE_W_EditorHUD_C::IGLE_W_Viewport' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, IGLE_W_ViewportSettings) == 0x000308, "Member 'UIGLE_W_EditorHUD_C::IGLE_W_ViewportSettings' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, OutlinerPropertiesResizer) == 0x000310, "Member 'UIGLE_W_EditorHUD_C::OutlinerPropertiesResizer' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, OutlinerPropertiesSizeBox) == 0x000318, "Member 'UIGLE_W_EditorHUD_C::OutlinerPropertiesSizeBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, PlacablesBorder) == 0x000320, "Member 'UIGLE_W_EditorHUD_C::PlacablesBorder' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, PlacablesResizer) == 0x000328, "Member 'UIGLE_W_EditorHUD_C::PlacablesResizer' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, PlacablesSizeBox) == 0x000330, "Member 'UIGLE_W_EditorHUD_C::PlacablesSizeBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, ProperiesPannelSizeBox) == 0x000338, "Member 'UIGLE_W_EditorHUD_C::ProperiesPannelSizeBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, PropertiesPannelResizer) == 0x000340, "Member 'UIGLE_W_EditorHUD_C::PropertiesPannelResizer' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, TileView_236) == 0x000348, "Member 'UIGLE_W_EditorHUD_C::TileView_236' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, GeneratedPlacableIcons) == 0x000350, "Member 'UIGLE_W_EditorHUD_C::GeneratedPlacableIcons' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, SelectedPlacableCategory) == 0x0003A0, "Member 'UIGLE_W_EditorHUD_C::SelectedPlacableCategory' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, HorizontalPlacableWidgetSize) == 0x0003B0, "Member 'UIGLE_W_EditorHUD_C::HorizontalPlacableWidgetSize' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorHUD_C, CurrentFullItemList) == 0x0003B8, "Member 'UIGLE_W_EditorHUD_C::CurrentFullItemList' has a wrong offset!");

}

