#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_SceneOutliner_Entry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on IGLE_W_SceneOutliner_Entry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on IGLE_W_SceneOutliner_Entry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_CustomEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_CustomEvent) == 0x000008, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_CustomEvent");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_CustomEvent) == 0x000008, "Wrong size on IGLE_W_SceneOutliner_Entry_C_CustomEvent");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_CustomEvent, Actor) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_CustomEvent::Actor' has a wrong offset!");

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.ExecuteUbergraph_IGLE_W_SceneOutliner_Entry
// 0x01F0 (0x01F0 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIndex_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetModInfosFromDataTable_ReturnValue;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEPlacableActorInfo                 CallFunc_GetModInfosFromDataTable_Out_Row;         // 0x0068(0x00C0)(HasGetValueTypeHash)
	class FName                                   CallFunc_GetModInfosFromDataTable_RowName;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_W_SceneOutliner_Entry_C*          K2Node_DynamicCast_AsIGLE_W_Scene_Outliner_Entry;  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn;   // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x018C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_1; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_MyPlayerController_AsPlayer_Controller;   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_2; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_3; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_4; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_5; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry) == 0x000008, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry) == 0x0001F0, "Wrong size on IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, EntryPoint) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_GetItemIndex_ReturnValue) == 0x000004, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_GetItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_Percent_IntInt_ReturnValue) == 0x000008, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, Temp_bool_Variable) == 0x00000E, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, Temp_struct_Variable) == 0x000010, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, Temp_struct_Variable_1) == 0x000020, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, Temp_bool_Variable_1) == 0x000030, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_Select_Default) == 0x000034, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, Temp_struct_Variable_2) == 0x000044, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_GetObjectClass_ReturnValue) == 0x000058, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_GetModInfosFromDataTable_ReturnValue) == 0x000060, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_GetModInfosFromDataTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_GetModInfosFromDataTable_Out_Row) == 0x000068, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_GetModInfosFromDataTable_Out_Row' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_GetModInfosFromDataTable_RowName) == 0x000128, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_GetModInfosFromDataTable_RowName' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000130, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_CustomEvent_Loaded) == 0x000140, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, Temp_object_Variable) == 0x000148, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_DynamicCast_AsTexture_2D) == 0x000150, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_DynamicCast_AsIGLE_W_Scene_Outliner_Entry) == 0x000160, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_DynamicCast_AsIGLE_W_Scene_Outliner_Entry' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn) == 0x000170, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_Set_Contains_ReturnValue) == 0x000178, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_CreateDelegate_OutputDelegate_1) == 0x00017C, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_Select_Default_1) == 0x00018C, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_1) == 0x0001A0, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_MyPlayerController_AsPlayer_Controller) == 0x0001A8, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_MyPlayerController_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_2) == 0x0001B0, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_IsInputKeyDown_ReturnValue) == 0x0001B8, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_3) == 0x0001C0, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_4) == 0x0001C8, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_5) == 0x0001D0, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_Event_bIsSelected) == 0x0001D8, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_Event_bIsExpanded) == 0x0001D9, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_Event_ListItemObject) == 0x0001E0, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry, K2Node_CustomEvent_Actor) == 0x0001E8, "Member 'IGLE_W_SceneOutliner_Entry_C_ExecuteUbergraph_IGLE_W_SceneOutliner_Entry::K2Node_CustomEvent_Actor' has a wrong offset!");

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.GetItemIndex
// 0x0008 (0x0008 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_GetItemIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_GetItemIndex) == 0x000004, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_GetItemIndex");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_GetItemIndex) == 0x000008, "Wrong size on IGLE_W_SceneOutliner_Entry_C_GetItemIndex");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetItemIndex, ReturnValue) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_GetItemIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetItemIndex, CallFunc_GetIndexForItem_ReturnValue) == 0x000004, "Member 'IGLE_W_SceneOutliner_Entry_C_GetItemIndex::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.GetPlacableID
// 0x0040 (0x0040 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_GetPlacableID final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UIGLE_InterfaceComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0028(0x0018)()
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_GetPlacableID) == 0x000008, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_GetPlacableID");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_GetPlacableID) == 0x000040, "Wrong size on IGLE_W_SceneOutliner_Entry_C_GetPlacableID");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableID, ReturnValue) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableID::ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableID, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableID::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableID, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableID, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableID::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableID, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000028, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableID::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.GetPlacableName
// 0x0040 (0x0040 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_GetPlacableName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UIGLE_InterfaceComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_GetPlacableName) == 0x000008, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_GetPlacableName");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_GetPlacableName) == 0x000040, "Wrong size on IGLE_W_SceneOutliner_Entry_C_GetPlacableName");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableName, ReturnValue) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableName::ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableName, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableName::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableName, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableName, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableName::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_GetPlacableName, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'IGLE_W_SceneOutliner_Entry_C_GetPlacableName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_OnListItemObjectSet");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_OnListItemObjectSet) == 0x000008, "Wrong size on IGLE_W_SceneOutliner_Entry_C_OnListItemObjectSet");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C.OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C
// 0x0008 (0x0008 - 0x0000)
struct IGLE_W_SceneOutliner_Entry_C_OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_SceneOutliner_Entry_C_OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C) == 0x000008, "Wrong alignment on IGLE_W_SceneOutliner_Entry_C_OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C");
static_assert(sizeof(IGLE_W_SceneOutliner_Entry_C_OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C) == 0x000008, "Wrong size on IGLE_W_SceneOutliner_Entry_C_OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C");
static_assert(offsetof(IGLE_W_SceneOutliner_Entry_C_OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C, Loaded) == 0x000000, "Member 'IGLE_W_SceneOutliner_Entry_C_OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C::Loaded' has a wrong offset!");

}

