#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_BoxSelect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function IGLE_W_BoxSelect.IGLE_W_BoxSelect_C.ExecuteUbergraph_IGLE_W_BoxSelect
// 0x00D0 (0x00D0 - 0x0000)
struct IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0004(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0060(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect) == 0x000008, "Wrong alignment on IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect");
static_assert(sizeof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect) == 0x0000D0, "Wrong size on IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, EntryPoint) == 0x000000, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_GetCachedGeometry_ReturnValue) == 0x000004, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_GetAbsoluteSize_ReturnValue) == 0x000040, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_BreakVector2D_X) == 0x000050, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_BreakVector2D_Y) == 0x000058, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, K2Node_Event_MyGeometry) == 0x000060, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, K2Node_Event_InDeltaTime) == 0x000098, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_Abs_ReturnValue) == 0x0000A0, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_Abs_ReturnValue_1) == 0x0000A8, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_MakeColor_ReturnValue) == 0x0000B8, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_MakeColor_G_ImplicitCast) == 0x0000C8, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect, CallFunc_MakeColor_R_ImplicitCast) == 0x0000CC, "Member 'IGLE_W_BoxSelect_C_ExecuteUbergraph_IGLE_W_BoxSelect::CallFunc_MakeColor_R_ImplicitCast' has a wrong offset!");

// Function IGLE_W_BoxSelect.IGLE_W_BoxSelect_C.Tick
// 0x003C (0x003C - 0x0000)
struct IGLE_W_BoxSelect_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_BoxSelect_C_Tick) == 0x000004, "Wrong alignment on IGLE_W_BoxSelect_C_Tick");
static_assert(sizeof(IGLE_W_BoxSelect_C_Tick) == 0x00003C, "Wrong size on IGLE_W_BoxSelect_C_Tick");
static_assert(offsetof(IGLE_W_BoxSelect_C_Tick, MyGeometry) == 0x000000, "Member 'IGLE_W_BoxSelect_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(IGLE_W_BoxSelect_C_Tick, InDeltaTime) == 0x000038, "Member 'IGLE_W_BoxSelect_C_Tick::InDeltaTime' has a wrong offset!");

}

