#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_Action_TransformSelection

#include "Basic.hpp"

#include "IGLE_ActionBuffer_Base_classes.hpp"
#include "InGameLevelEditor_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IGLE_Action_TransformSelection.IGLE_Action_TransformSelection_C
// 0x0050 (0x0088 - 0x0038)
class UIGLE_Action_TransformSelection_C final : public UIGLE_ActionBuffer_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IGLE_Action_TransformSelection_C;   // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         Selection;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	TArray<struct FTransform>                     OldTransforms;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AIGLE_Pawn_EditorBase_C*                EditorPawn;                                        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FIGLEActorReference>            Selection_Refs;                                    // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     NewTransforms;                                     // 0x0078(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_IGLE_Action_TransformSelection(int32 EntryPoint);
	void GetFriendlyActionName(class FString* OutName);
	void Initialize();
	void RedoAction();
	void UndoAction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_Action_TransformSelection_C">();
	}
	static class UIGLE_Action_TransformSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_Action_TransformSelection_C>();
	}
};
static_assert(alignof(UIGLE_Action_TransformSelection_C) == 0x000008, "Wrong alignment on UIGLE_Action_TransformSelection_C");
static_assert(sizeof(UIGLE_Action_TransformSelection_C) == 0x000088, "Wrong size on UIGLE_Action_TransformSelection_C");
static_assert(offsetof(UIGLE_Action_TransformSelection_C, UberGraphFrame_IGLE_Action_TransformSelection_C) == 0x000038, "Member 'UIGLE_Action_TransformSelection_C::UberGraphFrame_IGLE_Action_TransformSelection_C' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_TransformSelection_C, Selection) == 0x000040, "Member 'UIGLE_Action_TransformSelection_C::Selection' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_TransformSelection_C, OldTransforms) == 0x000050, "Member 'UIGLE_Action_TransformSelection_C::OldTransforms' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_TransformSelection_C, EditorPawn) == 0x000060, "Member 'UIGLE_Action_TransformSelection_C::EditorPawn' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_TransformSelection_C, Selection_Refs) == 0x000068, "Member 'UIGLE_Action_TransformSelection_C::Selection_Refs' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_TransformSelection_C, NewTransforms) == 0x000078, "Member 'UIGLE_Action_TransformSelection_C::NewTransforms' has a wrong offset!");

}

