#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_PropertiesPannel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_PropertiesPannel.IGLE_W_PropertiesPannel_C
// 0x0030 (0x02F0 - 0x02C0)
class UIGLE_W_PropertiesPannel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIGLE_EditableTextBox_C*                EditablePlacableName;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_PlacableTransform_C*            PlacableTransformEdit;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PropertiesPannelVerticalBox;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             PropertiesScrollBox;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 PlacableActor;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__EditablePlacableName_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void ClearPannel();
	void Construct();
	void ExecuteUbergraph_IGLE_W_PropertiesPannel(int32 EntryPoint);
	void OnTransformChanged(const struct FTransform& NewTransform);
	void SetPlacableActorTarget(class AActor* PlacableActor_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_PropertiesPannel_C">();
	}
	static class UIGLE_W_PropertiesPannel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_PropertiesPannel_C>();
	}
};
static_assert(alignof(UIGLE_W_PropertiesPannel_C) == 0x000008, "Wrong alignment on UIGLE_W_PropertiesPannel_C");
static_assert(sizeof(UIGLE_W_PropertiesPannel_C) == 0x0002F0, "Wrong size on UIGLE_W_PropertiesPannel_C");
static_assert(offsetof(UIGLE_W_PropertiesPannel_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_PropertiesPannel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertiesPannel_C, EditablePlacableName) == 0x0002C8, "Member 'UIGLE_W_PropertiesPannel_C::EditablePlacableName' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertiesPannel_C, PlacableTransformEdit) == 0x0002D0, "Member 'UIGLE_W_PropertiesPannel_C::PlacableTransformEdit' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertiesPannel_C, PropertiesPannelVerticalBox) == 0x0002D8, "Member 'UIGLE_W_PropertiesPannel_C::PropertiesPannelVerticalBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertiesPannel_C, PropertiesScrollBox) == 0x0002E0, "Member 'UIGLE_W_PropertiesPannel_C::PropertiesScrollBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertiesPannel_C, PlacableActor) == 0x0002E8, "Member 'UIGLE_W_PropertiesPannel_C::PlacableActor' has a wrong offset!");

}

