#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_PickSplineWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function IGLE_PickSplineWidget.IGLE_PickSplineWidget_C.ExecuteUbergraph_IGLE_PickSplineWidget
// 0x00A0 (0x00A0 - 0x0000)
struct IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_PickSplineProperty_C*             K2Node_DynamicCast_AsIGLE_Pick_Spline_Property;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlacableByID_ReturnValue;              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetPlacableByID_Actor;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIGLE_InterfaceComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	class UIGLE_PickSplineProperty_C*             K2Node_DynamicCast_AsIGLE_Pick_Spline_Property_1;  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlacableByID_ReturnValue_1;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetPlacableByID_Actor_1;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIGLE_InterfaceComponent*               CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	class UIGLE_PickSplineProperty_C*             K2Node_DynamicCast_AsIGLE_Pick_Spline_Property_2;  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_TryCallOnPropertyValueChanged_Success; // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget) == 0x000008, "Wrong alignment on IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget");
static_assert(sizeof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget) == 0x0000A0, "Wrong size on IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, EntryPoint) == 0x000000, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, K2Node_DynamicCast_AsIGLE_Pawn_Example) == 0x000010, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::K2Node_DynamicCast_AsIGLE_Pawn_Example' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, K2Node_DynamicCast_AsIGLE_Pick_Spline_Property) == 0x000020, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::K2Node_DynamicCast_AsIGLE_Pick_Spline_Property' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x000029, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_GetPlacableByID_ReturnValue) == 0x00002A, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_GetPlacableByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_GetPlacableByID_Actor) == 0x000030, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_GetPlacableByID_Actor' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, K2Node_DynamicCast_AsIGLE_Pick_Spline_Property_1) == 0x000058, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::K2Node_DynamicCast_AsIGLE_Pick_Spline_Property_1' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_GetPlacableByID_ReturnValue_1) == 0x000061, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_GetPlacableByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_GetPlacableByID_Actor_1) == 0x000068, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_GetPlacableByID_Actor_1' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000070, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, K2Node_DynamicCast_AsIGLE_Pick_Spline_Property_2) == 0x000090, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::K2Node_DynamicCast_AsIGLE_Pick_Spline_Property_2' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget, CallFunc_IGLE_TryCallOnPropertyValueChanged_Success) == 0x000099, "Member 'IGLE_PickSplineWidget_C_ExecuteUbergraph_IGLE_PickSplineWidget::CallFunc_IGLE_TryCallOnPropertyValueChanged_Success' has a wrong offset!");

// Function IGLE_PickSplineWidget.IGLE_PickSplineWidget_C.GetName
// 0x0088 (0x0088 - 0x0000)
struct IGLE_PickSplineWidget_C_GetName final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue_1;             // 0x0050(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
};
static_assert(alignof(IGLE_PickSplineWidget_C_GetName) == 0x000008, "Wrong alignment on IGLE_PickSplineWidget_C_GetName");
static_assert(sizeof(IGLE_PickSplineWidget_C_GetName) == 0x000088, "Wrong size on IGLE_PickSplineWidget_C_GetName");
static_assert(offsetof(IGLE_PickSplineWidget_C_GetName, SourceString) == 0x000000, "Member 'IGLE_PickSplineWidget_C_GetName::SourceString' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_GetName, ReturnValue) == 0x000010, "Member 'IGLE_PickSplineWidget_C_GetName::ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_GetName, CallFunc_ParseIntoArray_ReturnValue) == 0x000028, "Member 'IGLE_PickSplineWidget_C_GetName::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_GetName, CallFunc_Array_LastIndex_ReturnValue) == 0x000038, "Member 'IGLE_PickSplineWidget_C_GetName::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_GetName, CallFunc_Array_Get_Item) == 0x000040, "Member 'IGLE_PickSplineWidget_C_GetName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_GetName, CallFunc_ParseIntoArray_ReturnValue_1) == 0x000050, "Member 'IGLE_PickSplineWidget_C_GetName::CallFunc_ParseIntoArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_GetName, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'IGLE_PickSplineWidget_C_GetName::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(IGLE_PickSplineWidget_C_GetName, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'IGLE_PickSplineWidget_C_GetName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

