#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_BrowserSearch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_BrowserSearch.IGLE_BrowserSearch_C
// 0x0078 (0x0338 - 0x02C0)
class UIGLE_BrowserSearch_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIGLE_EditableTextBox_C*                SearchBox;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class AActor*, class UIGLE_W_SceneOutliner_Entry_C*> PlacableEntries;                                   // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class AIGLE_Pawn_EditorBase_C*                Parent;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnTextChanged;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void ExecuteUbergraph_IGLE_BrowserSearch(int32 EntryPoint);
	void OnTextChanged__DelegateSignature(const class FText& Text);
	void SortOutlinerChildrenBySearchTerm(const class FString& SearchString);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_BrowserSearch_C">();
	}
	static class UIGLE_BrowserSearch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_BrowserSearch_C>();
	}
};
static_assert(alignof(UIGLE_BrowserSearch_C) == 0x000008, "Wrong alignment on UIGLE_BrowserSearch_C");
static_assert(sizeof(UIGLE_BrowserSearch_C) == 0x000338, "Wrong size on UIGLE_BrowserSearch_C");
static_assert(offsetof(UIGLE_BrowserSearch_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_BrowserSearch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_BrowserSearch_C, SearchBox) == 0x0002C8, "Member 'UIGLE_BrowserSearch_C::SearchBox' has a wrong offset!");
static_assert(offsetof(UIGLE_BrowserSearch_C, PlacableEntries) == 0x0002D0, "Member 'UIGLE_BrowserSearch_C::PlacableEntries' has a wrong offset!");
static_assert(offsetof(UIGLE_BrowserSearch_C, Parent) == 0x000320, "Member 'UIGLE_BrowserSearch_C::Parent' has a wrong offset!");
static_assert(offsetof(UIGLE_BrowserSearch_C, OnTextChanged) == 0x000328, "Member 'UIGLE_BrowserSearch_C::OnTextChanged' has a wrong offset!");

}

