#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_BrowserSearch

#include "Basic.hpp"


namespace SDK::Params
{

// Function IGLE_BrowserSearch.IGLE_BrowserSearch_C.BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct IGLE_BrowserSearch_C_BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(IGLE_BrowserSearch_C_BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on IGLE_BrowserSearch_C_BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(IGLE_BrowserSearch_C_BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on IGLE_BrowserSearch_C_BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(IGLE_BrowserSearch_C_BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'IGLE_BrowserSearch_C_BndEvt__IGLE_BrowserSearch_SearchBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function IGLE_BrowserSearch.IGLE_BrowserSearch_C.ExecuteUbergraph_IGLE_BrowserSearch
// 0x0020 (0x0020 - 0x0000)
struct IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
};
static_assert(alignof(IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch) == 0x000008, "Wrong alignment on IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch");
static_assert(sizeof(IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch) == 0x000020, "Wrong size on IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch");
static_assert(offsetof(IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch, EntryPoint) == 0x000000, "Member 'IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'IGLE_BrowserSearch_C_ExecuteUbergraph_IGLE_BrowserSearch::K2Node_ComponentBoundEvent_Text' has a wrong offset!");

// Function IGLE_BrowserSearch.IGLE_BrowserSearch_C.OnTextChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct IGLE_BrowserSearch_C_OnTextChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(IGLE_BrowserSearch_C_OnTextChanged__DelegateSignature) == 0x000008, "Wrong alignment on IGLE_BrowserSearch_C_OnTextChanged__DelegateSignature");
static_assert(sizeof(IGLE_BrowserSearch_C_OnTextChanged__DelegateSignature) == 0x000018, "Wrong size on IGLE_BrowserSearch_C_OnTextChanged__DelegateSignature");
static_assert(offsetof(IGLE_BrowserSearch_C_OnTextChanged__DelegateSignature, Text) == 0x000000, "Member 'IGLE_BrowserSearch_C_OnTextChanged__DelegateSignature::Text' has a wrong offset!");

// Function IGLE_BrowserSearch.IGLE_BrowserSearch_C.SortOutlinerChildrenBySearchTerm
// 0x0060 (0x0060 - 0x0000)
struct IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm final
{
public:
	class FString                                 SearchString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class AActor*>            RuntimeNameToPlacable;                             // 0x0010(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm) == 0x000008, "Wrong alignment on IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm");
static_assert(sizeof(IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm) == 0x000060, "Wrong size on IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm");
static_assert(offsetof(IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm, SearchString) == 0x000000, "Member 'IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm::SearchString' has a wrong offset!");
static_assert(offsetof(IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm, RuntimeNameToPlacable) == 0x000010, "Member 'IGLE_BrowserSearch_C_SortOutlinerChildrenBySearchTerm::RuntimeNameToPlacable' has a wrong offset!");

}

