#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_ResizerHandle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_ResizerHandle.IGLE_W_ResizerHandle_C
// 0x0068 (0x0328 - 0x02C0)
class UIGLE_W_ResizerHandle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                HighlightLine;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Resizer;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              LastCursorLocation;                                // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGrabbed;                                         // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnMouseResized;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector2D                              CurrentCursorLocation;                             // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGeometryHovered;                                 // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HeightDominant;                                    // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PreUseCursorLocation;                              // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CanUseResizeHandle();
	void ExecuteUbergraph_IGLE_W_ResizerHandle(int32 EntryPoint);
	void OnMouseResized__DelegateSignature(const struct FVector2D& DeltaVector);
	void SnapCursorToResizeDirection();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_ResizerHandle_C">();
	}
	static class UIGLE_W_ResizerHandle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_ResizerHandle_C>();
	}
};
static_assert(alignof(UIGLE_W_ResizerHandle_C) == 0x000008, "Wrong alignment on UIGLE_W_ResizerHandle_C");
static_assert(sizeof(UIGLE_W_ResizerHandle_C) == 0x000328, "Wrong size on UIGLE_W_ResizerHandle_C");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_ResizerHandle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, HighlightLine) == 0x0002C8, "Member 'UIGLE_W_ResizerHandle_C::HighlightLine' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, Resizer) == 0x0002D0, "Member 'UIGLE_W_ResizerHandle_C::Resizer' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, LastCursorLocation) == 0x0002D8, "Member 'UIGLE_W_ResizerHandle_C::LastCursorLocation' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, IsGrabbed) == 0x0002E8, "Member 'UIGLE_W_ResizerHandle_C::IsGrabbed' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, OnMouseResized) == 0x0002F0, "Member 'UIGLE_W_ResizerHandle_C::OnMouseResized' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, CurrentCursorLocation) == 0x000300, "Member 'UIGLE_W_ResizerHandle_C::CurrentCursorLocation' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, IsGeometryHovered) == 0x000310, "Member 'UIGLE_W_ResizerHandle_C::IsGeometryHovered' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, HeightDominant) == 0x000311, "Member 'UIGLE_W_ResizerHandle_C::HeightDominant' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ResizerHandle_C, PreUseCursorLocation) == 0x000318, "Member 'UIGLE_W_ResizerHandle_C::PreUseCursorLocation' has a wrong offset!");

}

