#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_PlacableTransform

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IGLE_W_PlacableTransform.IGLE_W_PlacableTransform_C.ExecuteUbergraph_IGLE_W_PlacableTransform
// 0x0440 (0x0440 - 0x0000)
struct IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& NewValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& NewValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NewValue_2;                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_NewTransform;                   // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NewValue_1;                     // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NewValue;                       // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_4;                // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_4;                // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_4;                   // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0370(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_5;                // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_5;                // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_5;                   // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform) == 0x000010, "Wrong alignment on IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform");
static_assert(sizeof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform) == 0x000440, "Wrong size on IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, EntryPoint) == 0x000000, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, K2Node_CustomEvent_NewValue_2) == 0x000038, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Location) == 0x000050, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Rotation) == 0x000068, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Scale) == 0x000080, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Location_1) == 0x000100, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Rotation_1) == 0x000118, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Scale_1) == 0x000130, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, K2Node_CustomEvent_NewTransform) == 0x000150, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::K2Node_CustomEvent_NewTransform' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Location_2) == 0x0001B0, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Rotation_2) == 0x0001C8, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Scale_2) == 0x0001E0, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakRotator_Roll) == 0x0001F8, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakRotator_Pitch) == 0x0001FC, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakRotator_Yaw) == 0x000200, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeVector_ReturnValue) == 0x000208, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, K2Node_CustomEvent_NewValue_1) == 0x000220, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakVector_X) == 0x000238, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakVector_Y) == 0x000240, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakVector_Z) == 0x000248, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Location_3) == 0x000250, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Location_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Rotation_3) == 0x000268, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Rotation_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Scale_3) == 0x000280, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Scale_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeRotator_ReturnValue) == 0x000298, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeTransform_ReturnValue_1) == 0x0002B0, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, K2Node_CustomEvent_NewValue) == 0x000310, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Location_4) == 0x000328, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Location_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Rotation_4) == 0x000340, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Rotation_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Scale_4) == 0x000358, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Scale_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeTransform_ReturnValue_2) == 0x000370, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Location_5) == 0x0003D0, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Location_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Rotation_5) == 0x0003E8, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Rotation_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_BreakTransform_Scale_5) == 0x000400, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_BreakTransform_Scale_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeVector_X_ImplicitCast) == 0x000418, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeVector_Y_ImplicitCast) == 0x000420, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeVector_Z_ImplicitCast) == 0x000428, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000430, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000434, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000438, "Member 'IGLE_W_PlacableTransform_C_ExecuteUbergraph_IGLE_W_PlacableTransform::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function IGLE_W_PlacableTransform.IGLE_W_PlacableTransform_C.OnTransformChanged__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct IGLE_W_PlacableTransform_C_OnTransformChanged__DelegateSignature final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableTransform_C_OnTransformChanged__DelegateSignature) == 0x000010, "Wrong alignment on IGLE_W_PlacableTransform_C_OnTransformChanged__DelegateSignature");
static_assert(sizeof(IGLE_W_PlacableTransform_C_OnTransformChanged__DelegateSignature) == 0x000060, "Wrong size on IGLE_W_PlacableTransform_C_OnTransformChanged__DelegateSignature");
static_assert(offsetof(IGLE_W_PlacableTransform_C_OnTransformChanged__DelegateSignature, NewTransform) == 0x000000, "Member 'IGLE_W_PlacableTransform_C_OnTransformChanged__DelegateSignature::NewTransform' has a wrong offset!");

// Function IGLE_W_PlacableTransform.IGLE_W_PlacableTransform_C.OnVectorValueChanged_Location
// 0x0018 (0x0018 - 0x0000)
struct IGLE_W_PlacableTransform_C_OnVectorValueChanged_Location final
{
public:
	struct FVector                                NewValue;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Location) == 0x000008, "Wrong alignment on IGLE_W_PlacableTransform_C_OnVectorValueChanged_Location");
static_assert(sizeof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Location) == 0x000018, "Wrong size on IGLE_W_PlacableTransform_C_OnVectorValueChanged_Location");
static_assert(offsetof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Location, NewValue) == 0x000000, "Member 'IGLE_W_PlacableTransform_C_OnVectorValueChanged_Location::NewValue' has a wrong offset!");

// Function IGLE_W_PlacableTransform.IGLE_W_PlacableTransform_C.OnVectorValueChanged_Rotation
// 0x0018 (0x0018 - 0x0000)
struct IGLE_W_PlacableTransform_C_OnVectorValueChanged_Rotation final
{
public:
	struct FVector                                NewValue;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Rotation) == 0x000008, "Wrong alignment on IGLE_W_PlacableTransform_C_OnVectorValueChanged_Rotation");
static_assert(sizeof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Rotation) == 0x000018, "Wrong size on IGLE_W_PlacableTransform_C_OnVectorValueChanged_Rotation");
static_assert(offsetof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Rotation, NewValue) == 0x000000, "Member 'IGLE_W_PlacableTransform_C_OnVectorValueChanged_Rotation::NewValue' has a wrong offset!");

// Function IGLE_W_PlacableTransform.IGLE_W_PlacableTransform_C.OnVectorValueChanged_Scale
// 0x0018 (0x0018 - 0x0000)
struct IGLE_W_PlacableTransform_C_OnVectorValueChanged_Scale final
{
public:
	struct FVector                                NewValue;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Scale) == 0x000008, "Wrong alignment on IGLE_W_PlacableTransform_C_OnVectorValueChanged_Scale");
static_assert(sizeof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Scale) == 0x000018, "Wrong size on IGLE_W_PlacableTransform_C_OnVectorValueChanged_Scale");
static_assert(offsetof(IGLE_W_PlacableTransform_C_OnVectorValueChanged_Scale, NewValue) == 0x000000, "Member 'IGLE_W_PlacableTransform_C_OnVectorValueChanged_Scale::NewValue' has a wrong offset!");

// Function IGLE_W_PlacableTransform.IGLE_W_PlacableTransform_C.UpdateTransform
// 0x0060 (0x0060 - 0x0000)
struct IGLE_W_PlacableTransform_C_UpdateTransform final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableTransform_C_UpdateTransform) == 0x000010, "Wrong alignment on IGLE_W_PlacableTransform_C_UpdateTransform");
static_assert(sizeof(IGLE_W_PlacableTransform_C_UpdateTransform) == 0x000060, "Wrong size on IGLE_W_PlacableTransform_C_UpdateTransform");
static_assert(offsetof(IGLE_W_PlacableTransform_C_UpdateTransform, NewTransform) == 0x000000, "Member 'IGLE_W_PlacableTransform_C_UpdateTransform::NewTransform' has a wrong offset!");

}

