#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_PropertyPannelEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_PropertyPannelEntry.IGLE_W_PropertyPannelEntry_C
// 0x0048 (0x0308 - 0x02C0)
class UIGLE_W_PropertyPannelEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             PropertyNameText;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PropertyValueHolder;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 PropertyName;                                      // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 PlacableActor;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UIGLE_InterfaceComponent*               InterfaceComp;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                PropertyValuePadding;                              // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_IGLE_W_PropertyPannelEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_PropertyPannelEntry_C">();
	}
	static class UIGLE_W_PropertyPannelEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_PropertyPannelEntry_C>();
	}
};
static_assert(alignof(UIGLE_W_PropertyPannelEntry_C) == 0x000008, "Wrong alignment on UIGLE_W_PropertyPannelEntry_C");
static_assert(sizeof(UIGLE_W_PropertyPannelEntry_C) == 0x000308, "Wrong size on UIGLE_W_PropertyPannelEntry_C");
static_assert(offsetof(UIGLE_W_PropertyPannelEntry_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_PropertyPannelEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertyPannelEntry_C, PropertyNameText) == 0x0002C8, "Member 'UIGLE_W_PropertyPannelEntry_C::PropertyNameText' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertyPannelEntry_C, PropertyValueHolder) == 0x0002D0, "Member 'UIGLE_W_PropertyPannelEntry_C::PropertyValueHolder' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertyPannelEntry_C, PropertyName) == 0x0002D8, "Member 'UIGLE_W_PropertyPannelEntry_C::PropertyName' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertyPannelEntry_C, PlacableActor) == 0x0002E8, "Member 'UIGLE_W_PropertyPannelEntry_C::PlacableActor' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertyPannelEntry_C, InterfaceComp) == 0x0002F0, "Member 'UIGLE_W_PropertyPannelEntry_C::InterfaceComp' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PropertyPannelEntry_C, PropertyValuePadding) == 0x0002F8, "Member 'UIGLE_W_PropertyPannelEntry_C::PropertyValuePadding' has a wrong offset!");

}

