#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_ScaleWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IGLE_ScaleWidget.IGLE_ScaleWidget_C.BndEvt__IGLE_FoliageScaleWidget_ScaleVec3Edit_K2Node_ComponentBoundEvent_0_OnVectorValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct IGLE_ScaleWidget_C_BndEvt__IGLE_FoliageScaleWidget_ScaleVec3Edit_K2Node_ComponentBoundEvent_0_OnVectorValueChanged__DelegateSignature final
{
public:
	struct FVector                                NewValue;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_ScaleWidget_C_BndEvt__IGLE_FoliageScaleWidget_ScaleVec3Edit_K2Node_ComponentBoundEvent_0_OnVectorValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on IGLE_ScaleWidget_C_BndEvt__IGLE_FoliageScaleWidget_ScaleVec3Edit_K2Node_ComponentBoundEvent_0_OnVectorValueChanged__DelegateSignature");
static_assert(sizeof(IGLE_ScaleWidget_C_BndEvt__IGLE_FoliageScaleWidget_ScaleVec3Edit_K2Node_ComponentBoundEvent_0_OnVectorValueChanged__DelegateSignature) == 0x000018, "Wrong size on IGLE_ScaleWidget_C_BndEvt__IGLE_FoliageScaleWidget_ScaleVec3Edit_K2Node_ComponentBoundEvent_0_OnVectorValueChanged__DelegateSignature");
static_assert(offsetof(IGLE_ScaleWidget_C_BndEvt__IGLE_FoliageScaleWidget_ScaleVec3Edit_K2Node_ComponentBoundEvent_0_OnVectorValueChanged__DelegateSignature, NewValue) == 0x000000, "Member 'IGLE_ScaleWidget_C_BndEvt__IGLE_FoliageScaleWidget_ScaleVec3Edit_K2Node_ComponentBoundEvent_0_OnVectorValueChanged__DelegateSignature::NewValue' has a wrong offset!");

// Function IGLE_ScaleWidget.IGLE_ScaleWidget_C.ExecuteUbergraph_IGLE_ScaleWidget
// 0x0040 (0x0040 - 0x0000)
struct IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_ComponentBoundEvent_NewValue;               // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIGLE_ScaleProperty_C*                  K2Node_DynamicCast_AsIGLE_Scale_Property;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_TryCallOnPropertyValueChanged_Success; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_ScaleProperty_C*                  K2Node_DynamicCast_AsIGLE_Scale_Property_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget) == 0x000008, "Wrong alignment on IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget");
static_assert(sizeof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget) == 0x000040, "Wrong size on IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget");
static_assert(offsetof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget, EntryPoint) == 0x000000, "Member 'IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget, K2Node_ComponentBoundEvent_NewValue) == 0x000008, "Member 'IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget::K2Node_ComponentBoundEvent_NewValue' has a wrong offset!");
static_assert(offsetof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget, K2Node_DynamicCast_AsIGLE_Scale_Property) == 0x000020, "Member 'IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget::K2Node_DynamicCast_AsIGLE_Scale_Property' has a wrong offset!");
static_assert(offsetof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget, CallFunc_IGLE_TryCallOnPropertyValueChanged_Success) == 0x000029, "Member 'IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget::CallFunc_IGLE_TryCallOnPropertyValueChanged_Success' has a wrong offset!");
static_assert(offsetof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget, K2Node_DynamicCast_AsIGLE_Scale_Property_1) == 0x000030, "Member 'IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget::K2Node_DynamicCast_AsIGLE_Scale_Property_1' has a wrong offset!");
static_assert(offsetof(IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'IGLE_ScaleWidget_C_ExecuteUbergraph_IGLE_ScaleWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

