#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_Placable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InGameLevelEditor_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_Placable.IGLE_W_Placable_C
// 0x0158 (0x0418 - 0x02C0)
class UIGLE_W_Placable_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_1;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Play;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_Example_Button_Translucent_C*     IGLE_Example_Button_Translucent_C_142;             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlacableIcon;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlacableIcon_1;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlacableName01;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_2;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SoundText;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FIGLEPlacableActorInfo                 PlacableActorInfo;                                 // 0x0310(0x00C0)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture*                               OverrideActorIcon;                                 // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterial*                              IconMaterial;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicIconMaterial;                               // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UIGLE_W_PlacableDescription_C*          PlacableDescription;                               // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x03F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Playing;                                           // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_W_EditorHUD_C*                    Parent;                                            // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Adapt_Placable_Name(const class FText& InText, const class FString& SourceString, class FString* Name_0);
	class FText AdaptName(const class FString& SourceString);
	void BndEvt__IGLE_Example_Button_Translucent_C_142_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__IGLE_Example_Button_Translucent_C_142_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__IGLE_Example_Button_Translucent_C_142_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__IGLE_W_Placable_Button_Play_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__IGLE_W_Placable_IGLE_Example_Button_Translucent_C_142_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ChangeBorderColor(bool Mesh);
	void ExecuteUbergraph_IGLE_W_Placable(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnLoaded_3C8CAF334213C7EA745B5BAC5E21F252(class UObject* Loaded);
	void OnLoaded_A2F3141C49758312B000CCA1CB0E9C38(class UObject* Loaded);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PickMesh(class UIGLE_MeshWidget_C* Self2);
	void PlaySoundEvent();
	void StopSound();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	bool TryGetMusicClass(class UClass** Class_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_Placable_C">();
	}
	static class UIGLE_W_Placable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_Placable_C>();
	}
};
static_assert(alignof(UIGLE_W_Placable_C) == 0x000008, "Wrong alignment on UIGLE_W_Placable_C");
static_assert(sizeof(UIGLE_W_Placable_C) == 0x000418, "Wrong size on UIGLE_W_Placable_C");
static_assert(offsetof(UIGLE_W_Placable_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_Placable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, Border_0) == 0x0002C8, "Member 'UIGLE_W_Placable_C::Border_0' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, Border_1) == 0x0002D0, "Member 'UIGLE_W_Placable_C::Border_1' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, Button_Play) == 0x0002D8, "Member 'UIGLE_W_Placable_C::Button_Play' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, IGLE_Example_Button_Translucent_C_142) == 0x0002E0, "Member 'UIGLE_W_Placable_C::IGLE_Example_Button_Translucent_C_142' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, PlacableIcon) == 0x0002E8, "Member 'UIGLE_W_Placable_C::PlacableIcon' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, PlacableIcon_1) == 0x0002F0, "Member 'UIGLE_W_Placable_C::PlacableIcon_1' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, PlacableName01) == 0x0002F8, "Member 'UIGLE_W_Placable_C::PlacableName01' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, SizeBox_2) == 0x000300, "Member 'UIGLE_W_Placable_C::SizeBox_2' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, SoundText) == 0x000308, "Member 'UIGLE_W_Placable_C::SoundText' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, PlacableActorInfo) == 0x000310, "Member 'UIGLE_W_Placable_C::PlacableActorInfo' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, OverrideActorIcon) == 0x0003D0, "Member 'UIGLE_W_Placable_C::OverrideActorIcon' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, IconMaterial) == 0x0003D8, "Member 'UIGLE_W_Placable_C::IconMaterial' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, DynamicIconMaterial) == 0x0003E0, "Member 'UIGLE_W_Placable_C::DynamicIconMaterial' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, PlacableDescription) == 0x0003E8, "Member 'UIGLE_W_Placable_C::PlacableDescription' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, Name_0) == 0x0003F0, "Member 'UIGLE_W_Placable_C::Name_0' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, Playing) == 0x000408, "Member 'UIGLE_W_Placable_C::Playing' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Placable_C, Parent) == 0x000410, "Member 'UIGLE_W_Placable_C::Parent' has a wrong offset!");

}

