#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_Action_DuplicateSelection

#include "Basic.hpp"

#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function IGLE_Action_DuplicateSelection.IGLE_Action_DuplicateSelection_C.ExecuteUbergraph_IGLE_Action_DuplicateSelection
// 0x0280 (0x0280 - 0x0000)
struct IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEActorReference                    CallFunc_IGLE_MakeActorReference_Reference;        // 0x0028(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_MakeActorReference_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIGLEActorReference                    CallFunc_Array_Get_Item_1;                         // 0x0048(0x0018)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_IGLE_GetActorReference_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEPlacableSave                      CallFunc_IGLE_CreatePlacableSave_OutSave;          // 0x0080(0x00D0)(HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_CreatePlacableSave_ReturnValue;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEPlacableSave                      CallFunc_Array_Get_Item_2;                         // 0x0160(0x00D0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_IGLE_LoadPlacableSave_ReturnValue;        // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEActorReference                    CallFunc_IGLE_MakeActorReference_Reference_1;      // 0x0248(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_MakeActorReference_ReturnValue_1;    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIGLE_Action_ChangeSelection_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection) == 0x000010, "Wrong alignment on IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection");
static_assert(sizeof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection) == 0x000280, "Wrong size on IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, EntryPoint) == 0x000000, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, Temp_int_Array_Index_Variable) == 0x000004, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, Temp_int_Array_Index_Variable_2) == 0x000014, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Array_Get_Item) == 0x000018, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IGLE_MakeActorReference_Reference) == 0x000028, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IGLE_MakeActorReference_Reference' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IGLE_MakeActorReference_ReturnValue) == 0x000040, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IGLE_MakeActorReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IGLE_GetActorReference_ReturnValue) == 0x000068, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IGLE_GetActorReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IGLE_CreatePlacableSave_OutSave) == 0x000080, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IGLE_CreatePlacableSave_OutSave' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IGLE_CreatePlacableSave_ReturnValue) == 0x000150, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IGLE_CreatePlacableSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IsValid_ReturnValue) == 0x000151, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Array_Add_ReturnValue_1) == 0x000154, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Array_Get_Item_2) == 0x000160, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Array_Length_ReturnValue_2) == 0x000230, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IGLE_LoadPlacableSave_ReturnValue) == 0x000238, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IGLE_LoadPlacableSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Less_IntInt_ReturnValue_1) == 0x000240, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IGLE_MakeActorReference_Reference_1) == 0x000248, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IGLE_MakeActorReference_Reference_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_IGLE_MakeActorReference_ReturnValue_1) == 0x000260, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_IGLE_MakeActorReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, Temp_int_Loop_Counter_Variable_2) == 0x000264, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Less_IntInt_ReturnValue_2) == 0x000268, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_Add_IntInt_ReturnValue_2) == 0x00026C, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection, CallFunc_SpawnObject_ReturnValue) == 0x000270, "Member 'IGLE_Action_DuplicateSelection_C_ExecuteUbergraph_IGLE_Action_DuplicateSelection::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function IGLE_Action_DuplicateSelection.IGLE_Action_DuplicateSelection_C.GetFriendlyActionName
// 0x0010 (0x0010 - 0x0000)
struct IGLE_Action_DuplicateSelection_C_GetFriendlyActionName final
{
public:
	class FString                                 OutName;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_Action_DuplicateSelection_C_GetFriendlyActionName) == 0x000008, "Wrong alignment on IGLE_Action_DuplicateSelection_C_GetFriendlyActionName");
static_assert(sizeof(IGLE_Action_DuplicateSelection_C_GetFriendlyActionName) == 0x000010, "Wrong size on IGLE_Action_DuplicateSelection_C_GetFriendlyActionName");
static_assert(offsetof(IGLE_Action_DuplicateSelection_C_GetFriendlyActionName, OutName) == 0x000000, "Member 'IGLE_Action_DuplicateSelection_C_GetFriendlyActionName::OutName' has a wrong offset!");

}

