#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_FloatWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function IGLE_FloatWidget.IGLE_FloatWidget_C.BndEvt__IGLE_FloatWidget_IGLE_SpinBox_C_65_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct IGLE_FloatWidget_C_BndEvt__IGLE_FloatWidget_IGLE_SpinBox_C_65_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_FloatWidget_C_BndEvt__IGLE_FloatWidget_IGLE_SpinBox_C_65_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on IGLE_FloatWidget_C_BndEvt__IGLE_FloatWidget_IGLE_SpinBox_C_65_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(IGLE_FloatWidget_C_BndEvt__IGLE_FloatWidget_IGLE_SpinBox_C_65_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on IGLE_FloatWidget_C_BndEvt__IGLE_FloatWidget_IGLE_SpinBox_C_65_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(IGLE_FloatWidget_C_BndEvt__IGLE_FloatWidget_IGLE_SpinBox_C_65_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'IGLE_FloatWidget_C_BndEvt__IGLE_FloatWidget_IGLE_SpinBox_C_65_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function IGLE_FloatWidget.IGLE_FloatWidget_C.ExecuteUbergraph_IGLE_FloatWidget
// 0x0078 (0x0078 - 0x0000)
struct IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_InValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UIGLE_FloatProperty_C*                  K2Node_DynamicCast_AsIGLE_Float_Property;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FloatProperty_C*                  K2Node_DynamicCast_AsIGLE_Float_Property_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_TryCallOnPropertyValueChanged_Success; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Float_ImplicitCast;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_NewValue_ImplicitCast;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget) == 0x000008, "Wrong alignment on IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget");
static_assert(sizeof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget) == 0x000078, "Wrong size on IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, EntryPoint) == 0x000000, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, K2Node_ComponentBoundEvent_InValue) == 0x000008, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::K2Node_ComponentBoundEvent_InValue' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, K2Node_DynamicCast_AsIGLE_Float_Property) == 0x000020, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::K2Node_DynamicCast_AsIGLE_Float_Property' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, K2Node_DynamicCast_AsIGLE_Float_Property_1) == 0x000030, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::K2Node_DynamicCast_AsIGLE_Float_Property_1' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000040, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000050, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, CallFunc_IGLE_TryCallOnPropertyValueChanged_Success) == 0x000060, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::CallFunc_IGLE_TryCallOnPropertyValueChanged_Success' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, K2Node_VariableSet_Float_ImplicitCast) == 0x000068, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::K2Node_VariableSet_Float_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget, CallFunc_SetValue_NewValue_ImplicitCast) == 0x000070, "Member 'IGLE_FloatWidget_C_ExecuteUbergraph_IGLE_FloatWidget::CallFunc_SetValue_NewValue_ImplicitCast' has a wrong offset!");

}

