#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_Action_PlacePlacable

#include "Basic.hpp"

#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function IGLE_Action_PlacePlacable.IGLE_Action_PlacePlacable_C.ExecuteUbergraph_IGLE_Action_PlacePlacable
// 0x0120 (0x0120 - 0x0000)
struct IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEPlacableSave                      CallFunc_IGLE_CreatePlacableSave_OutSave;          // 0x0010(0x00D0)(HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_CreatePlacableSave_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEActorReference                    CallFunc_IGLE_MakeActorReference_Reference;        // 0x00E8(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_MakeActorReference_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_IGLE_LoadPlacableSave_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_IGLE_GetActorReference_ReturnValue;       // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable) == 0x000010, "Wrong alignment on IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable");
static_assert(sizeof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable) == 0x000120, "Wrong size on IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, EntryPoint) == 0x000000, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IGLE_CreatePlacableSave_OutSave) == 0x000010, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IGLE_CreatePlacableSave_OutSave' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IGLE_CreatePlacableSave_ReturnValue) == 0x0000E0, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IGLE_CreatePlacableSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IsValid_ReturnValue_1) == 0x0000E2, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IGLE_MakeActorReference_Reference) == 0x0000E8, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IGLE_MakeActorReference_Reference' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IGLE_MakeActorReference_ReturnValue) == 0x000100, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IGLE_MakeActorReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IGLE_LoadPlacableSave_ReturnValue) == 0x000108, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IGLE_LoadPlacableSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IGLE_GetActorReference_ReturnValue) == 0x000110, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IGLE_GetActorReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IsValid_ReturnValue_2) == 0x000118, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_IsValid_ReturnValue_3) == 0x000119, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable, CallFunc_Set_Contains_ReturnValue) == 0x00011A, "Member 'IGLE_Action_PlacePlacable_C_ExecuteUbergraph_IGLE_Action_PlacePlacable::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");

// Function IGLE_Action_PlacePlacable.IGLE_Action_PlacePlacable_C.GetFriendlyActionName
// 0x0010 (0x0010 - 0x0000)
struct IGLE_Action_PlacePlacable_C_GetFriendlyActionName final
{
public:
	class FString                                 OutName;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_Action_PlacePlacable_C_GetFriendlyActionName) == 0x000008, "Wrong alignment on IGLE_Action_PlacePlacable_C_GetFriendlyActionName");
static_assert(sizeof(IGLE_Action_PlacePlacable_C_GetFriendlyActionName) == 0x000010, "Wrong size on IGLE_Action_PlacePlacable_C_GetFriendlyActionName");
static_assert(offsetof(IGLE_Action_PlacePlacable_C_GetFriendlyActionName, OutName) == 0x000000, "Member 'IGLE_Action_PlacePlacable_C_GetFriendlyActionName::OutName' has a wrong offset!");

}

