#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_A_RotationGizmo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "IGLE_E_GizmoSpace_structs.hpp"


namespace SDK::Params
{

// Function IGLE_A_RotationGizmo.IGLE_A_RotationGizmo_C.ExecuteUbergraph_IGLE_A_RotationGizmo
// 0x07A0 (0x07A0 - 0x0000)
struct IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AIGLE_A_Gizmo_C*                        K2Node_Event_GizmoOuter;                           // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaX;                // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaY;                // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaX_1;              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaY_1;              // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EIGLE_E_GizmoSpace                            K2Node_Event_New_Gizmo_Space;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_2;                        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaX_2;              // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaY_2;              // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInputMouseDelta_DeltaX_3;              // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaY_3;              // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaX_4;              // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaY_4;              // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_3;                        // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SnapAngle_ReturnValue;                    // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorWorldRotation_SweepHitResult;  // 0x0380(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_SnapAngle_ReturnValue_1;                  // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorWorldRotation_SweepHitResult_1; // 0x0480(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0598(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select_Default;                             // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_Select_Default_1;                           // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x05E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_2;                           // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition_1;    // 0x0678(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue_1;       // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition_2;    // 0x06C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue_2;       // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x06D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ViewSpaceScanLine_Start;                  // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ViewSpaceScanLine_End;                    // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinePlaneIntersection_OriginNormal_T;     // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_LinePlaneIntersection_OriginNormal_Intersection; // 0x0730(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LinePlaneIntersection_OriginNormal_ReturnValue; // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74A[0x6];                                      // 0x074A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast_1;                     // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SnapAngle_Delta_ImplicitCast;             // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SnapAngle_Delta_ImplicitCast_1;           // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo) == 0x000008, "Wrong alignment on IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo");
static_assert(sizeof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo) == 0x0007A0, "Wrong size on IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, EntryPoint) == 0x000000, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, Temp_bool_Variable) == 0x000004, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_bBlockingHit) == 0x000005, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_bInitialOverlap) == 0x000006, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Time) == 0x000008, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Distance) == 0x00000C, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Location) == 0x000010, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ImpactPoint) == 0x000028, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Normal) == 0x000040, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ImpactNormal) == 0x000058, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_PhysMat) == 0x000070, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitActor) == 0x000078, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitComponent) == 0x000080, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitBoneName) == 0x000088, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_BoneName) == 0x000090, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitItem) == 0x000098, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ElementIndex) == 0x00009C, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_FaceIndex) == 0x0000A0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_TraceStart) == 0x0000A8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_TraceEnd) == 0x0000C0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0000D9, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0000DA, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Time_1) == 0x0000DC, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Distance_1) == 0x0000E0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Location_1) == 0x0000E8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000100, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Normal_1) == 0x000118, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000130, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_PhysMat_1) == 0x000148, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitActor_1) == 0x000150, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitComponent_1) == 0x000158, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitBoneName_1) == 0x000160, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_BoneName_1) == 0x000168, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitItem_1) == 0x000170, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ElementIndex_1) == 0x000174, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_FaceIndex_1) == 0x000178, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_TraceStart_1) == 0x000180, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_TraceEnd_1) == 0x000198, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_bBlockingHit_2) == 0x0001B0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x0001B1, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Time_2) == 0x0001B4, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Distance_2) == 0x0001B8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Location_2) == 0x0001C0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ImpactPoint_2) == 0x0001D8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_Normal_2) == 0x0001F0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ImpactNormal_2) == 0x000208, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_PhysMat_2) == 0x000220, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitActor_2) == 0x000228, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitComponent_2) == 0x000230, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitBoneName_2) == 0x000238, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_BoneName_2) == 0x000240, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_BoneName_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_HitItem_2) == 0x000248, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_ElementIndex_2) == 0x00024C, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_ElementIndex_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_FaceIndex_2) == 0x000250, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_FaceIndex_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_TraceStart_2) == 0x000258, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_TraceStart_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakHitResult_TraceEnd_2) == 0x000270, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakHitResult_TraceEnd_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetUpVector_ReturnValue) == 0x000288, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_IsValid_ReturnValue) == 0x0002A0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002A1, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, K2Node_Event_GizmoOuter) == 0x0002A8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::K2Node_Event_GizmoOuter' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetPlayerController_ReturnValue) == 0x0002B0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaX) == 0x0002B8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaX' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaY) == 0x0002BC, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaY' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetPlayerController_ReturnValue_1) == 0x0002C0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002C8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaX_1) == 0x0002D0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaX_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaY_1) == 0x0002D4, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaY_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, K2Node_Event_New_Gizmo_Space) == 0x0002D8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::K2Node_Event_New_Gizmo_Space' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Abs_ReturnValue) == 0x0002E0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Abs_ReturnValue_1) == 0x0002E8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0002F0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Abs_ReturnValue_2) == 0x0002F8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000300, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000308, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetPlayerController_ReturnValue_2) == 0x000310, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaX_2) == 0x000318, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaX_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaY_2) == 0x00031C, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaY_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetPlayerController_ReturnValue_3) == 0x000320, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, Temp_bool_Variable_1) == 0x000328, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaX_3) == 0x00032C, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaX_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaY_3) == 0x000330, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaY_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000338, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetPlayerController_ReturnValue_4) == 0x000340, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000348, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaX_4) == 0x000350, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaX_4' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetInputMouseDelta_DeltaY_4) == 0x000354, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetInputMouseDelta_DeltaY_4' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Abs_ReturnValue_3) == 0x000358, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000360, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_SnapAngle_ReturnValue) == 0x000368, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_SnapAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_K2_AddActorWorldRotation_SweepHitResult) == 0x000380, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_K2_AddActorWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_SnapAngle_ReturnValue_1) == 0x000468, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_SnapAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_K2_AddActorWorldRotation_SweepHitResult_1) == 0x000480, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_K2_AddActorWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetPlayerController_ReturnValue_5) == 0x000568, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetPlayerController_ReturnValue_6) == 0x000570, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000578, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, Temp_bool_Variable_2) == 0x000590, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000598, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x0005A8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakVector2D_X) == 0x0005B0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_BreakVector2D_Y) == 0x0005B8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, K2Node_Select_Default) == 0x0005C0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_FTrunc_ReturnValue) == 0x0005C8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, K2Node_Select_Default_1) == 0x0005D0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_FTrunc_ReturnValue_1) == 0x0005D8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0005E0, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0005E8, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, Temp_real_Variable) == 0x000600, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000608, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, CallFunc_Dot_VectorVector_ReturnValue) == 0x000620, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo, K2Node_Select_Default_2) == 0x000628, "Member 'IGLE_A_RotationGizmo_C_ExecuteUbergraph_IGLE_A_RotationGizmo::K2Node_Select_Default_2' has a wrong offset!");
