#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_PlacableCategoryEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_PlacableCategoryEntry.IGLE_W_PlacableCategoryEntry_C
// 0x0040 (0x0300 - 0x02C0)
class UIGLE_W_PlacableCategoryEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_Example_Button_Opaque_C*          CategoryButton;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CategoryNameText;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_EditorHUD_C*                    Parent;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 CategoryNameInput;                                 // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CategoryButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__IGLE_W_PlacableCategoryEntry_CategoryButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__IGLE_W_PlacableCategoryEntry_CategoryButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void DeselectAll();
	void ExecuteUbergraph_IGLE_W_PlacableCategoryEntry(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_PlacableCategoryEntry_C">();
	}
	static class UIGLE_W_PlacableCategoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_PlacableCategoryEntry_C>();
	}
};
static_assert(alignof(UIGLE_W_PlacableCategoryEntry_C) == 0x000008, "Wrong alignment on UIGLE_W_PlacableCategoryEntry_C");
static_assert(sizeof(UIGLE_W_PlacableCategoryEntry_C) == 0x000300, "Wrong size on UIGLE_W_PlacableCategoryEntry_C");
static_assert(offsetof(UIGLE_W_PlacableCategoryEntry_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_PlacableCategoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableCategoryEntry_C, Border_0) == 0x0002C8, "Member 'UIGLE_W_PlacableCategoryEntry_C::Border_0' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableCategoryEntry_C, CategoryButton) == 0x0002D0, "Member 'UIGLE_W_PlacableCategoryEntry_C::CategoryButton' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableCategoryEntry_C, CategoryNameText) == 0x0002D8, "Member 'UIGLE_W_PlacableCategoryEntry_C::CategoryNameText' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableCategoryEntry_C, Parent) == 0x0002E0, "Member 'UIGLE_W_PlacableCategoryEntry_C::Parent' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableCategoryEntry_C, CategoryNameInput) == 0x0002E8, "Member 'UIGLE_W_PlacableCategoryEntry_C::CategoryNameInput' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableCategoryEntry_C, Selected) == 0x0002F8, "Member 'UIGLE_W_PlacableCategoryEntry_C::Selected' has a wrong offset!");

}

