#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_Placable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function IGLE_W_Placable.IGLE_W_Placable_C.Adapt Placable Name
// 0x01F0 (0x01F0 - 0x0000)
struct IGLE_W_Placable_C_Adapt_Placable_Name final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 SourceString;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         InitialString;                                     // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         NameArray;                                         // 0x0048(0x0010)(Edit, BlueprintVisible)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x00E8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_1;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToUpper_ReturnValue;                      // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_3;                    // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_4;                    // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_5;                    // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ToLower_ReturnValue;                      // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Placable_C_Adapt_Placable_Name) == 0x000008, "Wrong alignment on IGLE_W_Placable_C_Adapt_Placable_Name");
static_assert(sizeof(IGLE_W_Placable_C_Adapt_Placable_Name) == 0x0001F0, "Wrong size on IGLE_W_Placable_C_Adapt_Placable_Name");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, InText) == 0x000000, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::InText' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, SourceString) == 0x000018, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::SourceString' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, Name_0) == 0x000028, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::Name_0' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, InitialString) == 0x000038, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::InitialString' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, NameArray) == 0x000048, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::NameArray' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Replace_ReturnValue) == 0x000058, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, Temp_int_Array_Index_Variable) == 0x000068, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_GetSubstring_ReturnValue) == 0x000070, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000084, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Len_ReturnValue) == 0x000088, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_SelectString_ReturnValue) == 0x000098, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C0, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D8, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x0000E8, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_IsNumeric_ReturnValue) == 0x000108, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_IsNumeric_ReturnValue_1) == 0x000124, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_IsNumeric_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Less_IntInt_ReturnValue) == 0x000125, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Replace_ReturnValue_1) == 0x000128, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000138, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_ToUpper_ReturnValue) == 0x000148, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_ToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Replace_ReturnValue_2) == 0x000158, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Replace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000168, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_JoinStringArray_ReturnValue) == 0x000170, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Replace_ReturnValue_3) == 0x000180, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Replace_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Array_Get_Item_2) == 0x000190, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Replace_ReturnValue_4) == 0x0001A0, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Replace_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_IsEmpty_ReturnValue) == 0x0001B0, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Replace_ReturnValue_5) == 0x0001B8, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Replace_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Not_PreBool_ReturnValue) == 0x0001C8, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_ToLower_ReturnValue) == 0x0001D0, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_ToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0001E0, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Array_Add_ReturnValue) == 0x0001E4, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_BooleanAND_ReturnValue) == 0x0001E8, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_Adapt_Placable_Name, CallFunc_Array_Add_ReturnValue_1) == 0x0001EC, "Member 'IGLE_W_Placable_C_Adapt_Placable_Name::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function IGLE_W_Placable.IGLE_W_Placable_C.AdaptName
// 0x0090 (0x0090 - 0x0000)
struct IGLE_W_Placable_C_AdaptName final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
};
static_assert(alignof(IGLE_W_Placable_C_AdaptName) == 0x000008, "Wrong alignment on IGLE_W_Placable_C_AdaptName");
static_assert(sizeof(IGLE_W_Placable_C_AdaptName) == 0x000090, "Wrong size on IGLE_W_Placable_C_AdaptName");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, SourceString) == 0x000000, "Member 'IGLE_W_Placable_C_AdaptName::SourceString' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, ReturnValue) == 0x000010, "Member 'IGLE_W_Placable_C_AdaptName::ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, CallFunc_Replace_ReturnValue) == 0x000028, "Member 'IGLE_W_Placable_C_AdaptName::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, CallFunc_Len_ReturnValue) == 0x000038, "Member 'IGLE_W_Placable_C_AdaptName::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, CallFunc_GetSubstring_ReturnValue) == 0x000040, "Member 'IGLE_W_Placable_C_AdaptName::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'IGLE_W_Placable_C_AdaptName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, CallFunc_SelectString_ReturnValue) == 0x000058, "Member 'IGLE_W_Placable_C_AdaptName::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'IGLE_W_Placable_C_AdaptName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_AdaptName, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'IGLE_W_Placable_C_AdaptName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function IGLE_W_Placable.IGLE_W_Placable_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct IGLE_W_Placable_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Placable_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on IGLE_W_Placable_C_BP_OnItemExpansionChanged");
static_assert(sizeof(IGLE_W_Placable_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on IGLE_W_Placable_C_BP_OnItemExpansionChanged");
static_assert(offsetof(IGLE_W_Placable_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'IGLE_W_Placable_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function IGLE_W_Placable.IGLE_W_Placable_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct IGLE_W_Placable_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Placable_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on IGLE_W_Placable_C_BP_OnItemSelectionChanged");
static_assert(sizeof(IGLE_W_Placable_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on IGLE_W_Placable_C_BP_OnItemSelectionChanged");
static_assert(offsetof(IGLE_W_Placable_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'IGLE_W_Placable_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function IGLE_W_Placable.IGLE_W_Placable_C.ChangeBorderColor
// 0x0001 (0x0001 - 0x0000)
struct IGLE_W_Placable_C_ChangeBorderColor final
{
public:
	bool                                          Mesh;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Placable_C_ChangeBorderColor) == 0x000001, "Wrong alignment on IGLE_W_Placable_C_ChangeBorderColor");
static_assert(sizeof(IGLE_W_Placable_C_ChangeBorderColor) == 0x000001, "Wrong size on IGLE_W_Placable_C_ChangeBorderColor");
static_assert(offsetof(IGLE_W_Placable_C_ChangeBorderColor, Mesh) == 0x000000, "Member 'IGLE_W_Placable_C_ChangeBorderColor::Mesh' has a wrong offset!");

// Function IGLE_W_Placable.IGLE_W_Placable_C.ExecuteUbergraph_IGLE_W_Placable
// 0x0338 (0x0338 - 0x0000)
struct IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetMusicClass_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_TryGetMusicClass_Class;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)(ConstParm)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIGLE_Pawn_Example_C*                   CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_MyPlayerController_AsPlayer_Controller;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIGLE_W_PlacableDescription_C*          CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMousePosition_LocationX;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePosition_LocationY;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMousePosition_ReturnValue;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example;            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example_1;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example_2;          // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example_3;          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UIGLE_W_Placable_C*>             CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UIGLE_W_Placable_C*                     CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIGLEPlacableActorInfo                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x01F8(0x00C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Adapt_Placable_Name_Name;                 // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02D0(0x0018)()
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIGLE_W_Placable_C*                     K2Node_DynamicCast_AsIGLE_W_Placable;              // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Mesh;                           // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x030C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetMusicClass_ReturnValue_1;           // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E[0x2];                                      // 0x031E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_TryGetMusicClass_Class_1;                 // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable) == 0x000008, "Wrong alignment on IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable");
static_assert(sizeof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable) == 0x000338, "Wrong size on IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, EntryPoint) == 0x000000, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_TryGetMusicClass_ReturnValue) == 0x000004, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_TryGetMusicClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_TryGetMusicClass_Class) == 0x000008, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_TryGetMusicClass_Class' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_CustomEvent_Loaded_1) == 0x000010, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, Temp_object_Variable) == 0x000018, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_AsSound_Base) == 0x000020, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, Temp_text_Variable) == 0x000030, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_CustomEvent_Loaded) == 0x000048, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, Temp_object_Variable_1) == 0x000050, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_AsTexture_2D) == 0x000058, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, Temp_int_Array_Index_Variable) == 0x000064, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_Event_bIsExpanded) == 0x000068, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_Event_bIsSelected) == 0x000069, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IsValid_ReturnValue) == 0x00006A, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00006B, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn) == 0x000070, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IGLE_TryGetEditorPawn_IGLE_Editor_Pawn' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_MyPlayerController_AsPlayer_Controller) == 0x000078, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_MyPlayerController_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000088, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_ClassDynamicCast_AsActor) == 0x000098, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_ClassDynamicCast_bSuccess) == 0x0000A0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Len_ReturnValue) == 0x0000C0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C4, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_Event_MyGeometry) == 0x0000C8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_Event_InDeltaTime) == 0x000100, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000108, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IsValid_ReturnValue_3) == 0x000110, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetMousePosition_LocationX) == 0x000114, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetMousePosition_LocationX' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetMousePosition_LocationY) == 0x000118, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetMousePosition_LocationY' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetMousePosition_ReturnValue) == 0x00011C, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetMousePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_MakeVector2D_ReturnValue) == 0x000120, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IsEmpty_ReturnValue) == 0x000130, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetPlayerPawn_ReturnValue) == 0x000138, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_AsIGLE_Pawn_Example) == 0x000140, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_AsIGLE_Pawn_Example' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IsValid_ReturnValue_4) == 0x000149, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, Temp_int_Loop_Counter_Variable) == 0x00014C, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000150, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_AsIGLE_Pawn_Example_1) == 0x000158, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_AsIGLE_Pawn_Example_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000168, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_AsIGLE_Pawn_Example_2) == 0x000170, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_AsIGLE_Pawn_Example_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_bSuccess_4) == 0x000178, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetPlayerPawn_ReturnValue_3) == 0x000180, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_AsIGLE_Pawn_Example_3) == 0x000188, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_AsIGLE_Pawn_Example_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_bSuccess_5) == 0x000190, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000198, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Less_IntInt_ReturnValue) == 0x0001B4, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_CreateDelegate_OutputDelegate) == 0x0001B8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Replace_ReturnValue) == 0x0001C8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_IsValid_ReturnValue_5) == 0x0001D8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Concat_StrStr_ReturnValue) == 0x0001E0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Conv_StringToName_ReturnValue) == 0x0001F0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001F8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002B8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Adapt_Placable_Name_Name) == 0x0002C0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Adapt_Placable_Name_Name' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Conv_StringToText_ReturnValue) == 0x0002D0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_Event_ListItemObject) == 0x0002E8, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002F0, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_AsIGLE_W_Placable) == 0x000300, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_AsIGLE_W_Placable' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_DynamicCast_bSuccess_6) == 0x000308, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, K2Node_CustomEvent_Mesh) == 0x000309, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_SelectColor_ReturnValue) == 0x00030C, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_Contains_ReturnValue) == 0x00031C, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_TryGetMusicClass_ReturnValue_1) == 0x00031D, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_TryGetMusicClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable, CallFunc_TryGetMusicClass_Class_1) == 0x000320, "Member 'IGLE_W_Placable_C_ExecuteUbergraph_IGLE_W_Placable::CallFunc_TryGetMusicClass_Class_1' has a wrong offset!");
