#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_ActionLogEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_ActionLogEntry.IGLE_W_ActionLogEntry_C
// 0x0030 (0x02F0 - 0x02C0)
class UIGLE_W_ActionLogEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ActionTextBlock;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Delay;                                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_IGLE_W_ActionLogEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_ActionLogEntry_C">();
	}
	static class UIGLE_W_ActionLogEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_ActionLogEntry_C>();
	}
};
static_assert(alignof(UIGLE_W_ActionLogEntry_C) == 0x000008, "Wrong alignment on UIGLE_W_ActionLogEntry_C");
static_assert(sizeof(UIGLE_W_ActionLogEntry_C) == 0x0002F0, "Wrong size on UIGLE_W_ActionLogEntry_C");
static_assert(offsetof(UIGLE_W_ActionLogEntry_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_ActionLogEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ActionLogEntry_C, FadeIn) == 0x0002C8, "Member 'UIGLE_W_ActionLogEntry_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ActionLogEntry_C, ActionTextBlock) == 0x0002D0, "Member 'UIGLE_W_ActionLogEntry_C::ActionTextBlock' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ActionLogEntry_C, Text) == 0x0002D8, "Member 'UIGLE_W_ActionLogEntry_C::Text' has a wrong offset!");
static_assert(offsetof(UIGLE_W_ActionLogEntry_C, Delay) == 0x0002E8, "Member 'UIGLE_W_ActionLogEntry_C::Delay' has a wrong offset!");

}

