#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_Action_TransformSelection

#include "Basic.hpp"

#include "InGameLevelEditor_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function IGLE_Action_TransformSelection.IGLE_Action_TransformSelection_C.ExecuteUbergraph_IGLE_Action_TransformSelection
// 0x0288 (0x0288 - 0x0000)
struct IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEActorReference                    CallFunc_IGLE_MakeActorReference_Reference;        // 0x0038(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_MakeActorReference_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIGLEActorReference                    CallFunc_Array_Get_Item_1;                         // 0x0058(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FIGLEActorReference                    CallFunc_Array_Get_Item_2;                         // 0x0070(0x0018)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_IGLE_GetActorReference_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_IGLE_GetActorReference_ReturnValue_1;     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x0190(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection) == 0x000008, "Wrong alignment on IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection");
static_assert(sizeof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection) == 0x000288, "Wrong size on IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, EntryPoint) == 0x000000, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, Temp_int_Array_Index_Variable) == 0x000004, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Array_Get_Item) == 0x000028, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_IGLE_MakeActorReference_Reference) == 0x000038, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_IGLE_MakeActorReference_Reference' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_IGLE_MakeActorReference_ReturnValue) == 0x000050, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_IGLE_MakeActorReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Array_Get_Item_2) == 0x000070, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_IGLE_GetActorReference_ReturnValue) == 0x000088, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_IGLE_GetActorReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_IGLE_GetActorReference_ReturnValue_1) == 0x000090, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_IGLE_GetActorReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000A0, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000188, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x000190, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x000278, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Array_Length_ReturnValue_1) == 0x00027C, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Array_Length_ReturnValue_2) == 0x000280, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Less_IntInt_ReturnValue_1) == 0x000284, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection, CallFunc_Less_IntInt_ReturnValue_2) == 0x000285, "Member 'IGLE_Action_TransformSelection_C_ExecuteUbergraph_IGLE_Action_TransformSelection::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function IGLE_Action_TransformSelection.IGLE_Action_TransformSelection_C.GetFriendlyActionName
// 0x0010 (0x0010 - 0x0000)
struct IGLE_Action_TransformSelection_C_GetFriendlyActionName final
{
public:
	class FString                                 OutName;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_Action_TransformSelection_C_GetFriendlyActionName) == 0x000008, "Wrong alignment on IGLE_Action_TransformSelection_C_GetFriendlyActionName");
static_assert(sizeof(IGLE_Action_TransformSelection_C_GetFriendlyActionName) == 0x000010, "Wrong size on IGLE_Action_TransformSelection_C_GetFriendlyActionName");
static_assert(offsetof(IGLE_Action_TransformSelection_C_GetFriendlyActionName, OutName) == 0x000000, "Member 'IGLE_Action_TransformSelection_C_GetFriendlyActionName::OutName' has a wrong offset!");

}

