#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_PropertyPannelEntry

#include "Basic.hpp"

#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function IGLE_W_PropertyPannelEntry.IGLE_W_PropertyPannelEntry_C.ExecuteUbergraph_IGLE_W_PropertyPannelEntry
// 0x0120 (0x0120 - 0x0000)
struct IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_PropertyValueObject*              CallFunc_GetPropertyValueByName_Value;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyValueByName_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIGLE_PropertyValueObject_Base_C*       K2Node_DynamicCast_AsIGLE_Property_Value_Object_Base; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsIGLE_W_Property_Value_Widget_Base; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEProperty                          CallFunc_GetPropertyByName_Property;               // 0x0040(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyByName_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_W_PropertyValueWidgetBase_C*      CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_InterfaceComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot;                 // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry) == 0x000008, "Wrong alignment on IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry");
static_assert(sizeof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry) == 0x000120, "Wrong size on IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, EntryPoint) == 0x000000, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_GetPropertyValueByName_Value) == 0x000008, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_GetPropertyValueByName_Value' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_GetPropertyValueByName_ReturnValue) == 0x000010, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_GetPropertyValueByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, K2Node_DynamicCast_AsIGLE_Property_Value_Object_Base) == 0x000020, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::K2Node_DynamicCast_AsIGLE_Property_Value_Object_Base' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, K2Node_ClassDynamicCast_AsIGLE_W_Property_Value_Widget_Base) == 0x000030, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::K2Node_ClassDynamicCast_AsIGLE_W_Property_Value_Widget_Base' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, K2Node_ClassDynamicCast_bSuccess) == 0x000038, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_GetPropertyByName_Property) == 0x000040, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_GetPropertyByName_Property' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_GetPropertyByName_ReturnValue) == 0x0000C0, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_GetPropertyByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_IsValidClass_ReturnValue) == 0x0000D0, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_GetComponentByClass_ReturnValue) == 0x0000F8, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, CallFunc_AddChild_ReturnValue) == 0x000108, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, K2Node_DynamicCast_AsOverlay_Slot) == 0x000110, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::K2Node_DynamicCast_AsOverlay_Slot' has a wrong offset!");
static_assert(offsetof(IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'IGLE_W_PropertyPannelEntry_C_ExecuteUbergraph_IGLE_W_PropertyPannelEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

