#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_Vec3Edit

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000004, "Wrong alignment on IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(sizeof(IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000008, "Wrong size on IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature, InValue) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature::InValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature, CommitMethod) == 0x000004, "Member 'IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000004, "Wrong alignment on IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(sizeof(IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000008, "Wrong size on IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature, InValue) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature::InValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature, CommitMethod) == 0x000004, "Member 'IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000004, "Wrong alignment on IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(sizeof(IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000008, "Wrong size on IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature, InValue) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature::InValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature, CommitMethod) == 0x000004, "Member 'IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.BreakAndTruncateVector
// 0x00E0 (0x00E0 - 0x0000)
struct IGLE_W_Vec3Edit_C_BreakAndTruncateVector final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ForcedDecimalPlaces;                               // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        X_0;                                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y_0;                                               // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Z_0;                                               // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0050(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0068(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x00B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_2;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector) == 0x000008, "Wrong alignment on IGLE_W_Vec3Edit_C_BreakAndTruncateVector");
static_assert(sizeof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector) == 0x0000E0, "Wrong size on IGLE_W_Vec3Edit_C_BreakAndTruncateVector");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, Vector) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::Vector' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, ForcedDecimalPlaces) == 0x000018, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::ForcedDecimalPlaces' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, X_0) == 0x000020, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::X_0' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, Y_0) == 0x000028, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::Y_0' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, Z_0) == 0x000030, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::Z_0' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_BreakVector_X) == 0x000038, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_BreakVector_Y) == 0x000040, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_BreakVector_Z) == 0x000048, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000050, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000068, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000090, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_StringToDouble_ReturnValue) == 0x0000A0, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_StringToDouble_ReturnValue_1) == 0x0000A8, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_StringToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x0000B0, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000C8, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_BreakAndTruncateVector, CallFunc_Conv_StringToDouble_ReturnValue_2) == 0x0000D8, "Member 'IGLE_W_Vec3Edit_C_BreakAndTruncateVector::CallFunc_Conv_StringToDouble_ReturnValue_2' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.CallOnVectorValueChanged
// 0x0018 (0x0018 - 0x0000)
struct IGLE_W_Vec3Edit_C_CallOnVectorValueChanged final
{
public:
	struct FVector                                NewValue;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_CallOnVectorValueChanged) == 0x000008, "Wrong alignment on IGLE_W_Vec3Edit_C_CallOnVectorValueChanged");
static_assert(sizeof(IGLE_W_Vec3Edit_C_CallOnVectorValueChanged) == 0x000018, "Wrong size on IGLE_W_Vec3Edit_C_CallOnVectorValueChanged");
static_assert(offsetof(IGLE_W_Vec3Edit_C_CallOnVectorValueChanged, NewValue) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_CallOnVectorValueChanged::NewValue' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.ExecuteUbergraph_IGLE_W_Vec3Edit
// 0x01C8 (0x01C8 - 0x0000)
struct IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NewValue;                       // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_4;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_3;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_5;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue_1;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue_2;            // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_InValue_2;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_2;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_3;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_1;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_1;         // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_5;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue;                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_VectorValue;                    // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast_1;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast_1;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_1;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit) == 0x000008, "Wrong alignment on IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit");
static_assert(sizeof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit) == 0x0001C8, "Wrong size on IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, EntryPoint) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_CustomEvent_NewValue) == 0x000008, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_X) == 0x000020, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Y) == 0x000028, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Z) == 0x000030, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_X_1) == 0x000038, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Y_1) == 0x000040, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Z_1) == 0x000048, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_X_2) == 0x000050, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Y_2) == 0x000058, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Z_2) == 0x000060, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_InValue_4) == 0x000068, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_InValue_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_InValue_3) == 0x000088, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_InValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_ReturnValue_1) == 0x000090, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_InValue_5) == 0x0000A8, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_InValue_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_ReturnValue_2) == 0x0000B0, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_HasAnyUserFocus_ReturnValue) == 0x0000C8, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_HasAnyUserFocus_ReturnValue_1) == 0x0000C9, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_HasAnyUserFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_HasAnyUserFocus_ReturnValue_2) == 0x0000CA, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_HasAnyUserFocus_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_InValue_2) == 0x0000CC, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_InValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_CommitMethod_2) == 0x0000D0, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_CommitMethod_2' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_X_3) == 0x0000D8, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Y_3) == 0x0000E0, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Z_3) == 0x0000E8, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_X_4) == 0x0000F0, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Y_4) == 0x0000F8, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Z_4) == 0x000100, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_ReturnValue_3) == 0x000108, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_InValue_1) == 0x000120, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_InValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_CommitMethod_1) == 0x000124, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_CommitMethod_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_ReturnValue_4) == 0x000128, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_X_5) == 0x000140, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Y_5) == 0x000148, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_BreakVector_Z_5) == 0x000150, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_InValue) == 0x000158, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_InValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_ComponentBoundEvent_CommitMethod) == 0x00015C, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_CustomEvent_VectorValue) == 0x000160, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_CustomEvent_VectorValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_ReturnValue_5) == 0x000178, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, K2Node_Event_IsDesignTime) == 0x000190, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_Y_ImplicitCast) == 0x000198, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_X_ImplicitCast) == 0x0001A0, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_Z_ImplicitCast) == 0x0001A8, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_X_ImplicitCast_1) == 0x0001B0, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_X_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_Y_ImplicitCast_1) == 0x0001B8, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_Y_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit, CallFunc_MakeVector_Z_ImplicitCast_1) == 0x0001C0, "Member 'IGLE_W_Vec3Edit_C_ExecuteUbergraph_IGLE_W_Vec3Edit::CallFunc_MakeVector_Z_ImplicitCast_1' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.OnVectorValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct IGLE_W_Vec3Edit_C_OnVectorValueChanged__DelegateSignature final
{
public:
	struct FVector                                NewValue;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_OnVectorValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on IGLE_W_Vec3Edit_C_OnVectorValueChanged__DelegateSignature");
static_assert(sizeof(IGLE_W_Vec3Edit_C_OnVectorValueChanged__DelegateSignature) == 0x000018, "Wrong size on IGLE_W_Vec3Edit_C_OnVectorValueChanged__DelegateSignature");
static_assert(offsetof(IGLE_W_Vec3Edit_C_OnVectorValueChanged__DelegateSignature, NewValue) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_OnVectorValueChanged__DelegateSignature::NewValue' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct IGLE_W_Vec3Edit_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_PreConstruct) == 0x000001, "Wrong alignment on IGLE_W_Vec3Edit_C_PreConstruct");
static_assert(sizeof(IGLE_W_Vec3Edit_C_PreConstruct) == 0x000001, "Wrong size on IGLE_W_Vec3Edit_C_PreConstruct");
static_assert(offsetof(IGLE_W_Vec3Edit_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C.UpdateVectorValue
// 0x0018 (0x0018 - 0x0000)
struct IGLE_W_Vec3Edit_C_UpdateVectorValue final
{
public:
	struct FVector                                VectorValue_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_Vec3Edit_C_UpdateVectorValue) == 0x000008, "Wrong alignment on IGLE_W_Vec3Edit_C_UpdateVectorValue");
static_assert(sizeof(IGLE_W_Vec3Edit_C_UpdateVectorValue) == 0x000018, "Wrong size on IGLE_W_Vec3Edit_C_UpdateVectorValue");
static_assert(offsetof(IGLE_W_Vec3Edit_C_UpdateVectorValue, VectorValue_0) == 0x000000, "Member 'IGLE_W_Vec3Edit_C_UpdateVectorValue::VectorValue_0' has a wrong offset!");

}

