#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_A_FollowingGrid

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass IGLE_A_FollowingGrid.IGLE_A_FollowingGrid_C
// 0x0048 (0x02E0 - 0x0298)
class AIGLE_A_FollowingGrid_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Plane;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        PrimaryGridLineWidth;                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        SecondaryGridSize;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        SecondaryGridLineWidth;                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PrimaryGridSize;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     GridMaterial;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GridMatInstance;                                   // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ConstantZLocation;                                 // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateGrid();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_A_FollowingGrid_C">();
	}
	static class AIGLE_A_FollowingGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIGLE_A_FollowingGrid_C>();
	}
};
static_assert(alignof(AIGLE_A_FollowingGrid_C) == 0x000008, "Wrong alignment on AIGLE_A_FollowingGrid_C");
static_assert(sizeof(AIGLE_A_FollowingGrid_C) == 0x0002E0, "Wrong size on AIGLE_A_FollowingGrid_C");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, Plane) == 0x000298, "Member 'AIGLE_A_FollowingGrid_C::Plane' has a wrong offset!");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, DefaultSceneRoot) == 0x0002A0, "Member 'AIGLE_A_FollowingGrid_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, PrimaryGridLineWidth) == 0x0002A8, "Member 'AIGLE_A_FollowingGrid_C::PrimaryGridLineWidth' has a wrong offset!");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, SecondaryGridSize) == 0x0002B0, "Member 'AIGLE_A_FollowingGrid_C::SecondaryGridSize' has a wrong offset!");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, SecondaryGridLineWidth) == 0x0002B8, "Member 'AIGLE_A_FollowingGrid_C::SecondaryGridLineWidth' has a wrong offset!");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, PrimaryGridSize) == 0x0002C0, "Member 'AIGLE_A_FollowingGrid_C::PrimaryGridSize' has a wrong offset!");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, GridMaterial) == 0x0002C8, "Member 'AIGLE_A_FollowingGrid_C::GridMaterial' has a wrong offset!");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, GridMatInstance) == 0x0002D0, "Member 'AIGLE_A_FollowingGrid_C::GridMatInstance' has a wrong offset!");
static_assert(offsetof(AIGLE_A_FollowingGrid_C, ConstantZLocation) == 0x0002D8, "Member 'AIGLE_A_FollowingGrid_C::ConstantZLocation' has a wrong offset!");

}

