#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_BoolFalseWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "IGLE_W_PropertyValueWidgetBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_BoolFalseWidget.IGLE_BoolFalseWidget_C
// 0x0020 (0x02E8 - 0x02C8)
class UIGLE_BoolFalseWidget_C final : public UIGLE_W_PropertyValueWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_25;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_139;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Check;                                             // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__IGLE_BoolWidget_Button_25_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Check_Uncheck(bool Index_0);
	void Construct();
	void ExecuteUbergraph_IGLE_BoolFalseWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_BoolFalseWidget_C">();
	}
	static class UIGLE_BoolFalseWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_BoolFalseWidget_C>();
	}
};
static_assert(alignof(UIGLE_BoolFalseWidget_C) == 0x000008, "Wrong alignment on UIGLE_BoolFalseWidget_C");
static_assert(sizeof(UIGLE_BoolFalseWidget_C) == 0x0002E8, "Wrong size on UIGLE_BoolFalseWidget_C");
static_assert(offsetof(UIGLE_BoolFalseWidget_C, UberGraphFrame) == 0x0002C8, "Member 'UIGLE_BoolFalseWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_BoolFalseWidget_C, Button_25) == 0x0002D0, "Member 'UIGLE_BoolFalseWidget_C::Button_25' has a wrong offset!");
static_assert(offsetof(UIGLE_BoolFalseWidget_C, Image_139) == 0x0002D8, "Member 'UIGLE_BoolFalseWidget_C::Image_139' has a wrong offset!");
static_assert(offsetof(UIGLE_BoolFalseWidget_C, Check) == 0x0002E0, "Member 'UIGLE_BoolFalseWidget_C::Check' has a wrong offset!");

}

