#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_EditorPauseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_EditorPauseMenu.IGLE_W_EditorPauseMenu_C
// 0x0040 (0x0300 - 0x02C0)
class UIGLE_W_EditorPauseMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIGLE_Example_Button_Opaque_C*          CrossExitButton;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentLevelText;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_W_ControlScheme_C*                IGLE_W_ControlScheme;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_Example_Button_Translucent_C*     PauseMenuExitButton;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_Example_Button_Opaque_C*          SaveAndPlayButton;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_Example_Button_Opaque_C*          SaveAndQuitButton;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_93;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__CrossExitButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__IGLE_W_EditorPauseMenu_Slider_93_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__PauseMenuExitButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SaveAndPlayButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SaveAndQuitButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_IGLE_W_EditorPauseMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_EditorPauseMenu_C">();
	}
	static class UIGLE_W_EditorPauseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_EditorPauseMenu_C>();
	}
};
static_assert(alignof(UIGLE_W_EditorPauseMenu_C) == 0x000008, "Wrong alignment on UIGLE_W_EditorPauseMenu_C");
static_assert(sizeof(UIGLE_W_EditorPauseMenu_C) == 0x000300, "Wrong size on UIGLE_W_EditorPauseMenu_C");
static_assert(offsetof(UIGLE_W_EditorPauseMenu_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_EditorPauseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorPauseMenu_C, CrossExitButton) == 0x0002C8, "Member 'UIGLE_W_EditorPauseMenu_C::CrossExitButton' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorPauseMenu_C, CurrentLevelText) == 0x0002D0, "Member 'UIGLE_W_EditorPauseMenu_C::CurrentLevelText' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorPauseMenu_C, IGLE_W_ControlScheme) == 0x0002D8, "Member 'UIGLE_W_EditorPauseMenu_C::IGLE_W_ControlScheme' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorPauseMenu_C, PauseMenuExitButton) == 0x0002E0, "Member 'UIGLE_W_EditorPauseMenu_C::PauseMenuExitButton' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorPauseMenu_C, SaveAndPlayButton) == 0x0002E8, "Member 'UIGLE_W_EditorPauseMenu_C::SaveAndPlayButton' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorPauseMenu_C, SaveAndQuitButton) == 0x0002F0, "Member 'UIGLE_W_EditorPauseMenu_C::SaveAndQuitButton' has a wrong offset!");
static_assert(offsetof(UIGLE_W_EditorPauseMenu_C, Slider_93) == 0x0002F8, "Member 'UIGLE_W_EditorPauseMenu_C::Slider_93' has a wrong offset!");

}

