#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_Action_ChangeSelection

#include "Basic.hpp"

#include "IGLE_ActionBuffer_Base_classes.hpp"
#include "InGameLevelEditor_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IGLE_Action_ChangeSelection.IGLE_Action_ChangeSelection_C
// 0x0150 (0x0188 - 0x0038)
class UIGLE_Action_ChangeSelection_C final : public UIGLE_ActionBuffer_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IGLE_Action_ChangeSelection_C;      // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSet<class AActor*>                           OldSelection;                                      // 0x0040(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	TSet<class AActor*>                           NewSelection;                                      // 0x0090(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	TSet<struct FIGLEActorReference>              OldSelection_Refs;                                 // 0x00E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<struct FIGLEActorReference>              NewSelection_Refs;                                 // 0x0130(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AIGLE_Pawn_EditorBase_C*                EditorPawn;                                        // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IGLE_Action_ChangeSelection(int32 EntryPoint);
	void GetFriendlyActionName(class FString* OutName);
	void Initialize();
	void RedoAction();
	void RedoSelection();
	void UndoAction();
	void UndoSelection();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_Action_ChangeSelection_C">();
	}
	static class UIGLE_Action_ChangeSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_Action_ChangeSelection_C>();
	}
};
static_assert(alignof(UIGLE_Action_ChangeSelection_C) == 0x000008, "Wrong alignment on UIGLE_Action_ChangeSelection_C");
static_assert(sizeof(UIGLE_Action_ChangeSelection_C) == 0x000188, "Wrong size on UIGLE_Action_ChangeSelection_C");
static_assert(offsetof(UIGLE_Action_ChangeSelection_C, UberGraphFrame_IGLE_Action_ChangeSelection_C) == 0x000038, "Member 'UIGLE_Action_ChangeSelection_C::UberGraphFrame_IGLE_Action_ChangeSelection_C' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_ChangeSelection_C, OldSelection) == 0x000040, "Member 'UIGLE_Action_ChangeSelection_C::OldSelection' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_ChangeSelection_C, NewSelection) == 0x000090, "Member 'UIGLE_Action_ChangeSelection_C::NewSelection' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_ChangeSelection_C, OldSelection_Refs) == 0x0000E0, "Member 'UIGLE_Action_ChangeSelection_C::OldSelection_Refs' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_ChangeSelection_C, NewSelection_Refs) == 0x000130, "Member 'UIGLE_Action_ChangeSelection_C::NewSelection_Refs' has a wrong offset!");
static_assert(offsetof(UIGLE_Action_ChangeSelection_C, EditorPawn) == 0x000180, "Member 'UIGLE_Action_ChangeSelection_C::EditorPawn' has a wrong offset!");

}

