#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_A_ExamplePlacableIconMaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function IGLE_A_ExamplePlacableIconMaker.IGLE_A_ExamplePlacableIconMaker_C.CapturePlacableIcons
// 0x05C0 (0x05C0 - 0x0000)
struct IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons final
{
public:
	TArray<class AActor*>                         TempActors;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<class UClass*, class UTexture*>          ActorClassToIconMap;                               // 0x0010(0x0050)(Parm, OutParm)
	class UMaterialInstanceDynamic*               CompositeMaterial;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CurrentCompositeRenderTarget;                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CurrentDepthRenderTarget;                          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        InitialFOV;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BoundsScale;                                       // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CaptureDistanceAwayFromMaxPoint;                   // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CaptureOrientation;                                // 0x0090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTextureRenderTarget2D*                 CurrentRenderTarget;                               // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentlyDrawingActor;                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TSet<class UClass*>                           PlacableClassesWithNoIcon;                         // 0x00C8(0x0050)(Edit, BlueprintVisible)
	TMap<class UClass*, class UTexture*>          Icons;                                             // 0x0118(0x0050)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_1;       // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_2;       // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0200(0x0010)(NoDestructor)
	TArray<struct FWeightedBlendable>             K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0220(0x0010)()
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin_1;                  // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent_1;               // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x02B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x03C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x04B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_RuntimeSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIGLEPlacableActorInfo>         CallFunc_Set_ToArray_Result;                       // 0x04D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEPlacableActorInfo                 CallFunc_Array_Get_Item_1;                         // 0x04F0(0x00C0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x05B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B6[0x2];                                      // 0x05B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_FOVAngle_ImplicitCast;          // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOuterConeAngle_NewOuterConeAngle_ImplicitCast; // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons) == 0x000008, "Wrong alignment on IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons");
static_assert(sizeof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons) == 0x0005C0, "Wrong size on IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, TempActors) == 0x000000, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::TempActors' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, ActorClassToIconMap) == 0x000010, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::ActorClassToIconMap' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CompositeMaterial) == 0x000060, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CompositeMaterial' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CurrentCompositeRenderTarget) == 0x000068, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CurrentCompositeRenderTarget' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CurrentDepthRenderTarget) == 0x000070, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CurrentDepthRenderTarget' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, InitialFOV) == 0x000078, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::InitialFOV' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, BoundsScale) == 0x000080, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::BoundsScale' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CaptureDistanceAwayFromMaxPoint) == 0x000088, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CaptureDistanceAwayFromMaxPoint' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CaptureOrientation) == 0x000090, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CaptureOrientation' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CurrentRenderTarget) == 0x0000A8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CurrentRenderTarget' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, IconSize) == 0x0000B0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::IconSize' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CurrentlyDrawingActor) == 0x0000C0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CurrentlyDrawingActor' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, PlacableClassesWithNoIcon) == 0x0000C8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::PlacableClassesWithNoIcon' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, Icons) == 0x000118, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::Icons' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Array_Length_ReturnValue) == 0x000168, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, Temp_int_Loop_Counter_Variable) == 0x00016C, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Add_IntInt_ReturnValue) == 0x000174, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, Temp_int_Array_Index_Variable) == 0x000178, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Array_Get_Item) == 0x000180, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_GetObjectClass_ReturnValue) == 0x000188, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_GetActorBounds_Origin) == 0x000190, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_GetActorBounds_BoxExtent) == 0x0001A8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, Temp_int_Array_Index_Variable_1) == 0x0001C0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_BreakVector2D_X) == 0x0001C8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_BreakVector2D_Y) == 0x0001D0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_FTrunc_ReturnValue) == 0x0001D8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_FTrunc_ReturnValue_1) == 0x0001DC, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x0001E0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_CreateRenderTarget2D_ReturnValue_1) == 0x0001E8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_CreateRenderTarget2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_CreateRenderTarget2D_ReturnValue_2) == 0x0001F0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_CreateRenderTarget2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001F8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, K2Node_MakeStruct_WeightedBlendable) == 0x000200, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, K2Node_MakeArray_Array) == 0x000210, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, K2Node_MakeStruct_WeightedBlendables) == 0x000220, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_GetObjectClass_ReturnValue_1) == 0x000230, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000238, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_GetActorBounds_Origin_1) == 0x000250, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_GetActorBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_GetActorBounds_BoxExtent_1) == 0x000268, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_GetActorBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_FindLookAtRotation_ReturnValue) == 0x000280, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000298, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0002B0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000398, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Add_VectorVector_ReturnValue) == 0x0003B0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0003C8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, K2Node_MakeArray_Array_1) == 0x0004B0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Set_Contains_ReturnValue) == 0x0004C0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0004C8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, Temp_int_Loop_Counter_Variable_1) == 0x0004D0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Set_ToArray_Result) == 0x0004D8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004E8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Array_Get_Item_1) == 0x0004F0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Array_Length_ReturnValue_1) == 0x0005B0, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0005B4, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_Less_IntInt_ReturnValue_1) == 0x0005B5, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, K2Node_VariableSet_FOVAngle_ImplicitCast) == 0x0005B8, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::K2Node_VariableSet_FOVAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons, CallFunc_SetOuterConeAngle_NewOuterConeAngle_ImplicitCast) == 0x0005BC, "Member 'IGLE_A_ExamplePlacableIconMaker_C_CapturePlacableIcons::CallFunc_SetOuterConeAngle_NewOuterConeAngle_ImplicitCast' has a wrong offset!");

// Function IGLE_A_ExamplePlacableIconMaker.IGLE_A_ExamplePlacableIconMaker_C.GetBigestPrimitive
// 0x00A0 (0x00A0 - 0x0000)
struct IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive final
{
public:
	class AActor*                                 Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Primitive;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Comp;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        MaxBound;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_1; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_2; // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive) == 0x000008, "Wrong alignment on IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive");
static_assert(sizeof(IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive) == 0x0000A0, "Wrong size on IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive, Self2) == 0x000000, "Member 'IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive::Self2' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive, Primitive) == 0x000008, "Member 'IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive::Primitive' has a wrong offset!");
static_assert(offsetof(IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive, Comp) == 0x000010, "Member 'IGLE_A_ExamplePlacableIconMaker_C_GetBigestPrimitive::Comp' has a wrong offset!");
