#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_SceneOutliner_Entry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_SceneOutliner_Entry.IGLE_W_SceneOutliner_Entry_C
// 0x0070 (0x0330 - 0x02C0)
class UIGLE_W_SceneOutliner_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIGLE_Example_BeveledBorder_C*          BeveledBorder;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlacableIconImage;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlacableID;                                        // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlacableName;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_Example_Button_Translucent_C*     SelectionButton;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 PlacableActor;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UIGLE_W_SceneOutliner_C*                Parent;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           InterlacedBorderColor;                             // 0x0304(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DynamicIconMaterialInstance;                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     IconMaterial;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                List_Item_Object;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__SelectionButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void CustomEvent(class AActor* Actor);
	void ExecuteUbergraph_IGLE_W_SceneOutliner_Entry(int32 EntryPoint);
	int32 GetItemIndex();
	class FText GetPlacableID();
	class FText GetPlacableName();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnLoaded_B1AAC64C454F5209A5F6CF8D545EDC1C(class UObject* Loaded);
	void OnSelectionUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_SceneOutliner_Entry_C">();
	}
	static class UIGLE_W_SceneOutliner_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_SceneOutliner_Entry_C>();
	}
};
static_assert(alignof(UIGLE_W_SceneOutliner_Entry_C) == 0x000008, "Wrong alignment on UIGLE_W_SceneOutliner_Entry_C");
static_assert(sizeof(UIGLE_W_SceneOutliner_Entry_C) == 0x000330, "Wrong size on UIGLE_W_SceneOutliner_Entry_C");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_SceneOutliner_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, BeveledBorder) == 0x0002C8, "Member 'UIGLE_W_SceneOutliner_Entry_C::BeveledBorder' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, PlacableIconImage) == 0x0002D0, "Member 'UIGLE_W_SceneOutliner_Entry_C::PlacableIconImage' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, PlacableID) == 0x0002D8, "Member 'UIGLE_W_SceneOutliner_Entry_C::PlacableID' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, PlacableName) == 0x0002E0, "Member 'UIGLE_W_SceneOutliner_Entry_C::PlacableName' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, SelectionButton) == 0x0002E8, "Member 'UIGLE_W_SceneOutliner_Entry_C::SelectionButton' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, PlacableActor) == 0x0002F0, "Member 'UIGLE_W_SceneOutliner_Entry_C::PlacableActor' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, Parent) == 0x0002F8, "Member 'UIGLE_W_SceneOutliner_Entry_C::Parent' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, Selected) == 0x000300, "Member 'UIGLE_W_SceneOutliner_Entry_C::Selected' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, InterlacedBorderColor) == 0x000304, "Member 'UIGLE_W_SceneOutliner_Entry_C::InterlacedBorderColor' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, DynamicIconMaterialInstance) == 0x000318, "Member 'UIGLE_W_SceneOutliner_Entry_C::DynamicIconMaterialInstance' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, IconMaterial) == 0x000320, "Member 'UIGLE_W_SceneOutliner_Entry_C::IconMaterial' has a wrong offset!");
static_assert(offsetof(UIGLE_W_SceneOutliner_Entry_C, List_Item_Object) == 0x000328, "Member 'UIGLE_W_SceneOutliner_Entry_C::List_Item_Object' has a wrong offset!");

}

