#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_PlacableDescription

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_PlacableDescription.IGLE_W_PlacableDescription_C
// 0x0028 (0x02E8 - 0x02C0)
class UIGLE_W_PlacableDescription_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             DescriptionText;                                   // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Description;                                       // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IGLE_W_PlacableDescription(int32 EntryPoint);
	void Hide_Description();
	void ShowDescription(const class FString& Description_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_PlacableDescription_C">();
	}
	static class UIGLE_W_PlacableDescription_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_PlacableDescription_C>();
	}
};
static_assert(alignof(UIGLE_W_PlacableDescription_C) == 0x000008, "Wrong alignment on UIGLE_W_PlacableDescription_C");
static_assert(sizeof(UIGLE_W_PlacableDescription_C) == 0x0002E8, "Wrong size on UIGLE_W_PlacableDescription_C");
static_assert(offsetof(UIGLE_W_PlacableDescription_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_PlacableDescription_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableDescription_C, FadeIn) == 0x0002C8, "Member 'UIGLE_W_PlacableDescription_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableDescription_C, DescriptionText) == 0x0002D0, "Member 'UIGLE_W_PlacableDescription_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UIGLE_W_PlacableDescription_C, Description) == 0x0002D8, "Member 'UIGLE_W_PlacableDescription_C::Description' has a wrong offset!");

}

