#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_AxisWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function IGLE_AxisWidget.IGLE_AxisWidget_C.BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'IGLE_AxisWidget_C_BndEvt__IGLE_TextureWidget_ComboBoxString_75_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function IGLE_AxisWidget.IGLE_AxisWidget_C.ExecuteUbergraph_IGLE_AxisWidget
// 0x0040 (0x0040 - 0x0000)
struct IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_AxisProperty_C*                   K2Node_DynamicCast_AsIGLE_Axis_Property;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_TryCallOnPropertyValueChanged_Success; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_AxisProperty_C*                   K2Node_DynamicCast_AsIGLE_Axis_Property_1;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget) == 0x000008, "Wrong alignment on IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget");
static_assert(sizeof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget) == 0x000040, "Wrong size on IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, EntryPoint) == 0x000000, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, K2Node_DynamicCast_AsIGLE_Axis_Property) == 0x000008, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::K2Node_DynamicCast_AsIGLE_Axis_Property' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, CallFunc_IGLE_TryCallOnPropertyValueChanged_Success) == 0x000011, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::CallFunc_IGLE_TryCallOnPropertyValueChanged_Success' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, K2Node_DynamicCast_AsIGLE_Axis_Property_1) == 0x000018, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::K2Node_DynamicCast_AsIGLE_Axis_Property_1' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, K2Node_ComponentBoundEvent_SelectedItem) == 0x000028, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget, K2Node_ComponentBoundEvent_SelectionType) == 0x000038, "Member 'IGLE_AxisWidget_C_ExecuteUbergraph_IGLE_AxisWidget::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");

}

