#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_SplinePointPropertyValueWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function IGLE_W_SplinePointPropertyValueWidget.IGLE_W_SplinePointPropertyValueWidget_C.ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget
// 0x0028 (0x0028 - 0x0000)
struct IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_SplinePointPropertyValueObject_C* K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_TryCallOnPropertyValueChanged_Success; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_SplinePointPropertyValueObject_C* K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object_1; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_TryCallOnPropertyValueChanged_Success_1; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget) == 0x000008, "Wrong alignment on IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget");
static_assert(sizeof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget) == 0x000028, "Wrong size on IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget, EntryPoint) == 0x000000, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget, K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object) == 0x000008, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget::K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget, CallFunc_IGLE_TryCallOnPropertyValueChanged_Success) == 0x000011, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget::CallFunc_IGLE_TryCallOnPropertyValueChanged_Success' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget, K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object_1) == 0x000018, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget::K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget, CallFunc_IGLE_TryCallOnPropertyValueChanged_Success_1) == 0x000021, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_ExecuteUbergraph_IGLE_W_SplinePointPropertyValueWidget::CallFunc_IGLE_TryCallOnPropertyValueChanged_Success_1' has a wrong offset!");

// Function IGLE_W_SplinePointPropertyValueWidget.IGLE_W_SplinePointPropertyValueWidget_C.GetText
// 0x0040 (0x0040 - 0x0000)
struct IGLE_W_SplinePointPropertyValueWidget_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UIGLE_SplinePointPropertyValueObject_C* K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
};
static_assert(alignof(IGLE_W_SplinePointPropertyValueWidget_C_GetText) == 0x000008, "Wrong alignment on IGLE_W_SplinePointPropertyValueWidget_C_GetText");
static_assert(sizeof(IGLE_W_SplinePointPropertyValueWidget_C_GetText) == 0x000040, "Wrong size on IGLE_W_SplinePointPropertyValueWidget_C_GetText");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_GetText, ReturnValue) == 0x000000, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_GetText, K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object) == 0x000018, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_GetText::K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_GetText, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_GetText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_GetText, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_GetText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_SplinePointPropertyValueWidget_C_GetText, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'IGLE_W_SplinePointPropertyValueWidget_C_GetText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

