#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_PlacableCategoryEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function IGLE_W_PlacableCategoryEntry.IGLE_W_PlacableCategoryEntry_C.ExecuteUbergraph_IGLE_W_PlacableCategoryEntry
// 0x00D8 (0x00D8 - 0x0000)
struct IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0068(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x007C(0x0014)()
	TArray<class UIGLE_W_PlacableCategoryEntry_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UIGLE_W_PlacableCategoryEntry_C*        CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry) == 0x000008, "Wrong alignment on IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry");
static_assert(sizeof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry) == 0x0000D8, "Wrong size on IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, EntryPoint) == 0x000000, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, Temp_real_Variable) == 0x000008, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, Temp_real_Variable_1) == 0x000010, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, Temp_int_Array_Index_Variable) == 0x000018, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, Temp_bool_Variable) == 0x00001D, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, K2Node_Event_MyGeometry) == 0x000020, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, K2Node_Event_InDeltaTime) == 0x000058, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_IsValid_ReturnValue_1) == 0x00005C, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00005D, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, K2Node_Select_Default) == 0x000060, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, K2Node_MakeStruct_SlateColor) == 0x000068, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, K2Node_MakeStruct_SlateColor_1) == 0x00007C, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000090, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000B0, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, Temp_int_Loop_Counter_Variable) == 0x0000B8, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, K2Node_DynamicCast_AsIGLE_Pawn_Example) == 0x0000C0, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::K2Node_DynamicCast_AsIGLE_Pawn_Example' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_Less_IntInt_ReturnValue) == 0x0000C9, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0000D0, "Member 'IGLE_W_PlacableCategoryEntry_C_ExecuteUbergraph_IGLE_W_PlacableCategoryEntry::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function IGLE_W_PlacableCategoryEntry.IGLE_W_PlacableCategoryEntry_C.Tick
// 0x003C (0x003C - 0x0000)
struct IGLE_W_PlacableCategoryEntry_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IGLE_W_PlacableCategoryEntry_C_Tick) == 0x000004, "Wrong alignment on IGLE_W_PlacableCategoryEntry_C_Tick");
static_assert(sizeof(IGLE_W_PlacableCategoryEntry_C_Tick) == 0x00003C, "Wrong size on IGLE_W_PlacableCategoryEntry_C_Tick");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_Tick, MyGeometry) == 0x000000, "Member 'IGLE_W_PlacableCategoryEntry_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(IGLE_W_PlacableCategoryEntry_C_Tick, InDeltaTime) == 0x000038, "Member 'IGLE_W_PlacableCategoryEntry_C_Tick::InDeltaTime' has a wrong offset!");

}

