#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGLE_W_Vec3Edit

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGLE_W_Vec3Edit.IGLE_W_Vec3Edit_C
// 0x0080 (0x0340 - 0x02C0)
class UIGLE_W_Vec3Edit_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIGLE_Example_Button_Opaque_C*          X;                                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_SpinBox_C*                        X_SpinBox;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_Example_Button_Opaque_C*          Y;                                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_SpinBox_C*                        Y_SpinBox;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_Example_Button_Opaque_C*          Z;                                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGLE_SpinBox_C*                        Z_SpinBox;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector                                VectorValue;                                       // 0x02F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnVectorValueChanged;                              // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector                                ResetVectorValue;                                  // 0x0320(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Max_Fractional_Digits;                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__X_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__X_SpinBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__Y_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__Y_SpinBox_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__Z_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__Z_SpinBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BreakAndTruncateVector(const struct FVector& Vector, int32 ForcedDecimalPlaces, double* X_0, double* Y_0, double* Z_0);
	void CallOnVectorValueChanged(const struct FVector& NewValue);
	void Construct();
	void ExecuteUbergraph_IGLE_W_Vec3Edit(int32 EntryPoint);
	void OnVectorValueChanged__DelegateSignature(const struct FVector& NewValue);
	void PreConstruct(bool IsDesignTime);
	void UpdateVectorValue(const struct FVector& VectorValue_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGLE_W_Vec3Edit_C">();
	}
	static class UIGLE_W_Vec3Edit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGLE_W_Vec3Edit_C>();
	}
};
static_assert(alignof(UIGLE_W_Vec3Edit_C) == 0x000008, "Wrong alignment on UIGLE_W_Vec3Edit_C");
static_assert(sizeof(UIGLE_W_Vec3Edit_C) == 0x000340, "Wrong size on UIGLE_W_Vec3Edit_C");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, UberGraphFrame) == 0x0002C0, "Member 'UIGLE_W_Vec3Edit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, X) == 0x0002C8, "Member 'UIGLE_W_Vec3Edit_C::X' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, X_SpinBox) == 0x0002D0, "Member 'UIGLE_W_Vec3Edit_C::X_SpinBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, Y) == 0x0002D8, "Member 'UIGLE_W_Vec3Edit_C::Y' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, Y_SpinBox) == 0x0002E0, "Member 'UIGLE_W_Vec3Edit_C::Y_SpinBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, Z) == 0x0002E8, "Member 'UIGLE_W_Vec3Edit_C::Z' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, Z_SpinBox) == 0x0002F0, "Member 'UIGLE_W_Vec3Edit_C::Z_SpinBox' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, VectorValue) == 0x0002F8, "Member 'UIGLE_W_Vec3Edit_C::VectorValue' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, OnVectorValueChanged) == 0x000310, "Member 'UIGLE_W_Vec3Edit_C::OnVectorValueChanged' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, ResetVectorValue) == 0x000320, "Member 'UIGLE_W_Vec3Edit_C::ResetVectorValue' has a wrong offset!");
static_assert(offsetof(UIGLE_W_Vec3Edit_C, Max_Fractional_Digits) == 0x000338, "Member 'UIGLE_W_Vec3Edit_C::Max_Fractional_Digits' has a wrong offset!");

}

