#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InOutPillar_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function InOutPillar_BP.InOutPillar_BP_C.ExecuteUbergraph_InOutPillar_BP
// 0x0108 (0x0108 - 0x0000)
struct InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0020(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP) == 0x000008, "Wrong alignment on InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP");
static_assert(sizeof(InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP) == 0x000108, "Wrong size on InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP");
static_assert(offsetof(InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP, EntryPoint) == 0x000000, "Member 'InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP, CallFunc_VLerp_ReturnValue) == 0x000008, "Member 'InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000020, "Member 'InOutPillar_BP_C_ExecuteUbergraph_InOutPillar_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function InOutPillar_BP.InOutPillar_BP_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct InOutPillar_BP_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InOutPillar_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on InOutPillar_BP_C_UserConstructionScript");
static_assert(sizeof(InOutPillar_BP_C_UserConstructionScript) == 0x000030, "Wrong size on InOutPillar_BP_C_UserConstructionScript");
static_assert(offsetof(InOutPillar_BP_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'InOutPillar_BP_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillar_BP_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000018, "Member 'InOutPillar_BP_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");

}

