#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InOutPillarManagaer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InOutPillarManagaer_BP.InOutPillarManagaer_BP_C
// 0x0038 (0x02D0 - 0x0298)
class AInOutPillarManagaer_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_BD9D411D461E4F7BC52C51B766FFF649; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC9[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AInOutPillar_BP_C*>              InOutPillars;                                      // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	float                                         PlayBackPosition;                                  // 0x02C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void ExecuteUbergraph_InOutPillarManagaer_BP(int32 EntryPoint);
	void OnRep_PlayBackPosition();
	void ReceiveBeginPlay();
	void SlideSound();
	void Timeline__A_In__EventFunc();
	void Timeline__A_Out__EventFunc();
	void Timeline__B_In__EventFunc();
	void Timeline__B_Out__EventFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InOutPillarManagaer_BP_C">();
	}
	static class AInOutPillarManagaer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInOutPillarManagaer_BP_C>();
	}
};
static_assert(alignof(AInOutPillarManagaer_BP_C) == 0x000008, "Wrong alignment on AInOutPillarManagaer_BP_C");
static_assert(sizeof(AInOutPillarManagaer_BP_C) == 0x0002D0, "Wrong size on AInOutPillarManagaer_BP_C");
static_assert(offsetof(AInOutPillarManagaer_BP_C, UberGraphFrame) == 0x000298, "Member 'AInOutPillarManagaer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInOutPillarManagaer_BP_C, DefaultSceneRoot) == 0x0002A0, "Member 'AInOutPillarManagaer_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AInOutPillarManagaer_BP_C, Timeline__Direction_BD9D411D461E4F7BC52C51B766FFF649) == 0x0002A8, "Member 'AInOutPillarManagaer_BP_C::Timeline__Direction_BD9D411D461E4F7BC52C51B766FFF649' has a wrong offset!");
static_assert(offsetof(AInOutPillarManagaer_BP_C, Timeline) == 0x0002B0, "Member 'AInOutPillarManagaer_BP_C::Timeline' has a wrong offset!");
static_assert(offsetof(AInOutPillarManagaer_BP_C, InOutPillars) == 0x0002B8, "Member 'AInOutPillarManagaer_BP_C::InOutPillars' has a wrong offset!");
static_assert(offsetof(AInOutPillarManagaer_BP_C, PlayBackPosition) == 0x0002C8, "Member 'AInOutPillarManagaer_BP_C::PlayBackPosition' has a wrong offset!");

}

