#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InOutPillarManagaer_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InOutPillarManagaer_BP.InOutPillarManagaer_BP_C.ExecuteUbergraph_InOutPillarManagaer_BP
// 0x00D0 (0x00D0 - 0x0000)
struct InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCB[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCC[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInOutPillar_BP_C*                      CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCD[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCE[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AInOutPillar_BP_C*                      CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCF[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AInOutPillar_BP_C*                      CallFunc_Array_Get_Item_2;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD0[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AInOutPillar_BP_C*                      CallFunc_Array_Get_Item_3;                         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD1[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP) == 0x000008, "Wrong alignment on InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP");
static_assert(sizeof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP) == 0x0000D0, "Wrong size on InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, EntryPoint) == 0x000000, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed) == 0x000008, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, Temp_int_Array_Index_Variable) == 0x000020, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_HasAuthority_ReturnValue) == 0x000040, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, Temp_int_Loop_Counter_Variable_2) == 0x000044, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, Temp_int_Array_Index_Variable_2) == 0x000050, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, Temp_int_Loop_Counter_Variable_3) == 0x000054, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Add_IntInt_ReturnValue_3) == 0x000058, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, Temp_int_Array_Index_Variable_3) == 0x00005C, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Array_Get_Item) == 0x000060, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_GetPlaybackPosition_ReturnValue) == 0x000070, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000084, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Array_Length_ReturnValue_2) == 0x000090, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x000094, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Array_Get_Item_3) == 0x000098, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Array_Length_ReturnValue_3) == 0x0000A0, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000A4, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0000C0, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x0000C8, "Member 'InOutPillarManagaer_BP_C_ExecuteUbergraph_InOutPillarManagaer_BP::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function InOutPillarManagaer_BP.InOutPillarManagaer_BP_C.OnRep_PlayBackPosition
// 0x0001 (0x0001 - 0x0000)
struct InOutPillarManagaer_BP_C_OnRep_PlayBackPosition final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InOutPillarManagaer_BP_C_OnRep_PlayBackPosition) == 0x000001, "Wrong alignment on InOutPillarManagaer_BP_C_OnRep_PlayBackPosition");
static_assert(sizeof(InOutPillarManagaer_BP_C_OnRep_PlayBackPosition) == 0x000001, "Wrong size on InOutPillarManagaer_BP_C_OnRep_PlayBackPosition");
static_assert(offsetof(InOutPillarManagaer_BP_C_OnRep_PlayBackPosition, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'InOutPillarManagaer_BP_C_OnRep_PlayBackPosition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

