#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeCore

#include "Basic.hpp"

#include "InterchangeCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function InterchangeCore.InterchangeFactoryBase.GetFactoryClass
// 0x0008 (0x0008 - 0x0000)
struct InterchangeFactoryBase_GetFactoryClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeFactoryBase_GetFactoryClass) == 0x000008, "Wrong alignment on InterchangeFactoryBase_GetFactoryClass");
static_assert(sizeof(InterchangeFactoryBase_GetFactoryClass) == 0x000008, "Wrong size on InterchangeFactoryBase_GetFactoryClass");
static_assert(offsetof(InterchangeFactoryBase_GetFactoryClass, ReturnValue) == 0x000000, "Member 'InterchangeFactoryBase_GetFactoryClass::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeSourceData.SetFilename
// 0x0018 (0x0018 - 0x0000)
struct InterchangeSourceData_SetFilename final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2751[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSourceData_SetFilename) == 0x000008, "Wrong alignment on InterchangeSourceData_SetFilename");
static_assert(sizeof(InterchangeSourceData_SetFilename) == 0x000018, "Wrong size on InterchangeSourceData_SetFilename");
static_assert(offsetof(InterchangeSourceData_SetFilename, InFilename) == 0x000000, "Member 'InterchangeSourceData_SetFilename::InFilename' has a wrong offset!");
static_assert(offsetof(InterchangeSourceData_SetFilename, ReturnValue) == 0x000010, "Member 'InterchangeSourceData_SetFilename::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeSourceData.GetFilename
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSourceData_GetFilename final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeSourceData_GetFilename) == 0x000008, "Wrong alignment on InterchangeSourceData_GetFilename");
static_assert(sizeof(InterchangeSourceData_GetFilename) == 0x000010, "Wrong size on InterchangeSourceData_GetFilename");
static_assert(offsetof(InterchangeSourceData_GetFilename, ReturnValue) == 0x000000, "Member 'InterchangeSourceData_GetFilename::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.FindOrAddPropertyStates
// 0x000C (0x000C - 0x0000)
struct InterchangePipelineBase_FindOrAddPropertyStates final
{
public:
	class FName                                   PropertyPath;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangePipelinePropertyStates     ReturnValue;                                       // 0x0008(0x0003)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2754[0x1];                                     // 0x000B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePipelineBase_FindOrAddPropertyStates) == 0x000004, "Wrong alignment on InterchangePipelineBase_FindOrAddPropertyStates");
static_assert(sizeof(InterchangePipelineBase_FindOrAddPropertyStates) == 0x00000C, "Wrong size on InterchangePipelineBase_FindOrAddPropertyStates");
static_assert(offsetof(InterchangePipelineBase_FindOrAddPropertyStates, PropertyPath) == 0x000000, "Member 'InterchangePipelineBase_FindOrAddPropertyStates::PropertyPath' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_FindOrAddPropertyStates, ReturnValue) == 0x000008, "Member 'InterchangePipelineBase_FindOrAddPropertyStates::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.ScriptedCanExecuteOnAnyThread
// 0x0002 (0x0002 - 0x0000)
struct InterchangePipelineBase_ScriptedCanExecuteOnAnyThread final
{
public:
	EInterchangePipelineTask                      PipelineTask;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangePipelineBase_ScriptedCanExecuteOnAnyThread) == 0x000001, "Wrong alignment on InterchangePipelineBase_ScriptedCanExecuteOnAnyThread");
static_assert(sizeof(InterchangePipelineBase_ScriptedCanExecuteOnAnyThread) == 0x000002, "Wrong size on InterchangePipelineBase_ScriptedCanExecuteOnAnyThread");
static_assert(offsetof(InterchangePipelineBase_ScriptedCanExecuteOnAnyThread, PipelineTask) == 0x000000, "Member 'InterchangePipelineBase_ScriptedCanExecuteOnAnyThread::PipelineTask' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedCanExecuteOnAnyThread, ReturnValue) == 0x000001, "Member 'InterchangePipelineBase_ScriptedCanExecuteOnAnyThread::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecuteExportPipeline
// 0x0008 (0x0008 - 0x0000)
struct InterchangePipelineBase_ScriptedExecuteExportPipeline final
{
public:
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangePipelineBase_ScriptedExecuteExportPipeline) == 0x000008, "Wrong alignment on InterchangePipelineBase_ScriptedExecuteExportPipeline");
static_assert(sizeof(InterchangePipelineBase_ScriptedExecuteExportPipeline) == 0x000008, "Wrong size on InterchangePipelineBase_ScriptedExecuteExportPipeline");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecuteExportPipeline, BaseNodeContainer) == 0x000000, "Member 'InterchangePipelineBase_ScriptedExecuteExportPipeline::BaseNodeContainer' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecutePipeline
// 0x0018 (0x0018 - 0x0000)
struct InterchangePipelineBase_ScriptedExecutePipeline final
{
public:
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInterchangeSourceData*>         SourceDatas;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangePipelineBase_ScriptedExecutePipeline) == 0x000008, "Wrong alignment on InterchangePipelineBase_ScriptedExecutePipeline");
static_assert(sizeof(InterchangePipelineBase_ScriptedExecutePipeline) == 0x000018, "Wrong size on InterchangePipelineBase_ScriptedExecutePipeline");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePipeline, BaseNodeContainer) == 0x000000, "Member 'InterchangePipelineBase_ScriptedExecutePipeline::BaseNodeContainer' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePipeline, SourceDatas) == 0x000008, "Member 'InterchangePipelineBase_ScriptedExecutePipeline::SourceDatas' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecutePostFactoryPipeline
// 0x0028 (0x0028 - 0x0000)
struct InterchangePipelineBase_ScriptedExecutePostFactoryPipeline final
{
public:
	const class UInterchangeBaseNodeContainer*    BaseNodeContainer;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FactoryNodeKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CreatedAsset;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAReimport;                                      // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2755[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePipelineBase_ScriptedExecutePostFactoryPipeline) == 0x000008, "Wrong alignment on InterchangePipelineBase_ScriptedExecutePostFactoryPipeline");
static_assert(sizeof(InterchangePipelineBase_ScriptedExecutePostFactoryPipeline) == 0x000028, "Wrong size on InterchangePipelineBase_ScriptedExecutePostFactoryPipeline");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePostFactoryPipeline, BaseNodeContainer) == 0x000000, "Member 'InterchangePipelineBase_ScriptedExecutePostFactoryPipeline::BaseNodeContainer' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePostFactoryPipeline, FactoryNodeKey) == 0x000008, "Member 'InterchangePipelineBase_ScriptedExecutePostFactoryPipeline::FactoryNodeKey' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePostFactoryPipeline, CreatedAsset) == 0x000018, "Member 'InterchangePipelineBase_ScriptedExecutePostFactoryPipeline::CreatedAsset' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePostFactoryPipeline, bIsAReimport) == 0x000020, "Member 'InterchangePipelineBase_ScriptedExecutePostFactoryPipeline::bIsAReimport' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecutePostImportPipeline
// 0x0028 (0x0028 - 0x0000)
struct InterchangePipelineBase_ScriptedExecutePostImportPipeline final
{
public:
	const class UInterchangeBaseNodeContainer*    BaseNodeContainer;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FactoryNodeKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CreatedAsset;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAReimport;                                      // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2756[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePipelineBase_ScriptedExecutePostImportPipeline) == 0x000008, "Wrong alignment on InterchangePipelineBase_ScriptedExecutePostImportPipeline");
static_assert(sizeof(InterchangePipelineBase_ScriptedExecutePostImportPipeline) == 0x000028, "Wrong size on InterchangePipelineBase_ScriptedExecutePostImportPipeline");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePostImportPipeline, BaseNodeContainer) == 0x000000, "Member 'InterchangePipelineBase_ScriptedExecutePostImportPipeline::BaseNodeContainer' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePostImportPipeline, FactoryNodeKey) == 0x000008, "Member 'InterchangePipelineBase_ScriptedExecutePostImportPipeline::FactoryNodeKey' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePostImportPipeline, CreatedAsset) == 0x000018, "Member 'InterchangePipelineBase_ScriptedExecutePostImportPipeline::CreatedAsset' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePostImportPipeline, bIsAReimport) == 0x000020, "Member 'InterchangePipelineBase_ScriptedExecutePostImportPipeline::bIsAReimport' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecutePreImportPipeline
// 0x0018 (0x0018 - 0x0000)
struct InterchangePipelineBase_ScriptedExecutePreImportPipeline final
{
public:
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInterchangeSourceData*>         SourceDatas;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangePipelineBase_ScriptedExecutePreImportPipeline) == 0x000008, "Wrong alignment on InterchangePipelineBase_ScriptedExecutePreImportPipeline");
static_assert(sizeof(InterchangePipelineBase_ScriptedExecutePreImportPipeline) == 0x000018, "Wrong size on InterchangePipelineBase_ScriptedExecutePreImportPipeline");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePreImportPipeline, BaseNodeContainer) == 0x000000, "Member 'InterchangePipelineBase_ScriptedExecutePreImportPipeline::BaseNodeContainer' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedExecutePreImportPipeline, SourceDatas) == 0x000008, "Member 'InterchangePipelineBase_ScriptedExecutePreImportPipeline::SourceDatas' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.ScriptedSetReimportSourceIndex
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineBase_ScriptedSetReimportSourceIndex final
{
public:
	class UClass*                                 ReimportObjectClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SourceFileIndex;                                   // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2757[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePipelineBase_ScriptedSetReimportSourceIndex) == 0x000008, "Wrong alignment on InterchangePipelineBase_ScriptedSetReimportSourceIndex");
static_assert(sizeof(InterchangePipelineBase_ScriptedSetReimportSourceIndex) == 0x000010, "Wrong size on InterchangePipelineBase_ScriptedSetReimportSourceIndex");
static_assert(offsetof(InterchangePipelineBase_ScriptedSetReimportSourceIndex, ReimportObjectClass) == 0x000000, "Member 'InterchangePipelineBase_ScriptedSetReimportSourceIndex::ReimportObjectClass' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_ScriptedSetReimportSourceIndex, SourceFileIndex) == 0x000008, "Member 'InterchangePipelineBase_ScriptedSetReimportSourceIndex::SourceFileIndex' has a wrong offset!");

// Function InterchangeCore.InterchangePipelineBase.DoesPropertyStatesExist
// 0x000C (0x000C - 0x0000)
struct InterchangePipelineBase_DoesPropertyStatesExist final
{
public:
	class FName                                   PropertyPath;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2758[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePipelineBase_DoesPropertyStatesExist) == 0x000004, "Wrong alignment on InterchangePipelineBase_DoesPropertyStatesExist");
static_assert(sizeof(InterchangePipelineBase_DoesPropertyStatesExist) == 0x00000C, "Wrong size on InterchangePipelineBase_DoesPropertyStatesExist");
static_assert(offsetof(InterchangePipelineBase_DoesPropertyStatesExist, PropertyPath) == 0x000000, "Member 'InterchangePipelineBase_DoesPropertyStatesExist::PropertyPath' has a wrong offset!");
static_assert(offsetof(InterchangePipelineBase_DoesPropertyStatesExist, ReturnValue) == 0x000008, "Member 'InterchangePipelineBase_DoesPropertyStatesExist::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddBooleanAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_AddBooleanAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_275B[0x6];                                     // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddBooleanAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddBooleanAttribute");
static_assert(sizeof(InterchangeBaseNode_AddBooleanAttribute) == 0x000018, "Wrong size on InterchangeBaseNode_AddBooleanAttribute");
static_assert(offsetof(InterchangeBaseNode_AddBooleanAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_AddBooleanAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddBooleanAttribute, Value) == 0x000010, "Member 'InterchangeBaseNode_AddBooleanAttribute::Value' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddBooleanAttribute, ReturnValue) == 0x000011, "Member 'InterchangeBaseNode_AddBooleanAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddDoubleAttribute
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNode_AddDoubleAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_275C[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddDoubleAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddDoubleAttribute");
static_assert(sizeof(InterchangeBaseNode_AddDoubleAttribute) == 0x000020, "Wrong size on InterchangeBaseNode_AddDoubleAttribute");
static_assert(offsetof(InterchangeBaseNode_AddDoubleAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_AddDoubleAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddDoubleAttribute, Value) == 0x000010, "Member 'InterchangeBaseNode_AddDoubleAttribute::Value' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddDoubleAttribute, ReturnValue) == 0x000018, "Member 'InterchangeBaseNode_AddDoubleAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddFloatAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_AddFloatAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_275D[0x3];                                     // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddFloatAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddFloatAttribute");
static_assert(sizeof(InterchangeBaseNode_AddFloatAttribute) == 0x000018, "Wrong size on InterchangeBaseNode_AddFloatAttribute");
static_assert(offsetof(InterchangeBaseNode_AddFloatAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_AddFloatAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddFloatAttribute, Value) == 0x000010, "Member 'InterchangeBaseNode_AddFloatAttribute::Value' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddFloatAttribute, ReturnValue) == 0x000014, "Member 'InterchangeBaseNode_AddFloatAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddGuidAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_AddGuidAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Value;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_275E[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddGuidAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddGuidAttribute");
static_assert(sizeof(InterchangeBaseNode_AddGuidAttribute) == 0x000028, "Wrong size on InterchangeBaseNode_AddGuidAttribute");
static_assert(offsetof(InterchangeBaseNode_AddGuidAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_AddGuidAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddGuidAttribute, Value) == 0x000010, "Member 'InterchangeBaseNode_AddGuidAttribute::Value' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddGuidAttribute, ReturnValue) == 0x000020, "Member 'InterchangeBaseNode_AddGuidAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddInt32Attribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_AddInt32Attribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_275F[0x3];                                     // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddInt32Attribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddInt32Attribute");
static_assert(sizeof(InterchangeBaseNode_AddInt32Attribute) == 0x000018, "Wrong size on InterchangeBaseNode_AddInt32Attribute");
static_assert(offsetof(InterchangeBaseNode_AddInt32Attribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_AddInt32Attribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddInt32Attribute, Value) == 0x000010, "Member 'InterchangeBaseNode_AddInt32Attribute::Value' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddInt32Attribute, ReturnValue) == 0x000014, "Member 'InterchangeBaseNode_AddInt32Attribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddLinearColorAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_AddLinearColorAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2760[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddLinearColorAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddLinearColorAttribute");
static_assert(sizeof(InterchangeBaseNode_AddLinearColorAttribute) == 0x000028, "Wrong size on InterchangeBaseNode_AddLinearColorAttribute");
static_assert(offsetof(InterchangeBaseNode_AddLinearColorAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_AddLinearColorAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddLinearColorAttribute, Value) == 0x000010, "Member 'InterchangeBaseNode_AddLinearColorAttribute::Value' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddLinearColorAttribute, ReturnValue) == 0x000020, "Member 'InterchangeBaseNode_AddLinearColorAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddStringAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_AddStringAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2761[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddStringAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddStringAttribute");
static_assert(sizeof(InterchangeBaseNode_AddStringAttribute) == 0x000028, "Wrong size on InterchangeBaseNode_AddStringAttribute");
static_assert(offsetof(InterchangeBaseNode_AddStringAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_AddStringAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddStringAttribute, Value) == 0x000010, "Member 'InterchangeBaseNode_AddStringAttribute::Value' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddStringAttribute, ReturnValue) == 0x000020, "Member 'InterchangeBaseNode_AddStringAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddVector2Attribute
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNode_AddVector2Attribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              Value;                                             // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2762[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddVector2Attribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddVector2Attribute");
static_assert(sizeof(InterchangeBaseNode_AddVector2Attribute) == 0x000020, "Wrong size on InterchangeBaseNode_AddVector2Attribute");
static_assert(offsetof(InterchangeBaseNode_AddVector2Attribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_AddVector2Attribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddVector2Attribute, Value) == 0x000010, "Member 'InterchangeBaseNode_AddVector2Attribute::Value' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddVector2Attribute, ReturnValue) == 0x000018, "Member 'InterchangeBaseNode_AddVector2Attribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.InitializeNode
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_InitializeNode final
{
public:
	class FString                                 UniqueID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayLabel;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeNodeContainerType                 NodeContainerType;                                 // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2763[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_InitializeNode) == 0x000008, "Wrong alignment on InterchangeBaseNode_InitializeNode");
static_assert(sizeof(InterchangeBaseNode_InitializeNode) == 0x000028, "Wrong size on InterchangeBaseNode_InitializeNode");
static_assert(offsetof(InterchangeBaseNode_InitializeNode, UniqueID) == 0x000000, "Member 'InterchangeBaseNode_InitializeNode::UniqueID' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_InitializeNode, DisplayLabel) == 0x000010, "Member 'InterchangeBaseNode_InitializeNode::DisplayLabel' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_InitializeNode, NodeContainerType) == 0x000020, "Member 'InterchangeBaseNode_InitializeNode::NodeContainerType' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.RemoveAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_RemoveAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2764[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_RemoveAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_RemoveAttribute");
static_assert(sizeof(InterchangeBaseNode_RemoveAttribute) == 0x000018, "Wrong size on InterchangeBaseNode_RemoveAttribute");
static_assert(offsetof(InterchangeBaseNode_RemoveAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_RemoveAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_RemoveAttribute, ReturnValue) == 0x000010, "Member 'InterchangeBaseNode_RemoveAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.SetAssetName
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_SetAssetName final
{
public:
	class FString                                 AssetName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2765[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_SetAssetName) == 0x000008, "Wrong alignment on InterchangeBaseNode_SetAssetName");
static_assert(sizeof(InterchangeBaseNode_SetAssetName) == 0x000018, "Wrong size on InterchangeBaseNode_SetAssetName");
static_assert(offsetof(InterchangeBaseNode_SetAssetName, AssetName) == 0x000000, "Member 'InterchangeBaseNode_SetAssetName::AssetName' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_SetAssetName, ReturnValue) == 0x000010, "Member 'InterchangeBaseNode_SetAssetName::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.SetDisplayLabel
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_SetDisplayLabel final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2766[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_SetDisplayLabel) == 0x000008, "Wrong alignment on InterchangeBaseNode_SetDisplayLabel");
static_assert(sizeof(InterchangeBaseNode_SetDisplayLabel) == 0x000018, "Wrong size on InterchangeBaseNode_SetDisplayLabel");
static_assert(offsetof(InterchangeBaseNode_SetDisplayLabel, DisplayName) == 0x000000, "Member 'InterchangeBaseNode_SetDisplayLabel::DisplayName' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_SetDisplayLabel, ReturnValue) == 0x000010, "Member 'InterchangeBaseNode_SetDisplayLabel::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.SetEnabled
// 0x0002 (0x0002 - 0x0000)
struct InterchangeBaseNode_SetEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeBaseNode_SetEnabled) == 0x000001, "Wrong alignment on InterchangeBaseNode_SetEnabled");
static_assert(sizeof(InterchangeBaseNode_SetEnabled) == 0x000002, "Wrong size on InterchangeBaseNode_SetEnabled");
static_assert(offsetof(InterchangeBaseNode_SetEnabled, bIsEnabled) == 0x000000, "Member 'InterchangeBaseNode_SetEnabled::bIsEnabled' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_SetEnabled, ReturnValue) == 0x000001, "Member 'InterchangeBaseNode_SetEnabled::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.SetParentUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_SetParentUid final
{
public:
	class FString                                 ParentUid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2767[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_SetParentUid) == 0x000008, "Wrong alignment on InterchangeBaseNode_SetParentUid");
static_assert(sizeof(InterchangeBaseNode_SetParentUid) == 0x000018, "Wrong size on InterchangeBaseNode_SetParentUid");
static_assert(offsetof(InterchangeBaseNode_SetParentUid, ParentUid) == 0x000000, "Member 'InterchangeBaseNode_SetParentUid::ParentUid' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_SetParentUid, ReturnValue) == 0x000010, "Member 'InterchangeBaseNode_SetParentUid::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.AddTargetNodeUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_AddTargetNodeUid final
{
public:
	class FString                                 AssetUid;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2768[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_AddTargetNodeUid) == 0x000008, "Wrong alignment on InterchangeBaseNode_AddTargetNodeUid");
static_assert(sizeof(InterchangeBaseNode_AddTargetNodeUid) == 0x000018, "Wrong size on InterchangeBaseNode_AddTargetNodeUid");
static_assert(offsetof(InterchangeBaseNode_AddTargetNodeUid, AssetUid) == 0x000000, "Member 'InterchangeBaseNode_AddTargetNodeUid::AssetUid' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_AddTargetNodeUid, ReturnValue) == 0x000010, "Member 'InterchangeBaseNode_AddTargetNodeUid::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetAssetName
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetAssetName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeBaseNode_GetAssetName) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetAssetName");
static_assert(sizeof(InterchangeBaseNode_GetAssetName) == 0x000010, "Wrong size on InterchangeBaseNode_GetAssetName");
static_assert(offsetof(InterchangeBaseNode_GetAssetName, ReturnValue) == 0x000000, "Member 'InterchangeBaseNode_GetAssetName::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetBooleanAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_GetBooleanAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutValue;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2769[0x6];                                     // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_GetBooleanAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetBooleanAttribute");
static_assert(sizeof(InterchangeBaseNode_GetBooleanAttribute) == 0x000018, "Wrong size on InterchangeBaseNode_GetBooleanAttribute");
static_assert(offsetof(InterchangeBaseNode_GetBooleanAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_GetBooleanAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetBooleanAttribute, OutValue) == 0x000010, "Member 'InterchangeBaseNode_GetBooleanAttribute::OutValue' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetBooleanAttribute, ReturnValue) == 0x000011, "Member 'InterchangeBaseNode_GetBooleanAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetDisplayLabel
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetDisplayLabel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeBaseNode_GetDisplayLabel) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetDisplayLabel");
static_assert(sizeof(InterchangeBaseNode_GetDisplayLabel) == 0x000010, "Wrong size on InterchangeBaseNode_GetDisplayLabel");
static_assert(offsetof(InterchangeBaseNode_GetDisplayLabel, ReturnValue) == 0x000000, "Member 'InterchangeBaseNode_GetDisplayLabel::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetDoubleAttribute
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNode_GetDoubleAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutValue;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_276A[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_GetDoubleAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetDoubleAttribute");
static_assert(sizeof(InterchangeBaseNode_GetDoubleAttribute) == 0x000020, "Wrong size on InterchangeBaseNode_GetDoubleAttribute");
static_assert(offsetof(InterchangeBaseNode_GetDoubleAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_GetDoubleAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetDoubleAttribute, OutValue) == 0x000010, "Member 'InterchangeBaseNode_GetDoubleAttribute::OutValue' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetDoubleAttribute, ReturnValue) == 0x000018, "Member 'InterchangeBaseNode_GetDoubleAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetFloatAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_GetFloatAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutValue;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_276B[0x3];                                     // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_GetFloatAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetFloatAttribute");
static_assert(sizeof(InterchangeBaseNode_GetFloatAttribute) == 0x000018, "Wrong size on InterchangeBaseNode_GetFloatAttribute");
static_assert(offsetof(InterchangeBaseNode_GetFloatAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_GetFloatAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetFloatAttribute, OutValue) == 0x000010, "Member 'InterchangeBaseNode_GetFloatAttribute::OutValue' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetFloatAttribute, ReturnValue) == 0x000014, "Member 'InterchangeBaseNode_GetFloatAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetGuidAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_GetGuidAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OutValue;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_276C[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_GetGuidAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetGuidAttribute");
static_assert(sizeof(InterchangeBaseNode_GetGuidAttribute) == 0x000028, "Wrong size on InterchangeBaseNode_GetGuidAttribute");
static_assert(offsetof(InterchangeBaseNode_GetGuidAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_GetGuidAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetGuidAttribute, OutValue) == 0x000010, "Member 'InterchangeBaseNode_GetGuidAttribute::OutValue' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetGuidAttribute, ReturnValue) == 0x000020, "Member 'InterchangeBaseNode_GetGuidAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetInt32Attribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_GetInt32Attribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutValue;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_276D[0x3];                                     // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_GetInt32Attribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetInt32Attribute");
static_assert(sizeof(InterchangeBaseNode_GetInt32Attribute) == 0x000018, "Wrong size on InterchangeBaseNode_GetInt32Attribute");
static_assert(offsetof(InterchangeBaseNode_GetInt32Attribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_GetInt32Attribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetInt32Attribute, OutValue) == 0x000010, "Member 'InterchangeBaseNode_GetInt32Attribute::OutValue' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetInt32Attribute, ReturnValue) == 0x000014, "Member 'InterchangeBaseNode_GetInt32Attribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetLinearColorAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_GetLinearColorAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutValue;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_276E[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_GetLinearColorAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetLinearColorAttribute");
static_assert(sizeof(InterchangeBaseNode_GetLinearColorAttribute) == 0x000028, "Wrong size on InterchangeBaseNode_GetLinearColorAttribute");
static_assert(offsetof(InterchangeBaseNode_GetLinearColorAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_GetLinearColorAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetLinearColorAttribute, OutValue) == 0x000010, "Member 'InterchangeBaseNode_GetLinearColorAttribute::OutValue' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetLinearColorAttribute, ReturnValue) == 0x000020, "Member 'InterchangeBaseNode_GetLinearColorAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetNodeContainerType
// 0x0001 (0x0001 - 0x0000)
struct InterchangeBaseNode_GetNodeContainerType final
{
public:
	EInterchangeNodeContainerType                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeBaseNode_GetNodeContainerType) == 0x000001, "Wrong alignment on InterchangeBaseNode_GetNodeContainerType");
static_assert(sizeof(InterchangeBaseNode_GetNodeContainerType) == 0x000001, "Wrong size on InterchangeBaseNode_GetNodeContainerType");
static_assert(offsetof(InterchangeBaseNode_GetNodeContainerType, ReturnValue) == 0x000000, "Member 'InterchangeBaseNode_GetNodeContainerType::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetParentUid
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetParentUid final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeBaseNode_GetParentUid) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetParentUid");
static_assert(sizeof(InterchangeBaseNode_GetParentUid) == 0x000010, "Wrong size on InterchangeBaseNode_GetParentUid");
static_assert(offsetof(InterchangeBaseNode_GetParentUid, ReturnValue) == 0x000000, "Member 'InterchangeBaseNode_GetParentUid::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetStringAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_GetStringAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutValue;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_276F[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseNode_GetStringAttribute) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetStringAttribute");
static_assert(sizeof(InterchangeBaseNode_GetStringAttribute) == 0x000028, "Wrong size on InterchangeBaseNode_GetStringAttribute");
static_assert(offsetof(InterchangeBaseNode_GetStringAttribute, NodeAttributeKey) == 0x000000, "Member 'InterchangeBaseNode_GetStringAttribute::NodeAttributeKey' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetStringAttribute, OutValue) == 0x000010, "Member 'InterchangeBaseNode_GetStringAttribute::OutValue' has a wrong offset!");
static_assert(offsetof(InterchangeBaseNode_GetStringAttribute, ReturnValue) == 0x000020, "Member 'InterchangeBaseNode_GetStringAttribute::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetTargetNodeCount
// 0x0004 (0x0004 - 0x0000)
struct InterchangeBaseNode_GetTargetNodeCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeBaseNode_GetTargetNodeCount) == 0x000004, "Wrong alignment on InterchangeBaseNode_GetTargetNodeCount");
static_assert(sizeof(InterchangeBaseNode_GetTargetNodeCount) == 0x000004, "Wrong size on InterchangeBaseNode_GetTargetNodeCount");
static_assert(offsetof(InterchangeBaseNode_GetTargetNodeCount, ReturnValue) == 0x000000, "Member 'InterchangeBaseNode_GetTargetNodeCount::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetTargetNodeUids
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetTargetNodeUids final
{
public:
	TArray<class FString>                         OutTargetAssets;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeBaseNode_GetTargetNodeUids) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetTargetNodeUids");
static_assert(sizeof(InterchangeBaseNode_GetTargetNodeUids) == 0x000010, "Wrong size on InterchangeBaseNode_GetTargetNodeUids");
static_assert(offsetof(InterchangeBaseNode_GetTargetNodeUids, OutTargetAssets) == 0x000000, "Member 'InterchangeBaseNode_GetTargetNodeUids::OutTargetAssets' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetUniqueID
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetUniqueID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeBaseNode_GetUniqueID) == 0x000008, "Wrong alignment on InterchangeBaseNode_GetUniqueID");
static_assert(sizeof(InterchangeBaseNode_GetUniqueID) == 0x000010, "Wrong size on InterchangeBaseNode_GetUniqueID");
static_assert(offsetof(InterchangeBaseNode_GetUniqueID, ReturnValue) == 0x000000, "Member 'InterchangeBaseNode_GetUniqueID::ReturnValue' has a wrong offset!");

// Function InterchangeCore.InterchangeBaseNode.GetVector2Attribute
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNode_GetVector2Attribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
