#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeNodes

#include "Basic.hpp"

#include "InterchangeNodes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.AddCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid final
{
public:
	class FString                                 AnimationTrackUid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A1[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid");
static_assert(sizeof(InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid) == 0x000018, "Wrong size on InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid");
static_assert(offsetof(InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid, AnimationTrackUid) == 0x000000, "Member 'InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid::AnimationTrackUid' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid, ReturnValue) == 0x000010, "Member 'InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.RemoveCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid final
{
public:
	class FString                                 AnimationTrackUid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A2[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid");
static_assert(sizeof(InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid) == 0x000018, "Wrong size on InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid");
static_assert(offsetof(InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid, AnimationTrackUid) == 0x000000, "Member 'InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid::AnimationTrackUid' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid, ReturnValue) == 0x000010, "Member 'InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.SetCustomFrameRate
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetNode_SetCustomFrameRate final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A3[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetNode_SetCustomFrameRate) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetNode_SetCustomFrameRate");
static_assert(sizeof(InterchangeAnimationTrackSetNode_SetCustomFrameRate) == 0x000008, "Wrong size on InterchangeAnimationTrackSetNode_SetCustomFrameRate");
static_assert(offsetof(InterchangeAnimationTrackSetNode_SetCustomFrameRate, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetNode_SetCustomFrameRate::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetNode_SetCustomFrameRate, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetNode_SetCustomFrameRate::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.GetCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutAnimationTrackUid;                              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid");
static_assert(sizeof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid) == 0x000018, "Wrong size on InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid");
static_assert(offsetof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid, Param_Index) == 0x000000, "Member 'InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid::Param_Index' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid, OutAnimationTrackUid) == 0x000008, "Member 'InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid::OutAnimationTrackUid' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.GetCustomAnimationTrackUidCount
// 0x0004 (0x0004 - 0x0000)
struct InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount");
static_assert(sizeof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount) == 0x000004, "Wrong size on InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount");
static_assert(offsetof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount, ReturnValue) == 0x000000, "Member 'InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.GetCustomAnimationTrackUids
// 0x0010 (0x0010 - 0x0000)
struct InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids final
{
public:
	TArray<class FString>                         OutAnimationTrackUids;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids");
static_assert(sizeof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids) == 0x000010, "Wrong size on InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids");
static_assert(offsetof(InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids, OutAnimationTrackUids) == 0x000000, "Member 'InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids::OutAnimationTrackUids' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.GetCustomFrameRate
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetNode_GetCustomFrameRate final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A5[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetNode_GetCustomFrameRate) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetNode_GetCustomFrameRate");
static_assert(sizeof(InterchangeAnimationTrackSetNode_GetCustomFrameRate) == 0x000008, "Wrong size on InterchangeAnimationTrackSetNode_GetCustomFrameRate");
static_assert(offsetof(InterchangeAnimationTrackSetNode_GetCustomFrameRate, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetNode_GetCustomFrameRate::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetNode_GetCustomFrameRate, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetNode_GetCustomFrameRate::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackBaseNode.SetCustomCompletionMode
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackBaseNode_SetCustomCompletionMode final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A7[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackBaseNode_SetCustomCompletionMode) == 0x000004, "Wrong alignment on InterchangeAnimationTrackBaseNode_SetCustomCompletionMode");
static_assert(sizeof(InterchangeAnimationTrackBaseNode_SetCustomCompletionMode) == 0x000008, "Wrong size on InterchangeAnimationTrackBaseNode_SetCustomCompletionMode");
static_assert(offsetof(InterchangeAnimationTrackBaseNode_SetCustomCompletionMode, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackBaseNode_SetCustomCompletionMode::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackBaseNode_SetCustomCompletionMode, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackBaseNode_SetCustomCompletionMode::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackBaseNode.GetCustomCompletionMode
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackBaseNode_GetCustomCompletionMode final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A8[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackBaseNode_GetCustomCompletionMode) == 0x000004, "Wrong alignment on InterchangeAnimationTrackBaseNode_GetCustomCompletionMode");
static_assert(sizeof(InterchangeAnimationTrackBaseNode_GetCustomCompletionMode) == 0x000008, "Wrong size on InterchangeAnimationTrackBaseNode_GetCustomCompletionMode");
static_assert(offsetof(InterchangeAnimationTrackBaseNode_GetCustomCompletionMode, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackBaseNode_GetCustomCompletionMode::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackBaseNode_GetCustomCompletionMode, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackBaseNode_GetCustomCompletionMode::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.SetCustomDuration
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_SetCustomDuration final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27AA[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetInstanceNode_SetCustomDuration) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetInstanceNode_SetCustomDuration");
static_assert(sizeof(InterchangeAnimationTrackSetInstanceNode_SetCustomDuration) == 0x000008, "Wrong size on InterchangeAnimationTrackSetInstanceNode_SetCustomDuration");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_SetCustomDuration, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetInstanceNode_SetCustomDuration::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_SetCustomDuration, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetInstanceNode_SetCustomDuration::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.SetCustomStartFrame
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27AB[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame");
static_assert(sizeof(InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame) == 0x000008, "Wrong size on InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.SetCustomTimeScale
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27AC[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale");
static_assert(sizeof(InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale) == 0x000008, "Wrong size on InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.SetCustomTrackSetDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27AD[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid");
static_assert(sizeof(InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid) == 0x000018, "Wrong size on InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid, ReturnValue) == 0x000010, "Member 'InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.GetCustomDuration
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_GetCustomDuration final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27AE[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetInstanceNode_GetCustomDuration) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetInstanceNode_GetCustomDuration");
static_assert(sizeof(InterchangeAnimationTrackSetInstanceNode_GetCustomDuration) == 0x000008, "Wrong size on InterchangeAnimationTrackSetInstanceNode_GetCustomDuration");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_GetCustomDuration, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetInstanceNode_GetCustomDuration::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_GetCustomDuration, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetInstanceNode_GetCustomDuration::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.GetCustomStartFrame
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27AF[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame");
static_assert(sizeof(InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame) == 0x000008, "Wrong size on InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.GetCustomTimeScale
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B0[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale");
static_assert(sizeof(InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale) == 0x000008, "Wrong size on InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.GetCustomTrackSetDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B1[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid");
static_assert(sizeof(InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid) == 0x000018, "Wrong size on InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid, ReturnValue) == 0x000010, "Member 'InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackNode.SetCustomActorDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackNode_SetCustomActorDependencyUid final
{
public:
	class FString                                 DependencyUid;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B3[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackNode_SetCustomActorDependencyUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackNode_SetCustomActorDependencyUid");
static_assert(sizeof(InterchangeAnimationTrackNode_SetCustomActorDependencyUid) == 0x000018, "Wrong size on InterchangeAnimationTrackNode_SetCustomActorDependencyUid");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomActorDependencyUid, DependencyUid) == 0x000000, "Member 'InterchangeAnimationTrackNode_SetCustomActorDependencyUid::DependencyUid' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomActorDependencyUid, ReturnValue) == 0x000010, "Member 'InterchangeAnimationTrackNode_SetCustomActorDependencyUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackNode.SetCustomAnimationPayloadKey
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey final
{
public:
	class FString                                 InUniqueId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeAnimationPayLoadType              InType;                                            // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B4[0x6];                                     // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey) == 0x000008, "Wrong alignment on InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey");
static_assert(sizeof(InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey) == 0x000018, "Wrong size on InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey, InUniqueId) == 0x000000, "Member 'InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey::InUniqueId' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey, InType) == 0x000010, "Member 'InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey::InType' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey, ReturnValue) == 0x000011, "Member 'InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackNode.SetCustomFrameCount
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackNode_SetCustomFrameCount final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B5[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackNode_SetCustomFrameCount) == 0x000004, "Wrong alignment on InterchangeAnimationTrackNode_SetCustomFrameCount");
static_assert(sizeof(InterchangeAnimationTrackNode_SetCustomFrameCount) == 0x000008, "Wrong size on InterchangeAnimationTrackNode_SetCustomFrameCount");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomFrameCount, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackNode_SetCustomFrameCount::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomFrameCount, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackNode_SetCustomFrameCount::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackNode.SetCustomTargetedProperty
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackNode_SetCustomTargetedProperty final
{
public:
	int32                                         TargetedProperty;                                  // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B6[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackNode_SetCustomTargetedProperty) == 0x000004, "Wrong alignment on InterchangeAnimationTrackNode_SetCustomTargetedProperty");
static_assert(sizeof(InterchangeAnimationTrackNode_SetCustomTargetedProperty) == 0x000008, "Wrong size on InterchangeAnimationTrackNode_SetCustomTargetedProperty");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomTargetedProperty, TargetedProperty) == 0x000000, "Member 'InterchangeAnimationTrackNode_SetCustomTargetedProperty::TargetedProperty' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_SetCustomTargetedProperty, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackNode_SetCustomTargetedProperty::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackNode.GetCustomActorDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackNode_GetCustomActorDependencyUid final
{
public:
	class FString                                 DependencyUid;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B7[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackNode_GetCustomActorDependencyUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackNode_GetCustomActorDependencyUid");
static_assert(sizeof(InterchangeAnimationTrackNode_GetCustomActorDependencyUid) == 0x000018, "Wrong size on InterchangeAnimationTrackNode_GetCustomActorDependencyUid");
static_assert(offsetof(InterchangeAnimationTrackNode_GetCustomActorDependencyUid, DependencyUid) == 0x000000, "Member 'InterchangeAnimationTrackNode_GetCustomActorDependencyUid::DependencyUid' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_GetCustomActorDependencyUid, ReturnValue) == 0x000010, "Member 'InterchangeAnimationTrackNode_GetCustomActorDependencyUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackNode.GetCustomAnimationPayloadKey
// 0x0020 (0x0020 - 0x0000)
struct InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey final
{
public:
	struct FInterchangeAnimationPayLoadKey        AnimationPayLoadKey;                               // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B8[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey) == 0x000008, "Wrong alignment on InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey");
static_assert(sizeof(InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey) == 0x000020, "Wrong size on InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey");
static_assert(offsetof(InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey, AnimationPayLoadKey) == 0x000000, "Member 'InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey::AnimationPayLoadKey' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey, ReturnValue) == 0x000018, "Member 'InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackNode.GetCustomFrameCount
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackNode_GetCustomFrameCount final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27B9[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackNode_GetCustomFrameCount) == 0x000004, "Wrong alignment on InterchangeAnimationTrackNode_GetCustomFrameCount");
static_assert(sizeof(InterchangeAnimationTrackNode_GetCustomFrameCount) == 0x000008, "Wrong size on InterchangeAnimationTrackNode_GetCustomFrameCount");
static_assert(offsetof(InterchangeAnimationTrackNode_GetCustomFrameCount, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackNode_GetCustomFrameCount::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_GetCustomFrameCount, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackNode_GetCustomFrameCount::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeAnimationTrackNode.GetCustomTargetedProperty
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackNode_GetCustomTargetedProperty final
{
public:
	int32                                         TargetedProperty;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27BA[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackNode_GetCustomTargetedProperty) == 0x000004, "Wrong alignment on InterchangeAnimationTrackNode_GetCustomTargetedProperty");
static_assert(sizeof(InterchangeAnimationTrackNode_GetCustomTargetedProperty) == 0x000008, "Wrong size on InterchangeAnimationTrackNode_GetCustomTargetedProperty");
static_assert(offsetof(InterchangeAnimationTrackNode_GetCustomTargetedProperty, TargetedProperty) == 0x000000, "Member 'InterchangeAnimationTrackNode_GetCustomTargetedProperty::TargetedProperty' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackNode_GetCustomTargetedProperty, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackNode_GetCustomTargetedProperty::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeTransformAnimationTrackNode.SetCustomUsedChannels
// 0x0008 (0x0008 - 0x0000)
struct InterchangeTransformAnimationTrackNode_SetCustomUsedChannels final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27BC[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeTransformAnimationTrackNode_SetCustomUsedChannels) == 0x000004, "Wrong alignment on InterchangeTransformAnimationTrackNode_SetCustomUsedChannels");
static_assert(sizeof(InterchangeTransformAnimationTrackNode_SetCustomUsedChannels) == 0x000008, "Wrong size on InterchangeTransformAnimationTrackNode_SetCustomUsedChannels");
static_assert(offsetof(InterchangeTransformAnimationTrackNode_SetCustomUsedChannels, AttributeValue) == 0x000000, "Member 'InterchangeTransformAnimationTrackNode_SetCustomUsedChannels::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeTransformAnimationTrackNode_SetCustomUsedChannels, ReturnValue) == 0x000004, "Member 'InterchangeTransformAnimationTrackNode_SetCustomUsedChannels::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeTransformAnimationTrackNode.GetCustomUsedChannels
// 0x0008 (0x0008 - 0x0000)
struct InterchangeTransformAnimationTrackNode_GetCustomUsedChannels final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27BD[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeTransformAnimationTrackNode_GetCustomUsedChannels) == 0x000004, "Wrong alignment on InterchangeTransformAnimationTrackNode_GetCustomUsedChannels");
static_assert(sizeof(InterchangeTransformAnimationTrackNode_GetCustomUsedChannels) == 0x000008, "Wrong size on InterchangeTransformAnimationTrackNode_GetCustomUsedChannels");
static_assert(offsetof(InterchangeTransformAnimationTrackNode_GetCustomUsedChannels, AttributeValue) == 0x000000, "Member 'InterchangeTransformAnimationTrackNode_GetCustomUsedChannels::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeTransformAnimationTrackNode_GetCustomUsedChannels, ReturnValue) == 0x000004, "Member 'InterchangeTransformAnimationTrackNode_GetCustomUsedChannels::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetAnimationPayloadKeyForMorphTargetNodeUid
// 0x0028 (0x0028 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid final
{
public:
	class FString                                 MorphTargetNodeUid;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InUniqueId;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeAnimationPayLoadType              InType;                                            // 0x0020(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27BF[0x6];                                     // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid) == 0x000028, "Wrong size on InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid, MorphTargetNodeUid) == 0x000000, "Member 'InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid::MorphTargetNodeUid' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid, InUniqueId) == 0x000010, "Member 'InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid::InUniqueId' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid, InType) == 0x000020, "Member 'InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid::InType' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid, ReturnValue) == 0x000021, "Member 'InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetAnimationPayloadKeyForSceneNodeUid
// 0x0028 (0x0028 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid final
{
public:
	class FString                                 SceneNodeUid;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InUniqueId;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeAnimationPayLoadType              InType;                                            // 0x0020(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C0[0x6];                                     // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid) == 0x000028, "Wrong size on InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid, SceneNodeUid) == 0x000000, "Member 'InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid::SceneNodeUid' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid, InUniqueId) == 0x000010, "Member 'InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid::InUniqueId' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid, InType) == 0x000020, "Member 'InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid::InType' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid, ReturnValue) == 0x000021, "Member 'InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetCustomAnimationSampleRate
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate final
{
public:
	double                                        SampleRate;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C1[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate) == 0x000010, "Wrong size on InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate, SampleRate) == 0x000000, "Member 'InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate::SampleRate' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate, ReturnValue) == 0x000008, "Member 'InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetCustomAnimationStartTime
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime final
{
public:
	double                                        StartTime;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C2[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime) == 0x000010, "Wrong size on InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime, StartTime) == 0x000000, "Member 'InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime::StartTime' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime, ReturnValue) == 0x000008, "Member 'InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetCustomAnimationStopTime
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime final
{
public:
	double                                        StopTime;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C3[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime) == 0x000010, "Wrong size on InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime, StopTime) == 0x000000, "Member 'InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime::StopTime' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime, ReturnValue) == 0x000008, "Member 'InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetCustomSkeletonNodeUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C4[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid) == 0x000018, "Wrong size on InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid, AttributeValue) == 0x000000, "Member 'InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid, ReturnValue) == 0x000010, "Member 'InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetCustomAnimationSampleRate
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate final
{
public:
	double                                        SampleRate;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C5[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate) == 0x000010, "Wrong size on InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate, SampleRate) == 0x000000, "Member 'InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate::SampleRate' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate, ReturnValue) == 0x000008, "Member 'InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetCustomAnimationStartTime
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime final
{
public:
	double                                        StartTime;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C6[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime) == 0x000010, "Wrong size on InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime, StartTime) == 0x000000, "Member 'InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime::StartTime' has a wrong offset!");
static_assert(offsetof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime, ReturnValue) == 0x000008, "Member 'InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime::ReturnValue' has a wrong offset!");

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetCustomAnimationStopTime
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStopTime final
{
public:
	double                                        StopTime;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C7[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStopTime) == 0x000008, "Wrong alignment on InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStopTime");
static_assert(sizeof(InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStopTime) == 0x000010, "Wrong size on InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStopTime");
