#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeFactoryNodes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "InterchangeNodes_structs.hpp"
#include "InterchangeFactoryNodes_structs.hpp"


namespace SDK::Params
{

// Function InterchangeFactoryNodes.InterchangeAnimationTrackSetFactoryNode.AddCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid final
{
public:
	class FString                                 AnimationTrackUid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_286B[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid");
static_assert(sizeof(InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid) == 0x000018, "Wrong size on InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid, AnimationTrackUid) == 0x000000, "Member 'InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid::AnimationTrackUid' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid, ReturnValue) == 0x000010, "Member 'InterchangeAnimationTrackSetFactoryNode_AddCustomAnimationTrackUid::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeAnimationTrackSetFactoryNode.RemoveCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid final
{
public:
	class FString                                 AnimationTrackUid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_286C[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid");
static_assert(sizeof(InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid) == 0x000018, "Wrong size on InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid, AnimationTrackUid) == 0x000000, "Member 'InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid::AnimationTrackUid' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid, ReturnValue) == 0x000010, "Member 'InterchangeAnimationTrackSetFactoryNode_RemoveCustomAnimationTrackUid::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeAnimationTrackSetFactoryNode.SetCustomFrameRate
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_286D[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate");
static_assert(sizeof(InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate) == 0x000008, "Wrong size on InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetFactoryNode_SetCustomFrameRate::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeAnimationTrackSetFactoryNode.GetCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_286E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutAnimationTrackUid;                              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid");
static_assert(sizeof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid) == 0x000018, "Wrong size on InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid, Param_Index) == 0x000000, "Member 'InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid::Param_Index' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid, OutAnimationTrackUid) == 0x000008, "Member 'InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUid::OutAnimationTrackUid' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeAnimationTrackSetFactoryNode.GetCustomAnimationTrackUidCount
// 0x0004 (0x0004 - 0x0000)
struct InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUidCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUidCount) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUidCount");
static_assert(sizeof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUidCount) == 0x000004, "Wrong size on InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUidCount");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUidCount, ReturnValue) == 0x000000, "Member 'InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUidCount::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeAnimationTrackSetFactoryNode.GetCustomAnimationTrackUids
// 0x0010 (0x0010 - 0x0000)
struct InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUids final
{
public:
	TArray<class FString>                         OutAnimationTrackUids;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUids) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUids");
static_assert(sizeof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUids) == 0x000010, "Wrong size on InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUids");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUids, OutAnimationTrackUids) == 0x000000, "Member 'InterchangeAnimationTrackSetFactoryNode_GetCustomAnimationTrackUids::OutAnimationTrackUids' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeAnimationTrackSetFactoryNode.GetCustomFrameRate
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_286F[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate) == 0x000004, "Wrong alignment on InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate");
static_assert(sizeof(InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate) == 0x000008, "Wrong size on InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate, AttributeValue) == 0x000000, "Member 'InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate, ReturnValue) == 0x000004, "Member 'InterchangeAnimationTrackSetFactoryNode_GetCustomFrameRate::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeAnimationTrackSetFactoryNode.GetObjectClass
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetFactoryNode_GetObjectClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeAnimationTrackSetFactoryNode_GetObjectClass) == 0x000008, "Wrong alignment on InterchangeAnimationTrackSetFactoryNode_GetObjectClass");
static_assert(sizeof(InterchangeAnimationTrackSetFactoryNode_GetObjectClass) == 0x000008, "Wrong size on InterchangeAnimationTrackSetFactoryNode_GetObjectClass");
static_assert(offsetof(InterchangeAnimationTrackSetFactoryNode_GetObjectClass, ReturnValue) == 0x000000, "Member 'InterchangeAnimationTrackSetFactoryNode_GetObjectClass::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeActorFactoryNode.SetCustomActorClassName
// 0x0018 (0x0018 - 0x0000)
struct InterchangeActorFactoryNode_SetCustomActorClassName final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2871[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeActorFactoryNode_SetCustomActorClassName) == 0x000008, "Wrong alignment on InterchangeActorFactoryNode_SetCustomActorClassName");
static_assert(sizeof(InterchangeActorFactoryNode_SetCustomActorClassName) == 0x000018, "Wrong size on InterchangeActorFactoryNode_SetCustomActorClassName");
static_assert(offsetof(InterchangeActorFactoryNode_SetCustomActorClassName, AttributeValue) == 0x000000, "Member 'InterchangeActorFactoryNode_SetCustomActorClassName::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeActorFactoryNode_SetCustomActorClassName, ReturnValue) == 0x000010, "Member 'InterchangeActorFactoryNode_SetCustomActorClassName::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeActorFactoryNode.SetCustomGlobalTransform
// 0x0070 (0x0070 - 0x0000)
struct InterchangeActorFactoryNode_SetCustomGlobalTransform final
{
public:
	struct FTransform                             AttributeValue;                                    // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0060(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0061(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2872[0xE];                                     // 0x0062(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeActorFactoryNode_SetCustomGlobalTransform) == 0x000010, "Wrong alignment on InterchangeActorFactoryNode_SetCustomGlobalTransform");
static_assert(sizeof(InterchangeActorFactoryNode_SetCustomGlobalTransform) == 0x000070, "Wrong size on InterchangeActorFactoryNode_SetCustomGlobalTransform");
static_assert(offsetof(InterchangeActorFactoryNode_SetCustomGlobalTransform, AttributeValue) == 0x000000, "Member 'InterchangeActorFactoryNode_SetCustomGlobalTransform::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeActorFactoryNode_SetCustomGlobalTransform, bAddApplyDelegate) == 0x000060, "Member 'InterchangeActorFactoryNode_SetCustomGlobalTransform::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeActorFactoryNode_SetCustomGlobalTransform, ReturnValue) == 0x000061, "Member 'InterchangeActorFactoryNode_SetCustomGlobalTransform::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeActorFactoryNode.SetCustomMobility
// 0x0003 (0x0003 - 0x0000)
struct InterchangeActorFactoryNode_SetCustomMobility final
{
public:
	uint8                                         AttributeValue;                                    // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeActorFactoryNode_SetCustomMobility) == 0x000001, "Wrong alignment on InterchangeActorFactoryNode_SetCustomMobility");
static_assert(sizeof(InterchangeActorFactoryNode_SetCustomMobility) == 0x000003, "Wrong size on InterchangeActorFactoryNode_SetCustomMobility");
static_assert(offsetof(InterchangeActorFactoryNode_SetCustomMobility, AttributeValue) == 0x000000, "Member 'InterchangeActorFactoryNode_SetCustomMobility::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeActorFactoryNode_SetCustomMobility, bAddApplyDelegate) == 0x000001, "Member 'InterchangeActorFactoryNode_SetCustomMobility::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeActorFactoryNode_SetCustomMobility, ReturnValue) == 0x000002, "Member 'InterchangeActorFactoryNode_SetCustomMobility::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeActorFactoryNode.GetCustomActorClassName
// 0x0018 (0x0018 - 0x0000)
struct InterchangeActorFactoryNode_GetCustomActorClassName final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2873[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeActorFactoryNode_GetCustomActorClassName) == 0x000008, "Wrong alignment on InterchangeActorFactoryNode_GetCustomActorClassName");
static_assert(sizeof(InterchangeActorFactoryNode_GetCustomActorClassName) == 0x000018, "Wrong size on InterchangeActorFactoryNode_GetCustomActorClassName");
static_assert(offsetof(InterchangeActorFactoryNode_GetCustomActorClassName, AttributeValue) == 0x000000, "Member 'InterchangeActorFactoryNode_GetCustomActorClassName::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeActorFactoryNode_GetCustomActorClassName, ReturnValue) == 0x000010, "Member 'InterchangeActorFactoryNode_GetCustomActorClassName::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeActorFactoryNode.GetCustomGlobalTransform
// 0x0070 (0x0070 - 0x0000)
struct InterchangeActorFactoryNode_GetCustomGlobalTransform final
{
public:
	struct FTransform                             AttributeValue;                                    // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2874[0xF];                                     // 0x0061(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeActorFactoryNode_GetCustomGlobalTransform) == 0x000010, "Wrong alignment on InterchangeActorFactoryNode_GetCustomGlobalTransform");
static_assert(sizeof(InterchangeActorFactoryNode_GetCustomGlobalTransform) == 0x000070, "Wrong size on InterchangeActorFactoryNode_GetCustomGlobalTransform");
static_assert(offsetof(InterchangeActorFactoryNode_GetCustomGlobalTransform, AttributeValue) == 0x000000, "Member 'InterchangeActorFactoryNode_GetCustomGlobalTransform::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeActorFactoryNode_GetCustomGlobalTransform, ReturnValue) == 0x000060, "Member 'InterchangeActorFactoryNode_GetCustomGlobalTransform::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeActorFactoryNode.GetCustomMobility
// 0x0002 (0x0002 - 0x0000)
struct InterchangeActorFactoryNode_GetCustomMobility final
{
public:
	uint8                                         AttributeValue;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeActorFactoryNode_GetCustomMobility) == 0x000001, "Wrong alignment on InterchangeActorFactoryNode_GetCustomMobility");
static_assert(sizeof(InterchangeActorFactoryNode_GetCustomMobility) == 0x000002, "Wrong size on InterchangeActorFactoryNode_GetCustomMobility");
static_assert(offsetof(InterchangeActorFactoryNode_GetCustomMobility, AttributeValue) == 0x000000, "Member 'InterchangeActorFactoryNode_GetCustomMobility::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeActorFactoryNode_GetCustomMobility, ReturnValue) == 0x000001, "Member 'InterchangeActorFactoryNode_GetCustomMobility::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangePhysicalCameraFactoryNode.SetCustomFocalLength
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraFactoryNode_SetCustomFocalLength final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2876[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePhysicalCameraFactoryNode_SetCustomFocalLength) == 0x000004, "Wrong alignment on InterchangePhysicalCameraFactoryNode_SetCustomFocalLength");
static_assert(sizeof(InterchangePhysicalCameraFactoryNode_SetCustomFocalLength) == 0x000008, "Wrong size on InterchangePhysicalCameraFactoryNode_SetCustomFocalLength");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomFocalLength, AttributeValue) == 0x000000, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomFocalLength::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomFocalLength, bAddApplyDelegate) == 0x000004, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomFocalLength::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomFocalLength, ReturnValue) == 0x000005, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomFocalLength::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangePhysicalCameraFactoryNode.SetCustomFocusMethod
// 0x0003 (0x0003 - 0x0000)
struct InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod final
{
public:
	ECameraFocusMethod                            AttributeValue;                                    // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod) == 0x000001, "Wrong alignment on InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod");
static_assert(sizeof(InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod) == 0x000003, "Wrong size on InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod, AttributeValue) == 0x000000, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod, bAddApplyDelegate) == 0x000001, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod, ReturnValue) == 0x000002, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomFocusMethod::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangePhysicalCameraFactoryNode.SetCustomSensorHeight
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2877[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight) == 0x000004, "Wrong alignment on InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight");
static_assert(sizeof(InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight) == 0x000008, "Wrong size on InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight, AttributeValue) == 0x000000, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight, bAddApplyDelegate) == 0x000004, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight, ReturnValue) == 0x000005, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomSensorHeight::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangePhysicalCameraFactoryNode.SetCustomSensorWidth
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2878[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth) == 0x000004, "Wrong alignment on InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth");
static_assert(sizeof(InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth) == 0x000008, "Wrong size on InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth, AttributeValue) == 0x000000, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth, bAddApplyDelegate) == 0x000004, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth, ReturnValue) == 0x000005, "Member 'InterchangePhysicalCameraFactoryNode_SetCustomSensorWidth::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangePhysicalCameraFactoryNode.GetCustomFocalLength
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraFactoryNode_GetCustomFocalLength final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2879[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePhysicalCameraFactoryNode_GetCustomFocalLength) == 0x000004, "Wrong alignment on InterchangePhysicalCameraFactoryNode_GetCustomFocalLength");
static_assert(sizeof(InterchangePhysicalCameraFactoryNode_GetCustomFocalLength) == 0x000008, "Wrong size on InterchangePhysicalCameraFactoryNode_GetCustomFocalLength");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_GetCustomFocalLength, AttributeValue) == 0x000000, "Member 'InterchangePhysicalCameraFactoryNode_GetCustomFocalLength::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_GetCustomFocalLength, ReturnValue) == 0x000004, "Member 'InterchangePhysicalCameraFactoryNode_GetCustomFocalLength::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangePhysicalCameraFactoryNode.GetCustomFocusMethod
// 0x0002 (0x0002 - 0x0000)
struct InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod final
{
public:
	ECameraFocusMethod                            AttributeValue;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod) == 0x000001, "Wrong alignment on InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod");
static_assert(sizeof(InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod) == 0x000002, "Wrong size on InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod, AttributeValue) == 0x000000, "Member 'InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod, ReturnValue) == 0x000001, "Member 'InterchangePhysicalCameraFactoryNode_GetCustomFocusMethod::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangePhysicalCameraFactoryNode.GetCustomSensorHeight
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_287A[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight) == 0x000004, "Wrong alignment on InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight");
static_assert(sizeof(InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight) == 0x000008, "Wrong size on InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight, AttributeValue) == 0x000000, "Member 'InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight, ReturnValue) == 0x000004, "Member 'InterchangePhysicalCameraFactoryNode_GetCustomSensorHeight::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangePhysicalCameraFactoryNode.GetCustomSensorWidth
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_287B[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth) == 0x000004, "Wrong alignment on InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth");
static_assert(sizeof(InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth) == 0x000008, "Wrong size on InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth, AttributeValue) == 0x000000, "Member 'InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth, ReturnValue) == 0x000004, "Member 'InterchangePhysicalCameraFactoryNode_GetCustomSensorWidth::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.SetCustomAspectRatio
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_SetCustomAspectRatio final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_287D[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_SetCustomAspectRatio) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_SetCustomAspectRatio");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_SetCustomAspectRatio) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_SetCustomAspectRatio");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomAspectRatio, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_SetCustomAspectRatio::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomAspectRatio, bAddApplyDelegate) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_SetCustomAspectRatio::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomAspectRatio, ReturnValue) == 0x000005, "Member 'InterchangeStandardCameraFactoryNode_SetCustomAspectRatio::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.SetCustomFarClipPlane
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_287E[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane, bAddApplyDelegate) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane, ReturnValue) == 0x000005, "Member 'InterchangeStandardCameraFactoryNode_SetCustomFarClipPlane::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.SetCustomFieldOfView
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_SetCustomFieldOfView final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_287F[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_SetCustomFieldOfView) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_SetCustomFieldOfView");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_SetCustomFieldOfView) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_SetCustomFieldOfView");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomFieldOfView, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_SetCustomFieldOfView::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomFieldOfView, bAddApplyDelegate) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_SetCustomFieldOfView::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomFieldOfView, ReturnValue) == 0x000005, "Member 'InterchangeStandardCameraFactoryNode_SetCustomFieldOfView::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.SetCustomNearClipPlane
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2880[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane, bAddApplyDelegate) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane, ReturnValue) == 0x000005, "Member 'InterchangeStandardCameraFactoryNode_SetCustomNearClipPlane::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.SetCustomProjectionMode
// 0x0003 (0x0003 - 0x0000)
struct InterchangeStandardCameraFactoryNode_SetCustomProjectionMode final
{
public:
	ECameraProjectionMode                         AttributeValue;                                    // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_SetCustomProjectionMode) == 0x000001, "Wrong alignment on InterchangeStandardCameraFactoryNode_SetCustomProjectionMode");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_SetCustomProjectionMode) == 0x000003, "Wrong size on InterchangeStandardCameraFactoryNode_SetCustomProjectionMode");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomProjectionMode, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_SetCustomProjectionMode::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomProjectionMode, bAddApplyDelegate) == 0x000001, "Member 'InterchangeStandardCameraFactoryNode_SetCustomProjectionMode::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomProjectionMode, ReturnValue) == 0x000002, "Member 'InterchangeStandardCameraFactoryNode_SetCustomProjectionMode::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.SetCustomWidth
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_SetCustomWidth final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2881[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_SetCustomWidth) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_SetCustomWidth");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_SetCustomWidth) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_SetCustomWidth");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomWidth, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_SetCustomWidth::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomWidth, bAddApplyDelegate) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_SetCustomWidth::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_SetCustomWidth, ReturnValue) == 0x000005, "Member 'InterchangeStandardCameraFactoryNode_SetCustomWidth::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.GetCustomAspectRatio
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_GetCustomAspectRatio final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2882[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_GetCustomAspectRatio) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_GetCustomAspectRatio");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_GetCustomAspectRatio) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_GetCustomAspectRatio");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomAspectRatio, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_GetCustomAspectRatio::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomAspectRatio, ReturnValue) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_GetCustomAspectRatio::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.GetCustomFarClipPlane
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2883[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane, ReturnValue) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_GetCustomFarClipPlane::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.GetCustomFieldOfView
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_GetCustomFieldOfView final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2884[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_GetCustomFieldOfView) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_GetCustomFieldOfView");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_GetCustomFieldOfView) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_GetCustomFieldOfView");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomFieldOfView, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_GetCustomFieldOfView::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomFieldOfView, ReturnValue) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_GetCustomFieldOfView::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.GetCustomNearClipPlane
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2885[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane, ReturnValue) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_GetCustomNearClipPlane::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.GetCustomProjectionMode
// 0x0002 (0x0002 - 0x0000)
struct InterchangeStandardCameraFactoryNode_GetCustomProjectionMode final
{
public:
	ECameraProjectionMode                         AttributeValue;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_GetCustomProjectionMode) == 0x000001, "Wrong alignment on InterchangeStandardCameraFactoryNode_GetCustomProjectionMode");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_GetCustomProjectionMode) == 0x000002, "Wrong size on InterchangeStandardCameraFactoryNode_GetCustomProjectionMode");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomProjectionMode, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_GetCustomProjectionMode::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomProjectionMode, ReturnValue) == 0x000001, "Member 'InterchangeStandardCameraFactoryNode_GetCustomProjectionMode::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeStandardCameraFactoryNode.GetCustomWidth
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraFactoryNode_GetCustomWidth final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2886[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeStandardCameraFactoryNode_GetCustomWidth) == 0x000004, "Wrong alignment on InterchangeStandardCameraFactoryNode_GetCustomWidth");
static_assert(sizeof(InterchangeStandardCameraFactoryNode_GetCustomWidth) == 0x000008, "Wrong size on InterchangeStandardCameraFactoryNode_GetCustomWidth");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomWidth, AttributeValue) == 0x000000, "Member 'InterchangeStandardCameraFactoryNode_GetCustomWidth::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeStandardCameraFactoryNode_GetCustomWidth, ReturnValue) == 0x000004, "Member 'InterchangeStandardCameraFactoryNode_GetCustomWidth::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeBaseLightFactoryNode.SetCustomIntensity
// 0x0008 (0x0008 - 0x0000)
struct InterchangeBaseLightFactoryNode_SetCustomIntensity final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddApplyDelegate;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2888[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InterchangeBaseLightFactoryNode_SetCustomIntensity) == 0x000004, "Wrong alignment on InterchangeBaseLightFactoryNode_SetCustomIntensity");
static_assert(sizeof(InterchangeBaseLightFactoryNode_SetCustomIntensity) == 0x000008, "Wrong size on InterchangeBaseLightFactoryNode_SetCustomIntensity");
static_assert(offsetof(InterchangeBaseLightFactoryNode_SetCustomIntensity, AttributeValue) == 0x000000, "Member 'InterchangeBaseLightFactoryNode_SetCustomIntensity::AttributeValue' has a wrong offset!");
static_assert(offsetof(InterchangeBaseLightFactoryNode_SetCustomIntensity, bAddApplyDelegate) == 0x000004, "Member 'InterchangeBaseLightFactoryNode_SetCustomIntensity::bAddApplyDelegate' has a wrong offset!");
static_assert(offsetof(InterchangeBaseLightFactoryNode_SetCustomIntensity, ReturnValue) == 0x000005, "Member 'InterchangeBaseLightFactoryNode_SetCustomIntensity::ReturnValue' has a wrong offset!");

// Function InterchangeFactoryNodes.InterchangeBaseLightFactoryNode.SetCustomLightColor
