#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: L_Game02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function L_Game02.L_Game02_C.ExecuteUbergraph_L_Game02
// 0x0288 (0x0288 - 0x0000)
struct L_Game02_C_ExecuteUbergraph_L_Game02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D2[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D3[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0068(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D4[0x5];                                     // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0158(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D5[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0244(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x0254(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_2;            // 0x0264(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_3;            // 0x0274(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(L_Game02_C_ExecuteUbergraph_L_Game02) == 0x000008, "Wrong alignment on L_Game02_C_ExecuteUbergraph_L_Game02");
static_assert(sizeof(L_Game02_C_ExecuteUbergraph_L_Game02) == 0x000288, "Wrong size on L_Game02_C_ExecuteUbergraph_L_Game02");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, EntryPoint) == 0x000000, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::EntryPoint' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, Temp_bool_IsClosed_Variable) == 0x000020, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, Temp_bool_Has_Been_Initd_Variable) == 0x000021, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, Temp_bool_Has_Been_Initd_Variable_1) == 0x000022, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_BreakVector_X) == 0x000050, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_BreakVector_Y) == 0x000058, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_BreakVector_Z) == 0x000060, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000068, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000150, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000151, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_IsValid_ReturnValue_2) == 0x000152, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000158, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000240, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, Temp_bool_IsClosed_Variable_1) == 0x000241, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_LinearColorLerp_ReturnValue) == 0x000244, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_LinearColorLerp_ReturnValue_1) == 0x000254, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_LinearColorLerp_ReturnValue_2) == 0x000264, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_LinearColorLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(L_Game02_C_ExecuteUbergraph_L_Game02, CallFunc_LinearColorLerp_ReturnValue_3) == 0x000274, "Member 'L_Game02_C_ExecuteUbergraph_L_Game02::CallFunc_LinearColorLerp_ReturnValue_3' has a wrong offset!");

}

