#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: L_Game02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass L_Game02.L_Game02_C
// 0x0088 (0x0328 - 0x02A0)
class AL_Game02_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_459F08234393E96B0159F48A16EC4B27; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_459F08234393E96B0159F48A16EC4B27; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36CD[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_37F6ACBC44C3574153956BA286CF70E2; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_37F6ACBC44C3574153956BA286CF70E2; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36CE[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CityDensity;                                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HellDensity;                                       // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUpdate;                                         // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36CF[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HellInscateringColor;                              // 0x02D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CityInscateringColor;                              // 0x02E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HellEmissive;                                      // 0x02F4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CityEmissive;                                      // 0x0304(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D0[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AExponentialHeightFog*                  HeightFog_02_City_2_ExecuteUbergraph_L_Game02_RefProperty; // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AExponentialHeightFog*                  HeightFog_01_Hell_0_ExecuteUbergraph_L_Game02_RefProperty; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void ExecuteUbergraph_L_Game02(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"L_Game02_C">();
	}
	static class AL_Game02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AL_Game02_C>();
	}
};
static_assert(alignof(AL_Game02_C) == 0x000008, "Wrong alignment on AL_Game02_C");
static_assert(sizeof(AL_Game02_C) == 0x000328, "Wrong size on AL_Game02_C");
static_assert(offsetof(AL_Game02_C, UberGraphFrame) == 0x0002A0, "Member 'AL_Game02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, Timeline_0_NewTrack_0_459F08234393E96B0159F48A16EC4B27) == 0x0002A8, "Member 'AL_Game02_C::Timeline_0_NewTrack_0_459F08234393E96B0159F48A16EC4B27' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, Timeline_0__Direction_459F08234393E96B0159F48A16EC4B27) == 0x0002AC, "Member 'AL_Game02_C::Timeline_0__Direction_459F08234393E96B0159F48A16EC4B27' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, Timeline_0) == 0x0002B0, "Member 'AL_Game02_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, Timeline_NewTrack_0_37F6ACBC44C3574153956BA286CF70E2) == 0x0002B8, "Member 'AL_Game02_C::Timeline_NewTrack_0_37F6ACBC44C3574153956BA286CF70E2' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, Timeline__Direction_37F6ACBC44C3574153956BA286CF70E2) == 0x0002BC, "Member 'AL_Game02_C::Timeline__Direction_37F6ACBC44C3574153956BA286CF70E2' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, Timeline) == 0x0002C0, "Member 'AL_Game02_C::Timeline' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, CityDensity) == 0x0002C8, "Member 'AL_Game02_C::CityDensity' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, HellDensity) == 0x0002CC, "Member 'AL_Game02_C::HellDensity' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, CanUpdate) == 0x0002D0, "Member 'AL_Game02_C::CanUpdate' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, HellInscateringColor) == 0x0002D4, "Member 'AL_Game02_C::HellInscateringColor' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, CityInscateringColor) == 0x0002E4, "Member 'AL_Game02_C::CityInscateringColor' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, HellEmissive) == 0x0002F4, "Member 'AL_Game02_C::HellEmissive' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, CityEmissive) == 0x000304, "Member 'AL_Game02_C::CityEmissive' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, HeightFog_02_City_2_ExecuteUbergraph_L_Game02_RefProperty) == 0x000318, "Member 'AL_Game02_C::HeightFog_02_City_2_ExecuteUbergraph_L_Game02_RefProperty' has a wrong offset!");
static_assert(offsetof(AL_Game02_C, HeightFog_01_Hell_0_ExecuteUbergraph_L_Game02_RefProperty) == 0x000320, "Member 'AL_Game02_C::HeightFog_01_Hell_0_ExecuteUbergraph_L_Game02_RefProperty' has a wrong offset!");

}

