#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: L_MainMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass L_MainMenu.L_MainMenu_C
// 0x00F0 (0x0390 - 0x02A0)
class AL_MainMenu_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_343785DF4575A265D14F909D7BBDB64E; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_343785DF4575A265D14F909D7BBDB64E; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3418[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3419[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Camera01;                                          // 0x02C0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Camera02;                                          // 0x0320(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CameraActor_1_ExecuteUbergraph_L_MainMenu_RefProperty; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CameraActor2_ExecuteUbergraph_L_MainMenu_RefProperty; // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void CameraAnimation();
	void ExecuteUbergraph_L_MainMenu(int32 EntryPoint);
	void OnFailure_5A70658949E245B98F911992109D175C();
	void OnSuccess_5A70658949E245B98F911992109D175C();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Widget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"L_MainMenu_C">();
	}
	static class AL_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AL_MainMenu_C>();
	}
};
static_assert(alignof(AL_MainMenu_C) == 0x000010, "Wrong alignment on AL_MainMenu_C");
static_assert(sizeof(AL_MainMenu_C) == 0x000390, "Wrong size on AL_MainMenu_C");
static_assert(offsetof(AL_MainMenu_C, UberGraphFrame) == 0x0002A0, "Member 'AL_MainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AL_MainMenu_C, Timeline_0_NewTrack_0_343785DF4575A265D14F909D7BBDB64E) == 0x0002A8, "Member 'AL_MainMenu_C::Timeline_0_NewTrack_0_343785DF4575A265D14F909D7BBDB64E' has a wrong offset!");
static_assert(offsetof(AL_MainMenu_C, Timeline_0__Direction_343785DF4575A265D14F909D7BBDB64E) == 0x0002AC, "Member 'AL_MainMenu_C::Timeline_0__Direction_343785DF4575A265D14F909D7BBDB64E' has a wrong offset!");
static_assert(offsetof(AL_MainMenu_C, Timeline_0) == 0x0002B0, "Member 'AL_MainMenu_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AL_MainMenu_C, Camera01) == 0x0002C0, "Member 'AL_MainMenu_C::Camera01' has a wrong offset!");
static_assert(offsetof(AL_MainMenu_C, Camera02) == 0x000320, "Member 'AL_MainMenu_C::Camera02' has a wrong offset!");
static_assert(offsetof(AL_MainMenu_C, CameraActor_1_ExecuteUbergraph_L_MainMenu_RefProperty) == 0x000380, "Member 'AL_MainMenu_C::CameraActor_1_ExecuteUbergraph_L_MainMenu_RefProperty' has a wrong offset!");
static_assert(offsetof(AL_MainMenu_C, CameraActor2_ExecuteUbergraph_L_MainMenu_RefProperty) == 0x000388, "Member 'AL_MainMenu_C::CameraActor2_ExecuteUbergraph_L_MainMenu_RefProperty' has a wrong offset!");

}

