#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Large_wall_bowl_03_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass large_wall_bowl_03_BP.large_wall_bowl_03_BP_C
// 0x0018 (0x02B0 - 0x0298)
class ALarge_wall_bowl_03_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Hydrangea_wall5_StaticMeshComponent0;              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bowl11_StaticMeshComponent0;                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"large_wall_bowl_03_BP_C">();
	}
	static class ALarge_wall_bowl_03_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALarge_wall_bowl_03_BP_C>();
	}
};
static_assert(alignof(ALarge_wall_bowl_03_BP_C) == 0x000008, "Wrong alignment on ALarge_wall_bowl_03_BP_C");
static_assert(sizeof(ALarge_wall_bowl_03_BP_C) == 0x0002B0, "Wrong size on ALarge_wall_bowl_03_BP_C");
static_assert(offsetof(ALarge_wall_bowl_03_BP_C, Hydrangea_wall5_StaticMeshComponent0) == 0x000298, "Member 'ALarge_wall_bowl_03_BP_C::Hydrangea_wall5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_03_BP_C, bowl11_StaticMeshComponent0) == 0x0002A0, "Member 'ALarge_wall_bowl_03_BP_C::bowl11_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_03_BP_C, SharedRoot) == 0x0002A8, "Member 'ALarge_wall_bowl_03_BP_C::SharedRoot' has a wrong offset!");

}

