#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Large_rose_bed_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass large_rose_bed_BP.large_rose_bed_BP_C
// 0x00F8 (0x0390 - 0x0298)
class ALarge_rose_bed_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Rose_bush_13_StaticMeshComponent0;                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_15_StaticMeshComponent0;                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lupin4_StaticMeshComponent0;                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_4_StaticMeshComponent0;                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_3_StaticMeshComponent0;                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lupin5_StaticMeshComponent0;                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_2_StaticMeshComponent0;                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bay_tree5_StaticMeshComponent0;                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_20_StaticMeshComponent0;                 // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pennisetum5_StaticMeshComponent0;                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_19_StaticMeshComponent0;                 // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_18_StaticMeshComponent0;                 // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_17_StaticMeshComponent0;                 // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_16_StaticMeshComponent0;                 // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_03_StaticMeshComponent0;                 // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_02_StaticMeshComponent0;                 // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_14_StaticMeshComponent0;                 // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bay_tree6_StaticMeshComponent0;                    // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bay_tree01_StaticMeshComponent0;                   // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pennisetum4_StaticMeshComponent0;                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_5_StaticMeshComponent0;                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_12_StaticMeshComponent0;                 // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rose_bush_01_StaticMeshComponent0;                 // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lupin7_StaticMeshComponent0;                       // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lupin6_StaticMeshComponent0;                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_long_StaticMeshComponent0;              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36BA[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             Rose_colours;                                      // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Rose_colour_picker;                                // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"large_rose_bed_BP_C">();
	}
	static class ALarge_rose_bed_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALarge_rose_bed_BP_C>();
	}
};
static_assert(alignof(ALarge_rose_bed_BP_C) == 0x000008, "Wrong alignment on ALarge_rose_bed_BP_C");
static_assert(sizeof(ALarge_rose_bed_BP_C) == 0x000390, "Wrong size on ALarge_rose_bed_BP_C");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_13_StaticMeshComponent0) == 0x000298, "Member 'ALarge_rose_bed_BP_C::Rose_bush_13_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_15_StaticMeshComponent0) == 0x0002A0, "Member 'ALarge_rose_bed_BP_C::Rose_bush_15_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Lupin4_StaticMeshComponent0) == 0x0002A8, "Member 'ALarge_rose_bed_BP_C::Lupin4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_4_StaticMeshComponent0) == 0x0002B0, "Member 'ALarge_rose_bed_BP_C::Rose_bush_4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_3_StaticMeshComponent0) == 0x0002B8, "Member 'ALarge_rose_bed_BP_C::Rose_bush_3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Lupin5_StaticMeshComponent0) == 0x0002C0, "Member 'ALarge_rose_bed_BP_C::Lupin5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_2_StaticMeshComponent0) == 0x0002C8, "Member 'ALarge_rose_bed_BP_C::Rose_bush_2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, bay_tree5_StaticMeshComponent0) == 0x0002D0, "Member 'ALarge_rose_bed_BP_C::bay_tree5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_20_StaticMeshComponent0) == 0x0002D8, "Member 'ALarge_rose_bed_BP_C::Rose_bush_20_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Pennisetum5_StaticMeshComponent0) == 0x0002E0, "Member 'ALarge_rose_bed_BP_C::Pennisetum5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_19_StaticMeshComponent0) == 0x0002E8, "Member 'ALarge_rose_bed_BP_C::Rose_bush_19_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_18_StaticMeshComponent0) == 0x0002F0, "Member 'ALarge_rose_bed_BP_C::Rose_bush_18_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_17_StaticMeshComponent0) == 0x0002F8, "Member 'ALarge_rose_bed_BP_C::Rose_bush_17_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_16_StaticMeshComponent0) == 0x000300, "Member 'ALarge_rose_bed_BP_C::Rose_bush_16_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_03_StaticMeshComponent0) == 0x000308, "Member 'ALarge_rose_bed_BP_C::Rose_bush_03_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_02_StaticMeshComponent0) == 0x000310, "Member 'ALarge_rose_bed_BP_C::Rose_bush_02_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_14_StaticMeshComponent0) == 0x000318, "Member 'ALarge_rose_bed_BP_C::Rose_bush_14_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, bay_tree6_StaticMeshComponent0) == 0x000320, "Member 'ALarge_rose_bed_BP_C::bay_tree6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, bay_tree01_StaticMeshComponent0) == 0x000328, "Member 'ALarge_rose_bed_BP_C::bay_tree01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Pennisetum4_StaticMeshComponent0) == 0x000330, "Member 'ALarge_rose_bed_BP_C::Pennisetum4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_5_StaticMeshComponent0) == 0x000338, "Member 'ALarge_rose_bed_BP_C::Rose_bush_5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_12_StaticMeshComponent0) == 0x000340, "Member 'ALarge_rose_bed_BP_C::Rose_bush_12_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_bush_01_StaticMeshComponent0) == 0x000348, "Member 'ALarge_rose_bed_BP_C::Rose_bush_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Lupin7_StaticMeshComponent0) == 0x000350, "Member 'ALarge_rose_bed_BP_C::Lupin7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Lupin6_StaticMeshComponent0) == 0x000358, "Member 'ALarge_rose_bed_BP_C::Lupin6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Flower_bed_long_StaticMeshComponent0) == 0x000360, "Member 'ALarge_rose_bed_BP_C::Flower_bed_long_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, SharedRoot) == 0x000368, "Member 'ALarge_rose_bed_BP_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, NewVar_0) == 0x000370, "Member 'ALarge_rose_bed_BP_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_colours) == 0x000378, "Member 'ALarge_rose_bed_BP_C::Rose_colours' has a wrong offset!");
static_assert(offsetof(ALarge_rose_bed_BP_C, Rose_colour_picker) == 0x000388, "Member 'ALarge_rose_bed_BP_C::Rose_colour_picker' has a wrong offset!");

}

