#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Large_wall_bowl_01_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass large_wall_bowl_01_BP.large_wall_bowl_01_BP_C
// 0x0048 (0x02E0 - 0x0298)
class ALarge_wall_bowl_01_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Allium;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geranium13_StaticMeshComponent1;                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Creeping_jenny_02;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geranium11_StaticMeshComponent0;                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geranium13_StaticMeshComponent0;                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dianthus11_StaticMeshComponent0;                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dianthus13_StaticMeshComponent0;                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bowl12_StaticMeshComponent0;                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"large_wall_bowl_01_BP_C">();
	}
	static class ALarge_wall_bowl_01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALarge_wall_bowl_01_BP_C>();
	}
};
static_assert(alignof(ALarge_wall_bowl_01_BP_C) == 0x000008, "Wrong alignment on ALarge_wall_bowl_01_BP_C");
static_assert(sizeof(ALarge_wall_bowl_01_BP_C) == 0x0002E0, "Wrong size on ALarge_wall_bowl_01_BP_C");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, Allium) == 0x000298, "Member 'ALarge_wall_bowl_01_BP_C::Allium' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, Geranium13_StaticMeshComponent1) == 0x0002A0, "Member 'ALarge_wall_bowl_01_BP_C::Geranium13_StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, Creeping_jenny_02) == 0x0002A8, "Member 'ALarge_wall_bowl_01_BP_C::Creeping_jenny_02' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, Geranium11_StaticMeshComponent0) == 0x0002B0, "Member 'ALarge_wall_bowl_01_BP_C::Geranium11_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, Geranium13_StaticMeshComponent0) == 0x0002B8, "Member 'ALarge_wall_bowl_01_BP_C::Geranium13_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, Dianthus11_StaticMeshComponent0) == 0x0002C0, "Member 'ALarge_wall_bowl_01_BP_C::Dianthus11_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, Dianthus13_StaticMeshComponent0) == 0x0002C8, "Member 'ALarge_wall_bowl_01_BP_C::Dianthus13_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, bowl12_StaticMeshComponent0) == 0x0002D0, "Member 'ALarge_wall_bowl_01_BP_C::bowl12_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ALarge_wall_bowl_01_BP_C, SharedRoot) == 0x0002D8, "Member 'ALarge_wall_bowl_01_BP_C::SharedRoot' has a wrong offset!");

}

