#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LavaEnd_W

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LavaEnd_W.LavaEnd_W_C.ExecuteUbergraph_LavaEnd_W
// 0x01B8 (0x01B8 - 0x0000)
struct LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3328[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ConfirmQuit_C*                       CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Height0_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	class ABP_Height0_C*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetHeightTexteMeter_Return;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3329[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Lava_C*>                     CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332A[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lava_C*                             CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game;                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332B[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_1;                    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332C[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_RescuePoint_C*>              CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0110(0x0010)(ReferenceParm)
	class ABP_RescuePoint_C*                      CallFunc_Array_Get_Item_2;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332D[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate_1;              // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332E[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTimer_Timer;                           // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_ConvertTimeToTextFormat_ReturnValue;      // 0x0168(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01A0(0x0018)()
};
static_assert(alignof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W) == 0x000008, "Wrong alignment on LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W");
static_assert(sizeof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W) == 0x0001B8, "Wrong size on LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, EntryPoint) == 0x000000, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Create_ReturnValue) == 0x000010, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Array_Get_Item) == 0x000028, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetHeightTexteMeter_Return) == 0x000030, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetHeightTexteMeter_Return' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0000A8, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x0000B0, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_IsServer_ReturnValue) == 0x0000B8, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0000C0, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_IsServer_ReturnValue_1) == 0x0000D0, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetGameState_ReturnValue) == 0x0000E0, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetGameState_ReturnValue_1) == 0x0000E8, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, K2Node_DynamicCast_AsGS_Game) == 0x0000F0, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::K2Node_DynamicCast_AsGS_Game' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, K2Node_DynamicCast_AsGS_Game_1) == 0x000100, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::K2Node_DynamicCast_AsGS_Game_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000110, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Array_Get_Item_2) == 0x000120, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetGameState_ReturnValue_2) == 0x000128, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, K2Node_DynamicCast_AsBPI_Gamestate) == 0x000130, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetGameState_ReturnValue_3) == 0x000148, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetGameState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, K2Node_DynamicCast_AsBPI_Gamestate_1) == 0x000150, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::K2Node_DynamicCast_AsBPI_Gamestate_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_GetTimer_Timer) == 0x000164, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_GetTimer_Timer' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_ConvertTimeToTextFormat_ReturnValue) == 0x000168, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_ConvertTimeToTextFormat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000180, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000190, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001A0, "Member 'LavaEnd_W_C_ExecuteUbergraph_LavaEnd_W::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

// Function LavaEnd_W.LavaEnd_W_C.GetHeightTexteMeter
// 0x00C0 (0x00C0 - 0x0000)
struct LavaEnd_W_C_GetHeightTexteMeter final
{
public:
	class AActor*                                 Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Return;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0098(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LavaEnd_W_C_GetHeightTexteMeter) == 0x000008, "Wrong alignment on LavaEnd_W_C_GetHeightTexteMeter");
static_assert(sizeof(LavaEnd_W_C_GetHeightTexteMeter) == 0x0000C0, "Wrong size on LavaEnd_W_C_GetHeightTexteMeter");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, Self2) == 0x000000, "Member 'LavaEnd_W_C_GetHeightTexteMeter::Self2' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, Return) == 0x000008, "Member 'LavaEnd_W_C_GetHeightTexteMeter::Return' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_BreakVector_X) == 0x000050, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_BreakVector_Y) == 0x000058, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_BreakVector_Z) == 0x000060, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_BreakVector_X_1) == 0x000068, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_BreakVector_Y_1) == 0x000070, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_BreakVector_Z_1) == 0x000078, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000080, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000088, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_Round_ReturnValue) == 0x000090, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_Clamp_ReturnValue) == 0x000094, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_Conv_IntToText_ReturnValue) == 0x000098, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LavaEnd_W_C_GetHeightTexteMeter, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'LavaEnd_W_C_GetHeightTexteMeter::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

