#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lilly_pads_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lilly_pads_BP.Lilly_pads_BP_C
// 0x0030 (0x02C8 - 0x0298)
class ALilly_pads_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Lilly_flower;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lilly_pad;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Lilly_amount;                                      // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x02B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	int32                                         Lilly_position;                                    // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Flower_amount;                                     // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lilly_pads_BP_C">();
	}
	static class ALilly_pads_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALilly_pads_BP_C>();
	}
};
static_assert(alignof(ALilly_pads_BP_C) == 0x000008, "Wrong alignment on ALilly_pads_BP_C");
static_assert(sizeof(ALilly_pads_BP_C) == 0x0002C8, "Wrong size on ALilly_pads_BP_C");
static_assert(offsetof(ALilly_pads_BP_C, Lilly_flower) == 0x000298, "Member 'ALilly_pads_BP_C::Lilly_flower' has a wrong offset!");
static_assert(offsetof(ALilly_pads_BP_C, Lilly_pad) == 0x0002A0, "Member 'ALilly_pads_BP_C::Lilly_pad' has a wrong offset!");
static_assert(offsetof(ALilly_pads_BP_C, DefaultSceneRoot) == 0x0002A8, "Member 'ALilly_pads_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALilly_pads_BP_C, Lilly_amount) == 0x0002B0, "Member 'ALilly_pads_BP_C::Lilly_amount' has a wrong offset!");
static_assert(offsetof(ALilly_pads_BP_C, Stream) == 0x0002B4, "Member 'ALilly_pads_BP_C::Stream' has a wrong offset!");
static_assert(offsetof(ALilly_pads_BP_C, Lilly_position) == 0x0002BC, "Member 'ALilly_pads_BP_C::Lilly_position' has a wrong offset!");
static_assert(offsetof(ALilly_pads_BP_C, Flower_amount) == 0x0002C0, "Member 'ALilly_pads_BP_C::Flower_amount' has a wrong offset!");

}

