#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lilly_pads_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Lilly_pads_BP.Lilly_pads_BP_C.UserConstructionScript
// 0x01B0 (0x01B0 - 0x0000)
struct Lilly_pads_BP_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B2[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B3[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RandomRotatorFromStream_ReturnValue;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakRotIntoAxes_X;                       // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Y;                       // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Z;                       // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B4[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_3; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_1;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast_1;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast_1;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lilly_pads_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on Lilly_pads_BP_C_UserConstructionScript");
static_assert(sizeof(Lilly_pads_BP_C_UserConstructionScript) == 0x0001B0, "Wrong size on Lilly_pads_BP_C_UserConstructionScript");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'Lilly_pads_BP_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, Temp_int_Variable_1) == 0x000008, "Member 'Lilly_pads_BP_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Multiply_IntInt_ReturnValue) == 0x000010, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000014, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000028, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000030, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000038, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000058, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomRotatorFromStream_ReturnValue) == 0x000060, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomRotatorFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_X) == 0x000078, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_X' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_Y) == 0x000090, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_Y' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_Z) == 0x0000A8, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_Z' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x0000C0, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000C8, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x0000E0, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_3) == 0x0000E4, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0000E8, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000160, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x000168, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x000170, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast) == 0x000174, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1) == 0x000178, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1) == 0x00017C, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeVector_X_ImplicitCast) == 0x000180, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeVector_Y_ImplicitCast) == 0x000188, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeVector_Z_ImplicitCast) == 0x000190, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeVector_Z_ImplicitCast_1) == 0x000198, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeVector_Z_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeVector_Y_ImplicitCast_1) == 0x0001A0, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeVector_Y_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Lilly_pads_BP_C_UserConstructionScript, CallFunc_MakeVector_X_ImplicitCast_1) == 0x0001A8, "Member 'Lilly_pads_BP_C_UserConstructionScript::CallFunc_MakeVector_X_ImplicitCast_1' has a wrong offset!");

}

