#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadSaveSwitcher_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadSaveSwitcher_W.LoadSaveSwitcher_W_C
// 0x0048 (0x0308 - 0x02C0)
class ULoadSaveSwitcher_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BackButton;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_3;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadSave_W_C*                          LoadSave_W_01;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_66;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerNumber;                                      // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1F[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Mode;                                              // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__LoadSaveSwitcher_W_BackButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_LoadSaveSwitcher_W(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadSaveSwitcher_W_C">();
	}
	static class ULoadSaveSwitcher_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadSaveSwitcher_W_C>();
	}
};
static_assert(alignof(ULoadSaveSwitcher_W_C) == 0x000008, "Wrong alignment on ULoadSaveSwitcher_W_C");
static_assert(sizeof(ULoadSaveSwitcher_W_C) == 0x000308, "Wrong size on ULoadSaveSwitcher_W_C");
static_assert(offsetof(ULoadSaveSwitcher_W_C, UberGraphFrame) == 0x0002C0, "Member 'ULoadSaveSwitcher_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadSaveSwitcher_W_C, NewAnimation) == 0x0002C8, "Member 'ULoadSaveSwitcher_W_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(ULoadSaveSwitcher_W_C, BackButton) == 0x0002D0, "Member 'ULoadSaveSwitcher_W_C::BackButton' has a wrong offset!");
static_assert(offsetof(ULoadSaveSwitcher_W_C, Border_3) == 0x0002D8, "Member 'ULoadSaveSwitcher_W_C::Border_3' has a wrong offset!");
static_assert(offsetof(ULoadSaveSwitcher_W_C, LoadSave_W_01) == 0x0002E0, "Member 'ULoadSaveSwitcher_W_C::LoadSave_W_01' has a wrong offset!");
static_assert(offsetof(ULoadSaveSwitcher_W_C, TextBlock_66) == 0x0002E8, "Member 'ULoadSaveSwitcher_W_C::TextBlock_66' has a wrong offset!");
static_assert(offsetof(ULoadSaveSwitcher_W_C, PlayerNumber) == 0x0002F0, "Member 'ULoadSaveSwitcher_W_C::PlayerNumber' has a wrong offset!");
static_assert(offsetof(ULoadSaveSwitcher_W_C, Mode) == 0x0002F8, "Member 'ULoadSaveSwitcher_W_C::Mode' has a wrong offset!");

}

