#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_Sublevel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lobby_Sublevel.Lobby_Sublevel_C
// 0x0048 (0x02E8 - 0x02A0)
class ALobby_Sublevel_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_NewTrack_0_7D40A1384DA593C5C1E4A2B65CDB10D3; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_7D40A1384DA593C5C1E4A2B65CDB10D3; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A76[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        TravellingTime;                                    // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitLoc;                                           // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CameraActor_0_ExecuteUbergraph_Lobby_Sublevel_RefProperty; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CameraActor2_1_ExecuteUbergraph_Lobby_Sublevel_RefProperty; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Lobby_Sublevel(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lobby_Sublevel_C">();
	}
	static class ALobby_Sublevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobby_Sublevel_C>();
	}
};
static_assert(alignof(ALobby_Sublevel_C) == 0x000008, "Wrong alignment on ALobby_Sublevel_C");
static_assert(sizeof(ALobby_Sublevel_C) == 0x0002E8, "Wrong size on ALobby_Sublevel_C");
static_assert(offsetof(ALobby_Sublevel_C, UberGraphFrame) == 0x0002A0, "Member 'ALobby_Sublevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobby_Sublevel_C, Timeline_NewTrack_0_7D40A1384DA593C5C1E4A2B65CDB10D3) == 0x0002A8, "Member 'ALobby_Sublevel_C::Timeline_NewTrack_0_7D40A1384DA593C5C1E4A2B65CDB10D3' has a wrong offset!");
static_assert(offsetof(ALobby_Sublevel_C, Timeline__Direction_7D40A1384DA593C5C1E4A2B65CDB10D3) == 0x0002AC, "Member 'ALobby_Sublevel_C::Timeline__Direction_7D40A1384DA593C5C1E4A2B65CDB10D3' has a wrong offset!");
static_assert(offsetof(ALobby_Sublevel_C, Timeline) == 0x0002B0, "Member 'ALobby_Sublevel_C::Timeline' has a wrong offset!");
static_assert(offsetof(ALobby_Sublevel_C, TravellingTime) == 0x0002B8, "Member 'ALobby_Sublevel_C::TravellingTime' has a wrong offset!");
static_assert(offsetof(ALobby_Sublevel_C, InitLoc) == 0x0002C0, "Member 'ALobby_Sublevel_C::InitLoc' has a wrong offset!");
static_assert(offsetof(ALobby_Sublevel_C, CameraActor_0_ExecuteUbergraph_Lobby_Sublevel_RefProperty) == 0x0002D8, "Member 'ALobby_Sublevel_C::CameraActor_0_ExecuteUbergraph_Lobby_Sublevel_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobby_Sublevel_C, CameraActor2_1_ExecuteUbergraph_Lobby_Sublevel_RefProperty) == 0x0002E0, "Member 'ALobby_Sublevel_C::CameraActor2_1_ExecuteUbergraph_Lobby_Sublevel_RefProperty' has a wrong offset!");

}

