#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalMultiplayer_W

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "S_BiomeSave_structs.hpp"


namespace SDK::Params
{

// Function LocalMultiplayer_W.LocalMultiplayer_W_C.BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_1_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function LocalMultiplayer_W.LocalMultiplayer_W_C.BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_2_K2Node_ComponentBoundEvent_6_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function LocalMultiplayer_W.LocalMultiplayer_W_C.BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_3_K2Node_ComponentBoundEvent_7_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function LocalMultiplayer_W.LocalMultiplayer_W_C.BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'LocalMultiplayer_W_C_BndEvt__LocalMultiplayer_W_W_ComboBox_K2Node_ComponentBoundEvent_0_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function LocalMultiplayer_W.LocalMultiplayer_W_C.ExecuteUbergraph_LocalMultiplayer_W
// 0x0240 (0x0240 - 0x0000)
struct LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BiomeSave                           K2Node_MakeStruct_S_BiomeSave;                     // 0x0008(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_NewSelection_3;         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType_3;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B3[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B4[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance;            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B5[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance_1;          // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B6[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B7[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_NewSelection_2;         // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType_2;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B8[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_NewSelection_1;         // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType_1;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B9[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BA[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI_1;                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BB[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadSaveSwitcher_W_C*                  CallFunc_Create_ReturnValue;                       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameMapsSettings*                      CallFunc_GetGameMapsSettings_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameMapsSettings*                      CallFunc_GetGameMapsSettings_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameMapsSettings*                      CallFunc_GetGameMapsSettings_ReturnValue_2;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_NewSelection;           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BC[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess_2;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BD[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI_2;                  // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BE[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BiomeSave                           K2Node_MakeStruct_S_BiomeSave_1;                   // 0x0170(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_BiomeSave                           K2Node_MakeStruct_S_BiomeSave_2;                   // 0x01A8(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_BiomeSave                           K2Node_Event_Save;                                 // 0x01E0(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BF[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI_3;                  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C0[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMenu_W_C*                          CallFunc_Create_ReturnValue_1;                     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W) == 0x000008, "Wrong alignment on LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W");
static_assert(sizeof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W) == 0x000240, "Wrong size on LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, EntryPoint) == 0x000000, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_MakeStruct_S_BiomeSave) == 0x000008, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_MakeStruct_S_BiomeSave' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_SpawnSound2D_ReturnValue) == 0x000050, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_ComponentBoundEvent_NewSelection_3) == 0x000058, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_ComponentBoundEvent_NewSelection_3' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_ComponentBoundEvent_SelectType_3) == 0x000068, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_ComponentBoundEvent_SelectType_3' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetGameInstance_ReturnValue) == 0x000070, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_Conv_StringToInt_ReturnValue) == 0x000078, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_AsBPI_Game_Instance) == 0x000080, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_AsBPI_Game_Instance' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_SwitchInteger_CmpSuccess) == 0x000091, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetGameInstance_ReturnValue_1) == 0x000098, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_AsBPI_Game_Instance_1) == 0x0000A0, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_AsBPI_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_AsCustom_GI) == 0x0000B8, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_ComponentBoundEvent_NewSelection_2) == 0x0000C8, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_ComponentBoundEvent_NewSelection_2' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_ComponentBoundEvent_SelectType_2) == 0x0000D8, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_ComponentBoundEvent_SelectType_2' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_SwitchString_CmpSuccess) == 0x0000D9, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_ComponentBoundEvent_NewSelection_1) == 0x0000E0, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_ComponentBoundEvent_NewSelection_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_ComponentBoundEvent_SelectType_1) == 0x0000F0, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_ComponentBoundEvent_SelectType_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetGameInstance_ReturnValue_2) == 0x0000F8, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_SwitchString_CmpSuccess_1) == 0x000100, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_AsCustom_GI_1) == 0x000108, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_AsCustom_GI_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_Create_ReturnValue) == 0x000118, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetGameMapsSettings_ReturnValue) == 0x000120, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetGameMapsSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetGameMapsSettings_ReturnValue_1) == 0x000128, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetGameMapsSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetGameMapsSettings_ReturnValue_2) == 0x000130, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetGameMapsSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_ComponentBoundEvent_NewSelection) == 0x000138, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_ComponentBoundEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_ComponentBoundEvent_SelectType) == 0x000148, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_ComponentBoundEvent_SelectType' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetGameInstance_ReturnValue_3) == 0x000150, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_SwitchString_CmpSuccess_2) == 0x000158, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_SwitchString_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_AsCustom_GI_2) == 0x000160, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_AsCustom_GI_2' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_bSuccess_4) == 0x000168, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_MakeStruct_S_BiomeSave_1) == 0x000170, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_MakeStruct_S_BiomeSave_1' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_MakeStruct_S_BiomeSave_2) == 0x0001A8, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_MakeStruct_S_BiomeSave_2' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_Event_Save) == 0x0001E0, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_Event_Save' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000218, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_GetGameInstance_ReturnValue_4) == 0x000220, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_AsCustom_GI_3) == 0x000228, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_AsCustom_GI_3' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, K2Node_DynamicCast_bSuccess_5) == 0x000230, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W, CallFunc_Create_ReturnValue_1) == 0x000238, "Member 'LocalMultiplayer_W_C_ExecuteUbergraph_LocalMultiplayer_W::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function LocalMultiplayer_W.LocalMultiplayer_W_C.RefreshSave
// 0x0038 (0x0038 - 0x0000)
struct LocalMultiplayer_W_C_RefreshSave final
{
public:
	struct FS_BiomeSave                           Save;                                              // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LocalMultiplayer_W_C_RefreshSave) == 0x000008, "Wrong alignment on LocalMultiplayer_W_C_RefreshSave");
static_assert(sizeof(LocalMultiplayer_W_C_RefreshSave) == 0x000038, "Wrong size on LocalMultiplayer_W_C_RefreshSave");
static_assert(offsetof(LocalMultiplayer_W_C_RefreshSave, Save) == 0x000000, "Member 'LocalMultiplayer_W_C_RefreshSave::Save' has a wrong offset!");

}

