#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Magnolia_01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function magnolia_01_BP.magnolia_01_BP_C.UserConstructionScript
// 0x02E0 (0x02E0 - 0x0000)
struct Magnolia_01_BP_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CE4[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CE5[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CE6[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RandomRotatorFromStream_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CE7[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_X;                       // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Y;                       // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Z;                       // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CE8[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0120(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_3; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CE9[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CEA[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0230(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast; // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1; // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_1;              // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast_1;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast_1;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Magnolia_01_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on Magnolia_01_BP_C_UserConstructionScript");
static_assert(sizeof(Magnolia_01_BP_C_UserConstructionScript) == 0x0002E0, "Wrong size on Magnolia_01_BP_C_UserConstructionScript");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'Magnolia_01_BP_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000008, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000020, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000028, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x000034, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000038, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000040, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000060, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomRotatorFromStream_ReturnValue) == 0x000068, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomRotatorFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x000080, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000088, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_X) == 0x0000A0, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_X' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_Y) == 0x0000B8, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_Y' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_Z) == 0x0000D0, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_Z' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000E8, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000100, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x000118, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000120, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue_3) == 0x000208, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000210, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000228, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000230, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000290, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x000298, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast) == 0x00029C, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1) == 0x0002A0, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1) == 0x0002A4, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeVector_X_ImplicitCast) == 0x0002A8, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeVector_Y_ImplicitCast) == 0x0002B0, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeVector_Z_ImplicitCast) == 0x0002B8, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeVector_Z_ImplicitCast_1) == 0x0002C0, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeVector_Z_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeVector_Y_ImplicitCast_1) == 0x0002C8, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeVector_Y_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Magnolia_01_BP_C_UserConstructionScript, CallFunc_MakeVector_X_ImplicitCast_1) == 0x0002D0, "Member 'Magnolia_01_BP_C_UserConstructionScript::CallFunc_MakeVector_X_ImplicitCast_1' has a wrong offset!");

}

