#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_W

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_W.MainMenu_W_C.ExecuteUbergraph_MainMenu_W
// 0x0070 (0x0070 - 0x0000)
struct MainMenu_W_C_ExecuteUbergraph_MainMenu_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_286E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTroubleshooting_W_C*                   CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_LeaderboardSwitcher_C*               CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_SettingsMain_C*                      CallFunc_Create_ReturnValue_2;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayMenu_W_C*                          CallFunc_Create_ReturnValue_3;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W) == 0x000008, "Wrong alignment on MainMenu_W_C_ExecuteUbergraph_MainMenu_W");
static_assert(sizeof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W) == 0x000070, "Wrong size on MainMenu_W_C_ExecuteUbergraph_MainMenu_W");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, EntryPoint) == 0x000000, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_Create_ReturnValue) == 0x000008, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_Create_ReturnValue_2) == 0x000028, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_PlayAnimation_ReturnValue_2) == 0x000040, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_PlayAnimation_ReturnValue_3) == 0x000048, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_SpawnSound2D_ReturnValue) == 0x000050, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000058, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000060, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_ExecuteUbergraph_MainMenu_W, CallFunc_Create_ReturnValue_3) == 0x000068, "Member 'MainMenu_W_C_ExecuteUbergraph_MainMenu_W::CallFunc_Create_ReturnValue_3' has a wrong offset!");

// Function MainMenu_W.MainMenu_W_C.OnMouseButtonDown
// 0x0318 (0x0318 - 0x0000)
struct MainMenu_W_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0220(0x00B8)()
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x02D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_286F[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APC_MainMenu_C*                         K2Node_DynamicCast_AsPC_Main_Menu;                 // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2870[0x5];                                     // 0x0303(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_W_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on MainMenu_W_C_OnMouseButtonDown");
static_assert(sizeof(MainMenu_W_C_OnMouseButtonDown) == 0x000318, "Wrong size on MainMenu_W_C_OnMouseButtonDown");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'MainMenu_W_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'MainMenu_W_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'MainMenu_W_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'MainMenu_W_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue_1) == 0x000220, "Member 'MainMenu_W_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0002D8, "Member 'MainMenu_W_C_OnMouseButtonDown::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, CallFunc_GetPlayerController_ReturnValue) == 0x0002E8, "Member 'MainMenu_W_C_OnMouseButtonDown::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, CallFunc_Array_Length_ReturnValue) == 0x0002F0, "Member 'MainMenu_W_C_OnMouseButtonDown::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, K2Node_DynamicCast_AsPC_Main_Menu) == 0x0002F8, "Member 'MainMenu_W_C_OnMouseButtonDown::K2Node_DynamicCast_AsPC_Main_Menu' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x000300, "Member 'MainMenu_W_C_OnMouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000301, "Member 'MainMenu_W_C_OnMouseButtonDown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, K2Node_SwitchString_CmpSuccess) == 0x000302, "Member 'MainMenu_W_C_OnMouseButtonDown::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_OnMouseButtonDown, CallFunc_Conv_IntToString_ReturnValue) == 0x000308, "Member 'MainMenu_W_C_OnMouseButtonDown::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");

// Function MainMenu_W.MainMenu_W_C.UpdateVersion
// 0x0030 (0x0030 - 0x0000)
struct MainMenu_W_C_UpdateVersion final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2871[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(MainMenu_W_C_UpdateVersion) == 0x000008, "Wrong alignment on MainMenu_W_C_UpdateVersion");
static_assert(sizeof(MainMenu_W_C_UpdateVersion) == 0x000030, "Wrong size on MainMenu_W_C_UpdateVersion");
static_assert(offsetof(MainMenu_W_C_UpdateVersion, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'MainMenu_W_C_UpdateVersion::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_UpdateVersion, K2Node_DynamicCast_AsCustom_GI) == 0x000008, "Member 'MainMenu_W_C_UpdateVersion::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_UpdateVersion, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'MainMenu_W_C_UpdateVersion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_W_C_UpdateVersion, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'MainMenu_W_C_UpdateVersion::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

