#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_W.MainMenu_W_C
// 0x0088 (0x0348 - 0x02C0)
class UMainMenu_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Spawn;                                             // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade;                                              // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DelayedSpawn;                                      // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_82;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_138;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Play_Button;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButtonText_C*                    Quit;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Quit_Button;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButtonText_C*                    Settings;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Settings_Button;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_356;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Troubleshooting;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Troubleshooting_Button;                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButtonText_C*                    W_MenuButtonText_C_4;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FadeIn;                                            // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__MainMenu_W_Button_0_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Button_1_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Play_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Play_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Play_Button_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Quit_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Quit_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Quit_Button_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Settings_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Settings_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_W_Settings_Button_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_MainMenu_W(int32 EntryPoint);
	void PlayFade();
	void UpdateVersion();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_W_C">();
	}
	static class UMainMenu_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_W_C>();
	}
};
static_assert(alignof(UMainMenu_W_C) == 0x000008, "Wrong alignment on UMainMenu_W_C");
static_assert(sizeof(UMainMenu_W_C) == 0x000348, "Wrong size on UMainMenu_W_C");
static_assert(offsetof(UMainMenu_W_C, UberGraphFrame) == 0x0002C0, "Member 'UMainMenu_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Spawn) == 0x0002C8, "Member 'UMainMenu_W_C::Spawn' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Fade) == 0x0002D0, "Member 'UMainMenu_W_C::Fade' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, DelayedSpawn) == 0x0002D8, "Member 'UMainMenu_W_C::DelayedSpawn' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Button_0) == 0x0002E0, "Member 'UMainMenu_W_C::Button_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Image_82) == 0x0002E8, "Member 'UMainMenu_W_C::Image_82' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Image_138) == 0x0002F0, "Member 'UMainMenu_W_C::Image_138' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Play_Button) == 0x0002F8, "Member 'UMainMenu_W_C::Play_Button' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Quit) == 0x000300, "Member 'UMainMenu_W_C::Quit' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Quit_Button) == 0x000308, "Member 'UMainMenu_W_C::Quit_Button' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Settings) == 0x000310, "Member 'UMainMenu_W_C::Settings' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Settings_Button) == 0x000318, "Member 'UMainMenu_W_C::Settings_Button' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, TextBlock_356) == 0x000320, "Member 'UMainMenu_W_C::TextBlock_356' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Troubleshooting) == 0x000328, "Member 'UMainMenu_W_C::Troubleshooting' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, Troubleshooting_Button) == 0x000330, "Member 'UMainMenu_W_C::Troubleshooting_Button' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, W_MenuButtonText_C_4) == 0x000338, "Member 'UMainMenu_W_C::W_MenuButtonText_C_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_W_C, FadeIn) == 0x000340, "Member 'UMainMenu_W_C::FadeIn' has a wrong offset!");

}

