#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MazeCreator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MazeCreator.MazeCreator_C.Add Floor
// 0x01E0 (0x01E0 - 0x0000)
struct MazeCreator_C_Add_Floor final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E8[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E9[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EA[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EB[0xE];                                     // 0x0162(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0170(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue;                 // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MazeCreator_C_Add_Floor) == 0x000010, "Wrong alignment on MazeCreator_C_Add_Floor");
static_assert(sizeof(MazeCreator_C_Add_Floor) == 0x0001E0, "Wrong size on MazeCreator_C_Add_Floor");
static_assert(offsetof(MazeCreator_C_Add_Floor, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'MazeCreator_C_Add_Floor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'MazeCreator_C_Add_Floor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'MazeCreator_C_Add_Floor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'MazeCreator_C_Add_Floor::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'MazeCreator_C_Add_Floor::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Multiply_IntInt_ReturnValue) == 0x000030, "Member 'MazeCreator_C_Add_Floor::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'MazeCreator_C_Add_Floor::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'MazeCreator_C_Add_Floor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_SelectVector_ReturnValue) == 0x000048, "Member 'MazeCreator_C_Add_Floor::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000060, "Member 'MazeCreator_C_Add_Floor::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_MakeVector_ReturnValue_1) == 0x000068, "Member 'MazeCreator_C_Add_Floor::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000080, "Member 'MazeCreator_C_Add_Floor::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000088, "Member 'MazeCreator_C_Add_Floor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'MazeCreator_C_Add_Floor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A8, "Member 'MazeCreator_C_Add_Floor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, Temp_int_Array_Index_Variable) == 0x0000C0, "Member 'MazeCreator_C_Add_Floor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0000C8, "Member 'MazeCreator_C_Add_Floor::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'MazeCreator_C_Add_Floor::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_MakeVector_ReturnValue_2) == 0x0000D8, "Member 'MazeCreator_C_Add_Floor::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'MazeCreator_C_Add_Floor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Array_Get_Item) == 0x000150, "Member 'MazeCreator_C_Add_Floor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_AddInstance_ReturnValue) == 0x000158, "Member 'MazeCreator_C_Add_Floor::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Array_Length_ReturnValue) == 0x00015C, "Member 'MazeCreator_C_Add_Floor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_Less_IntInt_ReturnValue) == 0x000160, "Member 'MazeCreator_C_Add_Floor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_SetStaticMesh_ReturnValue) == 0x000161, "Member 'MazeCreator_C_Add_Floor::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, Temp_struct_Variable) == 0x000170, "Member 'MazeCreator_C_Add_Floor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Add_Floor, CallFunc_AddComponent_ReturnValue) == 0x0001D0, "Member 'MazeCreator_C_Add_Floor::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function MazeCreator.MazeCreator_C.Corner is Inside Maze?
// 0x0050 (0x0050 - 0x0000)
struct MazeCreator_C_Corner_is_Inside_Maze_ final
{
public:
	struct FVector2D                              Corner_Location;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EC[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36ED[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MazeCreator_C_Corner_is_Inside_Maze_) == 0x000008, "Wrong alignment on MazeCreator_C_Corner_is_Inside_Maze_");
static_assert(sizeof(MazeCreator_C_Corner_is_Inside_Maze_) == 0x000050, "Wrong size on MazeCreator_C_Corner_is_Inside_Maze_");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, Corner_Location) == 0x000000, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::Corner_Location' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, Return_Value) == 0x000010, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::Return_Value' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_BreakVector2D_X) == 0x000018, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_FFloor_ReturnValue) == 0x000040, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_FFloor_ReturnValue_1) == 0x000044, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_Less_IntInt_ReturnValue_1) == 0x000049, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00004A, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_BooleanAND_ReturnValue_1) == 0x00004C, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_Corner_is_Inside_Maze_, CallFunc_BooleanAND_ReturnValue_2) == 0x00004D, "Member 'MazeCreator_C_Corner_is_Inside_Maze_::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function MazeCreator.MazeCreator_C.ExecuteUbergraph_MazeCreator
// 0x0800 (0x0800 - 0x0000)
struct MazeCreator_C_ExecuteUbergraph_MazeCreator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EE[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Total_Outer_Edges_Return_Value;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F0[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_3;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_3;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_3;                    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_3;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F1[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_2;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_2;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_2;                    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_2;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F2[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Get_Adjacent_Unvisited_Cells_Adjacent_Cell_Indices; // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Get_Adjacent_Unvisited_Cells_Return_Value; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F3[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue_2; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F4[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Get_Indices_to_Create_Room_Cell_Indices;  // 0x00E8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Get_Indices_to_Create_Room_Old_Cell;      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Indices_to_Create_Room_Old_Width;     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Indices_to_Create_Room_Old_Height;    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F5[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      CallFunc_Remove_Corner_Pieces_in_Range_Removed_Corners; // 0x0108(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F6[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F7[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item_2;                         // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F8[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_1;          // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_1;                    // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep_1;                   // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F9[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult_1;                  // 0x01A8(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_MathExpression_ReturnValue;                 // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FA[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FB[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x02D0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_36FC[0x8];                                     // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FD[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Get_Adjacent_Visited_Cells_Adjacent_Cell_Indices; // 0x0438(0x0010)(ReferenceParm)
	bool                                          CallFunc_Get_Adjacent_Visited_Cells_Return_Value;  // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FE[0x3];                                     // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FF[0x3];                                     // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3700[0x3];                                     // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue_3; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_4;                         // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3701[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item_5;                         // 0x0498(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3702[0x3];                                     // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3703[0x8];                                     // 0x04E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x04F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0560(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0572(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0573(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Rectangle_Edge_is_Vertical__Is_Vertical_; // 0x0575(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3704[0x2];                                     // 0x0576(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Rectangle_Edge_is_Vertical__Index_Relative_To_Side; // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3705[0x3];                                     // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3706[0x7];                                     // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3707[0x4];                                     // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x05B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_1;               // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_4;                // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_2;               // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_5;                // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_6;                // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_7;                // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0648(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3708[0x7];                                     // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_1;      // 0x0660(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue_1;              // 0x0678(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3709[0xC];                                     // 0x0694(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x06A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_2;      // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_2;                // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_370A[0x4];                                     // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0720(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0738(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0750(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_AddComponent_ReturnValue;                 // 0x07B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x07B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x07CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_Vector2DToVector_Z_ImplicitCast;     // 0x07DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_Vector2DToVector_Z_ImplicitCast_1;   // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MazeCreator_C_ExecuteUbergraph_MazeCreator) == 0x000010, "Wrong alignment on MazeCreator_C_ExecuteUbergraph_MazeCreator");
static_assert(sizeof(MazeCreator_C_ExecuteUbergraph_MazeCreator) == 0x000800, "Wrong size on MazeCreator_C_ExecuteUbergraph_MazeCreator");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, EntryPoint) == 0x000000, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::EntryPoint' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, Temp_bool_Variable) == 0x00001C, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Get_Total_Outer_Edges_Return_Value) == 0x000048, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Get_Total_Outer_Edges_Return_Value' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CustomEvent_OverlappedComponent_3) == 0x000060, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CustomEvent_OverlappedComponent_3' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CustomEvent_OtherActor_3) == 0x000068, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CustomEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CustomEvent_OtherComp_3) == 0x000070, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CustomEvent_OtherComp_3' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CustomEvent_OtherBodyIndex_3) == 0x000078, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CustomEvent_OtherBodyIndex_3' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CustomEvent_OverlappedComponent_2) == 0x000080, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CustomEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CustomEvent_OtherActor_2) == 0x000088, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CustomEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CustomEvent_OtherComp_2) == 0x000090, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CustomEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, K2Node_CustomEvent_OtherBodyIndex_2) == 0x000098, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::K2Node_CustomEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Get_Adjacent_Unvisited_Cells_Adjacent_Cell_Indices) == 0x0000A0, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Get_Adjacent_Unvisited_Cells_Adjacent_Cell_Indices' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Get_Adjacent_Unvisited_Cells_Return_Value) == 0x0000B0, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Get_Adjacent_Unvisited_Cells_Return_Value' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000B8, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, Temp_int_Array_Index_Variable_1) == 0x0000BC, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0000C4, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x0000C8, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Array_Get_Item) == 0x0000CC, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x0000D0, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1) == 0x0000D4, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_RandomIntegerInRangeFromStream_ReturnValue_2) == 0x0000D8, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_RandomIntegerInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Get_Indices_to_Create_Room_Cell_Indices) == 0x0000E8, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Get_Indices_to_Create_Room_Cell_Indices' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Get_Indices_to_Create_Room_Old_Cell) == 0x0000F8, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Get_Indices_to_Create_Room_Old_Cell' has a wrong offset!");
static_assert(offsetof(MazeCreator_C_ExecuteUbergraph_MazeCreator, CallFunc_Get_Indices_to_Create_Room_Old_Width) == 0x0000FC, "Member 'MazeCreator_C_ExecuteUbergraph_MazeCreator::CallFunc_Get_Indices_to_Create_Room_Old_Width' has a wrong offset!");
