#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetasoundEngine

#include "Basic.hpp"

#include "MetasoundEngine_structs.hpp"
#include "MetasoundFrontend_structs.hpp"
#include "AudioExtensions_structs.hpp"


namespace SDK::Params
{

// Function MetasoundEngine.MetasoundGeneratorHandle.CreateMetaSoundGeneratorHandle
// 0x0010 (0x0010 - 0x0000)
struct MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle final
{
public:
	class UAudioComponent*                        OnComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetasoundGeneratorHandle*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle) == 0x000008, "Wrong alignment on MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle");
static_assert(sizeof(MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle) == 0x000010, "Wrong size on MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle");
static_assert(offsetof(MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle, OnComponent) == 0x000000, "Member 'MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle::OnComponent' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle, ReturnValue) == 0x000008, "Member 'MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundGeneratorHandle.ApplyParameterPack
// 0x0010 (0x0010 - 0x0000)
struct MetasoundGeneratorHandle_ApplyParameterPack final
{
public:
	class UMetasoundParameterPack*                Pack;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A6C[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundGeneratorHandle_ApplyParameterPack) == 0x000008, "Wrong alignment on MetasoundGeneratorHandle_ApplyParameterPack");
static_assert(sizeof(MetasoundGeneratorHandle_ApplyParameterPack) == 0x000010, "Wrong size on MetasoundGeneratorHandle_ApplyParameterPack");
static_assert(offsetof(MetasoundGeneratorHandle_ApplyParameterPack, Pack) == 0x000000, "Member 'MetasoundGeneratorHandle_ApplyParameterPack::Pack' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_ApplyParameterPack, ReturnValue) == 0x000008, "Member 'MetasoundGeneratorHandle_ApplyParameterPack::ReturnValue' has a wrong offset!");

// DelegateFunction MetasoundEngine.MetasoundGeneratorHandle.OnOutputValueChangedMulticast__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundOutput                       Output;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature) == 0x000008, "Wrong alignment on MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature");
static_assert(sizeof(MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature) == 0x000018, "Wrong size on MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature");
static_assert(offsetof(MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature, Param_Name) == 0x000000, "Member 'MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature::Param_Name' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature, Output) == 0x000008, "Member 'MetasoundGeneratorHandle_OnOutputValueChangedMulticast__DelegateSignature::Output' has a wrong offset!");

// Function MetasoundEngine.MetasoundGeneratorHandle.WatchOutput
// 0x002C (0x002C - 0x0000)
struct MetasoundGeneratorHandle_WatchOutput final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class FName OutputName, struct FMetaSoundOutput& Output)> OnOutputValueChanged;                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnalyzerName;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnalyzerOutputName;                                // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A6D[0x3];                                     // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundGeneratorHandle_WatchOutput) == 0x000004, "Wrong alignment on MetasoundGeneratorHandle_WatchOutput");
static_assert(sizeof(MetasoundGeneratorHandle_WatchOutput) == 0x00002C, "Wrong size on MetasoundGeneratorHandle_WatchOutput");
static_assert(offsetof(MetasoundGeneratorHandle_WatchOutput, OutputName) == 0x000000, "Member 'MetasoundGeneratorHandle_WatchOutput::OutputName' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_WatchOutput, OnOutputValueChanged) == 0x000008, "Member 'MetasoundGeneratorHandle_WatchOutput::OnOutputValueChanged' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_WatchOutput, AnalyzerName) == 0x000018, "Member 'MetasoundGeneratorHandle_WatchOutput::AnalyzerName' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_WatchOutput, AnalyzerOutputName) == 0x000020, "Member 'MetasoundGeneratorHandle_WatchOutput::AnalyzerOutputName' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_WatchOutput, ReturnValue) == 0x000028, "Member 'MetasoundGeneratorHandle_WatchOutput::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetBool
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetBool final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A6E[0x6];                                     // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundOutputBlueprintAccess_GetBool) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_GetBool");
static_assert(sizeof(MetasoundOutputBlueprintAccess_GetBool) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_GetBool");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetBool, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_GetBool::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetBool, Success) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_GetBool::Success' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetBool, ReturnValue) == 0x000011, "Member 'MetasoundOutputBlueprintAccess_GetBool::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetFloat
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetFloat final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A6F[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetasoundOutputBlueprintAccess_GetFloat) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_GetFloat");
static_assert(sizeof(MetasoundOutputBlueprintAccess_GetFloat) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_GetFloat");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetFloat, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_GetFloat::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetFloat, Success) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_GetFloat::Success' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetFloat, ReturnValue) == 0x000014, "Member 'MetasoundOutputBlueprintAccess_GetFloat::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetInt32
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetInt32 final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A70[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetasoundOutputBlueprintAccess_GetInt32) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_GetInt32");
static_assert(sizeof(MetasoundOutputBlueprintAccess_GetInt32) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_GetInt32");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetInt32, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_GetInt32::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetInt32, Success) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_GetInt32::Success' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetInt32, ReturnValue) == 0x000014, "Member 'MetasoundOutputBlueprintAccess_GetInt32::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetString
// 0x0028 (0x0028 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetString final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A71[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetasoundOutputBlueprintAccess_GetString) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_GetString");
static_assert(sizeof(MetasoundOutputBlueprintAccess_GetString) == 0x000028, "Wrong size on MetasoundOutputBlueprintAccess_GetString");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetString, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_GetString::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetString, Success) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_GetString::Success' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetString, ReturnValue) == 0x000018, "Member 'MetasoundOutputBlueprintAccess_GetString::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetTimeSeconds
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetTimeSeconds final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A72[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetasoundOutputBlueprintAccess_GetTimeSeconds) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_GetTimeSeconds");
static_assert(sizeof(MetasoundOutputBlueprintAccess_GetTimeSeconds) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_GetTimeSeconds");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetTimeSeconds, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_GetTimeSeconds::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetTimeSeconds, Success) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_GetTimeSeconds::Success' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_GetTimeSeconds, ReturnValue) == 0x000014, "Member 'MetasoundOutputBlueprintAccess_GetTimeSeconds::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsBool
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsBool final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A73[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundOutputBlueprintAccess_IsBool) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_IsBool");
static_assert(sizeof(MetasoundOutputBlueprintAccess_IsBool) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_IsBool");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsBool, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_IsBool::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsBool, ReturnValue) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_IsBool::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsFloat
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsFloat final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A74[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundOutputBlueprintAccess_IsFloat) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_IsFloat");
static_assert(sizeof(MetasoundOutputBlueprintAccess_IsFloat) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_IsFloat");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsFloat, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_IsFloat::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsFloat, ReturnValue) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_IsFloat::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsInt32
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsInt32 final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A75[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundOutputBlueprintAccess_IsInt32) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_IsInt32");
static_assert(sizeof(MetasoundOutputBlueprintAccess_IsInt32) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_IsInt32");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsInt32, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_IsInt32::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsInt32, ReturnValue) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_IsInt32::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsString
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsString final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A76[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundOutputBlueprintAccess_IsString) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_IsString");
static_assert(sizeof(MetasoundOutputBlueprintAccess_IsString) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_IsString");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsString, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_IsString::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsString, ReturnValue) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_IsString::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsTime
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsTime final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A77[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundOutputBlueprintAccess_IsTime) == 0x000008, "Wrong alignment on MetasoundOutputBlueprintAccess_IsTime");
static_assert(sizeof(MetasoundOutputBlueprintAccess_IsTime) == 0x000018, "Wrong size on MetasoundOutputBlueprintAccess_IsTime");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsTime, Output) == 0x000000, "Member 'MetasoundOutputBlueprintAccess_IsTime::Output' has a wrong offset!");
static_assert(offsetof(MetasoundOutputBlueprintAccess_IsTime, ReturnValue) == 0x000010, "Member 'MetasoundOutputBlueprintAccess_IsTime::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundOutputSubsystem.WatchOutput
// 0x0038 (0x0038 - 0x0000)
struct MetaSoundOutputSubsystem_WatchOutput final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutputName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class FName OutputName, struct FMetaSoundOutput& Output)> OnOutputValueChanged;                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnalyzerName;                                      // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnalyzerOutputName;                                // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A78[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundOutputSubsystem_WatchOutput) == 0x000008, "Wrong alignment on MetaSoundOutputSubsystem_WatchOutput");
static_assert(sizeof(MetaSoundOutputSubsystem_WatchOutput) == 0x000038, "Wrong size on MetaSoundOutputSubsystem_WatchOutput");
static_assert(offsetof(MetaSoundOutputSubsystem_WatchOutput, AudioComponent) == 0x000000, "Member 'MetaSoundOutputSubsystem_WatchOutput::AudioComponent' has a wrong offset!");
static_assert(offsetof(MetaSoundOutputSubsystem_WatchOutput, OutputName) == 0x000008, "Member 'MetaSoundOutputSubsystem_WatchOutput::OutputName' has a wrong offset!");
static_assert(offsetof(MetaSoundOutputSubsystem_WatchOutput, OnOutputValueChanged) == 0x000010, "Member 'MetaSoundOutputSubsystem_WatchOutput::OnOutputValueChanged' has a wrong offset!");
static_assert(offsetof(MetaSoundOutputSubsystem_WatchOutput, AnalyzerName) == 0x000020, "Member 'MetaSoundOutputSubsystem_WatchOutput::AnalyzerName' has a wrong offset!");
static_assert(offsetof(MetaSoundOutputSubsystem_WatchOutput, AnalyzerOutputName) == 0x000028, "Member 'MetaSoundOutputSubsystem_WatchOutput::AnalyzerOutputName' has a wrong offset!");
static_assert(offsetof(MetaSoundOutputSubsystem_WatchOutput, ReturnValue) == 0x000030, "Member 'MetaSoundOutputSubsystem_WatchOutput::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundAssetSubsystem.RegisterAssetClassesInDirectories
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories final
{
public:
	TArray<struct FMetaSoundAssetDirectory>       Directories;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories) == 0x000008, "Wrong alignment on MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories");
static_assert(sizeof(MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories) == 0x000010, "Wrong size on MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories");
static_assert(offsetof(MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories, Directories) == 0x000000, "Member 'MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories::Directories' has a wrong offset!");

// Function MetasoundEngine.MetaSoundAssetSubsystem.UnregisterAssetClassesInDirectories
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories final
{
public:
	TArray<struct FMetaSoundAssetDirectory>       Directories;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories) == 0x000008, "Wrong alignment on MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories");
static_assert(sizeof(MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories) == 0x000010, "Wrong size on MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories");
static_assert(offsetof(MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories, Directories) == 0x000000, "Member 'MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories::Directories' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddGraphInputNode
// 0x0090 (0x0090 - 0x0000)
struct MetaSoundBuilderBase_AddGraphInputNode final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DataType;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              DefaultValue;                                      // 0x0010(0x0058)(Parm, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConstructorInput;                               // 0x0069(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A80[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeOutputHandle      ReturnValue;                                       // 0x006C(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A81[0x4];                                     // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_AddGraphInputNode) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_AddGraphInputNode");
static_assert(sizeof(MetaSoundBuilderBase_AddGraphInputNode) == 0x000090, "Wrong size on MetaSoundBuilderBase_AddGraphInputNode");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, Param_Name) == 0x000000, "Member 'MetaSoundBuilderBase_AddGraphInputNode::Param_Name' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, DataType) == 0x000008, "Member 'MetaSoundBuilderBase_AddGraphInputNode::DataType' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, DefaultValue) == 0x000010, "Member 'MetaSoundBuilderBase_AddGraphInputNode::DefaultValue' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, OutResult) == 0x000068, "Member 'MetaSoundBuilderBase_AddGraphInputNode::OutResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, bIsConstructorInput) == 0x000069, "Member 'MetaSoundBuilderBase_AddGraphInputNode::bIsConstructorInput' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, ReturnValue) == 0x00006C, "Member 'MetaSoundBuilderBase_AddGraphInputNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddGraphOutputNode
// 0x0090 (0x0090 - 0x0000)
struct MetaSoundBuilderBase_AddGraphOutputNode final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DataType;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              DefaultValue;                                      // 0x0010(0x0058)(Parm, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConstructorOutput;                              // 0x0069(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A82[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeInputHandle       ReturnValue;                                       // 0x006C(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A83[0x4];                                     // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_AddGraphOutputNode) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_AddGraphOutputNode");
static_assert(sizeof(MetaSoundBuilderBase_AddGraphOutputNode) == 0x000090, "Wrong size on MetaSoundBuilderBase_AddGraphOutputNode");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, Param_Name) == 0x000000, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::Param_Name' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, DataType) == 0x000008, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::DataType' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, DefaultValue) == 0x000010, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::DefaultValue' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, OutResult) == 0x000068, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::OutResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, bIsConstructorOutput) == 0x000069, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::bIsConstructorOutput' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, ReturnValue) == 0x00006C, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddInterface
// 0x000C (0x000C - 0x0000)
struct MetaSoundBuilderBase_AddInterface final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A84[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_AddInterface) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_AddInterface");
static_assert(sizeof(MetaSoundBuilderBase_AddInterface) == 0x00000C, "Wrong size on MetaSoundBuilderBase_AddInterface");
static_assert(offsetof(MetaSoundBuilderBase_AddInterface, InterfaceName) == 0x000000, "Member 'MetaSoundBuilderBase_AddInterface::InterfaceName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddInterface, OutResult) == 0x000008, "Member 'MetaSoundBuilderBase_AddInterface::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddNode
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_AddNode final
{
public:
	TScriptInterface<class IMetaSoundDocumentInterface> NodeClass;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A85[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0014(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A86[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_AddNode) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_AddNode");
static_assert(sizeof(MetaSoundBuilderBase_AddNode) == 0x000028, "Wrong size on MetaSoundBuilderBase_AddNode");
static_assert(offsetof(MetaSoundBuilderBase_AddNode, NodeClass) == 0x000000, "Member 'MetaSoundBuilderBase_AddNode::NodeClass' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddNode, OutResult) == 0x000010, "Member 'MetaSoundBuilderBase_AddNode::OutResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddNode, ReturnValue) == 0x000014, "Member 'MetaSoundBuilderBase_AddNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddNodeByClassName
// 0x0030 (0x0030 - 0x0000)
struct MetaSoundBuilderBase_AddNodeByClassName final
{
public:
	struct FMetasoundFrontendClassName            ClassName;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MajorVersion;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A87[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_AddNodeByClassName) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_AddNodeByClassName");
static_assert(sizeof(MetaSoundBuilderBase_AddNodeByClassName) == 0x000030, "Wrong size on MetaSoundBuilderBase_AddNodeByClassName");
static_assert(offsetof(MetaSoundBuilderBase_AddNodeByClassName, ClassName) == 0x000000, "Member 'MetaSoundBuilderBase_AddNodeByClassName::ClassName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddNodeByClassName, MajorVersion) == 0x000018, "Member 'MetaSoundBuilderBase_AddNodeByClassName::MajorVersion' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddNodeByClassName, OutResult) == 0x00001C, "Member 'MetaSoundBuilderBase_AddNodeByClassName::OutResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddNodeByClassName, ReturnValue) == 0x000020, "Member 'MetaSoundBuilderBase_AddNodeByClassName::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeInputsToMatchingGraphInterfaceInputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A88[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeOutputHandle> ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs) == 0x000028, "Wrong size on MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs, OutResult) == 0x000010, "Member 'MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs::OutResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs, ReturnValue) == 0x000018, "Member 'MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeInputToGraphInput
// 0x002C (0x002C - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeInputToGraphInput final
{
public:
	class FName                                   GraphInputName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A89[0x3];                                     // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ConnectNodeInputToGraphInput");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput) == 0x00002C, "Wrong size on MetaSoundBuilderBase_ConnectNodeInputToGraphInput");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput, GraphInputName) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodeInputToGraphInput::GraphInputName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput, NodeInputHandle) == 0x000008, "Member 'MetaSoundBuilderBase_ConnectNodeInputToGraphInput::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput, OutResult) == 0x000028, "Member 'MetaSoundBuilderBase_ConnectNodeInputToGraphInput::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeOutputsToMatchingGraphInterfaceOutputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeInputHandle> ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs) == 0x000028, "Wrong size on MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs, OutResult) == 0x000010, "Member 'MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs::OutResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs, ReturnValue) == 0x000018, "Member 'MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeOutputToGraphOutput
// 0x002C (0x002C - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput final
{
public:
	class FName                                   GraphOutputName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8B[0x3];                                     // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput) == 0x00002C, "Wrong size on MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput, GraphOutputName) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput::GraphOutputName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput, NodeOutputHandle) == 0x000008, "Member 'MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput::NodeOutputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput, OutResult) == 0x000028, "Member 'MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodes
// 0x0044 (0x0044 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodes final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8C[0x3];                                     // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodes) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ConnectNodes");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodes) == 0x000044, "Wrong size on MetaSoundBuilderBase_ConnectNodes");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodes, NodeOutputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodes::NodeOutputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodes, NodeInputHandle) == 0x000020, "Member 'MetaSoundBuilderBase_ConnectNodes::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodes, OutResult) == 0x000040, "Member 'MetaSoundBuilderBase_ConnectNodes::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodesByInterfaceBindings
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodesByInterfaceBindings final
{
public:
	struct FMetaSoundNodeHandle                   FromNodeHandle;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMetaSoundNodeHandle                   ToNodeHandle;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8D[0x3];                                     // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ConnectNodesByInterfaceBindings");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings) == 0x000024, "Wrong size on MetaSoundBuilderBase_ConnectNodesByInterfaceBindings");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings, FromNodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodesByInterfaceBindings::FromNodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings, ToNodeHandle) == 0x000010, "Member 'MetaSoundBuilderBase_ConnectNodesByInterfaceBindings::ToNodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings, OutResult) == 0x000020, "Member 'MetaSoundBuilderBase_ConnectNodesByInterfaceBindings::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConvertFromPreset
// 0x0001 (0x0001 - 0x0000)
struct MetaSoundBuilderBase_ConvertFromPreset final
{
public:
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_ConvertFromPreset) == 0x000001, "Wrong alignment on MetaSoundBuilderBase_ConvertFromPreset");
static_assert(sizeof(MetaSoundBuilderBase_ConvertFromPreset) == 0x000001, "Wrong size on MetaSoundBuilderBase_ConvertFromPreset");
static_assert(offsetof(MetaSoundBuilderBase_ConvertFromPreset, OutResult) == 0x000000, "Member 'MetaSoundBuilderBase_ConvertFromPreset::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConvertToPreset
// 0x0018 (0x0018 - 0x0000)
struct MetaSoundBuilderBase_ConvertToPreset final
{
public:
	TScriptInterface<class IMetaSoundDocumentInterface> ReferencedNodeClass;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8E[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConvertToPreset) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_ConvertToPreset");
static_assert(sizeof(MetaSoundBuilderBase_ConvertToPreset) == 0x000018, "Wrong size on MetaSoundBuilderBase_ConvertToPreset");
static_assert(offsetof(MetaSoundBuilderBase_ConvertToPreset, ReferencedNodeClass) == 0x000000, "Member 'MetaSoundBuilderBase_ConvertToPreset::ReferencedNodeClass' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConvertToPreset, OutResult) == 0x000010, "Member 'MetaSoundBuilderBase_ConvertToPreset::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodeInput
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodeInput final
{
public:
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8F[0x3];                                     // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_DisconnectNodeInput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_DisconnectNodeInput");
static_assert(sizeof(MetaSoundBuilderBase_DisconnectNodeInput) == 0x000024, "Wrong size on MetaSoundBuilderBase_DisconnectNodeInput");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodeInput, NodeInputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_DisconnectNodeInput::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodeInput, OutResult) == 0x000020, "Member 'MetaSoundBuilderBase_DisconnectNodeInput::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodeOutput
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodeOutput final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A90[0x3];                                     // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_DisconnectNodeOutput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_DisconnectNodeOutput");
static_assert(sizeof(MetaSoundBuilderBase_DisconnectNodeOutput) == 0x000024, "Wrong size on MetaSoundBuilderBase_DisconnectNodeOutput");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodeOutput, NodeOutputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_DisconnectNodeOutput::NodeOutputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodeOutput, OutResult) == 0x000020, "Member 'MetaSoundBuilderBase_DisconnectNodeOutput::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodes
// 0x0044 (0x0044 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodes final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A91[0x3];                                     // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_DisconnectNodes) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_DisconnectNodes");
static_assert(sizeof(MetaSoundBuilderBase_DisconnectNodes) == 0x000044, "Wrong size on MetaSoundBuilderBase_DisconnectNodes");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodes, NodeOutputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_DisconnectNodes::NodeOutputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodes, NodeInputHandle) == 0x000020, "Member 'MetaSoundBuilderBase_DisconnectNodes::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodes, OutResult) == 0x000040, "Member 'MetaSoundBuilderBase_DisconnectNodes::OutResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodesByInterfaceBindings
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings final
{
public:
	struct FMetaSoundNodeHandle                   FromNodeHandle;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMetaSoundNodeHandle                   ToNodeHandle;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A92[0x3];                                     // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings");
static_assert(sizeof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings) == 0x000024, "Wrong size on MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings, FromNodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings::FromNodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings, ToNodeHandle) == 0x000010, "Member 'MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings::ToNodeHandle' has a wrong offset!");
