#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinecartLevier_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MinecartLevier_BP.MinecartLevier_BP_C.Balance
// 0x0001 (0x0001 - 0x0000)
struct MinecartLevier_BP_C_Balance final
{
public:
	bool                                          Param_Left;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinecartLevier_BP_C_Balance) == 0x000001, "Wrong alignment on MinecartLevier_BP_C_Balance");
static_assert(sizeof(MinecartLevier_BP_C_Balance) == 0x000001, "Wrong size on MinecartLevier_BP_C_Balance");
static_assert(offsetof(MinecartLevier_BP_C_Balance, Param_Left) == 0x000000, "Member 'MinecartLevier_BP_C_Balance::Param_Left' has a wrong offset!");

// Function MinecartLevier_BP.MinecartLevier_BP_C.BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C74[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function MinecartLevier_BP.MinecartLevier_BP_C.BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_LeftBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function MinecartLevier_BP.MinecartLevier_BP_C.BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C75[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function MinecartLevier_BP.MinecartLevier_BP_C.BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'MinecartLevier_BP_C_BndEvt__MinecartLevier_BP_RightBox1_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function MinecartLevier_BP.MinecartLevier_BP_C.ExecuteUbergraph_MinecartLevier_BP
// 0x08E0 (0x08E0 - 0x0000)
struct MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C76[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_3;  // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_3;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_3;            // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_3;       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C77[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0158(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x0240(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Left;                           // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C78[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C79[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C7A[0x3];                                     // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0388(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0488(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x04A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C7B[0x3];                                     // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x05D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C7C[0x3];                                     // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C7D[0x4];                                     // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x05E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C7E[0x4];                                     // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0640(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0740(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C7F[0x3];                                     // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0759(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C80[0x6];                                     // 0x075A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0760(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0778(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0788(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0798(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x07A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C81[0x6];                                     // 0x07A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C82[0x7];                                     // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x07C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x07E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C83[0x7];                                     // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x08DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP) == 0x000008, "Wrong alignment on MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP");
static_assert(sizeof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP) == 0x0008E0, "Wrong size on MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, EntryPoint) == 0x000000, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000006, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_HasAuthority_ReturnValue_2) == 0x000007, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, Temp_bool_Has_Been_Initd_Variable_1) == 0x000008, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_HasAuthority_ReturnValue_3) == 0x000009, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_HasAuthority_ReturnValue_4) == 0x00000A, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, Temp_bool_IsClosed_Variable) == 0x00000B, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, Temp_bool_IsClosed_Variable_1) == 0x00000C, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, Temp_bool_Has_Been_Initd_Variable_2) == 0x00000D, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Vector_Distance_ReturnValue) == 0x000010, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000038, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_MakeRotator_ReturnValue_1) == 0x000120, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OverlappedComponent_3) == 0x000138, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OverlappedComponent_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherActor_3) == 0x000140, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherComp_3) == 0x000148, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherComp_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherBodyIndex_3) == 0x000150, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherBodyIndex_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000154, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000158, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x000240, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_GetVelocity_ReturnValue) == 0x000328, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_CustomEvent_Left) == 0x000340, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_CustomEvent_Left' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_X) == 0x000348, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_Y) == 0x000350, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_Z) == 0x000358, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000360, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x000368, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000370, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherComp_2) == 0x000378, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x000380, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x000384, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x000388, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_RLerp_ReturnValue) == 0x000470, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_GetVelocity_ReturnValue_1) == 0x000488, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0004A0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_X_1) == 0x000588, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_Y_1) == 0x000590, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_Z_1) == 0x000598, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0005A0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0005A8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0005B0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0005B8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0005BC, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0005C0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x0005C8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x0005D0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0005D8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0005DC, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_Event_DeltaSeconds) == 0x0005E0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0005E8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakRotator_Roll) == 0x000600, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakRotator_Pitch) == 0x000604, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakRotator_Yaw) == 0x000608, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_X_2) == 0x000610, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_Y_2) == 0x000618, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_Z_2) == 0x000620, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_MakeRotator_ReturnValue_2) == 0x000628, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000640, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_X_3) == 0x000728, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_Y_3) == 0x000730, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_BreakVector_Z_3) == 0x000738, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000740, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000750, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Array_Length_ReturnValue) == 0x000754, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000758, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, Temp_bool_Has_Been_Initd_Variable_3) == 0x000759, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000760, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000778, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Lerp_ReturnValue) == 0x000780, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000788, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000798, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, Temp_bool_IsClosed_Variable_2) == 0x0007A0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, Temp_bool_IsClosed_Variable_3) == 0x0007A1, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0007A8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0007B0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0007B8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_IsPlaying_ReturnValue) == 0x0007C0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_MakeVector_ReturnValue) == 0x0007C8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x0007E0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_IsPlaying_ReturnValue_1) == 0x0008C8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0008D0, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0008D8, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP, CallFunc_MakeRotator_Pitch_ImplicitCast_1) == 0x0008DC, "Member 'MinecartLevier_BP_C_ExecuteUbergraph_MinecartLevier_BP::CallFunc_MakeRotator_Pitch_ImplicitCast_1' has a wrong offset!");

// Function MinecartLevier_BP.MinecartLevier_BP_C.OnRep_Reset
// 0x00E8 (0x00E8 - 0x0000)
struct MinecartLevier_BP_C_OnRep_Reset final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0000(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(MinecartLevier_BP_C_OnRep_Reset) == 0x000008, "Wrong alignment on MinecartLevier_BP_C_OnRep_Reset");
static_assert(sizeof(MinecartLevier_BP_C_OnRep_Reset) == 0x0000E8, "Wrong size on MinecartLevier_BP_C_OnRep_Reset");
static_assert(offsetof(MinecartLevier_BP_C_OnRep_Reset, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000000, "Member 'MinecartLevier_BP_C_OnRep_Reset::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function MinecartLevier_BP.MinecartLevier_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MinecartLevier_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinecartLevier_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on MinecartLevier_BP_C_ReceiveTick");
static_assert(sizeof(MinecartLevier_BP_C_ReceiveTick) == 0x000004, "Wrong size on MinecartLevier_BP_C_ReceiveTick");
static_assert(offsetof(MinecartLevier_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MinecartLevier_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function MinecartLevier_BP.MinecartLevier_BP_C.UserConstructionScript
// 0x0270 (0x0270 - 0x0000)
struct MinecartLevier_BP_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
