#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_Trigger

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Mod_Trigger.Mod_Trigger_C.AddActorToTrigger
// 0x0008 (0x0008 - 0x0000)
struct Mod_Trigger_C_AddActorToTrigger final
{
public:
	int64                                         ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Trigger_C_AddActorToTrigger) == 0x000008, "Wrong alignment on Mod_Trigger_C_AddActorToTrigger");
static_assert(sizeof(Mod_Trigger_C_AddActorToTrigger) == 0x000008, "Wrong size on Mod_Trigger_C_AddActorToTrigger");
static_assert(offsetof(Mod_Trigger_C_AddActorToTrigger, ID) == 0x000000, "Member 'Mod_Trigger_C_AddActorToTrigger::ID' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Mod_Trigger_C_BndEvt__Mod_Trigger_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.ExecuteUbergraph_Mod_Trigger
// 0x02A8 (0x02A8 - 0x0000)
struct Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0060(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomCar_C*                        K2Node_DynamicCast_AsBP_Custom_Car;                // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Vehicle_C>        K2Node_DynamicCast_AsBPI_Vehicle;                  // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         K2Node_CustomEvent_ID_1;                           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x01C0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue;           // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         K2Node_CustomEvent_ID;                             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Push_1;                         // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F7[0x1];                                      // 0x01F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor_1;                        // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ModButton_C>      K2Node_DynamicCast_AsBPI_Mod_Button;               // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Push;                           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game_1;                    // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryReferenceActors_Success;               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger) == 0x000008, "Wrong alignment on Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger");
static_assert(sizeof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger) == 0x0002A8, "Wrong size on Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, EntryPoint) == 0x000000, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_HasAuthority_ReturnValue_1) == 0x000007, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, Temp_bool_Has_Been_Initd_Variable_1) == 0x000008, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, Temp_bool_IsClosed_Variable_1) == 0x000009, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_HasAuthority_ReturnValue_2) == 0x00000A, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_HasAuthority_ReturnValue_3) == 0x000018, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_GetGameMode_ReturnValue) == 0x000020, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_IsServer_ReturnValue) == 0x000028, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_AsGM_Game) == 0x000030, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_AsGM_Game' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000040, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000048, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000050, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000058, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_bFromSweep) == 0x00005C, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_SweepResult) == 0x000060, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000148, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_OtherActor) == 0x000150, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_OtherComp) == 0x000158, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000160, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_AsBP_Custom_Car) == 0x000168, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_AsBP_Custom_Car' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_AsBPI_Vehicle) == 0x000178, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_AsBPI_Vehicle' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_bSuccess_2) == 0x000188, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_GetDisplayName_ReturnValue) == 0x000190, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_GetDisplayName_ReturnValue_1) == 0x0001A0, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_HasAuthority_ReturnValue_4) == 0x0001B0, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_CustomEvent_ID_1) == 0x0001B8, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_CustomEvent_ID_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_GetOverlappingActors_OverlappingActors) == 0x0001C0, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Conv_Int64ToString_ReturnValue) == 0x0001D0, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Conv_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Array_IsEmpty_ReturnValue) == 0x0001E0, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_CustomEvent_ID) == 0x0001E8, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_CustomEvent_ID' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Array_AddUnique_ReturnValue) == 0x0001F0, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001F4, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_IsServer_ReturnValue_1) == 0x0001F5, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_CustomEvent_Push_1) == 0x0001F6, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_CustomEvent_Push_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_CustomEvent_Actor_1) == 0x0001F8, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_CustomEvent_Actor_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Array_Get_Item) == 0x000200, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_AsBPI_Mod_Button) == 0x000210, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_AsBPI_Mod_Button' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_bSuccess_3) == 0x000220, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Less_IntInt_ReturnValue) == 0x000221, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_GetGameMode_ReturnValue_1) == 0x000228, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_CustomEvent_Push) == 0x000230, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_CustomEvent_Push' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_CustomEvent_Actor) == 0x000238, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_AsGM_Game_1) == 0x000240, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_AsGM_Game_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_DynamicCast_bSuccess_4) == 0x000248, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, K2Node_Event_DeltaSeconds) == 0x00024C, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Array_Get_Item_1) == 0x000250, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_GetDisplayName_ReturnValue_2) == 0x000258, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Array_Contains_ReturnValue) == 0x000268, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Concat_StrStr_ReturnValue) == 0x000270, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000280, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_TryReferenceActors_Success) == 0x000290, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_TryReferenceActors_Success' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_RandomFloatInRange_ReturnValue) == 0x000298, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger, CallFunc_Delay_Duration_ImplicitCast) == 0x0002A0, "Member 'Mod_Trigger_C_ExecuteUbergraph_Mod_Trigger::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.OnRep_ActorsToTrigger
// 0x0010 (0x0010 - 0x0000)
struct Mod_Trigger_C_OnRep_ActorsToTrigger final
{
public:
	TArray<TSoftClassPtr<class UClass>>           Classes;                                           // 0x0000(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(Mod_Trigger_C_OnRep_ActorsToTrigger) == 0x000008, "Wrong alignment on Mod_Trigger_C_OnRep_ActorsToTrigger");
static_assert(sizeof(Mod_Trigger_C_OnRep_ActorsToTrigger) == 0x000010, "Wrong size on Mod_Trigger_C_OnRep_ActorsToTrigger");
static_assert(offsetof(Mod_Trigger_C_OnRep_ActorsToTrigger, Classes) == 0x000000, "Member 'Mod_Trigger_C_OnRep_ActorsToTrigger::Classes' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Mod_Trigger_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Trigger_C_ReceiveTick) == 0x000004, "Wrong alignment on Mod_Trigger_C_ReceiveTick");
static_assert(sizeof(Mod_Trigger_C_ReceiveTick) == 0x000004, "Wrong size on Mod_Trigger_C_ReceiveTick");
static_assert(offsetof(Mod_Trigger_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Mod_Trigger_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.RemoveActorToTrigger
// 0x0008 (0x0008 - 0x0000)
struct Mod_Trigger_C_RemoveActorToTrigger final
{
public:
	int64                                         ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Trigger_C_RemoveActorToTrigger) == 0x000008, "Wrong alignment on Mod_Trigger_C_RemoveActorToTrigger");
static_assert(sizeof(Mod_Trigger_C_RemoveActorToTrigger) == 0x000008, "Wrong size on Mod_Trigger_C_RemoveActorToTrigger");
static_assert(offsetof(Mod_Trigger_C_RemoveActorToTrigger, ID) == 0x000000, "Member 'Mod_Trigger_C_RemoveActorToTrigger::ID' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.Trigger
// 0x0010 (0x0010 - 0x0000)
struct Mod_Trigger_C_Trigger final
{
public:
	bool                                          Push;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Trigger_C_Trigger) == 0x000008, "Wrong alignment on Mod_Trigger_C_Trigger");
static_assert(sizeof(Mod_Trigger_C_Trigger) == 0x000010, "Wrong size on Mod_Trigger_C_Trigger");
static_assert(offsetof(Mod_Trigger_C_Trigger, Push) == 0x000000, "Member 'Mod_Trigger_C_Trigger::Push' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_Trigger, Actor) == 0x000008, "Member 'Mod_Trigger_C_Trigger::Actor' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.TriggerAll
// 0x0010 (0x0010 - 0x0000)
struct Mod_Trigger_C_TriggerAll final
{
public:
	bool                                          Push;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Trigger_C_TriggerAll) == 0x000008, "Wrong alignment on Mod_Trigger_C_TriggerAll");
static_assert(sizeof(Mod_Trigger_C_TriggerAll) == 0x000010, "Wrong size on Mod_Trigger_C_TriggerAll");
static_assert(offsetof(Mod_Trigger_C_TriggerAll, Push) == 0x000000, "Member 'Mod_Trigger_C_TriggerAll::Push' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_TriggerAll, Actor) == 0x000008, "Member 'Mod_Trigger_C_TriggerAll::Actor' has a wrong offset!");

// Function Mod_Trigger.Mod_Trigger_C.TryReferenceActors
// 0x0098 (0x0098 - 0x0000)
struct Mod_Trigger_C_TryReferenceActors final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           CallFunc_GetModButtonClasses_ClassesOut;           // 0x0020(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item;                           // 0x0038(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlacableByID_ReturnValue;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetPlacableByID_Actor;                    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Trigger_C_TryReferenceActors) == 0x000008, "Wrong alignment on Mod_Trigger_C_TryReferenceActors");
static_assert(sizeof(Mod_Trigger_C_TryReferenceActors) == 0x000098, "Wrong size on Mod_Trigger_C_TryReferenceActors");
static_assert(offsetof(Mod_Trigger_C_TryReferenceActors, Success) == 0x000000, "Member 'Mod_Trigger_C_TryReferenceActors::Success' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_TryReferenceActors, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Mod_Trigger_C_TryReferenceActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Trigger_C_TryReferenceActors, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Mod_Trigger_C_TryReferenceActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
