#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_Lobby

#include "Basic.hpp"

#include "BP_ModContent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mod_Lobby.Mod_Lobby_C
// 0x0060 (0x0308 - 0x02A8)
class AMod_Lobby_C final : public ABP_ModContent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_3FC77A5245150979BDC7D983BA65CFC1; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_3FC77A5245150979BDC7D983BA65CFC1; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         InitArmLength;                                     // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mod_Lobby(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SpawnLobbyCharacters();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mod_Lobby_C">();
	}
	static class AMod_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMod_Lobby_C>();
	}
};
static_assert(alignof(AMod_Lobby_C) == 0x000008, "Wrong alignment on AMod_Lobby_C");
static_assert(sizeof(AMod_Lobby_C) == 0x000308, "Wrong size on AMod_Lobby_C");
static_assert(offsetof(AMod_Lobby_C, UberGraphFrame) == 0x0002A8, "Member 'AMod_Lobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, SpotLight) == 0x0002B0, "Member 'AMod_Lobby_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, StaticMesh) == 0x0002B8, "Member 'AMod_Lobby_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, StaticMesh1) == 0x0002C0, "Member 'AMod_Lobby_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, StaticMesh2) == 0x0002C8, "Member 'AMod_Lobby_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, StaticMesh3) == 0x0002D0, "Member 'AMod_Lobby_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, Camera) == 0x0002D8, "Member 'AMod_Lobby_C::Camera' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, SpringArm) == 0x0002E0, "Member 'AMod_Lobby_C::SpringArm' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, Cube) == 0x0002E8, "Member 'AMod_Lobby_C::Cube' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, Timeline_NewTrack_0_3FC77A5245150979BDC7D983BA65CFC1) == 0x0002F0, "Member 'AMod_Lobby_C::Timeline_NewTrack_0_3FC77A5245150979BDC7D983BA65CFC1' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, Timeline__Direction_3FC77A5245150979BDC7D983BA65CFC1) == 0x0002F4, "Member 'AMod_Lobby_C::Timeline__Direction_3FC77A5245150979BDC7D983BA65CFC1' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, Timeline) == 0x0002F8, "Member 'AMod_Lobby_C::Timeline' has a wrong offset!");
static_assert(offsetof(AMod_Lobby_C, InitArmLength) == 0x000300, "Member 'AMod_Lobby_C::InitArmLength' has a wrong offset!");

}

