#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_SafeLocation

#include "Basic.hpp"


namespace SDK::Params
{

// Function Mod_SafeLocation.Mod_SafeLocation_C.ExecuteUbergraph_Mod_SafeLocation
// 0x0048 (0x0048 - 0x0000)
struct Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game_1;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation) == 0x000008, "Wrong alignment on Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation");
static_assert(sizeof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation) == 0x000048, "Wrong size on Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, EntryPoint) == 0x000000, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, K2Node_DynamicCast_AsGM_Game) == 0x000018, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::K2Node_DynamicCast_AsGM_Game' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, CallFunc_GetGameMode_ReturnValue_1) == 0x000028, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, K2Node_DynamicCast_AsGM_Game_1) == 0x000030, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::K2Node_DynamicCast_AsGM_Game_1' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation, CallFunc_IsServer_ReturnValue_1) == 0x000040, "Member 'Mod_SafeLocation_C_ExecuteUbergraph_Mod_SafeLocation::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");

// Function Mod_SafeLocation.Mod_SafeLocation_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Mod_SafeLocation_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_SafeLocation_C_ReceiveTick) == 0x000004, "Wrong alignment on Mod_SafeLocation_C_ReceiveTick");
static_assert(sizeof(Mod_SafeLocation_C_ReceiveTick) == 0x000004, "Wrong size on Mod_SafeLocation_C_ReceiveTick");
static_assert(offsetof(Mod_SafeLocation_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Mod_SafeLocation_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

