#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_SkySphere

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mod_SkySphere.Mod_SkySphere_C
// 0x0028 (0x02C0 - 0x0298)
class AMod_SkySphere_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIGLE_InterfaceComponent*               IGLE_Interface;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mat;                                               // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Mod_SkySphere_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature(const class FString& PropertyName);
	void ExecuteUbergraph_Mod_SkySphere(int32 EntryPoint);
	void OnLoaded_81BF4707462F3E1839CBDF848E89C7D6(class UObject* Loaded);
	void ReceiveBeginPlay();
	void SetTexture(TSoftObjectPtr<class UTexture2D> Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mod_SkySphere_C">();
	}
	static class AMod_SkySphere_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMod_SkySphere_C>();
	}
};
static_assert(alignof(AMod_SkySphere_C) == 0x000008, "Wrong alignment on AMod_SkySphere_C");
static_assert(sizeof(AMod_SkySphere_C) == 0x0002C0, "Wrong size on AMod_SkySphere_C");
static_assert(offsetof(AMod_SkySphere_C, UberGraphFrame) == 0x000298, "Member 'AMod_SkySphere_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMod_SkySphere_C, IGLE_Interface) == 0x0002A0, "Member 'AMod_SkySphere_C::IGLE_Interface' has a wrong offset!");
static_assert(offsetof(AMod_SkySphere_C, Sphere) == 0x0002A8, "Member 'AMod_SkySphere_C::Sphere' has a wrong offset!");
static_assert(offsetof(AMod_SkySphere_C, DefaultSceneRoot) == 0x0002B0, "Member 'AMod_SkySphere_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMod_SkySphere_C, Mat) == 0x0002B8, "Member 'AMod_SkySphere_C::Mat' has a wrong offset!");

}

