#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_Foliage

#include "Basic.hpp"

#include "BP_ModContent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mod_Foliage.Mod_Foliage_C
// 0x0018 (0x02C0 - 0x02A8)
class AMod_Foliage_C final : public ABP_ModContent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstIndexToSpawn;                                 // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddFoliageInstance(class UIGLE_FoliagePropertyValueObject_C* Self2);
	void AddInstance(const struct FTransform& NewItem);
	void BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature(const class FString& PropertyName);
	void CustomEvent(class AActor* Actor, bool CreateUndoAction);
	void ExecuteUbergraph_Mod_Foliage(int32 EntryPoint);
	void OnLoaded_AE80A90C429B210FC2485FA1DCB71C71(class UObject* Loaded);
	void ReceiveBeginPlay();
	void RemoveFoliageInstance(int32 ID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mod_Foliage_C">();
	}
	static class AMod_Foliage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMod_Foliage_C>();
	}
};
static_assert(alignof(AMod_Foliage_C) == 0x000008, "Wrong alignment on AMod_Foliage_C");
static_assert(sizeof(AMod_Foliage_C) == 0x0002C0, "Wrong size on AMod_Foliage_C");
static_assert(offsetof(AMod_Foliage_C, UberGraphFrame) == 0x0002A8, "Member 'AMod_Foliage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMod_Foliage_C, HierarchicalInstancedStaticMesh) == 0x0002B0, "Member 'AMod_Foliage_C::HierarchicalInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(AMod_Foliage_C, FirstIndexToSpawn) == 0x0002B8, "Member 'AMod_Foliage_C::FirstIndexToSpawn' has a wrong offset!");

}

