#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_SplinePoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function Mod_SplinePoint.Mod_SplinePoint_C.ExecuteUbergraph_Mod_SplinePoint
// 0x02E0 (0x02E0 - 0x0000)
struct Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEProperty                          CallFunc_GetPropertyByName_Property;               // 0x0080(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyByName_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_SplinePointPropertyValueObject_C* K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0190(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0xF];                                      // 0x01F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x0200(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game_1;                    // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint) == 0x000010, "Wrong alignment on Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint");
static_assert(sizeof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint) == 0x0002E0, "Wrong size on Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, EntryPoint) == 0x000000, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, Temp_bool_Has_Been_Initd_Variable) == 0x000028, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_IsServer_ReturnValue) == 0x000029, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_GetGameMode_ReturnValue) == 0x000030, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_DynamicCast_AsGM_Game) == 0x000038, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_DynamicCast_AsGM_Game' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_IsServer_ReturnValue_1) == 0x000041, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_GetPlayerPawn_ReturnValue) == 0x000068, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_DynamicCast_AsIGLE_Pawn_Example) == 0x000070, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_DynamicCast_AsIGLE_Pawn_Example' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_Set_Contains_ReturnValue) == 0x000079, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_GetPropertyByName_Property) == 0x000080, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_GetPropertyByName_Property' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_GetPropertyByName_ReturnValue) == 0x000100, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_GetPropertyByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object) == 0x000108, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_DynamicCast_AsIGLE_Spline_Point_Property_Value_Object' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_GetTransform_ReturnValue) == 0x000190, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_IsValid_ReturnValue_1) == 0x0001F0, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_MakeRelativeTransform_ReturnValue) == 0x000200, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_MakeRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_BreakTransform_Location) == 0x000260, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_BreakTransform_Rotation) == 0x000278, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_BreakTransform_Scale) == 0x000290, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_GetGameMode_ReturnValue_1) == 0x0002A8, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_DynamicCast_AsGM_Game_1) == 0x0002B0, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_DynamicCast_AsGM_Game_1' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, K2Node_DynamicCast_bSuccess_3) == 0x0002B8, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002C0, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0002D8, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint, CallFunc_IsValid_ReturnValue_2) == 0x0002D9, "Member 'Mod_SplinePoint_C_ExecuteUbergraph_Mod_SplinePoint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function Mod_SplinePoint.Mod_SplinePoint_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Mod_SplinePoint_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_SplinePoint_C_ReceiveTick) == 0x000004, "Wrong alignment on Mod_SplinePoint_C_ReceiveTick");
static_assert(sizeof(Mod_SplinePoint_C_ReceiveTick) == 0x000004, "Wrong size on Mod_SplinePoint_C_ReceiveTick");
static_assert(offsetof(Mod_SplinePoint_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Mod_SplinePoint_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

