#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_Fog

#include "Basic.hpp"

#include "BP_ModContent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mod_Fog.Mod_Fog_C
// 0x0020 (0x02C8 - 0x02A8)
class AMod_Fog_C final : public ABP_ModContent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    billboard;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExponentialHeightFogComponent*         ExponentialHeightFog;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Mod_Fog_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature(const class FString& PropertyName);
	void ExecuteUbergraph_Mod_Fog(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mod_Fog_C">();
	}
	static class AMod_Fog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMod_Fog_C>();
	}
};
static_assert(alignof(AMod_Fog_C) == 0x000008, "Wrong alignment on AMod_Fog_C");
static_assert(sizeof(AMod_Fog_C) == 0x0002C8, "Wrong size on AMod_Fog_C");
static_assert(offsetof(AMod_Fog_C, UberGraphFrame) == 0x0002A8, "Member 'AMod_Fog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMod_Fog_C, Cube) == 0x0002B0, "Member 'AMod_Fog_C::Cube' has a wrong offset!");
static_assert(offsetof(AMod_Fog_C, billboard) == 0x0002B8, "Member 'AMod_Fog_C::billboard' has a wrong offset!");
static_assert(offsetof(AMod_Fog_C, ExponentialHeightFog) == 0x0002C0, "Member 'AMod_Fog_C::ExponentialHeightFog' has a wrong offset!");

}

