#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_Foliage

#include "Basic.hpp"

#include "InGameLevelEditor_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Mod_Foliage.Mod_Foliage_C.AddFoliageInstance
// 0x0080 (0x0080 - 0x0000)
struct Mod_Foliage_C_AddFoliageInstance final
{
public:
	class UIGLE_FoliagePropertyValueObject_C*     Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Foliage_C_AddFoliageInstance) == 0x000010, "Wrong alignment on Mod_Foliage_C_AddFoliageInstance");
static_assert(sizeof(Mod_Foliage_C_AddFoliageInstance) == 0x000080, "Wrong size on Mod_Foliage_C_AddFoliageInstance");
static_assert(offsetof(Mod_Foliage_C_AddFoliageInstance, Self2) == 0x000000, "Member 'Mod_Foliage_C_AddFoliageInstance::Self2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_AddFoliageInstance, Temp_int_Variable) == 0x000008, "Member 'Mod_Foliage_C_AddFoliageInstance::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_AddFoliageInstance, CallFunc_Array_LastIndex_ReturnValue) == 0x00000C, "Member 'Mod_Foliage_C_AddFoliageInstance::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_AddFoliageInstance, CallFunc_Array_Get_Item) == 0x000010, "Member 'Mod_Foliage_C_AddFoliageInstance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_AddFoliageInstance, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'Mod_Foliage_C_AddFoliageInstance::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_AddFoliageInstance, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'Mod_Foliage_C_AddFoliageInstance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_AddFoliageInstance, CallFunc_AddInstance_ReturnValue) == 0x000078, "Member 'Mod_Foliage_C_AddFoliageInstance::CallFunc_AddInstance_ReturnValue' has a wrong offset!");

// Function Mod_Foliage.Mod_Foliage_C.AddInstance
// 0x0060 (0x0060 - 0x0000)
struct Mod_Foliage_C_AddInstance final
{
public:
	struct FTransform                             NewItem;                                           // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Foliage_C_AddInstance) == 0x000010, "Wrong alignment on Mod_Foliage_C_AddInstance");
static_assert(sizeof(Mod_Foliage_C_AddInstance) == 0x000060, "Wrong size on Mod_Foliage_C_AddInstance");
static_assert(offsetof(Mod_Foliage_C_AddInstance, NewItem) == 0x000000, "Member 'Mod_Foliage_C_AddInstance::NewItem' has a wrong offset!");

// Function Mod_Foliage.Mod_Foliage_C.BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Mod_Foliage_C_BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Foliage_C_BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on Mod_Foliage_C_BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature");
static_assert(sizeof(Mod_Foliage_C_BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature) == 0x000010, "Wrong size on Mod_Foliage_C_BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature");
static_assert(offsetof(Mod_Foliage_C_BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature, PropertyName) == 0x000000, "Member 'Mod_Foliage_C_BndEvt__Mod_Foliage_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature::PropertyName' has a wrong offset!");

// Function Mod_Foliage.Mod_Foliage_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct Mod_Foliage_C_CustomEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CreateUndoAction;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Foliage_C_CustomEvent) == 0x000008, "Wrong alignment on Mod_Foliage_C_CustomEvent");
static_assert(sizeof(Mod_Foliage_C_CustomEvent) == 0x000010, "Wrong size on Mod_Foliage_C_CustomEvent");
static_assert(offsetof(Mod_Foliage_C_CustomEvent, Actor) == 0x000000, "Member 'Mod_Foliage_C_CustomEvent::Actor' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_CustomEvent, CreateUndoAction) == 0x000008, "Member 'Mod_Foliage_C_CustomEvent::CreateUndoAction' has a wrong offset!");

// Function Mod_Foliage.Mod_Foliage_C.ExecuteUbergraph_Mod_Foliage
// 0x0250 (0x0250 - 0x0000)
struct Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_PropertyValueObject*              CallFunc_GetPropertyValueByName_Value;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyValueByName_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FloatProperty_C*                  K2Node_DynamicCast_AsIGLE_Float_Property;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_1;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_2;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_3;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, bool CreateUndoAction)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_4;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_PropertyName;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_PropertyValueObject*              CallFunc_GetPropertyValueByName_Value_1;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyValueByName_ReturnValue_1;     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FloatProperty_C*                  K2Node_DynamicCast_AsIGLE_Float_Property_1;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_PropertyValueObject*              CallFunc_GetPropertyValueByName_Value_2;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyValueByName_ReturnValue_2;     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FoliagePropertyValueObject_C*     K2Node_DynamicCast_AsIGLE_Foliage_Property_Value_Object; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_BoolProperty_C*                   K2Node_DynamicCast_AsIGLE_Bool_Property;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IGLE_TryCallOnPropertyValueChanged_Success; // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_BoolProperty_C*                   K2Node_DynamicCast_AsIGLE_Bool_Property_1;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default;                             // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FloatProperty_C*                  K2Node_DynamicCast_AsIGLE_Float_Property_2;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default_1;                           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FloatProperty_C*                  K2Node_DynamicCast_AsIGLE_Float_Property_3;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_BoolProperty_C*                   K2Node_DynamicCast_AsIGLE_Bool_Property_2;         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIGLE_MeshProperty_C*                   K2Node_DynamicCast_AsIGLE_Mesh_Property;           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FoliagePropertyValueObject_C*     K2Node_DynamicCast_AsIGLE_Foliage_Property_Value_Object_1; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_NewItem;                        // 0x0140(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game;                      // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_PropertyValueObject*              CallFunc_GetPropertyValueByName_Value_3;           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyValueByName_ReturnValue_3;     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_BoolProperty_C*                   K2Node_DynamicCast_AsIGLE_Bool_Property_3;         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_5;                              // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ModFoliageSpawner_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x01E0(0x0010)(ReferenceParm)
	class ABP_ModFoliageSpawner_C*                CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example;            // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CreateUndoAction;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default_2;                           // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example_1;          // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetBoundsScale_NewBoundsScale_ImplicitCast; // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage) == 0x000010, "Wrong alignment on Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage");
static_assert(sizeof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage) == 0x000250, "Wrong size on Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, EntryPoint) == 0x000000, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPropertyValueByName_Value) == 0x000008, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPropertyValueByName_Value' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPropertyValueByName_ReturnValue) == 0x000010, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPropertyValueByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Float_Property) == 0x000018, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Float_Property' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_object_Variable) == 0x000030, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsStatic_Mesh) == 0x000038, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_bool_Variable) == 0x000041, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_byte_Variable) == 0x000042, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_byte_Variable_1) == 0x000043, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_bool_Variable_1) == 0x000044, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_byte_Variable_2) == 0x000045, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_byte_Variable_3) == 0x000046, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_int_Array_Index_Variable) == 0x000060, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_IsServer_ReturnValue) == 0x000064, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_byte_Variable_4) == 0x000065, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_ComponentBoundEvent_PropertyName) == 0x000068, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_ComponentBoundEvent_PropertyName' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_SwitchString_CmpSuccess) == 0x000078, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPropertyValueByName_Value_1) == 0x000080, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPropertyValueByName_Value_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPropertyValueByName_ReturnValue_1) == 0x000088, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPropertyValueByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Float_Property_1) == 0x000090, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Float_Property_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPropertyValueByName_Value_2) == 0x0000A0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPropertyValueByName_Value_2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPropertyValueByName_ReturnValue_2) == 0x0000A8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPropertyValueByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Foliage_Property_Value_Object) == 0x0000B0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Foliage_Property_Value_Object' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Bool_Property) == 0x0000C0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Bool_Property' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_IGLE_TryCallOnPropertyValueChanged_Success) == 0x0000C9, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_IGLE_TryCallOnPropertyValueChanged_Success' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Bool_Property_1) == 0x0000D0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Bool_Property_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_5) == 0x0000D8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_Select_Default) == 0x0000D9, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Float_Property_2) == 0x0000E0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Float_Property_2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_6) == 0x0000E8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_Select_Default_1) == 0x0000E9, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Float_Property_3) == 0x0000F0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Float_Property_3' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_7) == 0x0000F8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Bool_Property_2) == 0x000100, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Bool_Property_2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_8) == 0x000108, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000110, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Mesh_Property) == 0x000118, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Mesh_Property' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_9) == 0x000120, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_FTrunc_ReturnValue) == 0x000124, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_Multiply_IntInt_ReturnValue) == 0x000128, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00012C, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Foliage_Property_Value_Object_1) == 0x000130, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Foliage_Property_Value_Object_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_10) == 0x000138, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_CustomEvent_NewItem) == 0x000140, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_CustomEvent_NewItem' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_Array_Add_ReturnValue) == 0x0001A0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetGameMode_ReturnValue) == 0x0001A8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsGM_Game) == 0x0001B0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsGM_Game' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_11) == 0x0001B8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPropertyValueByName_Value_3) == 0x0001C0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPropertyValueByName_Value_3' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPropertyValueByName_ReturnValue_3) == 0x0001C8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPropertyValueByName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Bool_Property_3) == 0x0001D0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Bool_Property_3' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_12) == 0x0001D8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_SetStaticMesh_ReturnValue) == 0x0001D9, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_byte_Variable_5) == 0x0001DA, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001E0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_Array_Get_Item) == 0x0001F0, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001F8, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_Less_IntInt_ReturnValue) == 0x00020C, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPlayerPawn_ReturnValue) == 0x000210, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Pawn_Example) == 0x000218, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Pawn_Example' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_13) == 0x000220, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_CustomEvent_Actor) == 0x000228, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_CustomEvent_CreateUndoAction) == 0x000230, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_CustomEvent_CreateUndoAction' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, Temp_bool_Variable_2) == 0x000231, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000232, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_Select_Default_2) == 0x000233, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000238, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_AsIGLE_Pawn_Example_1) == 0x000240, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_AsIGLE_Pawn_Example_1' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, K2Node_DynamicCast_bSuccess_14) == 0x000248, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_IsValid_ReturnValue) == 0x000249, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage, CallFunc_SetBoundsScale_NewBoundsScale_ImplicitCast) == 0x00024C, "Member 'Mod_Foliage_C_ExecuteUbergraph_Mod_Foliage::CallFunc_SetBoundsScale_NewBoundsScale_ImplicitCast' has a wrong offset!");

// Function Mod_Foliage.Mod_Foliage_C.OnLoaded_AE80A90C429B210FC2485FA1DCB71C71
// 0x0008 (0x0008 - 0x0000)
struct Mod_Foliage_C_OnLoaded_AE80A90C429B210FC2485FA1DCB71C71 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Foliage_C_OnLoaded_AE80A90C429B210FC2485FA1DCB71C71) == 0x000008, "Wrong alignment on Mod_Foliage_C_OnLoaded_AE80A90C429B210FC2485FA1DCB71C71");
static_assert(sizeof(Mod_Foliage_C_OnLoaded_AE80A90C429B210FC2485FA1DCB71C71) == 0x000008, "Wrong size on Mod_Foliage_C_OnLoaded_AE80A90C429B210FC2485FA1DCB71C71");
static_assert(offsetof(Mod_Foliage_C_OnLoaded_AE80A90C429B210FC2485FA1DCB71C71, Loaded) == 0x000000, "Member 'Mod_Foliage_C_OnLoaded_AE80A90C429B210FC2485FA1DCB71C71::Loaded' has a wrong offset!");

// Function Mod_Foliage.Mod_Foliage_C.RemoveFoliageInstance
// 0x00A0 (0x00A0 - 0x0000)
struct Mod_Foliage_C_RemoveFoliageInstance final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEProperty                          CallFunc_GetPropertyByName_Property;               // 0x0008(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyByName_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveInstance_ReturnValue;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FoliagePropertyValueObject_C*     K2Node_DynamicCast_AsIGLE_Foliage_Property_Value_Object; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Foliage_C_RemoveFoliageInstance) == 0x000008, "Wrong alignment on Mod_Foliage_C_RemoveFoliageInstance");
static_assert(sizeof(Mod_Foliage_C_RemoveFoliageInstance) == 0x0000A0, "Wrong size on Mod_Foliage_C_RemoveFoliageInstance");
static_assert(offsetof(Mod_Foliage_C_RemoveFoliageInstance, ID) == 0x000000, "Member 'Mod_Foliage_C_RemoveFoliageInstance::ID' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_RemoveFoliageInstance, CallFunc_GetPropertyByName_Property) == 0x000008, "Member 'Mod_Foliage_C_RemoveFoliageInstance::CallFunc_GetPropertyByName_Property' has a wrong offset!");
static_assert(offsetof(Mod_Foliage_C_RemoveFoliageInstance, CallFunc_GetPropertyByName_ReturnValue) == 0x000088, "Member 'Mod_Foliage_C_RemoveFoliageInstance::CallFunc_GetPropertyByName_ReturnValue' has a wrong offset!");
