#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_KillPlane

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mod_KillPlane.Mod_KillPlane_C
// 0x0020 (0x02B8 - 0x0298)
class AMod_KillPlane_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIGLE_InterfaceComponent*               IGLE_Interface;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void DetectKill();
	void ExecuteUbergraph_Mod_KillPlane(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mod_KillPlane_C">();
	}
	static class AMod_KillPlane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMod_KillPlane_C>();
	}
};
static_assert(alignof(AMod_KillPlane_C) == 0x000008, "Wrong alignment on AMod_KillPlane_C");
static_assert(sizeof(AMod_KillPlane_C) == 0x0002B8, "Wrong size on AMod_KillPlane_C");
static_assert(offsetof(AMod_KillPlane_C, UberGraphFrame) == 0x000298, "Member 'AMod_KillPlane_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMod_KillPlane_C, IGLE_Interface) == 0x0002A0, "Member 'AMod_KillPlane_C::IGLE_Interface' has a wrong offset!");
static_assert(offsetof(AMod_KillPlane_C, Plane) == 0x0002A8, "Member 'AMod_KillPlane_C::Plane' has a wrong offset!");
static_assert(offsetof(AMod_KillPlane_C, DefaultSceneRoot) == 0x0002B0, "Member 'AMod_KillPlane_C::DefaultSceneRoot' has a wrong offset!");

}

