#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_CustomStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Mod_CustomStart.Mod_CustomStart_C.ExecuteUbergraph_Mod_CustomStart
// 0x0250 (0x0250 - 0x0000)
struct Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AssetLoadingNotifier_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class ABP_AssetLoadingNotifier_C*             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AMod_RescuePoint_C*>             CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0028(0x0010)(ReferenceParm)
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMod_RescuePoint_C*                     CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0160(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart) == 0x000010, "Wrong alignment on Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart");
static_assert(sizeof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart) == 0x000250, "Wrong size on Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, EntryPoint) == 0x000000, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_Array_Get_Item) == 0x000018, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_GetGameMode_ReturnValue) == 0x000020, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000028, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, K2Node_DynamicCast_AsGM_Game) == 0x000038, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::K2Node_DynamicCast_AsGM_Game' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_BreakTransform_Location) == 0x0000B0, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_BreakTransform_Rotation) == 0x0000C8, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_BreakTransform_Scale) == 0x0000E0, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000160, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000248, "Member 'Mod_CustomStart_C_ExecuteUbergraph_Mod_CustomStart::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

}

