#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_StaticMesh

#include "Basic.hpp"

#include "BP_ModContent_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mod_StaticMesh.Mod_StaticMesh_C
// 0x0038 (0x02E0 - 0x02A8)
class AMod_StaticMesh_C : public ABP_ModContent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            NewMesh;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                PreviousScale;                                     // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sphere_Radius;                                     // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HiddenInGame;                                      // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Mod_StaticMesh_IGLE_Interface_K2Node_ComponentBoundEvent_0_IGLE_OnPropertyValueChanged__DelegateSignature(const class FString& PropertyName);
	void CustomEvent();
	void ExecuteUbergraph_Mod_StaticMesh(int32 EntryPoint);
	void GetMeshFromDataTable();
	void InitMesh();
	void LoadMaterial();
	void OnLoaded_5EEC44EF47AF7DF55FBA1EAE804D5822(class UObject* Loaded);
	void ReceiveBeginPlay();
	void ReinitMaterials();
	void UpdateDrawDistance(double DefaultRadius);
	void UpdateMaterialSize();
	void UpdateMaterialWorldAligned();
	void UpdatePlacableName(bool* Found, struct FIGLEPlacableActorInfo* Out_Row);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mod_StaticMesh_C">();
	}
	static class AMod_StaticMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMod_StaticMesh_C>();
	}
};
static_assert(alignof(AMod_StaticMesh_C) == 0x000008, "Wrong alignment on AMod_StaticMesh_C");
static_assert(sizeof(AMod_StaticMesh_C) == 0x0002E0, "Wrong size on AMod_StaticMesh_C");
static_assert(offsetof(AMod_StaticMesh_C, UberGraphFrame) == 0x0002A8, "Member 'AMod_StaticMesh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMod_StaticMesh_C, StaticMesh) == 0x0002B0, "Member 'AMod_StaticMesh_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AMod_StaticMesh_C, NewMesh) == 0x0002B8, "Member 'AMod_StaticMesh_C::NewMesh' has a wrong offset!");
static_assert(offsetof(AMod_StaticMesh_C, PreviousScale) == 0x0002C0, "Member 'AMod_StaticMesh_C::PreviousScale' has a wrong offset!");
static_assert(offsetof(AMod_StaticMesh_C, Sphere_Radius) == 0x0002D8, "Member 'AMod_StaticMesh_C::Sphere_Radius' has a wrong offset!");
static_assert(offsetof(AMod_StaticMesh_C, HiddenInGame) == 0x0002DC, "Member 'AMod_StaticMesh_C::HiddenInGame' has a wrong offset!");

}

