#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_Music

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InGameLevelEditor_structs.hpp"


namespace SDK::Params
{

// Function Mod_Music.Mod_Music_C.BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Mod_Music.Mod_Music_C.BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Mod_Music_C_BndEvt__Mod_Music_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Mod_Music.Mod_Music_C.BndEvt__Mod_Music_IGLE_Interface_K2Node_ComponentBoundEvent_2_IGLE_OnPropertyValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Mod_Music_C_BndEvt__Mod_Music_IGLE_Interface_K2Node_ComponentBoundEvent_2_IGLE_OnPropertyValueChanged__DelegateSignature final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Music_C_BndEvt__Mod_Music_IGLE_Interface_K2Node_ComponentBoundEvent_2_IGLE_OnPropertyValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on Mod_Music_C_BndEvt__Mod_Music_IGLE_Interface_K2Node_ComponentBoundEvent_2_IGLE_OnPropertyValueChanged__DelegateSignature");
static_assert(sizeof(Mod_Music_C_BndEvt__Mod_Music_IGLE_Interface_K2Node_ComponentBoundEvent_2_IGLE_OnPropertyValueChanged__DelegateSignature) == 0x000010, "Wrong size on Mod_Music_C_BndEvt__Mod_Music_IGLE_Interface_K2Node_ComponentBoundEvent_2_IGLE_OnPropertyValueChanged__DelegateSignature");
static_assert(offsetof(Mod_Music_C_BndEvt__Mod_Music_IGLE_Interface_K2Node_ComponentBoundEvent_2_IGLE_OnPropertyValueChanged__DelegateSignature, PropertyName) == 0x000000, "Member 'Mod_Music_C_BndEvt__Mod_Music_IGLE_Interface_K2Node_ComponentBoundEvent_2_IGLE_OnPropertyValueChanged__DelegateSignature::PropertyName' has a wrong offset!");

// Function Mod_Music.Mod_Music_C.ExecuteUbergraph_Mod_Music
// 0x02A0 (0x02A0 - 0x0000)
struct Mod_Music_C_ExecuteUbergraph_Mod_Music final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game_1;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0090(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_Game_C*                             K2Node_DynamicCast_AsGM_Game_2;                    // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_PropertyName;           // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLEProperty                          CallFunc_GetPropertyByName_Property;               // 0x01E8(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPropertyByName_ReturnValue;            // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIGLE_FloatProperty_C*                  K2Node_DynamicCast_AsIGLE_Float_Property;          // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Music_C_ExecuteUbergraph_Mod_Music) == 0x000008, "Wrong alignment on Mod_Music_C_ExecuteUbergraph_Mod_Music");
static_assert(sizeof(Mod_Music_C_ExecuteUbergraph_Mod_Music) == 0x0002A0, "Wrong size on Mod_Music_C_ExecuteUbergraph_Mod_Music");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, EntryPoint) == 0x000000, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_CustomEvent_Loaded) == 0x000010, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, Temp_object_Variable) == 0x000020, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_AsSound_Base) == 0x000028, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_GetGameMode_ReturnValue) == 0x000038, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_IsServer_ReturnValue) == 0x000040, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_AsGM_Game) == 0x000048, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_AsGM_Game' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_IsServer_ReturnValue_1) == 0x000051, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_GetGameMode_ReturnValue_1) == 0x000058, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_AsGM_Game_1) == 0x000060, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_AsGM_Game_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_IsServer_ReturnValue_2) == 0x000069, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000070, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000078, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000080, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000088, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_bFromSweep) == 0x00008C, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_SweepResult) == 0x000090, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000178, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_OtherActor) == 0x000180, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_OtherComp) == 0x000188, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000190, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_GetGameMode_ReturnValue_2) == 0x000198, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_GetGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001A0, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_AsGM_Game_2) == 0x0001A8, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_AsGM_Game_2' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_bSuccess_3) == 0x0001B0, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_CreateDelegate_OutputDelegate) == 0x0001B4, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_ComponentBoundEvent_PropertyName) == 0x0001D0, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_ComponentBoundEvent_PropertyName' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_SwitchString_CmpSuccess) == 0x0001E0, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_GetPropertyByName_Property) == 0x0001E8, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_GetPropertyByName_Property' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_GetPropertyByName_ReturnValue) == 0x000268, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_GetPropertyByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_AsIGLE_Float_Property) == 0x000270, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_AsIGLE_Float_Property' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, K2Node_DynamicCast_bSuccess_4) == 0x000278, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000280, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000288, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000290, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Mod_Music_C_ExecuteUbergraph_Mod_Music, CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast) == 0x000298, "Member 'Mod_Music_C_ExecuteUbergraph_Mod_Music::CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast' has a wrong offset!");

// Function Mod_Music.Mod_Music_C.FixSphereScale
// 0x0018 (0x0018 - 0x0000)
struct Mod_Music_C_FixSphereScale final
{
public:
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Music_C_FixSphereScale) == 0x000008, "Wrong alignment on Mod_Music_C_FixSphereScale");
static_assert(sizeof(Mod_Music_C_FixSphereScale) == 0x000018, "Wrong size on Mod_Music_C_FixSphereScale");
static_assert(offsetof(Mod_Music_C_FixSphereScale, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000000, "Member 'Mod_Music_C_FixSphereScale::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");

// Function Mod_Music.Mod_Music_C.OnLoaded_E3528CED4589F880D8D30285FCC97A28
// 0x0008 (0x0008 - 0x0000)
struct Mod_Music_C_OnLoaded_E3528CED4589F880D8D30285FCC97A28 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mod_Music_C_OnLoaded_E3528CED4589F880D8D30285FCC97A28) == 0x000008, "Wrong alignment on Mod_Music_C_OnLoaded_E3528CED4589F880D8D30285FCC97A28");
static_assert(sizeof(Mod_Music_C_OnLoaded_E3528CED4589F880D8D30285FCC97A28) == 0x000008, "Wrong size on Mod_Music_C_OnLoaded_E3528CED4589F880D8D30285FCC97A28");
static_assert(offsetof(Mod_Music_C_OnLoaded_E3528CED4589F880D8D30285FCC97A28, Loaded) == 0x000000, "Member 'Mod_Music_C_OnLoaded_E3528CED4589F880D8D30285FCC97A28::Loaded' has a wrong offset!");

}

