#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelingComponents

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelingComponents_structs.hpp"
#include "GeometryFramework_classes.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Class ModelingComponents.MeshTopologySelectionMechanic
// 0x0AC0 (0x0AF0 - 0x0030)
class alignas(0x10) UMeshTopologySelectionMechanic : public UInteractionMechanic
{
public:
	uint8                                         Pad_1A9C[0x48];                                    // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshTopologySelectionMechanicProperties* Properties;                                        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9D[0x60];                                    // 0x0080(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UMouseHoverBehavior*                    HoverBehavior;                                     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USingleClickOrDragInputBehavior*        ClickOrDragBehavior;                               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URectangleMarqueeMechanic*              MarqueeMechanic;                                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A9E[0x5C8];                                   // 0x00F8(0x05C8)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  PreviewGeometryActor;                              // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTriangleSetComponent*                  DrawnTriangleSetComponent;                         // 0x06C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A9F[0x50];                                    // 0x06D0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     HighlightedFaceMaterial;                           // 0x0720(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AA0[0x3C8];                                   // 0x0728(0x03C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshTopologySelectionMechanic">();
	}
	static class UMeshTopologySelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTopologySelectionMechanic>();
	}
};
static_assert(alignof(UMeshTopologySelectionMechanic) == 0x000010, "Wrong alignment on UMeshTopologySelectionMechanic");
static_assert(sizeof(UMeshTopologySelectionMechanic) == 0x000AF0, "Wrong size on UMeshTopologySelectionMechanic");
static_assert(offsetof(UMeshTopologySelectionMechanic, Properties) == 0x000078, "Member 'UMeshTopologySelectionMechanic::Properties' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanic, HoverBehavior) == 0x0000E0, "Member 'UMeshTopologySelectionMechanic::HoverBehavior' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanic, ClickOrDragBehavior) == 0x0000E8, "Member 'UMeshTopologySelectionMechanic::ClickOrDragBehavior' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanic, MarqueeMechanic) == 0x0000F0, "Member 'UMeshTopologySelectionMechanic::MarqueeMechanic' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanic, PreviewGeometryActor) == 0x0006C0, "Member 'UMeshTopologySelectionMechanic::PreviewGeometryActor' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanic, DrawnTriangleSetComponent) == 0x0006C8, "Member 'UMeshTopologySelectionMechanic::DrawnTriangleSetComponent' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanic, HighlightedFaceMaterial) == 0x000720, "Member 'UMeshTopologySelectionMechanic::HighlightedFaceMaterial' has a wrong offset!");

// Class ModelingComponents.BoundarySelectionMechanic
// 0x0000 (0x0AF0 - 0x0AF0)
class UBoundarySelectionMechanic final : public UMeshTopologySelectionMechanic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoundarySelectionMechanic">();
	}
	static class UBoundarySelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoundarySelectionMechanic>();
	}
};
static_assert(alignof(UBoundarySelectionMechanic) == 0x000010, "Wrong alignment on UBoundarySelectionMechanic");
static_assert(sizeof(UBoundarySelectionMechanic) == 0x000AF0, "Wrong size on UBoundarySelectionMechanic");

// Class ModelingComponents.DynamicMeshCommitter
// 0x0000 (0x0028 - 0x0028)
class IDynamicMeshCommitter final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshCommitter">();
	}
	static class IDynamicMeshCommitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDynamicMeshCommitter>();
	}
};
static_assert(alignof(IDynamicMeshCommitter) == 0x000008, "Wrong alignment on IDynamicMeshCommitter");
static_assert(sizeof(IDynamicMeshCommitter) == 0x000028, "Wrong size on IDynamicMeshCommitter");

// Class ModelingComponents.DynamicMeshProvider
// 0x0000 (0x0028 - 0x0028)
class IDynamicMeshProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshProvider">();
	}
	static class IDynamicMeshProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDynamicMeshProvider>();
	}
};
static_assert(alignof(IDynamicMeshProvider) == 0x000008, "Wrong alignment on IDynamicMeshProvider");
static_assert(sizeof(IDynamicMeshProvider) == 0x000028, "Wrong size on IDynamicMeshProvider");

// Class ModelingComponents.PersistentDynamicMeshSource
// 0x0000 (0x0028 - 0x0028)
class IPersistentDynamicMeshSource final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PersistentDynamicMeshSource">();
	}
	static class IPersistentDynamicMeshSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPersistentDynamicMeshSource>();
	}
};
static_assert(alignof(IPersistentDynamicMeshSource) == 0x000008, "Wrong alignment on IPersistentDynamicMeshSource");
static_assert(sizeof(IPersistentDynamicMeshSource) == 0x000028, "Wrong size on IPersistentDynamicMeshSource");

// Class ModelingComponents.GeometrySelectionVisualizationProperties
// 0x0060 (0x0108 - 0x00A8)
class UGeometrySelectionVisualizationProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bEnableShowTriangleROIBorder;                      // 0x00A8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableShowEdgeSelectionVertices;                  // 0x00A9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometrySelectionElementType                 SelectionElementType;                              // 0x00AA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometrySelectionTopologyType                SelectionTopologyType;                             // 0x00AB(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSelection;                                    // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTriangleROIBorder;                            // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHidden;                                       // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEdgeSelectionVertices;                        // 0x00AF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineThickness;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PointSize;                                         // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthBias;                                         // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 FaceColor;                                         // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 LineColor;                                         // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 PointColor;                                        // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 TriangleROIBorderColor;                            // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA1[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     TriangleMaterial;                                  // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LineMaterial;                                      // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PointMaterial;                                     // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     TriangleMaterialShowingHidden;                     // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LineMaterialShowingHidden;                         // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PointMaterialShowingHidden;                        // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA2[0x8];                                     // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeometrySelectionVisualizationProperties">();
	}
	static class UGeometrySelectionVisualizationProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionVisualizationProperties>();
	}
};
static_assert(alignof(UGeometrySelectionVisualizationProperties) == 0x000008, "Wrong alignment on UGeometrySelectionVisualizationProperties");
static_assert(sizeof(UGeometrySelectionVisualizationProperties) == 0x000108, "Wrong size on UGeometrySelectionVisualizationProperties");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, bEnableShowTriangleROIBorder) == 0x0000A8, "Member 'UGeometrySelectionVisualizationProperties::bEnableShowTriangleROIBorder' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, bEnableShowEdgeSelectionVertices) == 0x0000A9, "Member 'UGeometrySelectionVisualizationProperties::bEnableShowEdgeSelectionVertices' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, SelectionElementType) == 0x0000AA, "Member 'UGeometrySelectionVisualizationProperties::SelectionElementType' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, SelectionTopologyType) == 0x0000AB, "Member 'UGeometrySelectionVisualizationProperties::SelectionTopologyType' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, bShowSelection) == 0x0000AC, "Member 'UGeometrySelectionVisualizationProperties::bShowSelection' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, bShowTriangleROIBorder) == 0x0000AD, "Member 'UGeometrySelectionVisualizationProperties::bShowTriangleROIBorder' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, bShowHidden) == 0x0000AE, "Member 'UGeometrySelectionVisualizationProperties::bShowHidden' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, bShowEdgeSelectionVertices) == 0x0000AF, "Member 'UGeometrySelectionVisualizationProperties::bShowEdgeSelectionVertices' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, LineThickness) == 0x0000B0, "Member 'UGeometrySelectionVisualizationProperties::LineThickness' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, PointSize) == 0x0000B4, "Member 'UGeometrySelectionVisualizationProperties::PointSize' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, DepthBias) == 0x0000B8, "Member 'UGeometrySelectionVisualizationProperties::DepthBias' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, FaceColor) == 0x0000BC, "Member 'UGeometrySelectionVisualizationProperties::FaceColor' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, LineColor) == 0x0000C0, "Member 'UGeometrySelectionVisualizationProperties::LineColor' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, PointColor) == 0x0000C4, "Member 'UGeometrySelectionVisualizationProperties::PointColor' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, TriangleROIBorderColor) == 0x0000C8, "Member 'UGeometrySelectionVisualizationProperties::TriangleROIBorderColor' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, TriangleMaterial) == 0x0000D0, "Member 'UGeometrySelectionVisualizationProperties::TriangleMaterial' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, LineMaterial) == 0x0000D8, "Member 'UGeometrySelectionVisualizationProperties::LineMaterial' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, PointMaterial) == 0x0000E0, "Member 'UGeometrySelectionVisualizationProperties::PointMaterial' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, TriangleMaterialShowingHidden) == 0x0000E8, "Member 'UGeometrySelectionVisualizationProperties::TriangleMaterialShowingHidden' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, LineMaterialShowingHidden) == 0x0000F0, "Member 'UGeometrySelectionVisualizationProperties::LineMaterialShowingHidden' has a wrong offset!");
static_assert(offsetof(UGeometrySelectionVisualizationProperties, PointMaterialShowingHidden) == 0x0000F8, "Member 'UGeometrySelectionVisualizationProperties::PointMaterialShowingHidden' has a wrong offset!");

// Class ModelingComponents.InteractiveToolActivity
// 0x0000 (0x0030 - 0x0030)
class UInteractiveToolActivity : public UInteractionMechanic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractiveToolActivity">();
	}
	static class UInteractiveToolActivity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractiveToolActivity>();
	}
};
static_assert(alignof(UInteractiveToolActivity) == 0x000008, "Wrong alignment on UInteractiveToolActivity");
static_assert(sizeof(UInteractiveToolActivity) == 0x000030, "Wrong size on UInteractiveToolActivity");

// Class ModelingComponents.ToolActivityHost
// 0x0000 (0x0028 - 0x0028)
class IToolActivityHost final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolActivityHost">();
	}
	static class IToolActivityHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<IToolActivityHost>();
	}
};
static_assert(alignof(IToolActivityHost) == 0x000008, "Wrong alignment on IToolActivityHost");
static_assert(sizeof(IToolActivityHost) == 0x000028, "Wrong size on IToolActivityHost");

// Class ModelingComponents.MeshTopologySelectionMechanicProperties
// 0x0018 (0x00C0 - 0x00A8)
class UMeshTopologySelectionMechanicProperties : public UInteractiveToolPropertySet
{
public:
	bool                                          bSelectVertices;                                   // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdges;                                      // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectFaces;                                      // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdgeLoops;                                  // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdgeRings;                                  // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitBackFaces;                                     // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMarquee;                                    // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMarqueeIgnoreOcclusion;                           // 0x00AF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreferProjectedElement;                           // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectDownRay;                                    // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreOcclusion;                                  // 0x00B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA3[0xD];                                     // 0x00B3(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InvertSelection();
	void SelectAll();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshTopologySelectionMechanicProperties">();
	}
	static class UMeshTopologySelectionMechanicProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTopologySelectionMechanicProperties>();
	}
};
static_assert(alignof(UMeshTopologySelectionMechanicProperties) == 0x000008, "Wrong alignment on UMeshTopologySelectionMechanicProperties");
static_assert(sizeof(UMeshTopologySelectionMechanicProperties) == 0x0000C0, "Wrong size on UMeshTopologySelectionMechanicProperties");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bSelectVertices) == 0x0000A8, "Member 'UMeshTopologySelectionMechanicProperties::bSelectVertices' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bSelectEdges) == 0x0000A9, "Member 'UMeshTopologySelectionMechanicProperties::bSelectEdges' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bSelectFaces) == 0x0000AA, "Member 'UMeshTopologySelectionMechanicProperties::bSelectFaces' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bSelectEdgeLoops) == 0x0000AB, "Member 'UMeshTopologySelectionMechanicProperties::bSelectEdgeLoops' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bSelectEdgeRings) == 0x0000AC, "Member 'UMeshTopologySelectionMechanicProperties::bSelectEdgeRings' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bHitBackFaces) == 0x0000AD, "Member 'UMeshTopologySelectionMechanicProperties::bHitBackFaces' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bEnableMarquee) == 0x0000AE, "Member 'UMeshTopologySelectionMechanicProperties::bEnableMarquee' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bMarqueeIgnoreOcclusion) == 0x0000AF, "Member 'UMeshTopologySelectionMechanicProperties::bMarqueeIgnoreOcclusion' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bPreferProjectedElement) == 0x0000B0, "Member 'UMeshTopologySelectionMechanicProperties::bPreferProjectedElement' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bSelectDownRay) == 0x0000B1, "Member 'UMeshTopologySelectionMechanicProperties::bSelectDownRay' has a wrong offset!");
static_assert(offsetof(UMeshTopologySelectionMechanicProperties, bIgnoreOcclusion) == 0x0000B2, "Member 'UMeshTopologySelectionMechanicProperties::bIgnoreOcclusion' has a wrong offset!");

// Class ModelingComponents.GeometrySelectionEditCommandArguments
// 0x0020 (0x0050 - 0x0030)
class UGeometrySelectionEditCommandArguments final : public UInteractiveCommandArguments
{
public:
	uint8                                         Pad_1AA4[0x20];                                    // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeometrySelectionEditCommandArguments">();
	}
	static class UGeometrySelectionEditCommandArguments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommandArguments>();
	}
};
static_assert(alignof(UGeometrySelectionEditCommandArguments) == 0x000008, "Wrong alignment on UGeometrySelectionEditCommandArguments");
static_assert(sizeof(UGeometrySelectionEditCommandArguments) == 0x000050, "Wrong size on UGeometrySelectionEditCommandArguments");

// Class ModelingComponents.GeometrySelectionEditCommandResult
// 0x0078 (0x00A0 - 0x0028)
class UGeometrySelectionEditCommandResult final : public UInteractiveCommandResult
{
public:
	uint8                                         Pad_1AA5[0x78];                                    // 0x0028(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeometrySelectionEditCommandResult">();
	}
	static class UGeometrySelectionEditCommandResult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommandResult>();
	}
};
static_assert(alignof(UGeometrySelectionEditCommandResult) == 0x000008, "Wrong alignment on UGeometrySelectionEditCommandResult");
static_assert(sizeof(UGeometrySelectionEditCommandResult) == 0x0000A0, "Wrong size on UGeometrySelectionEditCommandResult");

// Class ModelingComponents.GeometrySelectionEditCommand
// 0x0000 (0x0028 - 0x0028)
class UGeometrySelectionEditCommand : public UInteractiveCommand
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeometrySelectionEditCommand">();
	}
	static class UGeometrySelectionEditCommand* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommand>();
	}
};
static_assert(alignof(UGeometrySelectionEditCommand) == 0x000008, "Wrong alignment on UGeometrySelectionEditCommand");
static_assert(sizeof(UGeometrySelectionEditCommand) == 0x000028, "Wrong size on UGeometrySelectionEditCommand");

// Class ModelingComponents.VoxelProperties
// 0x0018 (0x00C0 - 0x00A8)
class UVoxelProperties final : public UInteractiveToolPropertySet
{
public:
	int32                                         VoxelCount;                                        // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSimplify;                                     // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveInternalSurfaces;                           // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA6[0x2];                                     // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SimplifyMaxErrorFactor;                            // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CubeRootMinComponentVolume;                        // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelProperties">();
	}
	static class UVoxelProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelProperties>();
	}
};
static_assert(alignof(UVoxelProperties) == 0x000008, "Wrong alignment on UVoxelProperties");
static_assert(sizeof(UVoxelProperties) == 0x0000C0, "Wrong size on UVoxelProperties");
static_assert(offsetof(UVoxelProperties, VoxelCount) == 0x0000A8, "Member 'UVoxelProperties::VoxelCount' has a wrong offset!");
static_assert(offsetof(UVoxelProperties, bAutoSimplify) == 0x0000AC, "Member 'UVoxelProperties::bAutoSimplify' has a wrong offset!");
static_assert(offsetof(UVoxelProperties, bRemoveInternalSurfaces) == 0x0000AD, "Member 'UVoxelProperties::bRemoveInternalSurfaces' has a wrong offset!");
static_assert(offsetof(UVoxelProperties, SimplifyMaxErrorFactor) == 0x0000B0, "Member 'UVoxelProperties::SimplifyMaxErrorFactor' has a wrong offset!");
static_assert(offsetof(UVoxelProperties, CubeRootMinComponentVolume) == 0x0000B8, "Member 'UVoxelProperties::CubeRootMinComponentVolume' has a wrong offset!");

// Class ModelingComponents.MultiSelectionMeshEditingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UMultiSelectionMeshEditingToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiSelectionMeshEditingToolBuilder">();
	}
	static class UMultiSelectionMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiSelectionMeshEditingToolBuilder>();
	}
};
static_assert(alignof(UMultiSelectionMeshEditingToolBuilder) == 0x000008, "Wrong alignment on UMultiSelectionMeshEditingToolBuilder");
static_assert(sizeof(UMultiSelectionMeshEditingToolBuilder) == 0x000028, "Wrong size on UMultiSelectionMeshEditingToolBuilder");

// Class ModelingComponents.BaseCreateFromSelectedToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UBaseCreateFromSelectedToolBuilder : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCreateFromSelectedToolBuilder">();
	}
	static class UBaseCreateFromSelectedToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedToolBuilder>();
	}
};
static_assert(alignof(UBaseCreateFromSelectedToolBuilder) == 0x000008, "Wrong alignment on UBaseCreateFromSelectedToolBuilder");
static_assert(sizeof(UBaseCreateFromSelectedToolBuilder) == 0x000028, "Wrong size on UBaseCreateFromSelectedToolBuilder");

// Class ModelingComponents.OnAcceptHandleSourcesPropertiesBase
// 0x0000 (0x00A8 - 0x00A8)
class UOnAcceptHandleSourcesPropertiesBase : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnAcceptHandleSourcesPropertiesBase">();
	}
	static class UOnAcceptHandleSourcesPropertiesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnAcceptHandleSourcesPropertiesBase>();
	}
};
static_assert(alignof(UOnAcceptHandleSourcesPropertiesBase) == 0x000008, "Wrong alignment on UOnAcceptHandleSourcesPropertiesBase");
static_assert(sizeof(UOnAcceptHandleSourcesPropertiesBase) == 0x0000A8, "Wrong size on UOnAcceptHandleSourcesPropertiesBase");

// Class ModelingComponents.OnAcceptHandleSourcesProperties
// 0x0008 (0x00B0 - 0x00A8)
class UOnAcceptHandleSourcesProperties : public UOnAcceptHandleSourcesPropertiesBase
{
public:
	EHandleSourcesMethod                          HandleInputs;                                      // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA7[0x7];                                     // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnAcceptHandleSourcesProperties">();
	}
	static class UOnAcceptHandleSourcesProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnAcceptHandleSourcesProperties>();
	}
};
static_assert(alignof(UOnAcceptHandleSourcesProperties) == 0x000008, "Wrong alignment on UOnAcceptHandleSourcesProperties");
static_assert(sizeof(UOnAcceptHandleSourcesProperties) == 0x0000B0, "Wrong size on UOnAcceptHandleSourcesProperties");
static_assert(offsetof(UOnAcceptHandleSourcesProperties, HandleInputs) == 0x0000A8, "Member 'UOnAcceptHandleSourcesProperties::HandleInputs' has a wrong offset!");

// Class ModelingComponents.BaseCreateFromSelectedHandleSourceProperties
// 0x0028 (0x00D8 - 0x00B0)
class UBaseCreateFromSelectedHandleSourceProperties final : public UOnAcceptHandleSourcesProperties
{
public:
	EBaseCreateFromSelectedTargetType             OutputWriteTo;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA8[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutputNewName;                                     // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputExistingName;                                // 0x00C8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCreateFromSelectedHandleSourceProperties">();
	}
	static class UBaseCreateFromSelectedHandleSourceProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedHandleSourceProperties>();
	}
};
static_assert(alignof(UBaseCreateFromSelectedHandleSourceProperties) == 0x000008, "Wrong alignment on UBaseCreateFromSelectedHandleSourceProperties");
static_assert(sizeof(UBaseCreateFromSelectedHandleSourceProperties) == 0x0000D8, "Wrong size on UBaseCreateFromSelectedHandleSourceProperties");
static_assert(offsetof(UBaseCreateFromSelectedHandleSourceProperties, OutputWriteTo) == 0x0000B0, "Member 'UBaseCreateFromSelectedHandleSourceProperties::OutputWriteTo' has a wrong offset!");
static_assert(offsetof(UBaseCreateFromSelectedHandleSourceProperties, OutputNewName) == 0x0000B8, "Member 'UBaseCreateFromSelectedHandleSourceProperties::OutputNewName' has a wrong offset!");
static_assert(offsetof(UBaseCreateFromSelectedHandleSourceProperties, OutputExistingName) == 0x0000C8, "Member 'UBaseCreateFromSelectedHandleSourceProperties::OutputExistingName' has a wrong offset!");

// Class ModelingComponents.TransformInputsToolProperties
// 0x0008 (0x00B0 - 0x00A8)
class UTransformInputsToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bShowTransformGizmo;                               // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA9[0x7];                                     // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TransformInputsToolProperties">();
	}
	static class UTransformInputsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransformInputsToolProperties>();
	}
};
static_assert(alignof(UTransformInputsToolProperties) == 0x000008, "Wrong alignment on UTransformInputsToolProperties");
static_assert(sizeof(UTransformInputsToolProperties) == 0x0000B0, "Wrong size on UTransformInputsToolProperties");
static_assert(offsetof(UTransformInputsToolProperties, bShowTransformGizmo) == 0x0000A8, "Member 'UTransformInputsToolProperties::bShowTransformGizmo' has a wrong offset!");

// Class ModelingComponents.MultiSelectionMeshEditingTool
// 0x0008 (0x00C0 - 0x00B8)
class UMultiSelectionMeshEditingTool : public UMultiSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiSelectionMeshEditingTool">();
	}
	static class UMultiSelectionMeshEditingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiSelectionMeshEditingTool>();
	}
};
static_assert(alignof(UMultiSelectionMeshEditingTool) == 0x000008, "Wrong alignment on UMultiSelectionMeshEditingTool");
static_assert(sizeof(UMultiSelectionMeshEditingTool) == 0x0000C0, "Wrong size on UMultiSelectionMeshEditingTool");
static_assert(offsetof(UMultiSelectionMeshEditingTool, TargetWorld) == 0x0000B8, "Member 'UMultiSelectionMeshEditingTool::TargetWorld' has a wrong offset!");

// Class ModelingComponents.BaseCreateFromSelectedTool
// 0x0048 (0x0108 - 0x00C0)
class UBaseCreateFromSelectedTool : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_1AAA[0x8];                                     // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformInputsToolProperties*         TransformProperties;                               // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCreateMeshObjectTypeProperties*        OutputTypeProperties;                              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseCreateFromSelectedHandleSourceProperties* HandleSourcesProperties;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UTransformProxy*>                TransformProxies;                                  // 0x00E8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UCombinedTransformGizmo*>        TransformGizmos;                                   // 0x00F8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCreateFromSelectedTool">();
	}
	static class UBaseCreateFromSelectedTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedTool>();
	}
};
static_assert(alignof(UBaseCreateFromSelectedTool) == 0x000008, "Wrong alignment on UBaseCreateFromSelectedTool");
static_assert(sizeof(UBaseCreateFromSelectedTool) == 0x000108, "Wrong size on UBaseCreateFromSelectedTool");
static_assert(offsetof(UBaseCreateFromSelectedTool, TransformProperties) == 0x0000C8, "Member 'UBaseCreateFromSelectedTool::TransformProperties' has a wrong offset!");
static_assert(offsetof(UBaseCreateFromSelectedTool, OutputTypeProperties) == 0x0000D0, "Member 'UBaseCreateFromSelectedTool::OutputTypeProperties' has a wrong offset!");
static_assert(offsetof(UBaseCreateFromSelectedTool, HandleSourcesProperties) == 0x0000D8, "Member 'UBaseCreateFromSelectedTool::HandleSourcesProperties' has a wrong offset!");
static_assert(offsetof(UBaseCreateFromSelectedTool, Preview) == 0x0000E0, "Member 'UBaseCreateFromSelectedTool::Preview' has a wrong offset!");
static_assert(offsetof(UBaseCreateFromSelectedTool, TransformProxies) == 0x0000E8, "Member 'UBaseCreateFromSelectedTool::TransformProxies' has a wrong offset!");
static_assert(offsetof(UBaseCreateFromSelectedTool, TransformGizmos) == 0x0000F8, "Member 'UBaseCreateFromSelectedTool::TransformGizmos' has a wrong offset!");

// Class ModelingComponents.BaseMeshProcessingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UBaseMeshProcessingToolBuilder final : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseMeshProcessingToolBuilder">();
	}
	static class UBaseMeshProcessingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMeshProcessingToolBuilder>();
	}
};
static_assert(alignof(UBaseMeshProcessingToolBuilder) == 0x000008, "Wrong alignment on UBaseMeshProcessingToolBuilder");
static_assert(sizeof(UBaseMeshProcessingToolBuilder) == 0x000028, "Wrong size on UBaseMeshProcessingToolBuilder");

// Class ModelingComponents.BaseMeshProcessingTool
// 0x0360 (0x0410 - 0x00B0)
class alignas(0x10) UBaseMeshProcessingTool final : public USingleSelectionTool
{
public:
	uint8                                         Pad_1AAB[0x20];                                    // 0x00B0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AAC[0x338];                                   // 0x00D8(0x0338)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseMeshProcessingTool">();
	}
	static class UBaseMeshProcessingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMeshProcessingTool>();
	}
};
static_assert(alignof(UBaseMeshProcessingTool) == 0x000010, "Wrong alignment on UBaseMeshProcessingTool");
static_assert(sizeof(UBaseMeshProcessingTool) == 0x000410, "Wrong size on UBaseMeshProcessingTool");
static_assert(offsetof(UBaseMeshProcessingTool, Preview) == 0x0000D0, "Member 'UBaseMeshProcessingTool::Preview' has a wrong offset!");

// Class ModelingComponents.BaseVoxelTool
// 0x0018 (0x0120 - 0x0108)
class UBaseVoxelTool final : public UBaseCreateFromSelectedTool
{
public:
	class UVoxelProperties*                       VoxProperties;                                     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AAD[0x10];                                    // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseVoxelTool">();
	}
	static class UBaseVoxelTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseVoxelTool>();
	}
};
static_assert(alignof(UBaseVoxelTool) == 0x000008, "Wrong alignment on UBaseVoxelTool");
static_assert(sizeof(UBaseVoxelTool) == 0x000120, "Wrong size on UBaseVoxelTool");
static_assert(offsetof(UBaseVoxelTool, VoxProperties) == 0x000108, "Member 'UBaseVoxelTool::VoxProperties' has a wrong offset!");

// Class ModelingComponents.MeshSurfacePointMeshEditingToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UMeshSurfacePointMeshEditingToolBuilder final : public UMeshSurfacePointToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshSurfacePointMeshEditingToolBuilder">();
	}
	static class UMeshSurfacePointMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshSurfacePointMeshEditingToolBuilder>();
	}
};
static_assert(alignof(UMeshSurfacePointMeshEditingToolBuilder) == 0x000008, "Wrong alignment on UMeshSurfacePointMeshEditingToolBuilder");
static_assert(sizeof(UMeshSurfacePointMeshEditingToolBuilder) == 0x000030, "Wrong size on UMeshSurfacePointMeshEditingToolBuilder");

// Class ModelingComponents.SingleSelectionMeshEditingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class USingleSelectionMeshEditingToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleSelectionMeshEditingToolBuilder">();
	}
	static class USingleSelectionMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleSelectionMeshEditingToolBuilder>();
	}
};
static_assert(alignof(USingleSelectionMeshEditingToolBuilder) == 0x000008, "Wrong alignment on USingleSelectionMeshEditingToolBuilder");
static_assert(sizeof(USingleSelectionMeshEditingToolBuilder) == 0x000028, "Wrong size on USingleSelectionMeshEditingToolBuilder");

// Class ModelingComponents.SingleSelectionMeshEditingTool
// 0x0010 (0x00C0 - 0x00B0)
class USingleSelectionMeshEditingTool : public USingleSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPersistentMeshSelection*               InputSelection;                                    // 0x00B8(0x0008)(ZeroConstructor, Deprecated, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleSelectionMeshEditingTool">();
	}
	static class USingleSelectionMeshEditingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleSelectionMeshEditingTool>();
	}
};
static_assert(alignof(USingleSelectionMeshEditingTool) == 0x000008, "Wrong alignment on USingleSelectionMeshEditingTool");
static_assert(sizeof(USingleSelectionMeshEditingTool) == 0x0000C0, "Wrong size on USingleSelectionMeshEditingTool");
static_assert(offsetof(USingleSelectionMeshEditingTool, TargetWorld) == 0x0000B0, "Member 'USingleSelectionMeshEditingTool::TargetWorld' has a wrong offset!");
static_assert(offsetof(USingleSelectionMeshEditingTool, InputSelection) == 0x0000B8, "Member 'USingleSelectionMeshEditingTool::InputSelection' has a wrong offset!");

// Class ModelingComponents.SingleTargetWithSelectionToolBuilder
// 0x0000 (0x0028 - 0x0028)
class USingleTargetWithSelectionToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleTargetWithSelectionToolBuilder">();
	}
	static class USingleTargetWithSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleTargetWithSelectionToolBuilder>();
	}
};
static_assert(alignof(USingleTargetWithSelectionToolBuilder) == 0x000008, "Wrong alignment on USingleTargetWithSelectionToolBuilder");
static_assert(sizeof(USingleTargetWithSelectionToolBuilder) == 0x000028, "Wrong size on USingleTargetWithSelectionToolBuilder");

// Class ModelingComponents.SingleTargetWithSelectionTool
// 0x0078 (0x0128 - 0x00B0)
class USingleTargetWithSelectionTool : public USingleSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AAE[0x60];                                    // 0x00B8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometrySelectionVisualizationProperties* GeometrySelectionVizProperties;                    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       GeometrySelectionViz;                              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleTargetWithSelectionTool">();
	}
	static class USingleTargetWithSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleTargetWithSelectionTool>();
	}
};
static_assert(alignof(USingleTargetWithSelectionTool) == 0x000008, "Wrong alignment on USingleTargetWithSelectionTool");
static_assert(sizeof(USingleTargetWithSelectionTool) == 0x000128, "Wrong size on USingleTargetWithSelectionTool");
static_assert(offsetof(USingleTargetWithSelectionTool, TargetWorld) == 0x0000B0, "Member 'USingleTargetWithSelectionTool::TargetWorld' has a wrong offset!");
static_assert(offsetof(USingleTargetWithSelectionTool, GeometrySelectionVizProperties) == 0x000118, "Member 'USingleTargetWithSelectionTool::GeometrySelectionVizProperties' has a wrong offset!");
static_assert(offsetof(USingleTargetWithSelectionTool, GeometrySelectionViz) == 0x000120, "Member 'USingleTargetWithSelectionTool::GeometrySelectionViz' has a wrong offset!");

// Class ModelingComponents.DynamicMeshReplacementChangeTarget
// 0x0030 (0x0058 - 0x0028)
class UDynamicMeshReplacementChangeTarget final : public UObject
{
public:
	uint8                                         Pad_1AAF[0x30];                                    // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshReplacementChangeTarget">();
	}
	static class UDynamicMeshReplacementChangeTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMeshReplacementChangeTarget>();
	}
};
static_assert(alignof(UDynamicMeshReplacementChangeTarget) == 0x000008, "Wrong alignment on UDynamicMeshReplacementChangeTarget");
static_assert(sizeof(UDynamicMeshReplacementChangeTarget) == 0x000058, "Wrong size on UDynamicMeshReplacementChangeTarget");

// Class ModelingComponents.OctreeDynamicMeshComponent
// 0x0120 (0x0730 - 0x0610)
class UOctreeDynamicMeshComponent final : public UBaseDynamicMeshComponent
{
public:
	uint8                                         Pad_1AB0[0x60];                                    // 0x0610(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           MeshObject;                                        // 0x0670(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1AB1[0xB8];                                    // 0x0678(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDynamicMesh(class UDynamicMesh* NewMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OctreeDynamicMeshComponent">();
	}
	static class UOctreeDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOctreeDynamicMeshComponent>();
	}
};
static_assert(alignof(UOctreeDynamicMeshComponent) == 0x000010, "Wrong alignment on UOctreeDynamicMeshComponent");
static_assert(sizeof(UOctreeDynamicMeshComponent) == 0x000730, "Wrong size on UOctreeDynamicMeshComponent");
static_assert(offsetof(UOctreeDynamicMeshComponent, MeshObject) == 0x000670, "Member 'UOctreeDynamicMeshComponent::MeshObject' has a wrong offset!");

// Class ModelingComponents.LineSetComponent
// 0x0080 (0x0630 - 0x05B0)
class ULineSetComponent final : public UMeshComponent
{
public:
	class UMaterialInterface*                     LineMaterial;                                      // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       Bounds;                                            // 0x05B0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1AB2[0x47];                                    // 0x05E9(0x0047)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LineSetComponent">();
	}
	static class ULineSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULineSetComponent>();
	}
};
static_assert(alignof(ULineSetComponent) == 0x000010, "Wrong alignment on ULineSetComponent");
static_assert(sizeof(ULineSetComponent) == 0x000630, "Wrong size on ULineSetComponent");
static_assert(offsetof(ULineSetComponent, LineMaterial) == 0x0005A8, "Member 'ULineSetComponent::LineMaterial' has a wrong offset!");
static_assert(offsetof(ULineSetComponent, Bounds) == 0x0005B0, "Member 'ULineSetComponent::Bounds' has a wrong offset!");
static_assert(offsetof(ULineSetComponent, bBoundsDirty) == 0x0005E8, "Member 'ULineSetComponent::bBoundsDirty' has a wrong offset!");

// Class ModelingComponents.MeshElementsVisualizerProperties
// 0x0030 (0x00D8 - 0x00A8)
class UMeshElementsVisualizerProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bVisible;                                          // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWireframe;                                    // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBorders;                                      // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowUVSeams;                                      // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowNormalSeams;                                  // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTangentSeams;                                 // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowColorSeams;                                   // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AB3[0x1];                                     // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThicknessScale;                                    // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 WireframeColor;                                    // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BoundaryEdgeColor;                                 // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 UVSeamColor;                                       // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 NormalSeamColor;                                   // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 TangentSeamColor;                                  // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ColorSeamColor;                                    // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthBias;                                         // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdjustDepthBiasUsingMeshSize;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AB4[0x7];                                     // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshElementsVisualizerProperties">();
	}
	static class UMeshElementsVisualizerProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshElementsVisualizerProperties>();
	}
};
static_assert(alignof(UMeshElementsVisualizerProperties) == 0x000008, "Wrong alignment on UMeshElementsVisualizerProperties");
static_assert(sizeof(UMeshElementsVisualizerProperties) == 0x0000D8, "Wrong size on UMeshElementsVisualizerProperties");
static_assert(offsetof(UMeshElementsVisualizerProperties, bVisible) == 0x0000A8, "Member 'UMeshElementsVisualizerProperties::bVisible' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, bShowWireframe) == 0x0000A9, "Member 'UMeshElementsVisualizerProperties::bShowWireframe' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, bShowBorders) == 0x0000AA, "Member 'UMeshElementsVisualizerProperties::bShowBorders' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, bShowUVSeams) == 0x0000AB, "Member 'UMeshElementsVisualizerProperties::bShowUVSeams' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, bShowNormalSeams) == 0x0000AC, "Member 'UMeshElementsVisualizerProperties::bShowNormalSeams' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, bShowTangentSeams) == 0x0000AD, "Member 'UMeshElementsVisualizerProperties::bShowTangentSeams' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, bShowColorSeams) == 0x0000AE, "Member 'UMeshElementsVisualizerProperties::bShowColorSeams' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, ThicknessScale) == 0x0000B0, "Member 'UMeshElementsVisualizerProperties::ThicknessScale' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, WireframeColor) == 0x0000B4, "Member 'UMeshElementsVisualizerProperties::WireframeColor' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, BoundaryEdgeColor) == 0x0000B8, "Member 'UMeshElementsVisualizerProperties::BoundaryEdgeColor' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, UVSeamColor) == 0x0000BC, "Member 'UMeshElementsVisualizerProperties::UVSeamColor' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, NormalSeamColor) == 0x0000C0, "Member 'UMeshElementsVisualizerProperties::NormalSeamColor' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, TangentSeamColor) == 0x0000C4, "Member 'UMeshElementsVisualizerProperties::TangentSeamColor' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, ColorSeamColor) == 0x0000C8, "Member 'UMeshElementsVisualizerProperties::ColorSeamColor' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, DepthBias) == 0x0000CC, "Member 'UMeshElementsVisualizerProperties::DepthBias' has a wrong offset!");
static_assert(offsetof(UMeshElementsVisualizerProperties, bAdjustDepthBiasUsingMeshSize) == 0x0000D0, "Member 'UMeshElementsVisualizerProperties::bAdjustDepthBiasUsingMeshSize' has a wrong offset!");

// Class ModelingComponents.PreviewGeometry
// 0x00F8 (0x0120 - 0x0028)
class UPreviewGeometry : public UObject
{
public:
	class APreviewGeometryActor*                  ParentActor;                                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UTriangleSetComponent*> TriangleSets;                                      // 0x0030(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
