#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovingDecaler_BPC

#include "Basic.hpp"

#include "Decaler_BP_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MovingDecaler_BPC.MovingDecaler_BPC_C
// 0x0060 (0x0360 - 0x0300)
class AMovingDecaler_BPC_C final : public ADecaler_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MovingDecaler_BPC_C;                // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_fence_03;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_917B40F540DB16169B2C4A9D00F56AED; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_917B40F540DB16169B2C4A9D00F56AED; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD2[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitLoc;                                           // 0x0320(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLoc;                                         // 0x0338(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimelinePlayrate;                                  // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Inverse;                                           // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3CD3[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Playbackpos;                                       // 0x0358(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MovingDecaler_BPC(int32 EntryPoint);
	void OnRep_playbackpos();
	void ReceiveBeginPlay();
	void Resync();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MovingDecaler_BPC_C">();
	}
	static class AMovingDecaler_BPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMovingDecaler_BPC_C>();
	}
};
static_assert(alignof(AMovingDecaler_BPC_C) == 0x000008, "Wrong alignment on AMovingDecaler_BPC_C");
static_assert(sizeof(AMovingDecaler_BPC_C) == 0x000360, "Wrong size on AMovingDecaler_BPC_C");
static_assert(offsetof(AMovingDecaler_BPC_C, UberGraphFrame_MovingDecaler_BPC_C) == 0x000300, "Member 'AMovingDecaler_BPC_C::UberGraphFrame_MovingDecaler_BPC_C' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, SM_fence_03) == 0x000308, "Member 'AMovingDecaler_BPC_C::SM_fence_03' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, Timeline_NewTrack_0_917B40F540DB16169B2C4A9D00F56AED) == 0x000310, "Member 'AMovingDecaler_BPC_C::Timeline_NewTrack_0_917B40F540DB16169B2C4A9D00F56AED' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, Timeline__Direction_917B40F540DB16169B2C4A9D00F56AED) == 0x000314, "Member 'AMovingDecaler_BPC_C::Timeline__Direction_917B40F540DB16169B2C4A9D00F56AED' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, Timeline) == 0x000318, "Member 'AMovingDecaler_BPC_C::Timeline' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, InitLoc) == 0x000320, "Member 'AMovingDecaler_BPC_C::InitLoc' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, TargetLoc) == 0x000338, "Member 'AMovingDecaler_BPC_C::TargetLoc' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, TimelinePlayrate) == 0x000350, "Member 'AMovingDecaler_BPC_C::TimelinePlayrate' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, Inverse) == 0x000354, "Member 'AMovingDecaler_BPC_C::Inverse' has a wrong offset!");
static_assert(offsetof(AMovingDecaler_BPC_C, Playbackpos) == 0x000358, "Member 'AMovingDecaler_BPC_C::Playbackpos' has a wrong offset!");

}

