#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Class MovieScene.MovieSceneBlenderSystemSupport
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneBlenderSystemSupport final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBlenderSystemSupport">();
	}
	static class IMovieSceneBlenderSystemSupport* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBlenderSystemSupport>();
	}
};
static_assert(alignof(IMovieSceneBlenderSystemSupport) == 0x000008, "Wrong alignment on IMovieSceneBlenderSystemSupport");
static_assert(sizeof(IMovieSceneBlenderSystemSupport) == 0x000028, "Wrong size on IMovieSceneBlenderSystemSupport");

// Class MovieScene.MovieSceneBoundObjectProxy
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneBoundObjectProxy final : public IInterface
{
public:
	class UObject* BP_GetBoundObjectForSequencer(class UObject* ResolvedObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBoundObjectProxy">();
	}
	static class IMovieSceneBoundObjectProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBoundObjectProxy>();
	}
};
static_assert(alignof(IMovieSceneBoundObjectProxy) == 0x000008, "Wrong alignment on IMovieSceneBoundObjectProxy");
static_assert(sizeof(IMovieSceneBoundObjectProxy) == 0x000028, "Wrong size on IMovieSceneBoundObjectProxy");

// Class MovieScene.MovieSceneChannelOverrideProvider
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneChannelOverrideProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneChannelOverrideProvider">();
	}
	static class IMovieSceneChannelOverrideProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneChannelOverrideProvider>();
	}
};
static_assert(alignof(IMovieSceneChannelOverrideProvider) == 0x000008, "Wrong alignment on IMovieSceneChannelOverrideProvider");
static_assert(sizeof(IMovieSceneChannelOverrideProvider) == 0x000028, "Wrong size on IMovieSceneChannelOverrideProvider");

// Class MovieScene.MovieSceneDeterminismSource
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneDeterminismSource final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDeterminismSource">();
	}
	static class IMovieSceneDeterminismSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneDeterminismSource>();
	}
};
static_assert(alignof(IMovieSceneDeterminismSource) == 0x000008, "Wrong alignment on IMovieSceneDeterminismSource");
static_assert(sizeof(IMovieSceneDeterminismSource) == 0x000028, "Wrong size on IMovieSceneDeterminismSource");

// Class MovieScene.MovieSceneEvaluationHook
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneEvaluationHook final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEvaluationHook">();
	}
	static class IMovieSceneEvaluationHook* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEvaluationHook>();
	}
};
static_assert(alignof(IMovieSceneEvaluationHook) == 0x000008, "Wrong alignment on IMovieSceneEvaluationHook");
static_assert(sizeof(IMovieSceneEvaluationHook) == 0x000028, "Wrong size on IMovieSceneEvaluationHook");

// Class MovieScene.MovieSceneMetaDataInterface
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneMetaDataInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMetaDataInterface">();
	}
	static class IMovieSceneMetaDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneMetaDataInterface>();
	}
};
static_assert(alignof(IMovieSceneMetaDataInterface) == 0x000008, "Wrong alignment on IMovieSceneMetaDataInterface");
static_assert(sizeof(IMovieSceneMetaDataInterface) == 0x000028, "Wrong size on IMovieSceneMetaDataInterface");

// Class MovieScene.MovieScenePlaybackClient
// 0x0000 (0x0028 - 0x0028)
class IMovieScenePlaybackClient final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePlaybackClient">();
	}
	static class IMovieScenePlaybackClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePlaybackClient>();
	}
};
static_assert(alignof(IMovieScenePlaybackClient) == 0x000008, "Wrong alignment on IMovieScenePlaybackClient");
static_assert(sizeof(IMovieScenePlaybackClient) == 0x000028, "Wrong size on IMovieScenePlaybackClient");

// Class MovieScene.MovieSceneSequencePlayerObserver
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneSequencePlayerObserver final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSequencePlayerObserver">();
	}
	static class IMovieSceneSequencePlayerObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSequencePlayerObserver>();
	}
};
static_assert(alignof(IMovieSceneSequencePlayerObserver) == 0x000008, "Wrong alignment on IMovieSceneSequencePlayerObserver");
static_assert(sizeof(IMovieSceneSequencePlayerObserver) == 0x000028, "Wrong size on IMovieSceneSequencePlayerObserver");

// Class MovieScene.MovieSceneBindingOwnerInterface
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneBindingOwnerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingOwnerInterface">();
	}
	static class IMovieSceneBindingOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingOwnerInterface>();
	}
};
static_assert(alignof(IMovieSceneBindingOwnerInterface) == 0x000008, "Wrong alignment on IMovieSceneBindingOwnerInterface");
static_assert(sizeof(IMovieSceneBindingOwnerInterface) == 0x000028, "Wrong size on IMovieSceneBindingOwnerInterface");

// Class MovieScene.MovieSceneCachedTrack
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneCachedTrack final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCachedTrack">();
	}
	static class IMovieSceneCachedTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneCachedTrack>();
	}
};
static_assert(alignof(IMovieSceneCachedTrack) == 0x000008, "Wrong alignment on IMovieSceneCachedTrack");
static_assert(sizeof(IMovieSceneCachedTrack) == 0x000028, "Wrong size on IMovieSceneCachedTrack");

// Class MovieScene.MovieSceneEasingFunction
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneEasingFunction final : public IInterface
{
public:
	float OnEvaluate(float Interp) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEasingFunction">();
	}
	static class IMovieSceneEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEasingFunction>();
	}
};
static_assert(alignof(IMovieSceneEasingFunction) == 0x000008, "Wrong alignment on IMovieSceneEasingFunction");
static_assert(sizeof(IMovieSceneEasingFunction) == 0x000028, "Wrong size on IMovieSceneEasingFunction");

// Class MovieScene.MovieSceneKeyProxy
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneKeyProxy final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneKeyProxy">();
	}
	static class IMovieSceneKeyProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneKeyProxy>();
	}
};
static_assert(alignof(IMovieSceneKeyProxy) == 0x000008, "Wrong alignment on IMovieSceneKeyProxy");
static_assert(sizeof(IMovieSceneKeyProxy) == 0x000028, "Wrong size on IMovieSceneKeyProxy");

// Class MovieScene.MovieSceneSequenceTickManagerClient
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneSequenceTickManagerClient final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSequenceTickManagerClient">();
	}
	static class IMovieSceneSequenceTickManagerClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSequenceTickManagerClient>();
	}
};
static_assert(alignof(IMovieSceneSequenceTickManagerClient) == 0x000008, "Wrong alignment on IMovieSceneSequenceTickManagerClient");
static_assert(sizeof(IMovieSceneSequenceTickManagerClient) == 0x000028, "Wrong size on IMovieSceneSequenceTickManagerClient");

// Class MovieScene.MovieSceneSignedObject
// 0x0030 (0x0058 - 0x0028)
class UMovieSceneSignedObject : public UObject
{
public:
	uint8                                         Pad_11B5[0x4];                                     // 0x0028(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Signature;                                         // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11B6[0x1C];                                    // 0x003C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSignedObject">();
	}
	static class UMovieSceneSignedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSignedObject>();
	}
};
static_assert(alignof(UMovieSceneSignedObject) == 0x000008, "Wrong alignment on UMovieSceneSignedObject");
static_assert(sizeof(UMovieSceneSignedObject) == 0x000058, "Wrong size on UMovieSceneSignedObject");
static_assert(offsetof(UMovieSceneSignedObject, Signature) == 0x00002C, "Member 'UMovieSceneSignedObject::Signature' has a wrong offset!");

// Class MovieScene.MovieSceneChannelOverrideContainer
// 0x0000 (0x0058 - 0x0058)
class UMovieSceneChannelOverrideContainer : public UMovieSceneSignedObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneChannelOverrideContainer">();
	}
	static class UMovieSceneChannelOverrideContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneChannelOverrideContainer>();
	}
};
static_assert(alignof(UMovieSceneChannelOverrideContainer) == 0x000008, "Wrong alignment on UMovieSceneChannelOverrideContainer");
static_assert(sizeof(UMovieSceneChannelOverrideContainer) == 0x000058, "Wrong size on UMovieSceneChannelOverrideContainer");

// Class MovieScene.MovieSceneSectionChannelOverrideRegistry
// 0x0050 (0x0078 - 0x0028)
class UMovieSceneSectionChannelOverrideRegistry final : public UObject
{
public:
	TMap<class FName, class UMovieSceneChannelOverrideContainer*> Overrides;                                         // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSectionChannelOverrideRegistry">();
	}
	static class UMovieSceneSectionChannelOverrideRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSectionChannelOverrideRegistry>();
	}
};
static_assert(alignof(UMovieSceneSectionChannelOverrideRegistry) == 0x000008, "Wrong alignment on UMovieSceneSectionChannelOverrideRegistry");
static_assert(sizeof(UMovieSceneSectionChannelOverrideRegistry) == 0x000078, "Wrong size on UMovieSceneSectionChannelOverrideRegistry");
static_assert(offsetof(UMovieSceneSectionChannelOverrideRegistry, Overrides) == 0x000028, "Member 'UMovieSceneSectionChannelOverrideRegistry::Overrides' has a wrong offset!");

// Class MovieScene.MovieSceneTrackTemplateProducer
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneTrackTemplateProducer final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackTemplateProducer">();
	}
	static class IMovieSceneTrackTemplateProducer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneTrackTemplateProducer>();
	}
};
static_assert(alignof(IMovieSceneTrackTemplateProducer) == 0x000008, "Wrong alignment on IMovieSceneTrackTemplateProducer");
static_assert(sizeof(IMovieSceneTrackTemplateProducer) == 0x000028, "Wrong size on IMovieSceneTrackTemplateProducer");

// Class MovieScene.MovieSceneCompiledData
// 0x03D0 (0x03F8 - 0x0028)
class UMovieSceneCompiledData final : public UObject
{
public:
	struct FMovieSceneEvaluationTemplate          EvaluationTemplate;                                // 0x0028(0x0160)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FMovieSceneSequenceHierarchy           Hierarchy;                                         // 0x0188(0x0118)(NativeAccessSpecifierPrivate)
	struct FMovieSceneEntityComponentField        EntityComponentField;                              // 0x02A0(0x00F0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneEvaluationField             TrackTemplateField;                                // 0x0390(0x0030)(NativeAccessSpecifierPrivate)
	TArray<struct FFrameTime>                     DeterminismFences;                                 // 0x03C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompiledSignature;                                 // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompilerVersion;                                   // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieSceneSequenceCompilerMaskStruct  AccumulatedMask;                                   // 0x03F0(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FMovieSceneSequenceCompilerMaskStruct  AllocatedMask;                                     // 0x03F1(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	EMovieSceneSequenceFlags                      AccumulatedFlags;                                  // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11B7[0x5];                                     // 0x03F3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCompiledData">();
	}
	static class UMovieSceneCompiledData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCompiledData>();
	}
};
static_assert(alignof(UMovieSceneCompiledData) == 0x000008, "Wrong alignment on UMovieSceneCompiledData");
static_assert(sizeof(UMovieSceneCompiledData) == 0x0003F8, "Wrong size on UMovieSceneCompiledData");
static_assert(offsetof(UMovieSceneCompiledData, EvaluationTemplate) == 0x000028, "Member 'UMovieSceneCompiledData::EvaluationTemplate' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, Hierarchy) == 0x000188, "Member 'UMovieSceneCompiledData::Hierarchy' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, EntityComponentField) == 0x0002A0, "Member 'UMovieSceneCompiledData::EntityComponentField' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, TrackTemplateField) == 0x000390, "Member 'UMovieSceneCompiledData::TrackTemplateField' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, DeterminismFences) == 0x0003C0, "Member 'UMovieSceneCompiledData::DeterminismFences' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, CompiledSignature) == 0x0003D0, "Member 'UMovieSceneCompiledData::CompiledSignature' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, CompilerVersion) == 0x0003E0, "Member 'UMovieSceneCompiledData::CompilerVersion' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, AccumulatedMask) == 0x0003F0, "Member 'UMovieSceneCompiledData::AccumulatedMask' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, AllocatedMask) == 0x0003F1, "Member 'UMovieSceneCompiledData::AllocatedMask' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledData, AccumulatedFlags) == 0x0003F2, "Member 'UMovieSceneCompiledData::AccumulatedFlags' has a wrong offset!");

// Class MovieScene.MovieSceneCompiledDataManager
// 0x0208 (0x0230 - 0x0028)
class UMovieSceneCompiledDataManager final : public UObject
{
public:
	uint8                                         Pad_11B8[0xB0];                                    // 0x0028(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FMovieSceneSequenceHierarchy> Hierarchies;                                       // 0x00D8(0x0050)(NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEvaluationTemplate> TrackTemplates;                                    // 0x0128(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEvaluationField> TrackTemplateFields;                               // 0x0178(0x0050)(NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEntityComponentField> EntityComponentFields;                             // 0x01C8(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_11B9[0x18];                                    // 0x0218(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCompiledDataManager">();
	}
	static class UMovieSceneCompiledDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCompiledDataManager>();
	}
};
static_assert(alignof(UMovieSceneCompiledDataManager) == 0x000008, "Wrong alignment on UMovieSceneCompiledDataManager");
static_assert(sizeof(UMovieSceneCompiledDataManager) == 0x000230, "Wrong size on UMovieSceneCompiledDataManager");
static_assert(offsetof(UMovieSceneCompiledDataManager, Hierarchies) == 0x0000D8, "Member 'UMovieSceneCompiledDataManager::Hierarchies' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledDataManager, TrackTemplates) == 0x000128, "Member 'UMovieSceneCompiledDataManager::TrackTemplates' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledDataManager, TrackTemplateFields) == 0x000178, "Member 'UMovieSceneCompiledDataManager::TrackTemplateFields' has a wrong offset!");
static_assert(offsetof(UMovieSceneCompiledDataManager, EntityComponentFields) == 0x0001C8, "Member 'UMovieSceneCompiledDataManager::EntityComponentFields' has a wrong offset!");

// Class MovieScene.MovieSceneEntityProvider
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneEntityProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntityProvider">();
	}
	static class IMovieSceneEntityProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEntityProvider>();
	}
};
static_assert(alignof(IMovieSceneEntityProvider) == 0x000008, "Wrong alignment on IMovieSceneEntityProvider");
static_assert(sizeof(IMovieSceneEntityProvider) == 0x000028, "Wrong size on IMovieSceneEntityProvider");

// Class MovieScene.MovieSceneEntitySystem
// 0x0018 (0x0040 - 0x0028)
class UMovieSceneEntitySystem : public UObject
{
public:
	class UMovieSceneEntitySystemLinker*          Linker;                                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11BA[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntitySystem">();
	}
	static class UMovieSceneEntitySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntitySystem>();
	}
};
static_assert(alignof(UMovieSceneEntitySystem) == 0x000008, "Wrong alignment on UMovieSceneEntitySystem");
static_assert(sizeof(UMovieSceneEntitySystem) == 0x000040, "Wrong size on UMovieSceneEntitySystem");
static_assert(offsetof(UMovieSceneEntitySystem, Linker) == 0x000028, "Member 'UMovieSceneEntitySystem::Linker' has a wrong offset!");

// Class MovieScene.MovieSceneBlenderSystem
// 0x0028 (0x0068 - 0x0040)
class UMovieSceneBlenderSystem : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_11BB[0x28];                                    // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBlenderSystem">();
	}
	static class UMovieSceneBlenderSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBlenderSystem>();
	}
};
static_assert(alignof(UMovieSceneBlenderSystem) == 0x000008, "Wrong alignment on UMovieSceneBlenderSystem");
static_assert(sizeof(UMovieSceneBlenderSystem) == 0x000068, "Wrong size on UMovieSceneBlenderSystem");

// Class MovieScene.MovieSceneEntityInstantiatorSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneEntityInstantiatorSystem : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntityInstantiatorSystem">();
	}
	static class UMovieSceneEntityInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntityInstantiatorSystem>();
	}
};
static_assert(alignof(UMovieSceneEntityInstantiatorSystem) == 0x000008, "Wrong alignment on UMovieSceneEntityInstantiatorSystem");
static_assert(sizeof(UMovieSceneEntityInstantiatorSystem) == 0x000040, "Wrong size on UMovieSceneEntityInstantiatorSystem");

// Class MovieScene.MovieSceneGenericBoundObjectInstantiator
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneGenericBoundObjectInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGenericBoundObjectInstantiator">();
	}
	static class UMovieSceneGenericBoundObjectInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGenericBoundObjectInstantiator>();
	}
};
static_assert(alignof(UMovieSceneGenericBoundObjectInstantiator) == 0x000008, "Wrong alignment on UMovieSceneGenericBoundObjectInstantiator");
static_assert(sizeof(UMovieSceneGenericBoundObjectInstantiator) == 0x000040, "Wrong size on UMovieSceneGenericBoundObjectInstantiator");

// Class MovieScene.MovieSceneBoundSceneComponentInstantiator
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneBoundSceneComponentInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBoundSceneComponentInstantiator">();
	}
	static class UMovieSceneBoundSceneComponentInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBoundSceneComponentInstantiator>();
	}
};
static_assert(alignof(UMovieSceneBoundSceneComponentInstantiator) == 0x000008, "Wrong alignment on UMovieSceneBoundSceneComponentInstantiator");
static_assert(sizeof(UMovieSceneBoundSceneComponentInstantiator) == 0x000040, "Wrong size on UMovieSceneBoundSceneComponentInstantiator");

// Class MovieScene.MovieSceneValueDecomposer
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneValueDecomposer final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneValueDecomposer">();
	}
	static class IMovieSceneValueDecomposer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneValueDecomposer>();
	}
};
static_assert(alignof(IMovieSceneValueDecomposer) == 0x000008, "Wrong alignment on IMovieSceneValueDecomposer");
static_assert(sizeof(IMovieSceneValueDecomposer) == 0x000028, "Wrong size on IMovieSceneValueDecomposer");

// Class MovieScene.MovieSceneEntitySystemLinker
// 0x0710 (0x0738 - 0x0028)
class UMovieSceneEntitySystemLinker : public UObject
{
public:
	uint8                                         Pad_11BC[0x278];                                   // 0x0028(0x0278)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEntitySystemGraph           SystemGraph;                                       // 0x02A0(0x0190)(NativeAccessSpecifierPublic)
	uint8                                         Pad_11BD[0x308];                                   // 0x0430(0x0308)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntitySystemLinker">();
	}
	static class UMovieSceneEntitySystemLinker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntitySystemLinker>();
	}
};
static_assert(alignof(UMovieSceneEntitySystemLinker) == 0x000008, "Wrong alignment on UMovieSceneEntitySystemLinker");
static_assert(sizeof(UMovieSceneEntitySystemLinker) == 0x000738, "Wrong size on UMovieSceneEntitySystemLinker");
static_assert(offsetof(UMovieSceneEntitySystemLinker, SystemGraph) == 0x0002A0, "Member 'UMovieSceneEntitySystemLinker::SystemGraph' has a wrong offset!");

// Class MovieScene.MovieSceneEvalTimeSystem
// 0x0170 (0x01B0 - 0x0040)
class UMovieSceneEvalTimeSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_11BE[0x170];                                   // 0x0040(0x0170)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEvalTimeSystem">();
	}
	static class UMovieSceneEvalTimeSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEvalTimeSystem>();
	}
};
static_assert(alignof(UMovieSceneEvalTimeSystem) == 0x000008, "Wrong alignment on UMovieSceneEvalTimeSystem");
static_assert(sizeof(UMovieSceneEvalTimeSystem) == 0x0001B0, "Wrong size on UMovieSceneEvalTimeSystem");

// Class MovieScene.MovieSceneEvaluationHookSystem
// 0x0050 (0x0090 - 0x0040)
class UMovieSceneEvaluationHookSystem final : public UMovieSceneEntitySystem
{
public:
	TMap<struct FMovieSceneEvaluationInstanceKey, struct FMovieSceneEvaluationHookEventContainer> PendingEventsByRootInstance;                       // 0x0040(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEvaluationHookSystem">();
	}
	static class UMovieSceneEvaluationHookSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEvaluationHookSystem>();
	}
};
static_assert(alignof(UMovieSceneEvaluationHookSystem) == 0x000008, "Wrong alignment on UMovieSceneEvaluationHookSystem");
static_assert(sizeof(UMovieSceneEvaluationHookSystem) == 0x000090, "Wrong size on UMovieSceneEvaluationHookSystem");
static_assert(offsetof(UMovieSceneEvaluationHookSystem, PendingEventsByRootInstance) == 0x000040, "Member 'UMovieSceneEvaluationHookSystem::PendingEventsByRootInstance' has a wrong offset!");

// Class MovieScene.MovieScenePreAnimatedStateSystemInterface
// 0x0000 (0x0028 - 0x0028)
class IMovieScenePreAnimatedStateSystemInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePreAnimatedStateSystemInterface">();
	}
	static class IMovieScenePreAnimatedStateSystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePreAnimatedStateSystemInterface>();
	}
};
static_assert(alignof(IMovieScenePreAnimatedStateSystemInterface) == 0x000008, "Wrong alignment on IMovieScenePreAnimatedStateSystemInterface");
static_assert(sizeof(IMovieScenePreAnimatedStateSystemInterface) == 0x000028, "Wrong size on IMovieScenePreAnimatedStateSystemInterface");

// Class MovieScene.MovieSceneCachePreAnimatedStateSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneCachePreAnimatedStateSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCachePreAnimatedStateSystem">();
	}
	static class UMovieSceneCachePreAnimatedStateSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCachePreAnimatedStateSystem>();
	}
};
static_assert(alignof(UMovieSceneCachePreAnimatedStateSystem) == 0x000008, "Wrong alignment on UMovieSceneCachePreAnimatedStateSystem");
static_assert(sizeof(UMovieSceneCachePreAnimatedStateSystem) == 0x000040, "Wrong size on UMovieSceneCachePreAnimatedStateSystem");

// Class MovieScene.MovieSceneRestorePreAnimatedStateSystem
// 0x0010 (0x0050 - 0x0040)
class UMovieSceneRestorePreAnimatedStateSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_11BF[0x10];                                    // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneRestorePreAnimatedStateSystem">();
	}
	static class UMovieSceneRestorePreAnimatedStateSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRestorePreAnimatedStateSystem>();
	}
};
static_assert(alignof(UMovieSceneRestorePreAnimatedStateSystem) == 0x000008, "Wrong alignment on UMovieSceneRestorePreAnimatedStateSystem");
static_assert(sizeof(UMovieSceneRestorePreAnimatedStateSystem) == 0x000050, "Wrong size on UMovieSceneRestorePreAnimatedStateSystem");

// Class MovieScene.MovieSceneRootInstantiatorSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneRootInstantiatorSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneRootInstantiatorSystem">();
	}
	static class UMovieSceneRootInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRootInstantiatorSystem>();
	}
};
static_assert(alignof(UMovieSceneRootInstantiatorSystem) == 0x000008, "Wrong alignment on UMovieSceneRootInstantiatorSystem");
static_assert(sizeof(UMovieSceneRootInstantiatorSystem) == 0x000040, "Wrong size on UMovieSceneRootInstantiatorSystem");

// Class MovieScene.MovieSceneSpawnablesSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneSpawnablesSystem final : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSpawnablesSystem">();
	}
	static class UMovieSceneSpawnablesSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnablesSystem>();
	}
};
static_assert(alignof(UMovieSceneSpawnablesSystem) == 0x000008, "Wrong alignment on UMovieSceneSpawnablesSystem");
static_assert(sizeof(UMovieSceneSpawnablesSystem) == 0x000040, "Wrong size on UMovieSceneSpawnablesSystem");

// Class MovieScene.MovieSceneTrackInstance
// 0x0028 (0x0050 - 0x0028)
class UMovieSceneTrackInstance : public UObject
{
public:
	TWeakObjectPtr<class UObject>                 WeakAnimatedObject;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsRootTrackInstance;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C0[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneEntitySystemLinker*          PrivateLinker;                                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneTrackInstanceInput>  Inputs;                                            // 0x0040(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackInstance">();
	}
	static class UMovieSceneTrackInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrackInstance>();
	}
};
static_assert(alignof(UMovieSceneTrackInstance) == 0x000008, "Wrong alignment on UMovieSceneTrackInstance");
static_assert(sizeof(UMovieSceneTrackInstance) == 0x000050, "Wrong size on UMovieSceneTrackInstance");
static_assert(offsetof(UMovieSceneTrackInstance, WeakAnimatedObject) == 0x000028, "Member 'UMovieSceneTrackInstance::WeakAnimatedObject' has a wrong offset!");
static_assert(offsetof(UMovieSceneTrackInstance, bIsRootTrackInstance) == 0x000030, "Member 'UMovieSceneTrackInstance::bIsRootTrackInstance' has a wrong offset!");
static_assert(offsetof(UMovieSceneTrackInstance, PrivateLinker) == 0x000038, "Member 'UMovieSceneTrackInstance::PrivateLinker' has a wrong offset!");
static_assert(offsetof(UMovieSceneTrackInstance, Inputs) == 0x000040, "Member 'UMovieSceneTrackInstance::Inputs' has a wrong offset!");

// Class MovieScene.MovieSceneTrackInstanceInstantiator
// 0x00B0 (0x00F0 - 0x0040)
class UMovieSceneTrackInstanceInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_11C1[0xB0];                                    // 0x0040(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackInstanceInstantiator">();
	}
	static class UMovieSceneTrackInstanceInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrackInstanceInstantiator>();
	}
};
static_assert(alignof(UMovieSceneTrackInstanceInstantiator) == 0x000008, "Wrong alignment on UMovieSceneTrackInstanceInstantiator");
static_assert(sizeof(UMovieSceneTrackInstanceInstantiator) == 0x0000F0, "Wrong size on UMovieSceneTrackInstanceInstantiator");

// Class MovieScene.MovieSceneTrackInstanceSystem
// 0x0008 (0x0048 - 0x0040)
class UMovieSceneTrackInstanceSystem final : public UMovieSceneEntitySystem
{
public:
	class UMovieSceneTrackInstanceInstantiator*   Instantiator;                                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackInstanceSystem">();
	}
	static class UMovieSceneTrackInstanceSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrackInstanceSystem>();
	}
};
static_assert(alignof(UMovieSceneTrackInstanceSystem) == 0x000008, "Wrong alignment on UMovieSceneTrackInstanceSystem");
static_assert(sizeof(UMovieSceneTrackInstanceSystem) == 0x000048, "Wrong size on UMovieSceneTrackInstanceSystem");
static_assert(offsetof(UMovieSceneTrackInstanceSystem, Instantiator) == 0x000040, "Member 'UMovieSceneTrackInstanceSystem::Instantiator' has a wrong offset!");

// Class MovieScene.MovieSceneCustomClockSource
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneCustomClockSource final : public IInterface
{
public:
	struct FFrameTime OnRequestCurrentTime(const struct FQualifiedFrameTime& InCurrentTime, float InPlayRate);
	void OnStartPlaying(const struct FQualifiedFrameTime& InStartTime);
	void OnStopPlaying(const struct FQualifiedFrameTime& InStopTime);
	void OnTick(float DeltaSeconds, float InPlayRate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCustomClockSource">();
	}
	static class IMovieSceneCustomClockSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneCustomClockSource>();
	}
};
static_assert(alignof(IMovieSceneCustomClockSource) == 0x000008, "Wrong alignment on IMovieSceneCustomClockSource");
static_assert(sizeof(IMovieSceneCustomClockSource) == 0x000028, "Wrong size on IMovieSceneCustomClockSource");

// Class MovieScene.MovieSceneBuiltInEasingFunction
// 0x0010 (0x0038 - 0x0028)
class UMovieSceneBuiltInEasingFunction final : public UObject
{
public:
	uint8                                         Pad_11C2[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieSceneBuiltInEasing                      Type;                                              // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C3[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBuiltInEasingFunction">();
	}
	static class UMovieSceneBuiltInEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBuiltInEasingFunction>();
	}
};
static_assert(alignof(UMovieSceneBuiltInEasingFunction) == 0x000008, "Wrong alignment on UMovieSceneBuiltInEasingFunction");
static_assert(sizeof(UMovieSceneBuiltInEasingFunction) == 0x000038, "Wrong size on UMovieSceneBuiltInEasingFunction");
static_assert(offsetof(UMovieSceneBuiltInEasingFunction, Type) == 0x000030, "Member 'UMovieSceneBuiltInEasingFunction::Type' has a wrong offset!");

// Class MovieScene.MovieSceneEasingExternalCurve
// 0x0010 (0x0038 - 0x0028)
class UMovieSceneEasingExternalCurve final : public UObject
{
public:
	uint8                                         Pad_11C4[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEasingExternalCurve">();
	}
	static class UMovieSceneEasingExternalCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEasingExternalCurve>();
	}
};
static_assert(alignof(UMovieSceneEasingExternalCurve) == 0x000008, "Wrong alignment on UMovieSceneEasingExternalCurve");
static_assert(sizeof(UMovieSceneEasingExternalCurve) == 0x000038, "Wrong size on UMovieSceneEasingExternalCurve");
static_assert(offsetof(UMovieSceneEasingExternalCurve, Curve) == 0x000030, "Member 'UMovieSceneEasingExternalCurve::Curve' has a wrong offset!");

// Class MovieScene.NodeAndChannelMappings
// 0x0000 (0x0028 - 0x0028)
class INodeAndChannelMappings final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NodeAndChannelMappings">();
	}
	static class INodeAndChannelMappings* GetDefaultObj()
	{
		return GetDefaultObjImpl<INodeAndChannelMappings>();
	}
};
static_assert(alignof(INodeAndChannelMappings) == 0x000008, "Wrong alignment on INodeAndChannelMappings");
static_assert(sizeof(INodeAndChannelMappings) == 0x000028, "Wrong size on INodeAndChannelMappings");

// Class MovieScene.MovieSceneNodeGroup
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneNodeGroup final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNodeGroup">();
	}
	static class UMovieSceneNodeGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNodeGroup>();
	}
};
static_assert(alignof(UMovieSceneNodeGroup) == 0x000008, "Wrong alignment on UMovieSceneNodeGroup");
static_assert(sizeof(UMovieSceneNodeGroup) == 0x000028, "Wrong size on UMovieSceneNodeGroup");

// Class MovieScene.MovieSceneNodeGroupCollection
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneNodeGroupCollection final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNodeGroupCollection">();
	}
	static class UMovieSceneNodeGroupCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNodeGroupCollection>();
	}
};
static_assert(alignof(UMovieSceneNodeGroupCollection) == 0x000008, "Wrong alignment on UMovieSceneNodeGroupCollection");
static_assert(sizeof(UMovieSceneNodeGroupCollection) == 0x000028, "Wrong size on UMovieSceneNodeGroupCollection");

// Class MovieScene.MovieScene
// 0x0108 (0x0160 - 0x0058)
class UMovieScene final : public UMovieSceneSignedObject
{
public:
	uint8                                         Pad_11C5[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMovieSceneSpawnable>           Spawnables;                                        // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieScenePossessable>         Possessables;                                      // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneBinding>             ObjectBindings;                                    // 0x0080(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneObjectBindingIDs> BindingGroups;                                     // 0x0090(0x0050)(NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               Tracks;                                            // 0x00E0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMovieSceneTrack*                       CameraCutTrack;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieSceneFrameRange                  SelectionRange;                                    // 0x00F8(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FMovieSceneFrameRange                  PlaybackRange;                                     // 0x0108(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FFrameRate                             TickResolution;                                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameRate                             DisplayRate;                                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneEvaluationType                     EvaluationType;                                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EUpdateClockSource                            ClockSource;                                       // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C6[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CustomClockSourcePath;                             // 0x0130(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneMarkedFrame>         MarkedFrames;                                      // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene">();
	}
	static class UMovieScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene>();
	}
};
static_assert(alignof(UMovieScene) == 0x000008, "Wrong alignment on UMovieScene");
static_assert(sizeof(UMovieScene) == 0x000160, "Wrong size on UMovieScene");
static_assert(offsetof(UMovieScene, Spawnables) == 0x000060, "Member 'UMovieScene::Spawnables' has a wrong offset!");
static_assert(offsetof(UMovieScene, Possessables) == 0x000070, "Member 'UMovieScene::Possessables' has a wrong offset!");
static_assert(offsetof(UMovieScene, ObjectBindings) == 0x000080, "Member 'UMovieScene::ObjectBindings' has a wrong offset!");
static_assert(offsetof(UMovieScene, BindingGroups) == 0x000090, "Member 'UMovieScene::BindingGroups' has a wrong offset!");
static_assert(offsetof(UMovieScene, Tracks) == 0x0000E0, "Member 'UMovieScene::Tracks' has a wrong offset!");
static_assert(offsetof(UMovieScene, CameraCutTrack) == 0x0000F0, "Member 'UMovieScene::CameraCutTrack' has a wrong offset!");
static_assert(offsetof(UMovieScene, SelectionRange) == 0x0000F8, "Member 'UMovieScene::SelectionRange' has a wrong offset!");
static_assert(offsetof(UMovieScene, PlaybackRange) == 0x000108, "Member 'UMovieScene::PlaybackRange' has a wrong offset!");
static_assert(offsetof(UMovieScene, TickResolution) == 0x000118, "Member 'UMovieScene::TickResolution' has a wrong offset!");
static_assert(offsetof(UMovieScene, DisplayRate) == 0x000120, "Member 'UMovieScene::DisplayRate' has a wrong offset!");
static_assert(offsetof(UMovieScene, EvaluationType) == 0x000128, "Member 'UMovieScene::EvaluationType' has a wrong offset!");
static_assert(offsetof(UMovieScene, ClockSource) == 0x000129, "Member 'UMovieScene::ClockSource' has a wrong offset!");
static_assert(offsetof(UMovieScene, CustomClockSourcePath) == 0x000130, "Member 'UMovieScene::CustomClockSourcePath' has a wrong offset!");
static_assert(offsetof(UMovieScene, MarkedFrames) == 0x000150, "Member 'UMovieScene::MarkedFrames' has a wrong offset!");

// Class MovieScene.MovieSceneBindingOverrides
// 0x0068 (0x0090 - 0x0028)
class UMovieSceneBindingOverrides final : public UObject
{
public:
	TArray<struct FMovieSceneBindingOverrideData> BindingData;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C7[0x58];                                    // 0x0038(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingOverrides">();
	}
	static class UMovieSceneBindingOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBindingOverrides>();
	}
};
static_assert(alignof(UMovieSceneBindingOverrides) == 0x000008, "Wrong alignment on UMovieSceneBindingOverrides");
static_assert(sizeof(UMovieSceneBindingOverrides) == 0x000090, "Wrong size on UMovieSceneBindingOverrides");
static_assert(offsetof(UMovieSceneBindingOverrides, BindingData) == 0x000028, "Member 'UMovieSceneBindingOverrides::BindingData' has a wrong offset!");

// Class MovieScene.BuiltInDynamicBindingResolverLibrary
// 0x0000 (0x0028 - 0x0028)
class UBuiltInDynamicBindingResolverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMovieSceneDynamicBindingResolveResult ResolveToPlayerPawn(class UObject* WorldContextObject, int32 PlayerControllerIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuiltInDynamicBindingResolverLibrary">();
	}
	static class UBuiltInDynamicBindingResolverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuiltInDynamicBindingResolverLibrary>();
	}
};
static_assert(alignof(UBuiltInDynamicBindingResolverLibrary) == 0x000008, "Wrong alignment on UBuiltInDynamicBindingResolverLibrary");
static_assert(sizeof(UBuiltInDynamicBindingResolverLibrary) == 0x000028, "Wrong size on UBuiltInDynamicBindingResolverLibrary");

// Class MovieScene.MovieSceneFolder
// 0x0050 (0x0078 - 0x0028)
class UMovieSceneFolder final : public UObject
{
public:
	uint8                                         Pad_11C9[0x4];                                     // 0x0028(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FolderName;                                        // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11CA[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneFolder*>              ChildFolders;                                      // 0x0038(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               ChildTracks;                                       // 0x0048(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ChildObjectBindingStrings;                         // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11CB[0x10];                                    // 0x0068(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFolder">();
	}
	static class UMovieSceneFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFolder>();
	}
};
static_assert(alignof(UMovieSceneFolder) == 0x000008, "Wrong alignment on UMovieSceneFolder");
static_assert(sizeof(UMovieSceneFolder) == 0x000078, "Wrong size on UMovieSceneFolder");
static_assert(offsetof(UMovieSceneFolder, FolderName) == 0x00002C, "Member 'UMovieSceneFolder::FolderName' has a wrong offset!");
static_assert(offsetof(UMovieSceneFolder, ChildFolders) == 0x000038, "Member 'UMovieSceneFolder::ChildFolders' has a wrong offset!");
static_assert(offsetof(UMovieSceneFolder, ChildTracks) == 0x000048, "Member 'UMovieSceneFolder::ChildTracks' has a wrong offset!");
static_assert(offsetof(UMovieSceneFolder, ChildObjectBindingStrings) == 0x000058, "Member 'UMovieSceneFolder::ChildObjectBindingStrings' has a wrong offset!");

// Class MovieScene.MovieSceneMetaData
// 0x0030 (0x0058 - 0x0028)
class UMovieSceneMetaData final : public UObject
{
public:
	uint8                                         Pad_11CC[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Author;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              Created;                                           // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 Notes;                                             // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetAuthor(const class FString& InAuthor);
	void SetCreated(const struct FDateTime& InCreated);
	void SetNotes(const class FString& InNotes);

	class FString GetAuthor() const;
	struct FDateTime GetCreated() const;
	class FString GetNotes() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMetaData">();
	}
	static class UMovieSceneMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMetaData>();
	}
};
static_assert(alignof(UMovieSceneMetaData) == 0x000008, "Wrong alignment on UMovieSceneMetaData");
static_assert(sizeof(UMovieSceneMetaData) == 0x000058, "Wrong size on UMovieSceneMetaData");
static_assert(offsetof(UMovieSceneMetaData, Author) == 0x000030, "Member 'UMovieSceneMetaData::Author' has a wrong offset!");
static_assert(offsetof(UMovieSceneMetaData, Created) == 0x000040, "Member 'UMovieSceneMetaData::Created' has a wrong offset!");
static_assert(offsetof(UMovieSceneMetaData, Notes) == 0x000048, "Member 'UMovieSceneMetaData::Notes' has a wrong offset!");

// Class MovieScene.MovieSceneTrack
// 0x0040 (0x0098 - 0x0058)
class UMovieSceneTrack : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneTrackEvalOptions            EvalOptions;                                       // 0x0058(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11CD[0x1];                                     // 0x005C(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEvalDisabled;                                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11CE[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RowsDisabled;                                      // 0x0060(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_11CF[0x4];                                     // 0x0070(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  EvaluationFieldGuid;                               // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11D0[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneTrackEvaluationField        EvaluationField;                                   // 0x0088(0x0010)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrack">();
	}
	static class UMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrack>();
	}
};
static_assert(alignof(UMovieSceneTrack) == 0x000008, "Wrong alignment on UMovieSceneTrack");
static_assert(sizeof(UMovieSceneTrack) == 0x000098, "Wrong size on UMovieSceneTrack");
static_assert(offsetof(UMovieSceneTrack, EvalOptions) == 0x000058, "Member 'UMovieSceneTrack::EvalOptions' has a wrong offset!");
static_assert(offsetof(UMovieSceneTrack, bIsEvalDisabled) == 0x00005D, "Member 'UMovieSceneTrack::bIsEvalDisabled' has a wrong offset!");
static_assert(offsetof(UMovieSceneTrack, RowsDisabled) == 0x000060, "Member 'UMovieSceneTrack::RowsDisabled' has a wrong offset!");
static_assert(offsetof(UMovieSceneTrack, EvaluationFieldGuid) == 0x000074, "Member 'UMovieSceneTrack::EvaluationFieldGuid' has a wrong offset!");
static_assert(offsetof(UMovieSceneTrack, EvaluationField) == 0x000088, "Member 'UMovieSceneTrack::EvaluationField' has a wrong offset!");

// Class MovieScene.MovieSceneNameableTrack
// 0x0000 (0x0098 - 0x0098)
class UMovieSceneNameableTrack : public UMovieSceneTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNameableTrack">();
	}
	static class UMovieSceneNameableTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNameableTrack>();
	}
};
static_assert(alignof(UMovieSceneNameableTrack) == 0x000008, "Wrong alignment on UMovieSceneNameableTrack");
static_assert(sizeof(UMovieSceneNameableTrack) == 0x000098, "Wrong size on UMovieSceneNameableTrack");

// Class MovieScene.MovieSceneSection
// 0x0098 (0x00F0 - 0x0058)
class UMovieSceneSection : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneSectionEvalOptions          EvalOptions;                                       // 0x0058(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11D1[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEasingSettings              Easing;                                            // 0x0060(0x0038)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneFrameRange                  SectionRange;                                      // 0x0098(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFrameNumber                           PreRollFrames;                                     // 0x00A8(0x0004)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           PostRollFrames;                                    // 0x00AC(0x0004)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RowIndex;                                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         OverlapPriority;                                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsActive : 1;                                     // 0x00B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsLocked : 1;                                     // 0x00B8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_11D2[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x00BC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndTime;                                           // 0x00C0(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PrerollTime;                                       // 0x00C4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PostrollTime;                                      // 0x00C8(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsInfinite : 1;                                   // 0x00CC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_11D3[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSupportsInfiniteRange;                            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FOptionalMovieSceneBlendType           BlendType;                                         // 0x00D1(0x0002)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_11D4[0x1D];                                    // 0x00D3(0x001D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBlendType(EMovieSceneBlendType InBlendType);
	void SetColorTint(const struct FColor& InColorTint);
	void SetCompletionMode(EMovieSceneCompletionMode InCompletionMode);
	void SetIsActive(bool bInIsActive);
	void SetIsLocked(bool bInIsLocked);
	void SetOverlapPriority(int32 NewPriority);
	void SetPostRollFrames(int32 InPostRollFrames);
	void SetPreRollFrames(int32 InPreRollFrames);
	void SetRowIndex(int32 NewRowIndex);

	struct FOptionalMovieSceneBlendType GetBlendType() const;
	struct FColor GetColorTint() const;
	EMovieSceneCompletionMode GetCompletionMode() const;
	int32 GetOverlapPriority() const;
	int32 GetPostRollFrames() const;
	int32 GetPreRollFrames() const;
	int32 GetRowIndex() const;
	bool IsActive() const;
	bool IsLocked() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSection">();
	}
	static class UMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSection>();
	}
};
static_assert(alignof(UMovieSceneSection) == 0x000008, "Wrong alignment on UMovieSceneSection");
static_assert(sizeof(UMovieSceneSection) == 0x0000F0, "Wrong size on UMovieSceneSection");
static_assert(offsetof(UMovieSceneSection, EvalOptions) == 0x000058, "Member 'UMovieSceneSection::EvalOptions' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, Easing) == 0x000060, "Member 'UMovieSceneSection::Easing' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, SectionRange) == 0x000098, "Member 'UMovieSceneSection::SectionRange' has a wrong offset!");
