#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieSceneTracks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "Constraints_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// Class MovieSceneTracks.MovieScenePropertySystem
// 0x0018 (0x0058 - 0x0040)
class UMovieScenePropertySystem : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_1390[0x8];                                     // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieScenePropertyInstantiatorSystem*  InstantiatorSystem;                                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1391[0x8];                                     // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePropertySystem">();
	}
	static class UMovieScenePropertySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePropertySystem>();
	}
};
static_assert(alignof(UMovieScenePropertySystem) == 0x000008, "Wrong alignment on UMovieScenePropertySystem");
static_assert(sizeof(UMovieScenePropertySystem) == 0x000058, "Wrong size on UMovieScenePropertySystem");
static_assert(offsetof(UMovieScenePropertySystem, InstantiatorSystem) == 0x000048, "Member 'UMovieScenePropertySystem::InstantiatorSystem' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneCameraCutTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneCameraCutTrack final : public UMovieSceneNameableTrack
{
public:
	bool                                          bCanBlend;                                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1392[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraCutTrack">();
	}
	static class UMovieSceneCameraCutTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraCutTrack>();
	}
};
static_assert(alignof(UMovieSceneCameraCutTrack) == 0x000008, "Wrong alignment on UMovieSceneCameraCutTrack");
static_assert(sizeof(UMovieSceneCameraCutTrack) == 0x0000B0, "Wrong size on UMovieSceneCameraCutTrack");
static_assert(offsetof(UMovieSceneCameraCutTrack, bCanBlend) == 0x000098, "Member 'UMovieSceneCameraCutTrack::bCanBlend' has a wrong offset!");
static_assert(offsetof(UMovieSceneCameraCutTrack, Sections) == 0x0000A0, "Member 'UMovieSceneCameraCutTrack::Sections' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneTransformOrigin
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneTransformOrigin final : public IInterface
{
public:
	struct FTransform BP_GetTransformOrigin() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTransformOrigin">();
	}
	static class IMovieSceneTransformOrigin* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneTransformOrigin>();
	}
};
static_assert(alignof(IMovieSceneTransformOrigin) == 0x000008, "Wrong alignment on IMovieSceneTransformOrigin");
static_assert(sizeof(IMovieSceneTransformOrigin) == 0x000028, "Wrong size on IMovieSceneTransformOrigin");

// Class MovieSceneTracks.MovieSceneComponentAttachmentInvalidatorSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneComponentAttachmentInvalidatorSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneComponentAttachmentInvalidatorSystem">();
	}
	static class UMovieSceneComponentAttachmentInvalidatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneComponentAttachmentInvalidatorSystem>();
	}
};
static_assert(alignof(UMovieSceneComponentAttachmentInvalidatorSystem) == 0x000008, "Wrong alignment on UMovieSceneComponentAttachmentInvalidatorSystem");
static_assert(sizeof(UMovieSceneComponentAttachmentInvalidatorSystem) == 0x000040, "Wrong size on UMovieSceneComponentAttachmentInvalidatorSystem");

// Class MovieSceneTracks.MovieSceneConsoleVariableTrackInterface
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneConsoleVariableTrackInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneConsoleVariableTrackInterface">();
	}
	static class IMovieSceneConsoleVariableTrackInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneConsoleVariableTrackInterface>();
	}
};
static_assert(alignof(IMovieSceneConsoleVariableTrackInterface) == 0x000008, "Wrong alignment on IMovieSceneConsoleVariableTrackInterface");
static_assert(sizeof(IMovieSceneConsoleVariableTrackInterface) == 0x000028, "Wrong size on IMovieSceneConsoleVariableTrackInterface");

// Class MovieSceneTracks.MovieSceneCameraShakeSourceShakeSection
// 0x0028 (0x0118 - 0x00F0)
class UMovieSceneCameraShakeSourceShakeSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneCameraShakeSectionData      ShakeData;                                         // 0x00F0(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraShakeSourceShakeSection">();
	}
	static class UMovieSceneCameraShakeSourceShakeSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraShakeSourceShakeSection>();
	}
};
static_assert(alignof(UMovieSceneCameraShakeSourceShakeSection) == 0x000008, "Wrong alignment on UMovieSceneCameraShakeSourceShakeSection");
static_assert(sizeof(UMovieSceneCameraShakeSourceShakeSection) == 0x000118, "Wrong size on UMovieSceneCameraShakeSourceShakeSection");
static_assert(offsetof(UMovieSceneCameraShakeSourceShakeSection, ShakeData) == 0x0000F0, "Member 'UMovieSceneCameraShakeSourceShakeSection::ShakeData' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneMotionVectorSimulationSystem
// 0x0058 (0x0098 - 0x0040)
class UMovieSceneMotionVectorSimulationSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_1393[0x58];                                    // 0x0040(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMotionVectorSimulationSystem">();
	}
	static class UMovieSceneMotionVectorSimulationSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMotionVectorSimulationSystem>();
	}
};
static_assert(alignof(UMovieSceneMotionVectorSimulationSystem) == 0x000008, "Wrong alignment on UMovieSceneMotionVectorSimulationSystem");
static_assert(sizeof(UMovieSceneMotionVectorSimulationSystem) == 0x000098, "Wrong size on UMovieSceneMotionVectorSimulationSystem");

// Class MovieSceneTracks.MovieSceneDecomposerTestObject
// 0x0008 (0x0030 - 0x0028)
class UMovieSceneDecomposerTestObject final : public UObject
{
public:
	float                                         FloatProperty;                                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1394[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDecomposerTestObject">();
	}
	static class UMovieSceneDecomposerTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDecomposerTestObject>();
	}
};
static_assert(alignof(UMovieSceneDecomposerTestObject) == 0x000008, "Wrong alignment on UMovieSceneDecomposerTestObject");
static_assert(sizeof(UMovieSceneDecomposerTestObject) == 0x000030, "Wrong size on UMovieSceneDecomposerTestObject");
static_assert(offsetof(UMovieSceneDecomposerTestObject, FloatProperty) == 0x000028, "Member 'UMovieSceneDecomposerTestObject::FloatProperty' has a wrong offset!");

// Class MovieSceneTracks.FloatChannelEvaluatorSystem
// 0x0000 (0x0040 - 0x0040)
class UFloatChannelEvaluatorSystem final : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatChannelEvaluatorSystem">();
	}
	static class UFloatChannelEvaluatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatChannelEvaluatorSystem>();
	}
};
static_assert(alignof(UFloatChannelEvaluatorSystem) == 0x000008, "Wrong alignment on UFloatChannelEvaluatorSystem");
static_assert(sizeof(UFloatChannelEvaluatorSystem) == 0x000040, "Wrong size on UFloatChannelEvaluatorSystem");

// Class MovieSceneTracks.MovieSceneTestSequence
// 0x0028 (0x0090 - 0x0068)
class UMovieSceneTestSequence final : public UMovieSceneSequence
{
public:
	class UMovieScene*                            MovieScene;                                        // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        BoundObjects;                                      // 0x0070(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          BindingGuids;                                      // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTestSequence">();
	}
	static class UMovieSceneTestSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTestSequence>();
	}
};
static_assert(alignof(UMovieSceneTestSequence) == 0x000008, "Wrong alignment on UMovieSceneTestSequence");
static_assert(sizeof(UMovieSceneTestSequence) == 0x000090, "Wrong size on UMovieSceneTestSequence");
static_assert(offsetof(UMovieSceneTestSequence, MovieScene) == 0x000068, "Member 'UMovieSceneTestSequence::MovieScene' has a wrong offset!");
static_assert(offsetof(UMovieSceneTestSequence, BoundObjects) == 0x000070, "Member 'UMovieSceneTestSequence::BoundObjects' has a wrong offset!");
static_assert(offsetof(UMovieSceneTestSequence, BindingGuids) == 0x000080, "Member 'UMovieSceneTestSequence::BindingGuids' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneParticleParameterTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneParticleParameterTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_1395[0x8];                                     // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneParticleParameterTrack">();
	}
	static class UMovieSceneParticleParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneParticleParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneParticleParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneParticleParameterTrack");
static_assert(sizeof(UMovieSceneParticleParameterTrack) == 0x0000B0, "Wrong size on UMovieSceneParticleParameterTrack");
static_assert(offsetof(UMovieSceneParticleParameterTrack, Sections) == 0x0000A0, "Member 'UMovieSceneParticleParameterTrack::Sections' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneDoublePerlinNoiseChannelContainer
// 0x0068 (0x00C0 - 0x0058)
class UMovieSceneDoublePerlinNoiseChannelContainer final : public UMovieSceneChannelOverrideContainer
{
public:
	struct FMovieSceneDoublePerlinNoiseChannel    PerlinNoiseChannel;                                // 0x0058(0x0068)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDoublePerlinNoiseChannelContainer">();
	}
	static class UMovieSceneDoublePerlinNoiseChannelContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDoublePerlinNoiseChannelContainer>();
	}
};
static_assert(alignof(UMovieSceneDoublePerlinNoiseChannelContainer) == 0x000008, "Wrong alignment on UMovieSceneDoublePerlinNoiseChannelContainer");
static_assert(sizeof(UMovieSceneDoublePerlinNoiseChannelContainer) == 0x0000C0, "Wrong size on UMovieSceneDoublePerlinNoiseChannelContainer");
static_assert(offsetof(UMovieSceneDoublePerlinNoiseChannelContainer, PerlinNoiseChannel) == 0x000058, "Member 'UMovieSceneDoublePerlinNoiseChannelContainer::PerlinNoiseChannel' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneFloatPerlinNoiseChannelContainer
// 0x0068 (0x00C0 - 0x0058)
class UMovieSceneFloatPerlinNoiseChannelContainer final : public UMovieSceneChannelOverrideContainer
{
public:
	struct FMovieSceneFloatPerlinNoiseChannel     PerlinNoiseChannel;                                // 0x0058(0x0068)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFloatPerlinNoiseChannelContainer">();
	}
	static class UMovieSceneFloatPerlinNoiseChannelContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFloatPerlinNoiseChannelContainer>();
	}
};
static_assert(alignof(UMovieSceneFloatPerlinNoiseChannelContainer) == 0x000008, "Wrong alignment on UMovieSceneFloatPerlinNoiseChannelContainer");
static_assert(sizeof(UMovieSceneFloatPerlinNoiseChannelContainer) == 0x0000C0, "Wrong size on UMovieSceneFloatPerlinNoiseChannelContainer");
static_assert(offsetof(UMovieSceneFloatPerlinNoiseChannelContainer, PerlinNoiseChannel) == 0x000058, "Member 'UMovieSceneFloatPerlinNoiseChannelContainer::PerlinNoiseChannel' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneConstrainedSection
// 0x0000 (0x0028 - 0x0028)
class IMovieSceneConstrainedSection final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneConstrainedSection">();
	}
	static class IMovieSceneConstrainedSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneConstrainedSection>();
	}
};
static_assert(alignof(IMovieSceneConstrainedSection) == 0x000008, "Wrong alignment on IMovieSceneConstrainedSection");
static_assert(sizeof(IMovieSceneConstrainedSection) == 0x000028, "Wrong size on IMovieSceneConstrainedSection");

// Class MovieSceneTracks.MovieScenePiecewiseEnumBlenderSystem
// 0x0028 (0x0090 - 0x0068)
class UMovieScenePiecewiseEnumBlenderSystem final : public UMovieSceneBlenderSystem
{
public:
	uint8                                         Pad_1396[0x28];                                    // 0x0068(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePiecewiseEnumBlenderSystem">();
	}
	static class UMovieScenePiecewiseEnumBlenderSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePiecewiseEnumBlenderSystem>();
	}
};
static_assert(alignof(UMovieScenePiecewiseEnumBlenderSystem) == 0x000008, "Wrong alignment on UMovieScenePiecewiseEnumBlenderSystem");
static_assert(sizeof(UMovieScenePiecewiseEnumBlenderSystem) == 0x000090, "Wrong size on UMovieScenePiecewiseEnumBlenderSystem");

// Class MovieSceneTracks.MovieSceneInterrogatedPropertyInstantiatorSystem
// 0x01B0 (0x01F0 - 0x0040)
class UMovieSceneInterrogatedPropertyInstantiatorSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_1397[0x1B0];                                   // 0x0040(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneInterrogatedPropertyInstantiatorSystem">();
	}
	static class UMovieSceneInterrogatedPropertyInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneInterrogatedPropertyInstantiatorSystem>();
	}
};
static_assert(alignof(UMovieSceneInterrogatedPropertyInstantiatorSystem) == 0x000008, "Wrong alignment on UMovieSceneInterrogatedPropertyInstantiatorSystem");
static_assert(sizeof(UMovieSceneInterrogatedPropertyInstantiatorSystem) == 0x0001F0, "Wrong size on UMovieSceneInterrogatedPropertyInstantiatorSystem");

// Class MovieSceneTracks.MovieScene3DTransformPropertySystem
// 0x0000 (0x0058 - 0x0058)
class UMovieScene3DTransformPropertySystem final : public UMovieScenePropertySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DTransformPropertySystem">();
	}
	static class UMovieScene3DTransformPropertySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DTransformPropertySystem>();
	}
};
static_assert(alignof(UMovieScene3DTransformPropertySystem) == 0x000008, "Wrong alignment on UMovieScene3DTransformPropertySystem");
static_assert(sizeof(UMovieScene3DTransformPropertySystem) == 0x000058, "Wrong size on UMovieScene3DTransformPropertySystem");

// Class MovieSceneTracks.MovieSceneCameraShakeEvaluator
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneCameraShakeEvaluator final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraShakeEvaluator">();
	}
	static class UMovieSceneCameraShakeEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraShakeEvaluator>();
	}
};
static_assert(alignof(UMovieSceneCameraShakeEvaluator) == 0x000008, "Wrong alignment on UMovieSceneCameraShakeEvaluator");
static_assert(sizeof(UMovieSceneCameraShakeEvaluator) == 0x000028, "Wrong size on UMovieSceneCameraShakeEvaluator");

// Class MovieSceneTracks.MovieSceneComponentAttachmentSystem
// 0x0190 (0x01D0 - 0x0040)
class UMovieSceneComponentAttachmentSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_1398[0x190];                                   // 0x0040(0x0190)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneComponentAttachmentSystem">();
	}
	static class UMovieSceneComponentAttachmentSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneComponentAttachmentSystem>();
	}
};
static_assert(alignof(UMovieSceneComponentAttachmentSystem) == 0x000008, "Wrong alignment on UMovieSceneComponentAttachmentSystem");
static_assert(sizeof(UMovieSceneComponentAttachmentSystem) == 0x0001D0, "Wrong size on UMovieSceneComponentAttachmentSystem");

// Class MovieSceneTracks.MovieScenePropertyTrack
// 0x0030 (0x00C8 - 0x0098)
class UMovieScenePropertyTrack : public UMovieSceneNameableTrack
{
public:
	class UMovieSceneSection*                     SectionToKey;                                      // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x00A0(0x0014)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1399[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePropertyTrack">();
	}
	static class UMovieScenePropertyTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePropertyTrack>();
	}
};
static_assert(alignof(UMovieScenePropertyTrack) == 0x000008, "Wrong alignment on UMovieScenePropertyTrack");
static_assert(sizeof(UMovieScenePropertyTrack) == 0x0000C8, "Wrong size on UMovieScenePropertyTrack");
static_assert(offsetof(UMovieScenePropertyTrack, SectionToKey) == 0x000098, "Member 'UMovieScenePropertyTrack::SectionToKey' has a wrong offset!");
static_assert(offsetof(UMovieScenePropertyTrack, PropertyBinding) == 0x0000A0, "Member 'UMovieScenePropertyTrack::PropertyBinding' has a wrong offset!");
static_assert(offsetof(UMovieScenePropertyTrack, Sections) == 0x0000B8, "Member 'UMovieScenePropertyTrack::Sections' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneDoubleTrack
// 0x0000 (0x00C8 - 0x00C8)
class UMovieSceneDoubleTrack final : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDoubleTrack">();
	}
	static class UMovieSceneDoubleTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDoubleTrack>();
	}
};
static_assert(alignof(UMovieSceneDoubleTrack) == 0x000008, "Wrong alignment on UMovieSceneDoubleTrack");
static_assert(sizeof(UMovieSceneDoubleTrack) == 0x0000C8, "Wrong size on UMovieSceneDoubleTrack");

// Class MovieSceneTracks.MovieScene3DConstraintSection
// 0x0028 (0x0118 - 0x00F0)
class UMovieScene3DConstraintSection : public UMovieSceneSection
{
public:
	struct FGuid                                  ConstraintId;                                      // 0x00F0(0x0010)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMovieSceneObjectBindingID             ConstraintBindingID;                               // 0x0100(0x0018)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetConstraintBindingID(const struct FMovieSceneObjectBindingID& InConstraintBindingID);

	const struct FMovieSceneObjectBindingID GetConstraintBindingID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DConstraintSection">();
	}
	static class UMovieScene3DConstraintSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DConstraintSection>();
	}
};
static_assert(alignof(UMovieScene3DConstraintSection) == 0x000008, "Wrong alignment on UMovieScene3DConstraintSection");
static_assert(sizeof(UMovieScene3DConstraintSection) == 0x000118, "Wrong size on UMovieScene3DConstraintSection");
static_assert(offsetof(UMovieScene3DConstraintSection, ConstraintId) == 0x0000F0, "Member 'UMovieScene3DConstraintSection::ConstraintId' has a wrong offset!");
static_assert(offsetof(UMovieScene3DConstraintSection, ConstraintBindingID) == 0x000100, "Member 'UMovieScene3DConstraintSection::ConstraintBindingID' has a wrong offset!");

// Class MovieSceneTracks.MovieScene3DAttachSection
// 0x0020 (0x0138 - 0x0118)
class UMovieScene3DAttachSection final : public UMovieScene3DConstraintSection
{
public:
	uint8                                         Pad_139A[0x8];                                     // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachSocketName;                                  // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachComponentName;                               // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AttachmentLocationRule;                            // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AttachmentRotationRule;                            // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AttachmentScaleRule;                               // 0x0132(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               DetachmentLocationRule;                            // 0x0133(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               DetachmentRotationRule;                            // 0x0134(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               DetachmentScaleRule;                               // 0x0135(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139B[0x2];                                     // 0x0136(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DAttachSection">();
	}
	static class UMovieScene3DAttachSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DAttachSection>();
	}
};
static_assert(alignof(UMovieScene3DAttachSection) == 0x000008, "Wrong alignment on UMovieScene3DAttachSection");
static_assert(sizeof(UMovieScene3DAttachSection) == 0x000138, "Wrong size on UMovieScene3DAttachSection");
static_assert(offsetof(UMovieScene3DAttachSection, AttachSocketName) == 0x000120, "Member 'UMovieScene3DAttachSection::AttachSocketName' has a wrong offset!");
static_assert(offsetof(UMovieScene3DAttachSection, AttachComponentName) == 0x000128, "Member 'UMovieScene3DAttachSection::AttachComponentName' has a wrong offset!");
static_assert(offsetof(UMovieScene3DAttachSection, AttachmentLocationRule) == 0x000130, "Member 'UMovieScene3DAttachSection::AttachmentLocationRule' has a wrong offset!");
static_assert(offsetof(UMovieScene3DAttachSection, AttachmentRotationRule) == 0x000131, "Member 'UMovieScene3DAttachSection::AttachmentRotationRule' has a wrong offset!");
static_assert(offsetof(UMovieScene3DAttachSection, AttachmentScaleRule) == 0x000132, "Member 'UMovieScene3DAttachSection::AttachmentScaleRule' has a wrong offset!");
static_assert(offsetof(UMovieScene3DAttachSection, DetachmentLocationRule) == 0x000133, "Member 'UMovieScene3DAttachSection::DetachmentLocationRule' has a wrong offset!");
static_assert(offsetof(UMovieScene3DAttachSection, DetachmentRotationRule) == 0x000134, "Member 'UMovieScene3DAttachSection::DetachmentRotationRule' has a wrong offset!");
static_assert(offsetof(UMovieScene3DAttachSection, DetachmentScaleRule) == 0x000135, "Member 'UMovieScene3DAttachSection::DetachmentScaleRule' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneEnumSection
// 0x0110 (0x0200 - 0x00F0)
class UMovieSceneEnumSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_139C[0x8];                                     // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneByteChannel                 EnumCurve;                                         // 0x00F8(0x0108)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEnumSection">();
	}
	static class UMovieSceneEnumSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEnumSection>();
	}
};
static_assert(alignof(UMovieSceneEnumSection) == 0x000008, "Wrong alignment on UMovieSceneEnumSection");
static_assert(sizeof(UMovieSceneEnumSection) == 0x000200, "Wrong size on UMovieSceneEnumSection");
static_assert(offsetof(UMovieSceneEnumSection, EnumCurve) == 0x0000F8, "Member 'UMovieSceneEnumSection::EnumCurve' has a wrong offset!");

// Class MovieSceneTracks.MovieScenePredictionSystem
// 0x00B0 (0x00F0 - 0x0040)
class UMovieScenePredictionSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_139D[0x90];                                    // 0x0040(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneAsyncAction_SequencePrediction*> PendingPredictions;                                // 0x00D0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneAsyncAction_SequencePrediction*> ProcessingPredictions;                             // 0x00E0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePredictionSystem">();
	}
	static class UMovieScenePredictionSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePredictionSystem>();
	}
};
static_assert(alignof(UMovieScenePredictionSystem) == 0x000008, "Wrong alignment on UMovieScenePredictionSystem");
static_assert(sizeof(UMovieScenePredictionSystem) == 0x0000F0, "Wrong size on UMovieScenePredictionSystem");
static_assert(offsetof(UMovieScenePredictionSystem, PendingPredictions) == 0x0000D0, "Member 'UMovieScenePredictionSystem::PendingPredictions' has a wrong offset!");
static_assert(offsetof(UMovieScenePredictionSystem, ProcessingPredictions) == 0x0000E0, "Member 'UMovieScenePredictionSystem::ProcessingPredictions' has a wrong offset!");

// Class MovieSceneTracks.MovieScene3DPathSection
// 0x0118 (0x0230 - 0x0118)
class UMovieScene3DPathSection final : public UMovieScene3DConstraintSection
{
public:
	struct FMovieSceneFloatChannel                TimingCurve;                                       // 0x0118(0x0110)(NativeAccessSpecifierPublic)
	EMovieScene3DPathSection_Axis                 FrontAxisEnum;                                     // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieScene3DPathSection_Axis                 UpAxisEnum;                                        // 0x0229(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139E[0x2];                                     // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bFollow : 1;                                       // 0x022C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReverse : 1;                                      // 0x022C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForceUpright : 1;                                 // 0x022C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_139F[0x3];                                     // 0x022D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DPathSection">();
	}
	static class UMovieScene3DPathSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DPathSection>();
	}
};
static_assert(alignof(UMovieScene3DPathSection) == 0x000008, "Wrong alignment on UMovieScene3DPathSection");
static_assert(sizeof(UMovieScene3DPathSection) == 0x000230, "Wrong size on UMovieScene3DPathSection");
static_assert(offsetof(UMovieScene3DPathSection, TimingCurve) == 0x000118, "Member 'UMovieScene3DPathSection::TimingCurve' has a wrong offset!");
static_assert(offsetof(UMovieScene3DPathSection, FrontAxisEnum) == 0x000228, "Member 'UMovieScene3DPathSection::FrontAxisEnum' has a wrong offset!");
static_assert(offsetof(UMovieScene3DPathSection, UpAxisEnum) == 0x000229, "Member 'UMovieScene3DPathSection::UpAxisEnum' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneBytePropertySystem
// 0x0000 (0x0058 - 0x0058)
class UMovieSceneBytePropertySystem final : public UMovieScenePropertySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBytePropertySystem">();
	}
	static class UMovieSceneBytePropertySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBytePropertySystem>();
	}
};
static_assert(alignof(UMovieSceneBytePropertySystem) == 0x000008, "Wrong alignment on UMovieSceneBytePropertySystem");
static_assert(sizeof(UMovieSceneBytePropertySystem) == 0x000058, "Wrong size on UMovieSceneBytePropertySystem");

// Class MovieSceneTracks.MovieScene3DTransformSectionConstraints
// 0x0010 (0x0038 - 0x0028)
class UMovieScene3DTransformSectionConstraints final : public UObject
{
public:
	TArray<struct FConstraintAndActiveChannel>    ConstraintsChannels;                               // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DTransformSectionConstraints">();
	}
	static class UMovieScene3DTransformSectionConstraints* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DTransformSectionConstraints>();
	}
};
static_assert(alignof(UMovieScene3DTransformSectionConstraints) == 0x000008, "Wrong alignment on UMovieScene3DTransformSectionConstraints");
static_assert(sizeof(UMovieScene3DTransformSectionConstraints) == 0x000038, "Wrong size on UMovieScene3DTransformSectionConstraints");
static_assert(offsetof(UMovieScene3DTransformSectionConstraints, ConstraintsChannels) == 0x000028, "Member 'UMovieScene3DTransformSectionConstraints::ConstraintsChannels' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneDoubleVectorTrack
// 0x0008 (0x00D0 - 0x00C8)
class UMovieSceneDoubleVectorTrack final : public UMovieScenePropertyTrack
{
public:
	int32                                         NumChannelsUsed;                                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13A0[0x4];                                     // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDoubleVectorTrack">();
	}
	static class UMovieSceneDoubleVectorTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDoubleVectorTrack>();
	}
};
static_assert(alignof(UMovieSceneDoubleVectorTrack) == 0x000008, "Wrong alignment on UMovieSceneDoubleVectorTrack");
static_assert(sizeof(UMovieSceneDoubleVectorTrack) == 0x0000D0, "Wrong size on UMovieSceneDoubleVectorTrack");
static_assert(offsetof(UMovieSceneDoubleVectorTrack, NumChannelsUsed) == 0x0000C8, "Member 'UMovieSceneDoubleVectorTrack::NumChannelsUsed' has a wrong offset!");

// Class MovieSceneTracks.MovieScene3DTransformSection
// 0x0B48 (0x0C38 - 0x00F0)
class UMovieScene3DTransformSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_13A1[0x40];                                    // 0x00F0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneTransformMask               TransformMask;                                     // 0x0130(0x0004)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13A2[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneDoubleChannel               Translation[0x3];                                  // 0x0138(0x0118)(NativeAccessSpecifierPrivate)
	struct FMovieSceneDoubleChannel               Rotation[0x3];                                     // 0x0480(0x0118)(NativeAccessSpecifierPrivate)
	struct FMovieSceneDoubleChannel               Scale[0x3];                                        // 0x07C8(0x0118)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                ManualWeight;                                      // 0x0B10(0x0110)(NativeAccessSpecifierPrivate)
	class UMovieSceneSectionChannelOverrideRegistry* OverrideRegistry;                                  // 0x0C20(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieScene3DTransformSectionConstraints* Constraints;                                       // 0x0C28(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseQuaternionInterpolation;                       // 0x0C30(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13A3[0x7];                                     // 0x0C31(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DTransformSection">();
	}
	static class UMovieScene3DTransformSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DTransformSection>();
	}
};
static_assert(alignof(UMovieScene3DTransformSection) == 0x000008, "Wrong alignment on UMovieScene3DTransformSection");
static_assert(sizeof(UMovieScene3DTransformSection) == 0x000C38, "Wrong size on UMovieScene3DTransformSection");
static_assert(offsetof(UMovieScene3DTransformSection, TransformMask) == 0x000130, "Member 'UMovieScene3DTransformSection::TransformMask' has a wrong offset!");
static_assert(offsetof(UMovieScene3DTransformSection, Translation) == 0x000138, "Member 'UMovieScene3DTransformSection::Translation' has a wrong offset!");
static_assert(offsetof(UMovieScene3DTransformSection, Rotation) == 0x000480, "Member 'UMovieScene3DTransformSection::Rotation' has a wrong offset!");
static_assert(offsetof(UMovieScene3DTransformSection, Scale) == 0x0007C8, "Member 'UMovieScene3DTransformSection::Scale' has a wrong offset!");
static_assert(offsetof(UMovieScene3DTransformSection, ManualWeight) == 0x000B10, "Member 'UMovieScene3DTransformSection::ManualWeight' has a wrong offset!");
static_assert(offsetof(UMovieScene3DTransformSection, OverrideRegistry) == 0x000C20, "Member 'UMovieScene3DTransformSection::OverrideRegistry' has a wrong offset!");
static_assert(offsetof(UMovieScene3DTransformSection, Constraints) == 0x000C28, "Member 'UMovieScene3DTransformSection::Constraints' has a wrong offset!");
static_assert(offsetof(UMovieScene3DTransformSection, bUseQuaternionInterpolation) == 0x000C30, "Member 'UMovieScene3DTransformSection::bUseQuaternionInterpolation' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneCVarSection
// 0x0068 (0x0158 - 0x00F0)
class UMovieSceneCVarSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_13A4[0x8];                                     // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMovieSceneConsoleVariableCollection> ConsoleVariableCollections;                        // 0x00F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMovieSceneCVarOverrides               ConsoleVariables;                                  // 0x0108(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	void SetFromString(const class FString& InString);

	class FString GetString() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCVarSection">();
	}
	static class UMovieSceneCVarSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCVarSection>();
	}
};
static_assert(alignof(UMovieSceneCVarSection) == 0x000008, "Wrong alignment on UMovieSceneCVarSection");
static_assert(sizeof(UMovieSceneCVarSection) == 0x000158, "Wrong size on UMovieSceneCVarSection");
static_assert(offsetof(UMovieSceneCVarSection, ConsoleVariableCollections) == 0x0000F8, "Member 'UMovieSceneCVarSection::ConsoleVariableCollections' has a wrong offset!");
static_assert(offsetof(UMovieSceneCVarSection, ConsoleVariables) == 0x000108, "Member 'UMovieSceneCVarSection::ConsoleVariables' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneActorReferenceSection
// 0x01B0 (0x02A0 - 0x00F0)
class UMovieSceneActorReferenceSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneActorReferenceData          ActorReferenceData;                                // 0x00F0(0x0120)(NativeAccessSpecifierPrivate)
	struct FIntegralCurve                         ActorGuidIndexCurve;                               // 0x0210(0x0080)(Deprecated, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ActorGuidStrings;                                  // 0x0290(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneActorReferenceSection">();
	}
	static class UMovieSceneActorReferenceSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneActorReferenceSection>();
	}
};
static_assert(alignof(UMovieSceneActorReferenceSection) == 0x000008, "Wrong alignment on UMovieSceneActorReferenceSection");
static_assert(sizeof(UMovieSceneActorReferenceSection) == 0x0002A0, "Wrong size on UMovieSceneActorReferenceSection");
static_assert(offsetof(UMovieSceneActorReferenceSection, ActorReferenceData) == 0x0000F0, "Member 'UMovieSceneActorReferenceSection::ActorReferenceData' has a wrong offset!");
static_assert(offsetof(UMovieSceneActorReferenceSection, ActorGuidIndexCurve) == 0x000210, "Member 'UMovieSceneActorReferenceSection::ActorGuidIndexCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneActorReferenceSection, ActorGuidStrings) == 0x000290, "Member 'UMovieSceneActorReferenceSection::ActorGuidStrings' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneEventSectionBase
// 0x0000 (0x00F0 - 0x00F0)
class UMovieSceneEventSectionBase : public UMovieSceneSection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEventSectionBase">();
	}
	static class UMovieSceneEventSectionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEventSectionBase>();
	}
};
static_assert(alignof(UMovieSceneEventSectionBase) == 0x000008, "Wrong alignment on UMovieSceneEventSectionBase");
static_assert(sizeof(UMovieSceneEventSectionBase) == 0x0000F0, "Wrong size on UMovieSceneEventSectionBase");

// Class MovieSceneTracks.MovieSceneEventTriggerSection
// 0x0100 (0x01F0 - 0x00F0)
class UMovieSceneEventTriggerSection final : public UMovieSceneEventSectionBase
{
public:
	uint8                                         Pad_13A5[0x8];                                     // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEventChannel                EventChannel;                                      // 0x00F8(0x00F8)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEventTriggerSection">();
	}
	static class UMovieSceneEventTriggerSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEventTriggerSection>();
	}
};
static_assert(alignof(UMovieSceneEventTriggerSection) == 0x000008, "Wrong alignment on UMovieSceneEventTriggerSection");
static_assert(sizeof(UMovieSceneEventTriggerSection) == 0x0001F0, "Wrong size on UMovieSceneEventTriggerSection");
static_assert(offsetof(UMovieSceneEventTriggerSection, EventChannel) == 0x0000F8, "Member 'UMovieSceneEventTriggerSection::EventChannel' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneSkeletalAnimationSystem
// 0x00A0 (0x00E0 - 0x0040)
class UMovieSceneSkeletalAnimationSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_13A6[0xA0];                                    // 0x0040(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSkeletalAnimationSystem">();
	}
	static class UMovieSceneSkeletalAnimationSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSkeletalAnimationSystem>();
	}
};
static_assert(alignof(UMovieSceneSkeletalAnimationSystem) == 0x000008, "Wrong alignment on UMovieSceneSkeletalAnimationSystem");
static_assert(sizeof(UMovieSceneSkeletalAnimationSystem) == 0x0000E0, "Wrong size on UMovieSceneSkeletalAnimationSystem");

// Class MovieSceneTracks.MovieSceneAudioSection
// 0x0538 (0x0628 - 0x00F0)
class UMovieSceneAudioSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_13A7[0x8];                                     // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound;                                             // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           StartFrameOffset;                                  // 0x0100(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StartOffset;                                       // 0x0104(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AudioStartTime;                                    // 0x0108(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AudioDilationFactor;                               // 0x010C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AudioVolume;                                       // 0x0110(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13A8[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneFloatChannel                SoundVolume;                                       // 0x0118(0x0110)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                PitchMultiplier;                                   // 0x0228(0x0110)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneFloatChannel> Inputs_Float;                                      // 0x0338(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneStringChannel> Inputs_String;                                     // 0x0388(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneBoolChannel> Inputs_Bool;                                       // 0x03D8(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneIntegerChannel> Inputs_Int;                                        // 0x0428(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneAudioTriggerChannel> Inputs_Trigger;                                    // 0x0478(0x0050)(NativeAccessSpecifierPrivate)
	struct FMovieSceneActorReferenceData          AttachActorData;                                   // 0x04C8(0x0120)(NativeAccessSpecifierPrivate)
	bool                                          bLooping;                                          // 0x05E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSuppressSubtitles;                                // 0x05E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOverrideAttenuation;                              // 0x05EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13A9[0x5];                                     // 0x05EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      AttenuationSettings;                               // 0x05F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(TArray<struct FSubtitleCue>& Subtitles, float CueDuration)> OnQueueSubtitles;                                  // 0x05F8(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             OnAudioFinished;                                   // 0x0608(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             OnAudioPlaybackPercent;                            // 0x0618(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPrivate)

public:
	void SetAttenuationSettings(class USoundAttenuation* InAttenuationSettings);
	void SetLooping(bool bInLooping);
	void SetOverrideAttenuation(bool bInOverrideAttenuation);
	void SetSound(class USoundBase* InSound);
	void SetStartOffset(const struct FFrameNumber& InStartOffset);
	void SetSuppressSubtitles(bool bInSuppressSubtitles);

	class USoundAttenuation* GetAttenuationSettings() const;
	bool GetLooping() const;
	bool GetOverrideAttenuation() const;
	class USoundBase* GetSound() const;
	struct FFrameNumber GetStartOffset() const;
	bool GetSuppressSubtitles() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneAudioSection">();
	}
	static class UMovieSceneAudioSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneAudioSection>();
	}
};
static_assert(alignof(UMovieSceneAudioSection) == 0x000008, "Wrong alignment on UMovieSceneAudioSection");
static_assert(sizeof(UMovieSceneAudioSection) == 0x000628, "Wrong size on UMovieSceneAudioSection");
static_assert(offsetof(UMovieSceneAudioSection, Sound) == 0x0000F8, "Member 'UMovieSceneAudioSection::Sound' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, StartFrameOffset) == 0x000100, "Member 'UMovieSceneAudioSection::StartFrameOffset' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, StartOffset) == 0x000104, "Member 'UMovieSceneAudioSection::StartOffset' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, AudioStartTime) == 0x000108, "Member 'UMovieSceneAudioSection::AudioStartTime' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, AudioDilationFactor) == 0x00010C, "Member 'UMovieSceneAudioSection::AudioDilationFactor' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, AudioVolume) == 0x000110, "Member 'UMovieSceneAudioSection::AudioVolume' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, SoundVolume) == 0x000118, "Member 'UMovieSceneAudioSection::SoundVolume' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, PitchMultiplier) == 0x000228, "Member 'UMovieSceneAudioSection::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, Inputs_Float) == 0x000338, "Member 'UMovieSceneAudioSection::Inputs_Float' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, Inputs_String) == 0x000388, "Member 'UMovieSceneAudioSection::Inputs_String' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, Inputs_Bool) == 0x0003D8, "Member 'UMovieSceneAudioSection::Inputs_Bool' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, Inputs_Int) == 0x000428, "Member 'UMovieSceneAudioSection::Inputs_Int' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, Inputs_Trigger) == 0x000478, "Member 'UMovieSceneAudioSection::Inputs_Trigger' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, AttachActorData) == 0x0004C8, "Member 'UMovieSceneAudioSection::AttachActorData' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, bLooping) == 0x0005E8, "Member 'UMovieSceneAudioSection::bLooping' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, bSuppressSubtitles) == 0x0005E9, "Member 'UMovieSceneAudioSection::bSuppressSubtitles' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, bOverrideAttenuation) == 0x0005EA, "Member 'UMovieSceneAudioSection::bOverrideAttenuation' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, AttenuationSettings) == 0x0005F0, "Member 'UMovieSceneAudioSection::AttenuationSettings' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, OnQueueSubtitles) == 0x0005F8, "Member 'UMovieSceneAudioSection::OnQueueSubtitles' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, OnAudioFinished) == 0x000608, "Member 'UMovieSceneAudioSection::OnAudioFinished' has a wrong offset!");
static_assert(offsetof(UMovieSceneAudioSection, OnAudioPlaybackPercent) == 0x000618, "Member 'UMovieSceneAudioSection::OnAudioPlaybackPercent' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneComponentMaterialSystem
// 0x0160 (0x01A0 - 0x0040)
class UMovieSceneComponentMaterialSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_13AA[0x160];                                   // 0x0040(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneComponentMaterialSystem">();
	}
	static class UMovieSceneComponentMaterialSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneComponentMaterialSystem>();
	}
};
static_assert(alignof(UMovieSceneComponentMaterialSystem) == 0x000008, "Wrong alignment on UMovieSceneComponentMaterialSystem");
static_assert(sizeof(UMovieSceneComponentMaterialSystem) == 0x0001A0, "Wrong size on UMovieSceneComponentMaterialSystem");

// Class MovieSceneTracks.MovieSceneBaseCacheSection
// 0x0008 (0x00F8 - 0x00F0)
class UMovieSceneBaseCacheSection : public UMovieSceneSection
{
public:
	uint8                                         Pad_13AB[0x8];                                     // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBaseCacheSection">();
	}
	static class UMovieSceneBaseCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBaseCacheSection>();
	}
};
static_assert(alignof(UMovieSceneBaseCacheSection) == 0x000008, "Wrong alignment on UMovieSceneBaseCacheSection");
static_assert(sizeof(UMovieSceneBaseCacheSection) == 0x0000F8, "Wrong size on UMovieSceneBaseCacheSection");

// Class MovieSceneTracks.MovieSceneMaterialTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneMaterialTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMovieSceneSection*                     SectionToKey;                                      // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMaterialTrack">();
	}
	static class UMovieSceneMaterialTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMaterialTrack>();
	}
};
static_assert(alignof(UMovieSceneMaterialTrack) == 0x000008, "Wrong alignment on UMovieSceneMaterialTrack");
static_assert(sizeof(UMovieSceneMaterialTrack) == 0x0000B0, "Wrong size on UMovieSceneMaterialTrack");
static_assert(offsetof(UMovieSceneMaterialTrack, Sections) == 0x000098, "Member 'UMovieSceneMaterialTrack::Sections' has a wrong offset!");
static_assert(offsetof(UMovieSceneMaterialTrack, SectionToKey) == 0x0000A8, "Member 'UMovieSceneMaterialTrack::SectionToKey' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneByteSection
// 0x0110 (0x0200 - 0x00F0)
class UMovieSceneByteSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_13AC[0x8];                                     // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneByteChannel                 ByteCurve;                                         // 0x00F8(0x0108)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneByteSection">();
	}
	static class UMovieSceneByteSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneByteSection>();
	}
};
static_assert(alignof(UMovieSceneByteSection) == 0x000008, "Wrong alignment on UMovieSceneByteSection");
static_assert(sizeof(UMovieSceneByteSection) == 0x000200, "Wrong size on UMovieSceneByteSection");
static_assert(offsetof(UMovieSceneByteSection, ByteCurve) == 0x0000F8, "Member 'UMovieSceneByteSection::ByteCurve' has a wrong offset!");

// Class MovieSceneTracks.MovieSceneCameraCutSection
// 0x00B0 (0x01A0 - 0x00F0)
class UMovieSceneCameraCutSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_13AD[0x8];                                     // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLockPreviousCamera;                               // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13AE[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CameraGuid;                                        // 0x00FC(0x0010)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieSceneObjectBindingID             CameraBindingID;                                   // 0x010C(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13AF[0xC];                                     // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InitialCameraCutTransform;                         // 0x0130(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasInitialCameraCutTransform;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13B0[0xF];                                     // 0x0191(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCameraBindingID(const struct FMovieSceneObjectBindingID& InCameraBindingID);

	const struct FMovieSceneObjectBindingID GetCameraBindingID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraCutSection">();
	}
