#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MyUGC_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MyUGC_W.MyUGC_W_C
// 0x0040 (0x0300 - 0x02C0)
class UMyUGC_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CreateLevel_Image;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CreateLevels_Button;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Update_Image;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                UpdateWorkshopLevel_Button;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upload_Image;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                UploadNewWorkshopLevel_Button;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_50;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MyUGC_W_CreateLevel_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MyUGC_W_UpdateLevel_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MyUGC_W_UploadNewWorkshopLevel_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_MyUGC_W(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MyUGC_W_C">();
	}
	static class UMyUGC_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyUGC_W_C>();
	}
};
static_assert(alignof(UMyUGC_W_C) == 0x000008, "Wrong alignment on UMyUGC_W_C");
static_assert(sizeof(UMyUGC_W_C) == 0x000300, "Wrong size on UMyUGC_W_C");
static_assert(offsetof(UMyUGC_W_C, UberGraphFrame) == 0x0002C0, "Member 'UMyUGC_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMyUGC_W_C, CreateLevel_Image) == 0x0002C8, "Member 'UMyUGC_W_C::CreateLevel_Image' has a wrong offset!");
static_assert(offsetof(UMyUGC_W_C, CreateLevels_Button) == 0x0002D0, "Member 'UMyUGC_W_C::CreateLevels_Button' has a wrong offset!");
static_assert(offsetof(UMyUGC_W_C, Update_Image) == 0x0002D8, "Member 'UMyUGC_W_C::Update_Image' has a wrong offset!");
static_assert(offsetof(UMyUGC_W_C, UpdateWorkshopLevel_Button) == 0x0002E0, "Member 'UMyUGC_W_C::UpdateWorkshopLevel_Button' has a wrong offset!");
static_assert(offsetof(UMyUGC_W_C, Upload_Image) == 0x0002E8, "Member 'UMyUGC_W_C::Upload_Image' has a wrong offset!");
static_assert(offsetof(UMyUGC_W_C, UploadNewWorkshopLevel_Button) == 0x0002F0, "Member 'UMyUGC_W_C::UploadNewWorkshopLevel_Button' has a wrong offset!");
static_assert(offsetof(UMyUGC_W_C, WidgetSwitcher_50) == 0x0002F8, "Member 'UMyUGC_W_C::WidgetSwitcher_50' has a wrong offset!");

}

