#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "NiagaraCore_structs.hpp"
#include "NiagaraCore_classes.hpp"
#include "NiagaraShader_structs.hpp"
#include "NiagaraShader_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class Niagara.NDIRenderTargetVolumeSimCacheData
// 0x0018 (0x0040 - 0x0028)
class UNDIRenderTargetVolumeSimCacheData final : public UObject
{
public:
	class FName                                   CompressionType;                                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNDIRenderTargetVolumeSimCacheFrame> Frames;                                            // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NDIRenderTargetVolumeSimCacheData">();
	}
	static class UNDIRenderTargetVolumeSimCacheData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNDIRenderTargetVolumeSimCacheData>();
	}
};
static_assert(alignof(UNDIRenderTargetVolumeSimCacheData) == 0x000008, "Wrong alignment on UNDIRenderTargetVolumeSimCacheData");
static_assert(sizeof(UNDIRenderTargetVolumeSimCacheData) == 0x000040, "Wrong size on UNDIRenderTargetVolumeSimCacheData");
static_assert(offsetof(UNDIRenderTargetVolumeSimCacheData, CompressionType) == 0x000028, "Member 'UNDIRenderTargetVolumeSimCacheData::CompressionType' has a wrong offset!");
static_assert(offsetof(UNDIRenderTargetVolumeSimCacheData, Frames) == 0x000030, "Member 'UNDIRenderTargetVolumeSimCacheData::Frames' has a wrong offset!");

// Class Niagara.NiagaraConvertInPlaceUtilityBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraConvertInPlaceUtilityBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraConvertInPlaceUtilityBase">();
	}
	static class UNiagaraConvertInPlaceUtilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraConvertInPlaceUtilityBase>();
	}
};
static_assert(alignof(UNiagaraConvertInPlaceUtilityBase) == 0x000008, "Wrong alignment on UNiagaraConvertInPlaceUtilityBase");
static_assert(sizeof(UNiagaraConvertInPlaceUtilityBase) == 0x000028, "Wrong size on UNiagaraConvertInPlaceUtilityBase");

// Class Niagara.NiagaraDataChannelReader
// 0x0020 (0x0048 - 0x0028)
class UNiagaraDataChannelReader final : public UObject
{
public:
	uint8                                         Pad_2614[0x18];                                    // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraDataChannelHandler*             Owner;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool InitAccess(const struct FNiagaraDataChannelSearchParameters& SearchParams, bool bReadPrevFrameData);

	int32 Num() const;
	bool ReadBool(class FName VarName, int32 Param_Index) const;
	double ReadFloat(class FName VarName, int32 Param_Index) const;
	int32 ReadInt(class FName VarName, int32 Param_Index) const;
	struct FLinearColor ReadLinearColor(class FName VarName, int32 Param_Index) const;
	struct FVector ReadPosition(class FName VarName, int32 Param_Index) const;
	struct FQuat ReadQuat(class FName VarName, int32 Param_Index) const;
	struct FVector ReadVector(class FName VarName, int32 Param_Index) const;
	struct FVector2D ReadVector2D(class FName VarName, int32 Param_Index) const;
	struct FVector4 ReadVector4(class FName VarName, int32 Param_Index) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannelReader">();
	}
	static class UNiagaraDataChannelReader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelReader>();
	}
};
static_assert(alignof(UNiagaraDataChannelReader) == 0x000008, "Wrong alignment on UNiagaraDataChannelReader");
static_assert(sizeof(UNiagaraDataChannelReader) == 0x000048, "Wrong size on UNiagaraDataChannelReader");
static_assert(offsetof(UNiagaraDataChannelReader, Owner) == 0x000040, "Member 'UNiagaraDataChannelReader::Owner' has a wrong offset!");

// Class Niagara.NiagaraParameterCollectionInstance
// 0x00C8 (0x00F0 - 0x0028)
class UNiagaraParameterCollectionInstance final : public UObject
{
public:
	class UNiagaraParameterCollection*            Collection;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariable>               OverridenParameters;                               // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNiagaraParameterStore                 ParameterStorage;                                  // 0x0040(0x0088)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_261D[0x28];                                    // 0x00C8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetBoolParameter(const class FString& InVariableName);
	struct FLinearColor GetColorParameter(const class FString& InVariableName);
	float GetFloatParameter(const class FString& InVariableName);
	int32 GetIntParameter(const class FString& InVariableName);
	struct FQuat GetQuatParameter(const class FString& InVariableName);
	struct FVector2D GetVector2DParameter(const class FString& InVariableName);
	struct FVector4 GetVector4Parameter(const class FString& InVariableName);
	struct FVector GetVectorParameter(const class FString& InVariableName);
	void SetBoolParameter(const class FString& InVariableName, bool InValue);
	void SetColorParameter(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetFloatParameter(const class FString& InVariableName, float InValue);
	void SetIntParameter(const class FString& InVariableName, int32 InValue);
	void SetQuatParameter(const class FString& InVariableName, const struct FQuat& InValue);
	void SetVector2DParameter(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetVector4Parameter(const class FString& InVariableName, const struct FVector4& InValue);
	void SetVectorParameter(const class FString& InVariableName, const struct FVector& InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraParameterCollectionInstance">();
	}
	static class UNiagaraParameterCollectionInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraParameterCollectionInstance>();
	}
};
static_assert(alignof(UNiagaraParameterCollectionInstance) == 0x000008, "Wrong alignment on UNiagaraParameterCollectionInstance");
static_assert(sizeof(UNiagaraParameterCollectionInstance) == 0x0000F0, "Wrong size on UNiagaraParameterCollectionInstance");
static_assert(offsetof(UNiagaraParameterCollectionInstance, Collection) == 0x000028, "Member 'UNiagaraParameterCollectionInstance::Collection' has a wrong offset!");
static_assert(offsetof(UNiagaraParameterCollectionInstance, OverridenParameters) == 0x000030, "Member 'UNiagaraParameterCollectionInstance::OverridenParameters' has a wrong offset!");
static_assert(offsetof(UNiagaraParameterCollectionInstance, ParameterStorage) == 0x000040, "Member 'UNiagaraParameterCollectionInstance::ParameterStorage' has a wrong offset!");

// Class Niagara.NiagaraDataChannelWriter
// 0x0018 (0x0040 - 0x0028)
class UNiagaraDataChannelWriter final : public UObject
{
public:
	uint8                                         Pad_2624[0x10];                                    // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraDataChannelHandler*             Owner;                                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool InitWrite(const struct FNiagaraDataChannelSearchParameters& SearchParams, int32 Count, bool bVisibleToGame, bool bVisibleToCPU, bool bVisibleToGPU);
	void WriteBool(class FName VarName, int32 Param_Index, bool InData);
	void WriteFloat(class FName VarName, int32 Param_Index, double InData);
	void WriteInt(class FName VarName, int32 Param_Index, int32 InData);
	void WriteLinearColor(class FName VarName, int32 Param_Index, const struct FLinearColor& InData);
	void WritePosition(class FName VarName, int32 Param_Index, const struct FVector& InData);
	void WriteQuat(class FName VarName, int32 Param_Index, const struct FQuat& InData);
	void WriteSpawnInfo(class FName VarName, int32 Param_Index, const struct FNiagaraSpawnInfo& InData);
	void WriteVector(class FName VarName, int32 Param_Index, const struct FVector& InData);
	void WriteVector2D(class FName VarName, int32 Param_Index, const struct FVector2D& InData);
	void WriteVector4(class FName VarName, int32 Param_Index, const struct FVector4& InData);

	int32 Num() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannelWriter">();
	}
	static class UNiagaraDataChannelWriter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelWriter>();
	}
};
static_assert(alignof(UNiagaraDataChannelWriter) == 0x000008, "Wrong alignment on UNiagaraDataChannelWriter");
static_assert(sizeof(UNiagaraDataChannelWriter) == 0x000040, "Wrong size on UNiagaraDataChannelWriter");
static_assert(offsetof(UNiagaraDataChannelWriter, Owner) == 0x000038, "Member 'UNiagaraDataChannelWriter::Owner' has a wrong offset!");

// Class Niagara.NiagaraDataChannelHandler
// 0x0018 (0x0040 - 0x0028)
class UNiagaraDataChannelHandler : public UObject
{
public:
	TWeakObjectPtr<class UNiagaraDataChannel>     DataChannel;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraDataChannelWriter*              Writer;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraDataChannelReader*              Reader;                                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UNiagaraDataChannelReader* GetDataChannelReader();
	class UNiagaraDataChannelWriter* GetDataChannelWriter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannelHandler">();
	}
	static class UNiagaraDataChannelHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler>();
	}
};
static_assert(alignof(UNiagaraDataChannelHandler) == 0x000008, "Wrong alignment on UNiagaraDataChannelHandler");
static_assert(sizeof(UNiagaraDataChannelHandler) == 0x000040, "Wrong size on UNiagaraDataChannelHandler");
static_assert(offsetof(UNiagaraDataChannelHandler, DataChannel) == 0x000028, "Member 'UNiagaraDataChannelHandler::DataChannel' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannelHandler, Writer) == 0x000030, "Member 'UNiagaraDataChannelHandler::Writer' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannelHandler, Reader) == 0x000038, "Member 'UNiagaraDataChannelHandler::Reader' has a wrong offset!");

// Class Niagara.NiagaraDataChannelAsset
// 0x0008 (0x0030 - 0x0028)
class UNiagaraDataChannelAsset final : public UObject
{
public:
	class UNiagaraDataChannel*                    DataChannel;                                       // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannelAsset">();
	}
	static class UNiagaraDataChannelAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelAsset>();
	}
};
static_assert(alignof(UNiagaraDataChannelAsset) == 0x000008, "Wrong alignment on UNiagaraDataChannelAsset");
static_assert(sizeof(UNiagaraDataChannelAsset) == 0x000030, "Wrong size on UNiagaraDataChannelAsset");
static_assert(offsetof(UNiagaraDataChannelAsset, DataChannel) == 0x000028, "Member 'UNiagaraDataChannelAsset::DataChannel' has a wrong offset!");

// Class Niagara.NiagaraDataChannel
// 0x0108 (0x0130 - 0x0028)
class UNiagaraDataChannel : public UObject
{
public:
	TArray<struct FNiagaraVariable>               Variables;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bKeepPreviousFrameData;                            // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_262C[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraDataSetCompiledData            CompiledData;                                      // 0x0040(0x0048)(Transient, NativeAccessSpecifierPrivate)
	struct FNiagaraDataSetCompiledData            CompiledDataGPU;                                   // 0x0088(0x0048)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_262D[0x60];                                    // 0x00D0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannel">();
	}
	static class UNiagaraDataChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel>();
	}
};
static_assert(alignof(UNiagaraDataChannel) == 0x000008, "Wrong alignment on UNiagaraDataChannel");
static_assert(sizeof(UNiagaraDataChannel) == 0x000130, "Wrong size on UNiagaraDataChannel");
static_assert(offsetof(UNiagaraDataChannel, Variables) == 0x000028, "Member 'UNiagaraDataChannel::Variables' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel, bKeepPreviousFrameData) == 0x000038, "Member 'UNiagaraDataChannel::bKeepPreviousFrameData' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel, CompiledData) == 0x000040, "Member 'UNiagaraDataChannel::CompiledData' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel, CompiledDataGPU) == 0x000088, "Member 'UNiagaraDataChannel::CompiledDataGPU' has a wrong offset!");

// Class Niagara.NiagaraDataChannel_Global
// 0x0000 (0x0130 - 0x0130)
class UNiagaraDataChannel_Global final : public UNiagaraDataChannel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannel_Global">();
	}
	static class UNiagaraDataChannel_Global* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel_Global>();
	}
};
static_assert(alignof(UNiagaraDataChannel_Global) == 0x000008, "Wrong alignment on UNiagaraDataChannel_Global");
static_assert(sizeof(UNiagaraDataChannel_Global) == 0x000130, "Wrong size on UNiagaraDataChannel_Global");

// Class Niagara.NiagaraDataChannelHandler_Global
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataChannelHandler_Global final : public UNiagaraDataChannelHandler
{
public:
	uint8                                         Pad_262E[0x10];                                    // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannelHandler_Global">();
	}
	static class UNiagaraDataChannelHandler_Global* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler_Global>();
	}
};
static_assert(alignof(UNiagaraDataChannelHandler_Global) == 0x000008, "Wrong alignment on UNiagaraDataChannelHandler_Global");
static_assert(sizeof(UNiagaraDataChannelHandler_Global) == 0x000050, "Wrong size on UNiagaraDataChannelHandler_Global");

// Class Niagara.NiagaraRendererProperties
// 0x0098 (0x00C0 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0028(0x0030)(Edit, NativeAccessSpecifierPublic)
	int32                                         SortOrderHint;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRendererMotionVectorSetting           MotionVectorSetting;                               // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RendererEnabledBinding;                            // 0x0060(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInCullProxies;                               // 0x0099(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_262F[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  OuterEmitterVersion;                               // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2630[0x14];                                    // 0x00AC(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRendererProperties">();
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};
static_assert(alignof(UNiagaraRendererProperties) == 0x000008, "Wrong alignment on UNiagaraRendererProperties");
static_assert(sizeof(UNiagaraRendererProperties) == 0x0000C0, "Wrong size on UNiagaraRendererProperties");
static_assert(offsetof(UNiagaraRendererProperties, Platforms) == 0x000028, "Member 'UNiagaraRendererProperties::Platforms' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, SortOrderHint) == 0x000058, "Member 'UNiagaraRendererProperties::SortOrderHint' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, MotionVectorSetting) == 0x00005C, "Member 'UNiagaraRendererProperties::MotionVectorSetting' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, RendererEnabledBinding) == 0x000060, "Member 'UNiagaraRendererProperties::RendererEnabledBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bIsEnabled) == 0x000098, "Member 'UNiagaraRendererProperties::bIsEnabled' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bAllowInCullProxies) == 0x000099, "Member 'UNiagaraRendererProperties::bAllowInCullProxies' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, OuterEmitterVersion) == 0x00009C, "Member 'UNiagaraRendererProperties::OuterEmitterVersion' has a wrong offset!");

// Class Niagara.NiagaraLightRendererProperties
// 0x01E0 (0x02A0 - 0x00C0)
class UNiagaraLightRendererProperties final : public UNiagaraRendererProperties
{
public:
	ENiagaraRendererSourceDataMode                SourceMode;                                        // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2631[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUseInverseSquaredFalloff : 1;                     // 0x00C4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectsTranslucency : 1;                          // 0x00C4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlphaScalesBrightness : 1;                        // 0x00C4(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideInverseExposureBlend : 1;                 // 0x00C4(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2632[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RadiusScale;                                       // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultExponent;                                   // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              ColorAdd;                                          // 0x00D0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InverseExposureBlend;                              // 0x00DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RendererVisibility;                                // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2633[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       LightRenderingEnabledBinding;                      // 0x00E8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       LightExponentBinding;                              // 0x0120(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x0158(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ColorBinding;                                      // 0x0190(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RadiusBinding;                                     // 0x01C8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       VolumetricScatteringBinding;                       // 0x0200(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RendererVisibilityTagBinding;                      // 0x0238(0x0038)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_2634[0x30];                                    // 0x0270(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraLightRendererProperties">();
	}
	static class UNiagaraLightRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraLightRendererProperties>();
	}
};
static_assert(alignof(UNiagaraLightRendererProperties) == 0x000008, "Wrong alignment on UNiagaraLightRendererProperties");
static_assert(sizeof(UNiagaraLightRendererProperties) == 0x0002A0, "Wrong size on UNiagaraLightRendererProperties");
static_assert(offsetof(UNiagaraLightRendererProperties, SourceMode) == 0x0000C0, "Member 'UNiagaraLightRendererProperties::SourceMode' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, RadiusScale) == 0x0000C8, "Member 'UNiagaraLightRendererProperties::RadiusScale' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, DefaultExponent) == 0x0000CC, "Member 'UNiagaraLightRendererProperties::DefaultExponent' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, ColorAdd) == 0x0000D0, "Member 'UNiagaraLightRendererProperties::ColorAdd' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, InverseExposureBlend) == 0x0000DC, "Member 'UNiagaraLightRendererProperties::InverseExposureBlend' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, RendererVisibility) == 0x0000E0, "Member 'UNiagaraLightRendererProperties::RendererVisibility' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, LightRenderingEnabledBinding) == 0x0000E8, "Member 'UNiagaraLightRendererProperties::LightRenderingEnabledBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, LightExponentBinding) == 0x000120, "Member 'UNiagaraLightRendererProperties::LightExponentBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, PositionBinding) == 0x000158, "Member 'UNiagaraLightRendererProperties::PositionBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, ColorBinding) == 0x000190, "Member 'UNiagaraLightRendererProperties::ColorBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, RadiusBinding) == 0x0001C8, "Member 'UNiagaraLightRendererProperties::RadiusBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, VolumetricScatteringBinding) == 0x000200, "Member 'UNiagaraLightRendererProperties::VolumetricScatteringBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, RendererVisibilityTagBinding) == 0x000238, "Member 'UNiagaraLightRendererProperties::RendererVisibilityTagBinding' has a wrong offset!");

// Class Niagara.NiagaraDataChannel_Islands
// 0x0078 (0x01A8 - 0x0130)
class UNiagaraDataChannel_Islands final : public UNiagaraDataChannel
{
public:
	ENiagraDataChannel_IslandMode                 Mode;                                              // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2635[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialExtents;                                    // 0x0138(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                MaxExtents;                                        // 0x0150(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                PerElementExtents;                                 // 0x0168(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class UNiagaraSystem>>  Systems;                                           // 0x0180(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	int32                                         IslandPoolSize;                                    // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNDCIslandDebugDrawSettings            DebugDrawSettings;                                 // 0x0194(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<class UNiagaraSystem*>                 SystemsInternal;                                   // 0x0198(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannel_Islands">();
	}
	static class UNiagaraDataChannel_Islands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel_Islands>();
	}
};
static_assert(alignof(UNiagaraDataChannel_Islands) == 0x000008, "Wrong alignment on UNiagaraDataChannel_Islands");
static_assert(sizeof(UNiagaraDataChannel_Islands) == 0x0001A8, "Wrong size on UNiagaraDataChannel_Islands");
static_assert(offsetof(UNiagaraDataChannel_Islands, Mode) == 0x000130, "Member 'UNiagaraDataChannel_Islands::Mode' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel_Islands, InitialExtents) == 0x000138, "Member 'UNiagaraDataChannel_Islands::InitialExtents' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel_Islands, MaxExtents) == 0x000150, "Member 'UNiagaraDataChannel_Islands::MaxExtents' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel_Islands, PerElementExtents) == 0x000168, "Member 'UNiagaraDataChannel_Islands::PerElementExtents' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel_Islands, Systems) == 0x000180, "Member 'UNiagaraDataChannel_Islands::Systems' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel_Islands, IslandPoolSize) == 0x000190, "Member 'UNiagaraDataChannel_Islands::IslandPoolSize' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel_Islands, DebugDrawSettings) == 0x000194, "Member 'UNiagaraDataChannel_Islands::DebugDrawSettings' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannel_Islands, SystemsInternal) == 0x000198, "Member 'UNiagaraDataChannel_Islands::SystemsInternal' has a wrong offset!");

// Class Niagara.NiagaraDataChannelHandler_Islands
// 0x0030 (0x0070 - 0x0040)
class UNiagaraDataChannelHandler_Islands final : public UNiagaraDataChannelHandler
{
public:
	TArray<int32>                                 ActiveIslands;                                     // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<int32>                                 FreeIslands;                                       // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FNDCIsland>                     IslandPool;                                        // 0x0060(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataChannelHandler_Islands">();
	}
	static class UNiagaraDataChannelHandler_Islands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler_Islands>();
	}
};
static_assert(alignof(UNiagaraDataChannelHandler_Islands) == 0x000008, "Wrong alignment on UNiagaraDataChannelHandler_Islands");
static_assert(sizeof(UNiagaraDataChannelHandler_Islands) == 0x000070, "Wrong size on UNiagaraDataChannelHandler_Islands");
static_assert(offsetof(UNiagaraDataChannelHandler_Islands, ActiveIslands) == 0x000040, "Member 'UNiagaraDataChannelHandler_Islands::ActiveIslands' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannelHandler_Islands, FreeIslands) == 0x000050, "Member 'UNiagaraDataChannelHandler_Islands::FreeIslands' has a wrong offset!");
static_assert(offsetof(UNiagaraDataChannelHandler_Islands, IslandPool) == 0x000060, "Member 'UNiagaraDataChannelHandler_Islands::IslandPool' has a wrong offset!");

// Class Niagara.NiagaraPreviewAxis
// 0x0000 (0x0028 - 0x0028)
class UNiagaraPreviewAxis : public UObject
{
public:
	void ApplyToPreview(class UNiagaraComponent* PreviewComponent, int32 PreviewIndex, bool bIsXAxis, class FString* OutLabelText);
	int32 Num();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraPreviewAxis">();
	}
	static class UNiagaraPreviewAxis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraPreviewAxis>();
	}
};
static_assert(alignof(UNiagaraPreviewAxis) == 0x000008, "Wrong alignment on UNiagaraPreviewAxis");
static_assert(sizeof(UNiagaraPreviewAxis) == 0x000028, "Wrong size on UNiagaraPreviewAxis");

// Class Niagara.NiagaraPreviewAxis_InterpParamBase
// 0x0010 (0x0038 - 0x0028)
class UNiagaraPreviewAxis_InterpParamBase : public UNiagaraPreviewAxis
{
public:
	class FName                                   Param;                                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Count;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2637[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraPreviewAxis_InterpParamBase">();
	}
	static class UNiagaraPreviewAxis_InterpParamBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraPreviewAxis_InterpParamBase>();
	}
};
static_assert(alignof(UNiagaraPreviewAxis_InterpParamBase) == 0x000008, "Wrong alignment on UNiagaraPreviewAxis_InterpParamBase");
static_assert(sizeof(UNiagaraPreviewAxis_InterpParamBase) == 0x000038, "Wrong size on UNiagaraPreviewAxis_InterpParamBase");
static_assert(offsetof(UNiagaraPreviewAxis_InterpParamBase, Param) == 0x000028, "Member 'UNiagaraPreviewAxis_InterpParamBase::Param' has a wrong offset!");
static_assert(offsetof(UNiagaraPreviewAxis_InterpParamBase, Count) == 0x000030, "Member 'UNiagaraPreviewAxis_InterpParamBase::Count' has a wrong offset!");

// Class Niagara.NiagaraDataInterface
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	uint8                                         Pad_2638[0x10];                                    // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterface">();
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
static_assert(alignof(UNiagaraDataInterface) == 0x000008, "Wrong alignment on UNiagaraDataInterface");
static_assert(sizeof(UNiagaraDataInterface) == 0x000038, "Wrong size on UNiagaraDataInterface");

// Class Niagara.NiagaraDataInterfaceRWBase
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRWBase">();
	}
	static class UNiagaraDataInterfaceRWBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRWBase>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRWBase) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRWBase");
static_assert(sizeof(UNiagaraDataInterfaceRWBase) == 0x000038, "Wrong size on UNiagaraDataInterfaceRWBase");

// Class Niagara.NiagaraBaselineController
// 0x0040 (0x0068 - 0x0028)
class UNiagaraBaselineController : public UObject
{
public:
	float                                         TestDuration;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2639[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraEffectType*                     EffectType;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANiagaraPerfBaselineActor*              Owner;                                             // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNiagaraSystem>          System;                                            // 0x0040(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UNiagaraSystem* GetSystem();
	void OnBeginTest();
	void OnEndTest(const struct FNiagaraPerfBaselineStats& Stats);
	void OnOwnerTick(float DeltaTime);
	bool OnTickTest();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraBaselineController">();
	}
	static class UNiagaraBaselineController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraBaselineController>();
	}
};
static_assert(alignof(UNiagaraBaselineController) == 0x000008, "Wrong alignment on UNiagaraBaselineController");
static_assert(sizeof(UNiagaraBaselineController) == 0x000068, "Wrong size on UNiagaraBaselineController");
static_assert(offsetof(UNiagaraBaselineController, TestDuration) == 0x000028, "Member 'UNiagaraBaselineController::TestDuration' has a wrong offset!");
static_assert(offsetof(UNiagaraBaselineController, EffectType) == 0x000030, "Member 'UNiagaraBaselineController::EffectType' has a wrong offset!");
static_assert(offsetof(UNiagaraBaselineController, Owner) == 0x000038, "Member 'UNiagaraBaselineController::Owner' has a wrong offset!");
static_assert(offsetof(UNiagaraBaselineController, System) == 0x000040, "Member 'UNiagaraBaselineController::System' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceDataChannelRead
// 0x0088 (0x00C0 - 0x0038)
class UNiagaraDataInterfaceDataChannelRead final : public UNiagaraDataInterfaceRWBase
{
public:
	class UNiagaraDataChannelAsset*               Channel;                                           // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraDataInterfaceEmitterBinding    EmitterBinding;                                    // 0x0040(0x000C)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bReadCurrentFrame;                                 // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateSourceDataEveryTick;                        // 0x004D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSpawnGroupToDataChannelIndex;             // 0x004E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_263A[0x1];                                     // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SpawnInfoName;                                     // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNDIDataChannelCompiledData            CompiledData;                                      // 0x0058(0x0068)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceDataChannelRead">();
	}
	static class UNiagaraDataInterfaceDataChannelRead* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceDataChannelRead>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceDataChannelRead) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceDataChannelRead");
static_assert(sizeof(UNiagaraDataInterfaceDataChannelRead) == 0x0000C0, "Wrong size on UNiagaraDataInterfaceDataChannelRead");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelRead, Channel) == 0x000038, "Member 'UNiagaraDataInterfaceDataChannelRead::Channel' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelRead, EmitterBinding) == 0x000040, "Member 'UNiagaraDataInterfaceDataChannelRead::EmitterBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelRead, bReadCurrentFrame) == 0x00004C, "Member 'UNiagaraDataInterfaceDataChannelRead::bReadCurrentFrame' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelRead, bUpdateSourceDataEveryTick) == 0x00004D, "Member 'UNiagaraDataInterfaceDataChannelRead::bUpdateSourceDataEveryTick' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelRead, bOverrideSpawnGroupToDataChannelIndex) == 0x00004E, "Member 'UNiagaraDataInterfaceDataChannelRead::bOverrideSpawnGroupToDataChannelIndex' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelRead, SpawnInfoName) == 0x000050, "Member 'UNiagaraDataInterfaceDataChannelRead::SpawnInfoName' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelRead, CompiledData) == 0x000058, "Member 'UNiagaraDataInterfaceDataChannelRead::CompiledData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceDataChannelWrite
// 0x00C8 (0x0100 - 0x0038)
class UNiagaraDataInterfaceDataChannelWrite final : public UNiagaraDataInterface
{
public:
	ENiagaraDataChannelAllocationMode             AllocationMode;                                    // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_263B[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        AllocationCount;                                   // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPublishToGame;                                    // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPublishToCPU;                                     // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPublishToGPU;                                     // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateDestinationDataEveryTick;                   // 0x0043(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_263C[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraDataChannelAsset*               Channel;                                           // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNDIDataChannelWriteCompiledData       CompiledData;                                      // 0x0050(0x00B0)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceDataChannelWrite">();
	}
	static class UNiagaraDataInterfaceDataChannelWrite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceDataChannelWrite>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceDataChannelWrite) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceDataChannelWrite");
static_assert(sizeof(UNiagaraDataInterfaceDataChannelWrite) == 0x000100, "Wrong size on UNiagaraDataInterfaceDataChannelWrite");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelWrite, AllocationMode) == 0x000038, "Member 'UNiagaraDataInterfaceDataChannelWrite::AllocationMode' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelWrite, AllocationCount) == 0x00003C, "Member 'UNiagaraDataInterfaceDataChannelWrite::AllocationCount' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelWrite, bPublishToGame) == 0x000040, "Member 'UNiagaraDataInterfaceDataChannelWrite::bPublishToGame' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelWrite, bPublishToCPU) == 0x000041, "Member 'UNiagaraDataInterfaceDataChannelWrite::bPublishToCPU' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelWrite, bPublishToGPU) == 0x000042, "Member 'UNiagaraDataInterfaceDataChannelWrite::bPublishToGPU' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelWrite, bUpdateDestinationDataEveryTick) == 0x000043, "Member 'UNiagaraDataInterfaceDataChannelWrite::bUpdateDestinationDataEveryTick' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelWrite, Channel) == 0x000048, "Member 'UNiagaraDataInterfaceDataChannelWrite::Channel' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceDataChannelWrite, CompiledData) == 0x000050, "Member 'UNiagaraDataInterfaceDataChannelWrite::CompiledData' has a wrong offset!");

// Class Niagara.NiagaraFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 AcquireNiagaraGPURayTracedCollisionGroup(class UObject* WorldContextObject);
	static class UNiagaraParameterCollectionInstance* GetNiagaraParameterCollection(class UObject* WorldContextObject, class UNiagaraParameterCollection* Collection);
	static void OverrideSystemUserVariableSkeletalMeshComponent(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class USkeletalMeshComponent* SkeletalMeshComponent);
	static void OverrideSystemUserVariableStaticMesh(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class UStaticMesh* StaticMesh);
	static void OverrideSystemUserVariableStaticMeshComponent(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class UStaticMeshComponent* StaticMeshComponent);
	static void ReleaseNiagaraGPURayTracedCollisionGroup(class UObject* WorldContextObject, int32 CollisionGroup);
	static void SetActorNiagaraGPURayTracedCollisionGroup(class UObject* WorldContextObject, class AActor* Actor, int32 CollisionGroup);
	static void SetComponentNiagaraGPURayTracedCollisionGroup(class UObject* WorldContextObject, class UPrimitiveComponent* Primitive, int32 CollisionGroup);
	static void SetSkeletalMeshDataInterfaceFilteredBones(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, const TArray<class FName>& FilteredBones);
	static void SetSkeletalMeshDataInterfaceFilteredSockets(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, const TArray<class FName>& FilteredSockets);
	static void SetSkeletalMeshDataInterfaceSamplingRegions(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, const TArray<class FName>& SamplingRegions);
	static void SetTexture2DArrayObject(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class UTexture2DArray* Texture);
	static void SetTextureObject(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class UTexture* Texture);
	static void SetVolumeTextureObject(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class UVolumeTexture* Texture);
	static class UNiagaraComponent* SpawnSystemAtLocation(const class UObject* WorldContextObject, class UNiagaraSystem* SystemTemplate, const struct FVector& Location, const struct FRotator& Rotation, const struct FVector& Scale, bool bAutoDestroy, bool bAutoActivate, ENCPoolMethod PoolingMethod, bool bPreCullCheck);
	static class UNiagaraComponent* SpawnSystemAtLocationWithParams(const struct FFXSystemSpawnParameters& SpawnParams);
	static class UNiagaraComponent* SpawnSystemAttached(class UNiagaraSystem* SystemTemplate, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, EAttachLocation LocationType, bool bAutoDestroy, bool bAutoActivate, ENCPoolMethod PoolingMethod, bool bPreCullCheck);
	static class UNiagaraComponent* SpawnSystemAttachedWithParams(const struct FFXSystemSpawnParameters& SpawnParams);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraFunctionLibrary">();
	}
	static class UNiagaraFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraFunctionLibrary>();
	}
};
static_assert(alignof(UNiagaraFunctionLibrary) == 0x000008, "Wrong alignment on UNiagaraFunctionLibrary");
static_assert(sizeof(UNiagaraFunctionLibrary) == 0x000028, "Wrong size on UNiagaraFunctionLibrary");

// Class Niagara.NiagaraMessageDataBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraMessageDataBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraMessageDataBase">();
	}
	static class UNiagaraMessageDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraMessageDataBase>();
	}
};
static_assert(alignof(UNiagaraMessageDataBase) == 0x000008, "Wrong alignment on UNiagaraMessageDataBase");
static_assert(sizeof(UNiagaraMessageDataBase) == 0x000028, "Wrong size on UNiagaraMessageDataBase");

// Class Niagara.NiagaraParameterDefinitionsBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraParameterDefinitionsBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraParameterDefinitionsBase">();
	}
	static class UNiagaraParameterDefinitionsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraParameterDefinitionsBase>();
	}
};
static_assert(alignof(UNiagaraParameterDefinitionsBase) == 0x000008, "Wrong alignment on UNiagaraParameterDefinitionsBase");
static_assert(sizeof(UNiagaraParameterDefinitionsBase) == 0x000028, "Wrong size on UNiagaraParameterDefinitionsBase");

// Class Niagara.NiagaraPreviewBase
// 0x0000 (0x0298 - 0x0298)
class ANiagaraPreviewBase final : public AActor
{
public:
	void SetLabelText(const class FText& InXAxisText, const class FText& InYAxisText);
	void SetSystem(class UNiagaraSystem* InSystem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraPreviewBase">();
	}
	static class ANiagaraPreviewBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraPreviewBase>();
	}
};
static_assert(alignof(ANiagaraPreviewBase) == 0x000008, "Wrong alignment on ANiagaraPreviewBase");
static_assert(sizeof(ANiagaraPreviewBase) == 0x000298, "Wrong size on ANiagaraPreviewBase");

// Class Niagara.NiagaraRenderableMeshInterface
// 0x0000 (0x0028 - 0x0028)
class INiagaraRenderableMeshInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRenderableMeshInterface">();
	}
	static class INiagaraRenderableMeshInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<INiagaraRenderableMeshInterface>();
	}
};
static_assert(alignof(INiagaraRenderableMeshInterface) == 0x000008, "Wrong alignment on INiagaraRenderableMeshInterface");
static_assert(sizeof(INiagaraRenderableMeshInterface) == 0x000028, "Wrong size on INiagaraRenderableMeshInterface");

// Class Niagara.NiagaraScriptSourceBase
// 0x0020 (0x0048 - 0x0028)
class UNiagaraScriptSourceBase final : public UObject
{
public:
	uint8                                         Pad_2643[0x20];                                    // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraScriptSourceBase">();
	}
	static class UNiagaraScriptSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraScriptSourceBase>();
	}
};
static_assert(alignof(UNiagaraScriptSourceBase) == 0x000008, "Wrong alignment on UNiagaraScriptSourceBase");
static_assert(sizeof(UNiagaraScriptSourceBase) == 0x000048, "Wrong size on UNiagaraScriptSourceBase");

// Class Niagara.NiagaraRibbonRendererProperties
// 0x06A8 (0x0768 - 0x00C0)
class UNiagaraRibbonRendererProperties final : public UNiagaraRendererProperties
{
public:
	class UMaterialInterface*                     Material;                                          // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraUserParameterBinding           MaterialUserParamBinding;                          // 0x00C8(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraRibbonUVSettings               UV0Settings;                                       // 0x00E8(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FNiagaraRibbonUVSettings               UV1Settings;                                       // 0x0110(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ENiagaraRibbonFacingMode                      FacingMode;                                        // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2644[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxNumRibbons;                                     // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonDrawDirection                   DrawDirection;                                     // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonShapeMode                       Shape;                                             // 0x0141(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableAccurateGeometry : 1;                       // 0x0142(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMaterialBackfaceCulling : 1;                   // 0x0142(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseGPUInit : 1;                                   // 0x0142(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseConstantFactor : 1;                            // 0x0142(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bScreenSpaceTessellation : 1;                      // 0x0142(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLinkOrderUseUniqueID : 1;                         // 0x0142(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2645[0x1];                                     // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WidthSegmentationCount;                            // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MultiPlaneCount;                                   // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TubeSubdivisions;                                  // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraRibbonShapeCustomVertex> CustomVertices;                                    // 0x0150(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ENiagaraRibbonTessellationMode                TessellationMode;                                  // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2646[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurveTension;                                      // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TessellationFactor;                                // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TessellationAngle;                                 // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x0170(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ColorBinding;                                      // 0x01A8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       VelocityBinding;                                   // 0x01E0(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       NormalizedAgeBinding;                              // 0x0218(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonTwistBinding;                                // 0x0250(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonWidthBinding;                                // 0x0288(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonFacingBinding;                               // 0x02C0(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonIdBinding;                                   // 0x02F8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonLinkOrderBinding;                            // 0x0330(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       MaterialRandomBinding;                             // 0x0368(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterialBinding;                            // 0x03A0(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial1Binding;                           // 0x03D8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial2Binding;                           // 0x0410(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial3Binding;                           // 0x0448(0x0038)(Edit, NativeAccessSpecifierPublic)
