#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NiagaraCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "NiagaraShader_structs.hpp"


namespace SDK
{

// Enum Niagara.ENiagaraSimCacheAttributeCaptureMode
// NumValues: 0x0004
enum class ENiagaraSimCacheAttributeCaptureMode : uint8
{
	All                                      = 0,
	RenderingOnly                            = 1,
	ExplicitAttributes                       = 2,
	ENiagaraSimCacheAttributeCaptureMode_MAX = 3,
};

// Enum Niagara.ENiagaraCollisionMode
// NumValues: 0x0005
enum class ENiagaraCollisionMode : uint8
{
	None                                     = 0,
	SceneGeometry                            = 1,
	DepthBuffer                              = 2,
	DistanceField                            = 3,
	ENiagaraCollisionMode_MAX                = 4,
};

// Enum Niagara.ENiagaraBaseTypes
// NumValues: 0x0005
enum class ENiagaraBaseTypes : uint8
{
	Half                                     = 0,
	Float                                    = 1,
	Int32                                    = 2,
	Bool                                     = 3,
	Max                                      = 4,
};

// Enum Niagara.ENiagaraGpuBufferFormat
// NumValues: 0x0004
enum class ENiagaraGpuBufferFormat : uint8
{
	Float                                    = 0,
	HalfFloat                                = 1,
	UnsignedNormalizedByte                   = 2,
	Max                                      = 3,
};

// Enum Niagara.ENiagaraGpuSyncMode
// NumValues: 0x0005
enum class ENiagaraGpuSyncMode : uint32
{
	None                                     = 0,
	SyncCpuToGpu                             = 1,
	SyncGpuToCpu                             = 2,
	SyncBoth                                 = 3,
	ENiagaraGpuSyncMode_MAX                  = 4,
};

// Enum Niagara.ENiagaraMipMapGeneration
// NumValues: 0x0004
enum class ENiagaraMipMapGeneration : uint8
{
	Disabled                                 = 0,
	PostStage                                = 1,
	PostSimulate                             = 2,
	ENiagaraMipMapGeneration_MAX             = 3,
};

// Enum Niagara.ENiagaraDefaultMode
// NumValues: 0x0005
enum class ENiagaraDefaultMode : uint8
{
	Value                                    = 0,
	Binding                                  = 1,
	Custom                                   = 2,
	FailIfPreviouslyNotSet                   = 3,
	ENiagaraDefaultMode_MAX                  = 4,
};

// Enum Niagara.ENiagaraDefaultRendererMotionVectorSetting
// NumValues: 0x0003
enum class ENiagaraDefaultRendererMotionVectorSetting : uint32
{
	Precise                                  = 0,
	Approximate                              = 1,
	ENiagaraDefaultRendererMotionVectorSetting_MAX = 2,
};

// Enum Niagara.ENiagaraRendererMotionVectorSetting
// NumValues: 0x0005
enum class ENiagaraRendererMotionVectorSetting : uint32
{
	AutoDetect                               = 0,
	Precise                                  = 1,
	Approximate                              = 2,
	Disable                                  = 3,
	ENiagaraRendererMotionVectorSetting_MAX  = 4,
};

// Enum Niagara.ENiagaraSimTarget
// NumValues: 0x0003
enum class ENiagaraSimTarget : uint8
{
	CPUSim                                   = 0,
	GPUComputeSim                            = 1,
	ENiagaraSimTarget_MAX                    = 2,
};

// Enum Niagara.ENiagaraAgeUpdateMode
// NumValues: 0x0004
enum class ENiagaraAgeUpdateMode : uint8
{
	TickDeltaTime                            = 0,
	DesiredAge                               = 1,
	DesiredAgeNoSeek                         = 2,
	ENiagaraAgeUpdateMode_MAX                = 3,
};

// Enum Niagara.ENiagaraStatEvaluationType
// NumValues: 0x0003
enum class ENiagaraStatEvaluationType : uint8
{
	Average                                  = 0,
	Maximum                                  = 1,
	ENiagaraStatEvaluationType_MAX           = 2,
};

// Enum Niagara.ENiagaraStatDisplayMode
// NumValues: 0x0003
enum class ENiagaraStatDisplayMode : uint8
{
	Percent                                  = 0,
	Absolute                                 = 1,
	ENiagaraStatDisplayMode_MAX              = 2,
};

// Enum Niagara.ENiagaraDataSetType
// NumValues: 0x0004
enum class ENiagaraDataSetType : uint8
{
	ParticleData                             = 0,
	Shared                                   = 1,
	Event                                    = 2,
	ENiagaraDataSetType_MAX                  = 3,
};

// Enum Niagara.ENiagaraInputNodeUsage
// NumValues: 0x0007
enum class ENiagaraInputNodeUsage : uint8
{
	Undefined                                = 0,
	Parameter                                = 1,
	Attribute                                = 2,
	SystemConstant                           = 3,
	TranslatorConstant                       = 4,
	RapidIterationParameter                  = 5,
	ENiagaraInputNodeUsage_MAX               = 6,
};

// Enum Niagara.ENiagaraScriptCompileStatus
// NumValues: 0x0008
enum class ENiagaraScriptCompileStatus : uint8
{
	NCS_Unknown                              = 0,
	NCS_Dirty                                = 1,
	NCS_Error                                = 2,
	NCS_UpToDate                             = 3,
	NCS_BeingCreated                         = 4,
	NCS_UpToDateWithWarnings                 = 5,
	NCS_ComputeUpToDateWithWarnings          = 6,
	NCS_MAX                                  = 7,
};

// Enum Niagara.ENiagaraScriptUsage
// NumValues: 0x000E
enum class ENiagaraScriptUsage : uint8
{
	Function                                 = 0,
	Module                                   = 1,
	DynamicInput                             = 2,
	ParticleSpawnScript                      = 3,
	ParticleSpawnScriptInterpolated          = 4,
	ParticleUpdateScript                     = 5,
	ParticleEventScript                      = 6,
	ParticleSimulationStageScript            = 7,
	ParticleGPUComputeScript                 = 8,
	EmitterSpawnScript                       = 9,
	EmitterUpdateScript                      = 10,
	SystemSpawnScript                        = 11,
	SystemUpdateScript                       = 12,
	ENiagaraScriptUsage_MAX                  = 13,
};

// Enum Niagara.ENiagaraCompileUsageStaticSwitch
// NumValues: 0x0006
enum class ENiagaraCompileUsageStaticSwitch : uint8
{
	Spawn                                    = 0,
	Update                                   = 1,
	Event                                    = 2,
	SimulationStage                          = 3,
	Default                                  = 4,
	ENiagaraCompileUsageStaticSwitch_MAX     = 5,
};

// Enum Niagara.ENiagaraScriptContextStaticSwitch
// NumValues: 0x0004
enum class ENiagaraScriptContextStaticSwitch : uint8
{
	System                                   = 0,
	Emitter                                  = 1,
	Particle                                 = 2,
	ENiagaraScriptContextStaticSwitch_MAX    = 3,
};

// Enum Niagara.ENiagaraScriptGroup
// NumValues: 0x0004
enum class ENiagaraScriptGroup : uint8
{
	Particle                                 = 0,
	Emitter                                  = 1,
	System                                   = 2,
	Max                                      = 3,
};

// Enum Niagara.ENiagaraBindingSource
// NumValues: 0x0007
enum class ENiagaraBindingSource : uint8
{
	ImplicitFromSource                       = 0,
	ExplicitParticles                        = 1,
	ExplicitEmitter                          = 2,
	ExplicitSystem                           = 3,
	ExplicitUser                             = 4,
	MaxBindingSource                         = 5,
	ENiagaraBindingSource_MAX                = 6,
};

// Enum Niagara.ENiagaraRendererSourceDataMode
// NumValues: 0x0003
enum class ENiagaraRendererSourceDataMode : uint8
{
	Particles                                = 0,
	Emitter                                  = 1,
	ENiagaraRendererSourceDataMode_MAX       = 2,
};

// Enum Niagara.ENiagaraLegacyTrailWidthMode
// NumValues: 0x0004
enum class ENiagaraLegacyTrailWidthMode : uint8
{
	FromCentre                               = 0,
	FromFirst                                = 1,
	FromSecond                               = 2,
	ENiagaraLegacyTrailWidthMode_MAX         = 3,
};

// Enum Niagara.ENiagaraSystemInstanceState
// NumValues: 0x0008
enum class ENiagaraSystemInstanceState : uint8
{
	None                                     = 0,
	PendingSpawn                             = 1,
	PendingSpawnPaused                       = 2,
	Spawning                                 = 3,
	Running                                  = 4,
	Paused                                   = 5,
	Num                                      = 6,
	ENiagaraSystemInstanceState_MAX          = 7,
};

// Enum Niagara.ENiagaraFunctionDebugState
// NumValues: 0x0003
enum class ENiagaraFunctionDebugState : uint8
{
	NoDebug                                  = 0,
	Basic                                    = 1,
	ENiagaraFunctionDebugState_MAX           = 2,
};

// Enum Niagara.ENiagaraGpuComputeTickStage
// NumValues: 0x0006
enum class ENiagaraGpuComputeTickStage : uint8
{
	PreInitViews                             = 0,
	PostInitViews                            = 1,
	PostOpaqueRender                         = 2,
	Max                                      = 3,
	First                                    = 0,
	Last                                     = 2,
};

// Enum Niagara.ENiagaraConditionalOperator
// NumValues: 0x0007
enum class ENiagaraConditionalOperator : uint8
{
	Equals                                   = 0,
	NotEqual                                 = 1,
	LessThan                                 = 2,
	LessThanOrEqual                          = 3,
	GreaterThan                              = 4,
	GreaterThanOrEqual                       = 5,
	Max                                      = 6,
};

// Enum Niagara.ENCPoolMethod
// NumValues: 0x0006
enum class ENCPoolMethod : uint8
{
	None                                     = 0,
	AutoRelease                              = 1,
	ManualRelease                            = 2,
	ManualRelease_OnComplete                 = 3,
	FreeInPool                               = 4,
	ENCPoolMethod_MAX                        = 5,
};

// Enum Niagara.ENiagraDataChannel_IslandMode
// NumValues: 0x0003
enum class ENiagraDataChannel_IslandMode : uint8
{
	AlignedStatic                            = 0,
	Dynamic                                  = 1,
	ENiagraDataChannel_MAX                   = 2,
};

// Enum Niagara.ENiagaraDataChannelAllocationMode
// NumValues: 0x0002
enum class ENiagaraDataChannelAllocationMode : uint8
{
	Static                                   = 0,
	ENiagaraDataChannelAllocationMode_MAX    = 1,
};

// Enum Niagara.ENDIDataChannelSpawnMode
// NumValues: 0x0004
enum class ENDIDataChannelSpawnMode : uint8
{
	Override                                 = 0,
	Accumulate                               = 1,
	None                                     = 2,
	Max                                      = 3,
};

// Enum Niagara.ENiagaraSortMode
// NumValues: 0x0006
enum class ENiagaraSortMode : uint8
{
	None                                     = 0,
	ViewDepth                                = 1,
	ViewDistance                             = 2,
	CustomAscending                          = 3,
	CustomDecending                          = 4,
	ENiagaraSortMode_MAX                     = 5,
};

// Enum Niagara.ENDISkelMesh_GpuMaxInfluences
// NumValues: 0x0004
enum class ENDISkelMesh_GpuMaxInfluences : uint8
{
	AllowMax4                                = 0,
	AllowMax8                                = 1,
	Unlimited                                = 2,
	ENDISkelMesh_MAX                         = 3,
};

// Enum Niagara.ENDISkelMesh_GpuUniformSamplingFormat
// NumValues: 0x0004
enum class ENDISkelMesh_GpuUniformSamplingFormat : uint8
{
	Full                                     = 0,
	Limited_24_8                             = 1,
	Limited_23_9                             = 2,
	ENDISkelMesh_MAX                         = 3,
};

// Enum Niagara.ENDISkelMesh_AdjacencyTriangleIndexFormat
// NumValues: 0x0003
enum class ENDISkelMesh_AdjacencyTriangleIndexFormat : uint8
{
	Full                                     = 0,
	Half                                     = 1,
	ENDISkelMesh_MAX                         = 2,
};

// Enum Niagara.ENiagaraDefaultRendererPixelCoverageMode
// NumValues: 0x0003
enum class ENiagaraDefaultRendererPixelCoverageMode : uint8
{
	Enabled                                  = 0,
	Disabled                                 = 1,
	ENiagaraDefaultRendererPixelCoverageMode_MAX = 2,
};

// Enum Niagara.ENiagaraDefaultSortPrecision
// NumValues: 0x0003
enum class ENiagaraDefaultSortPrecision : uint8
{
	Low                                      = 0,
	High                                     = 1,
	ENiagaraDefaultSortPrecision_MAX         = 2,
};

// Enum Niagara.ENiagaraDefaultGpuTranslucentLatency
// NumValues: 0x0003
enum class ENiagaraDefaultGpuTranslucentLatency : uint8
{
	Immediate                                = 0,
	Latent                                   = 1,
	ENiagaraDefaultGpuTranslucentLatency_MAX = 2,
};

// Enum Niagara.ENDICollisionQuery_AsyncGpuTraceProvider
// NumValues: 0x0005
enum class ENDICollisionQuery_AsyncGpuTraceProvider : uint8
{
	Default                                  = 0,
	HWRT                                     = 1,
	GSDF                                     = 2,
	None                                     = 3,
	ENDICollisionQuery_MAX                   = 4,
};

// Enum Niagara.ENiagaraTickBehavior
// NumValues: 0x0005
enum class ENiagaraTickBehavior : uint8
{
	UsePrereqs                               = 0,
	UseComponentTickGroup                    = 1,
	ForceTickFirst                           = 2,
	ForceTickLast                            = 3,
	ENiagaraTickBehavior_MAX                 = 4,
};

// Enum Niagara.ENDIActorComponentSourceMode
// NumValues: 0x0004
enum class ENDIActorComponentSourceMode : uint8
{
	Default                                  = 0,
	AttachParent                             = 1,
	LocalPlayer                              = 2,
	ENDIActorComponentSourceMode_MAX         = 3,
};

// Enum Niagara.ENDISceneCapture2DSourceMode
// NumValues: 0x0005
enum class ENDISceneCapture2DSourceMode : uint8
{
	UserParameterThenAttachParent            = 0,
	UserParameterOnly                        = 1,
	AttachParentOnly                         = 2,
	Managed                                  = 3,
	ENDISceneCapture2DSourceMode_MAX         = 4,
};

// Enum Niagara.ENDISceneCapture2DOffsetMode
// NumValues: 0x0005
enum class ENDISceneCapture2DOffsetMode : uint8
{
	Disabled                                 = 0,
	RelativeLocal                            = 1,
	RelativeWorld                            = 2,
	AbsoluteWorld                            = 3,
	ENDISceneCapture2DOffsetMode_MAX         = 4,
};

// Enum Niagara.ENDIStaticMesh_SourceMode
// NumValues: 0x0005
enum class ENDIStaticMesh_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	DefaultMeshOnly                          = 3,
	ENDIStaticMesh_MAX                       = 4,
};

// Enum Niagara.ENDIObjectPropertyReaderSourceMode
// NumValues: 0x0004
enum class ENDIObjectPropertyReaderSourceMode : uint8
{
	Binding                                  = 0,
	AttachParentActor                        = 1,
	BindingThenAttachParentActor             = 2,
	ENDIObjectPropertyReaderSourceMode_MAX   = 3,
};

// Enum Niagara.ENiagaraSystemSpawnSectionStartBehavior
// NumValues: 0x0002
enum class ENiagaraSystemSpawnSectionStartBehavior : uint32
{
	Activate                                 = 0,
	ENiagaraSystemSpawnSectionStartBehavior_MAX = 1,
};

// Enum Niagara.ENiagaraSystemSpawnSectionEvaluateBehavior
// NumValues: 0x0003
enum class ENiagaraSystemSpawnSectionEvaluateBehavior : uint32
{
	ActivateIfInactive                       = 0,
	None                                     = 1,
	ENiagaraSystemSpawnSectionEvaluateBehavior_MAX = 2,
};

// Enum Niagara.ENiagaraSystemSpawnSectionEndBehavior
// NumValues: 0x0004
enum class ENiagaraSystemSpawnSectionEndBehavior : uint32
{
	SetSystemInactive                        = 0,
	Deactivate                               = 1,
	None                                     = 2,
	ENiagaraSystemSpawnSectionEndBehavior_MAX = 3,
};

// Enum Niagara.ENiagaraCompilationState
// NumValues: 0x000A
enum class ENiagaraCompilationState : uint8
{
	CheckDDC                                 = 0,
	Precompile                               = 1,
	StartCompileJob                          = 2,
	AwaitResult                              = 3,
	OptimizeByteCode                         = 4,
	ProcessResult                            = 5,
	PutToDDC                                 = 6,
	Finished                                 = 7,
	Aborted                                  = 8,
	ENiagaraCompilationState_MAX             = 9,
};

// Enum Niagara.ENiagaraBakerViewMode
// NumValues: 0x0009
enum class ENiagaraBakerViewMode : uint32
{
	Perspective                              = 0,
	OrthoFront                               = 1,
	OrthoBack                                = 2,
	OrthoLeft                                = 3,
	OrthoRight                               = 4,
	OrthoTop                                 = 5,
	OrthoBottom                              = 6,
	Num                                      = 7,
	ENiagaraBakerViewMode_MAX                = 8,
};

// Enum Niagara.ENiagaraOcclusionQueryMode
// NumValues: 0x0004
enum class ENiagaraOcclusionQueryMode : uint8
{
	Default                                  = 0,
	AlwaysEnabled                            = 1,
	AlwaysDisabled                           = 2,
	ENiagaraOcclusionQueryMode_MAX           = 3,
};

// Enum Niagara.ENiagaraDataInterfaceEmitterBindingMode
// NumValues: 0x0003
enum class ENiagaraDataInterfaceEmitterBindingMode : uint32
{
	Self                                     = 0,
	Other                                    = 1,
	ENiagaraDataInterfaceEmitterBindingMode_MAX = 2,
};

// Enum Niagara.ENDIExport_GPUAllocationMode
// NumValues: 0x0003
enum class ENDIExport_GPUAllocationMode : uint8
{
	FixedSize                                = 0,
	PerParticle                              = 1,
	ENDIExport_MAX                           = 2,
};

// Enum Niagara.ENDILandscape_SourceMode
// NumValues: 0x0004
enum class ENDILandscape_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	ENDILandscape_MAX                        = 3,
};

// Enum Niagara.ESetResolutionMethod
// NumValues: 0x0004
enum class ESetResolutionMethod : uint32
{
	Independent                              = 0,
	MaxAxis                                  = 1,
	CellSize                                 = 2,
	ESetResolutionMethod_MAX                 = 3,
};

// Enum Niagara.ENDISkeletalMesh_SourceMode
// NumValues: 0x0004
enum class ENDISkeletalMesh_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	ENDISkeletalMesh_MAX                     = 3,
};

// Enum Niagara.ENDISkeletalMesh_SkinningMode
// NumValues: 0x0005
enum class ENDISkeletalMesh_SkinningMode : uint8
{
	Invalid                                  = 255,
	None                                     = 0,
	SkinOnTheFly                             = 1,
	PreSkin                                  = 2,
	ENDISkeletalMesh_MAX                     = 256,
};

// Enum Niagara.ENiagaraDebugPlaybackMode
// NumValues: 0x0005
enum class ENiagaraDebugPlaybackMode : uint8
{
	Play                                     = 0,
	Loop                                     = 1,
	Paused                                   = 2,
	Step                                     = 3,
	ENiagaraDebugPlaybackMode_MAX            = 4,
};

// Enum Niagara.ENiagaraDebugHudHAlign
// NumValues: 0x0004
enum class ENiagaraDebugHudHAlign : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	ENiagaraDebugHudHAlign_MAX               = 3,
};

// Enum Niagara.ENiagaraDebugHudVAlign
// NumValues: 0x0004
enum class ENiagaraDebugHudVAlign : uint8
{
	Top                                      = 0,
	Center                                   = 1,
	Bottom                                   = 2,
	ENiagaraDebugHudVAlign_MAX               = 3,
};

// Enum Niagara.ENiagaraDebugHudFont
// NumValues: 0x0003
enum class ENiagaraDebugHudFont : uint32
{
	Small                                    = 0,
	Normal                                   = 1,
	ENiagaraDebugHudFont_MAX                 = 2,
};

// Enum Niagara.ENiagaraDebugHudVerbosity
// NumValues: 0x0004
enum class ENiagaraDebugHudVerbosity : uint32
{
	None                                     = 0,
	Basic                                    = 1,
	Verbose                                  = 2,
	ENiagaraDebugHudVerbosity_MAX            = 3,
};

// Enum Niagara.ENiagaraDebugHUDOverviewMode
// NumValues: 0x0006
enum class ENiagaraDebugHUDOverviewMode : uint32
{
	Overview                                 = 0,
	Scalability                              = 1,
	Performance                              = 2,
	PerformanceGraph                         = 3,
	GpuComputePerformance                    = 4,
	ENiagaraDebugHUDOverviewMode_MAX         = 5,
};

// Enum Niagara.ENiagaraDebugHUDPerfGraphMode
// NumValues: 0x0004
enum class ENiagaraDebugHUDPerfGraphMode : uint32
{
	GameThread                               = 0,
	RenderThread                             = 1,
	GPU                                      = 2,
	ENiagaraDebugHUDPerfGraphMode_MAX        = 3,
};

// Enum Niagara.ENiagaraDebugHUDPerfSampleMode
// NumValues: 0x0003
enum class ENiagaraDebugHUDPerfSampleMode : uint32
{
	FrameTotal                               = 0,
	PerInstanceAverage                       = 1,
	ENiagaraDebugHUDPerfSampleMode_MAX       = 2,
};

// Enum Niagara.ENiagaraDebugHUDDOverviewSort
// NumValues: 0x0007
enum class ENiagaraDebugHUDDOverviewSort : uint32
{
	Name                                     = 0,
	NumberRegistered                         = 1,
	NumberActive                             = 2,
	NumberScalability                        = 3,
	MemoryUsage                              = 4,
	RecentlyVisibilty                        = 5,
	ENiagaraDebugHUDDOverviewSort_MAX        = 6,
};

// Enum Niagara.ENiagaraCullReaction
// NumValues: 0x0006
enum class ENiagaraCullReaction : uint32
{
	Deactivate                               = 0,
	DeactivateImmediate                      = 1,
	DeactivateResume                         = 2,
	DeactivateImmediateResume                = 3,
	PauseResume                              = 4,
	ENiagaraCullReaction_MAX                 = 5,
};

// Enum Niagara.ENiagaraScalabilityUpdateFrequency
// NumValues: 0x0006
enum class ENiagaraScalabilityUpdateFrequency : uint32
{
	SpawnOnly                                = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	Continuous                               = 4,
	ENiagaraScalabilityUpdateFrequency_MAX   = 5,
};

// Enum Niagara.ENiagaraCullProxyMode
// NumValues: 0x0003
enum class ENiagaraCullProxyMode : uint32
{
	None                                     = 0,
	Instanced_Rendered                       = 1,
	ENiagaraCullProxyMode_MAX                = 2,
};

// Enum Niagara.EScriptExecutionMode
// NumValues: 0x0004
enum class EScriptExecutionMode : uint8
{
	EveryParticle                            = 0,
	SpawnedParticles                         = 1,
	SingleParticle                           = 2,
	EScriptExecutionMode_MAX                 = 3,
};

// Enum Niagara.EParticleAllocationMode
// NumValues: 0x0004
enum class EParticleAllocationMode : uint8
{
	AutomaticEstimate                        = 0,
	ManualEstimate                           = 1,
	FixedCount                               = 2,
	EParticleAllocationMode_MAX              = 3,
};

// Enum Niagara.ENiagaraEmitterCalculateBoundMode
// NumValues: 0x0004
enum class ENiagaraEmitterCalculateBoundMode : uint8
{
	Dynamic                                  = 0,
	Fixed                                    = 1,
	Programmable                             = 2,
	ENiagaraEmitterCalculateBoundMode_MAX    = 3,
};

// Enum Niagara.ENiagaraMeshFacingMode
// NumValues: 0x0005
enum class ENiagaraMeshFacingMode : uint8
{
	Default                                  = 0,
	Velocity                                 = 1,
	CameraPosition                           = 2,
	CameraPlane                              = 3,
	ENiagaraMeshFacingMode_MAX               = 4,
};

// Enum Niagara.ENiagaraMeshPivotOffsetSpace
// NumValues: 0x0005
enum class ENiagaraMeshPivotOffsetSpace : uint8
{
	Mesh                                     = 0,
	Simulation                               = 1,
	World                                    = 2,
	Local                                    = 3,
	ENiagaraMeshPivotOffsetSpace_MAX         = 4,
};

// Enum Niagara.ENiagaraMeshLockedAxisSpace
// NumValues: 0x0004
enum class ENiagaraMeshLockedAxisSpace : uint8
{
	Simulation                               = 0,
	World                                    = 1,
	Local                                    = 2,
	ENiagaraMeshLockedAxisSpace_MAX          = 3,
};

// Enum Niagara.ENiagaraPlatformSelectionState
// NumValues: 0x0004
enum class ENiagaraPlatformSelectionState : uint8
{
	Default                                  = 0,
	Enabled                                  = 1,
	Disabled                                 = 2,
	ENiagaraPlatformSelectionState_MAX       = 3,
};

// Enum Niagara.ENiagaraPlatformSetState
// NumValues: 0x0005
enum class ENiagaraPlatformSetState : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Active                                   = 2,
	Unknown                                  = 3,
	ENiagaraPlatformSetState_MAX             = 4,
};

// Enum Niagara.ENiagaraCVarConditionResponse
// NumValues: 0x0004
enum class ENiagaraCVarConditionResponse : uint8
{
	None                                     = 0,
	Enable                                   = 1,
	Disable                                  = 2,
	ENiagaraCVarConditionResponse_MAX        = 3,
};

// Enum Niagara.ENiagaraDeviceProfileRedirectMode
// NumValues: 0x0003
enum class ENiagaraDeviceProfileRedirectMode : uint8
{
	CVar                                     = 0,
	DeviceProfile                            = 1,
	ENiagaraDeviceProfileRedirectMode_MAX    = 2,
};

// Enum Niagara.ENiagaraPreviewGridResetMode
// NumValues: 0x0004
enum class ENiagaraPreviewGridResetMode : uint8
{
	Never                                    = 0,
	Individual                               = 1,
	All                                      = 2,
	ENiagaraPreviewGridResetMode_MAX         = 3,
};

// Enum Niagara.ENiagaraRendererSortPrecision
// NumValues: 0x0004
enum class ENiagaraRendererSortPrecision : uint8
{
	Default                                  = 0,
	Low                                      = 1,
	High                                     = 2,
	ENiagaraRendererSortPrecision_MAX        = 3,
};

// Enum Niagara.ENiagaraRendererGpuTranslucentLatency
// NumValues: 0x0004
enum class ENiagaraRendererGpuTranslucentLatency : uint8
{
	ProjectDefault                           = 0,
	Immediate                                = 1,
	Latent                                   = 2,
	ENiagaraRendererGpuTranslucentLatency_MAX = 3,
};

// Enum Niagara.ENiagaraRibbonFacingMode
// NumValues: 0x0004
enum class ENiagaraRibbonFacingMode : uint8
{
	Screen                                   = 0,
	Custom                                   = 1,
	CustomSideVector                         = 2,
	ENiagaraRibbonFacingMode_MAX             = 3,
};

// Enum Niagara.ENiagaraRibbonAgeOffsetMode
// NumValues: 0x0003
enum class ENiagaraRibbonAgeOffsetMode : uint8
{
	Scale                                    = 0,
	Clip                                     = 1,
	ENiagaraRibbonAgeOffsetMode_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonDrawDirection
// NumValues: 0x0003
enum class ENiagaraRibbonDrawDirection : uint8
{
	FrontToBack                              = 0,
	BackToFront                              = 1,
	ENiagaraRibbonDrawDirection_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonShapeMode
// NumValues: 0x0005
enum class ENiagaraRibbonShapeMode : uint8
{
	Plane                                    = 0,
	MultiPlane                               = 1,
	Tube                                     = 2,
	Custom                                   = 3,
	ENiagaraRibbonShapeMode_MAX              = 4,
};

// Enum Niagara.ENiagaraRibbonTessellationMode
// NumValues: 0x0004
enum class ENiagaraRibbonTessellationMode : uint8
{
	Automatic                                = 0,
	Custom                                   = 1,
	Disabled                                 = 2,
	ENiagaraRibbonTessellationMode_MAX       = 3,
};

// Enum Niagara.ENiagaraRibbonUVEdgeMode
// NumValues: 0x0003
enum class ENiagaraRibbonUVEdgeMode : uint8
{
	SmoothTransition                         = 0,
	Locked                                   = 1,
	ENiagaraRibbonUVEdgeMode_MAX             = 2,
};

// Enum Niagara.ENiagaraRibbonUVDistributionMode
// NumValues: 0x0005
enum class ENiagaraRibbonUVDistributionMode : uint8
{
	ScaledUniformly                          = 0,
	ScaledUsingRibbonSegmentLength           = 1,
	TiledOverRibbonLength                    = 2,
	TiledFromStartOverRibbonLength           = 3,
	ENiagaraRibbonUVDistributionMode_MAX     = 4,
};

// Enum Niagara.EUnusedAttributeBehaviour
// NumValues: 0x0006
enum class EUnusedAttributeBehaviour : uint8
{
	Copy                                     = 0,
	Zero                                     = 1,
	None                                     = 2,
	MarkInvalid                              = 3,
	PassThrough                              = 4,
	EUnusedAttributeBehaviour_MAX            = 5,
};

// Enum Niagara.ENiagaraModuleDependencyType
// NumValues: 0x0003
enum class ENiagaraModuleDependencyType : uint8
{
	PreDependency                            = 0,
	PostDependency                           = 1,
	ENiagaraModuleDependencyType_MAX         = 2,
};

// Enum Niagara.ENiagaraModuleDependencyScriptConstraint
// NumValues: 0x0003
enum class ENiagaraModuleDependencyScriptConstraint : uint8
{
	SameScript                               = 0,
	AllScripts                               = 1,
	ENiagaraModuleDependencyScriptConstraint_MAX = 2,
};

// Enum Niagara.ENiagaraScriptLibraryVisibility
// NumValues: 0x0005
enum class ENiagaraScriptLibraryVisibility : uint8
{
	Invalid                                  = 0,
	Unexposed                                = 1,
	Library                                  = 2,
	Hidden                                   = 3,
	ENiagaraScriptLibraryVisibility_MAX      = 4,
};

// Enum Niagara.ENiagaraScriptTemplateSpecification
// NumValues: 0x0004
enum class ENiagaraScriptTemplateSpecification : uint8
{
	None                                     = 0,
	Template                                 = 1,
	Behavior                                 = 2,
	ENiagaraScriptTemplateSpecification_MAX  = 3,
};

// Enum Niagara.ENiagaraEmitterDefaultSummaryState
// NumValues: 0x0003
enum class ENiagaraEmitterDefaultSummaryState : uint8
{
	Default                                  = 0,
	Summary                                  = 1,
	ENiagaraEmitterDefaultSummaryState_MAX   = 2,
};

// Enum Niagara.ENiagaraModuleDependencyUsage
// NumValues: 0x0006
enum class ENiagaraModuleDependencyUsage : uint8
{
	None                                     = 0,
	Spawn                                    = 1,
	Update                                   = 2,
	Event                                    = 3,
	SimulationStage                          = 4,
	ENiagaraModuleDependencyUsage_MAX        = 5,
};

// Enum Niagara.ENiagaraInlineDynamicInputFormatTokenUsage
// NumValues: 0x0004
enum class ENiagaraInlineDynamicInputFormatTokenUsage : uint8
{
	Input                                    = 0,
	Decorator                                = 1,
	LineBreak                                = 2,
	ENiagaraInlineDynamicInputFormatTokenUsage_MAX = 3,
};

// Enum Niagara.ENiagaraSpriteAlignment
// NumValues: 0x0005
enum class ENiagaraSpriteAlignment : uint8
{
	Unaligned                                = 0,
	VelocityAligned                          = 1,
	CustomAlignment                          = 2,
	Automatic                                = 3,
	ENiagaraSpriteAlignment_MAX              = 4,
};

// Enum Niagara.ENiagaraSpriteFacingMode
// NumValues: 0x0007
enum class ENiagaraSpriteFacingMode : uint8
{
	FaceCamera                               = 0,
	FaceCameraPlane                          = 1,
	CustomFacingVector                       = 2,
	FaceCameraPosition                       = 3,
	FaceCameraDistanceBlend                  = 4,
	Automatic                                = 5,
	ENiagaraSpriteFacingMode_MAX             = 6,
};

// Enum Niagara.ENiagaraRendererPixelCoverageMode
// NumValues: 0x0007
enum class ENiagaraRendererPixelCoverageMode : uint8
{
	Automatic                                = 0,
	Disabled                                 = 1,
	Enabled                                  = 2,
	Enabled_RGBA                             = 3,
	Enabled_RGB                              = 4,
	Enabled_A                                = 5,
	ENiagaraRendererPixelCoverageMode_MAX    = 6,
};

// Enum Niagara.ENiagaraStructConversionType
// NumValues: 0x0007
enum class ENiagaraStructConversionType : uint8
{
	CopyOnly                                 = 0,
	DoubleToFloat                            = 1,
	Vector2                                  = 2,
	Vector3                                  = 3,
	Vector4                                  = 4,
	Quat                                     = 5,
	ENiagaraStructConversionType_MAX         = 6,
};

// Enum Niagara.ENiagaraNumericOutputTypeSelectionMode
// NumValues: 0x0006
enum class ENiagaraNumericOutputTypeSelectionMode : uint8
{
	None                                     = 0,
	Largest                                  = 1,
	Smallest                                 = 2,
	Scalar                                   = 3,
	Custom                                   = 4,
	ENiagaraNumericOutputTypeSelectionMode_MAX = 5,
};

// Enum Niagara.ENiagaraExecutionStateSource
// NumValues: 0x0005
enum class ENiagaraExecutionStateSource : uint8
{
	Scalability                              = 0,
	Internal                                 = 1,
	Owner                                    = 2,
	InternalCompletion                       = 3,
	ENiagaraExecutionStateSource_MAX         = 4,
};

// Enum Niagara.ENiagaraExecutionState
// NumValues: 0x0007
enum class ENiagaraExecutionState : uint32
{
	Active                                   = 0,
	Inactive                                 = 1,
	InactiveClear                            = 2,
	Complete                                 = 3,
	Disabled                                 = 4,
	Num                                      = 5,
	ENiagaraExecutionState_MAX               = 6,
};

// Enum Niagara.ENiagaraCoordinateSpace
// NumValues: 0x0004
enum class ENiagaraCoordinateSpace : uint8
{
	Simulation                               = 0,
	World                                    = 1,
	Local                                    = 2,
	ENiagaraCoordinateSpace_MAX              = 3,
};

// Enum Niagara.ENiagaraPythonUpdateScriptReference
// NumValues: 0x0004
enum class ENiagaraPythonUpdateScriptReference : uint8
{
	None                                     = 0,
	ScriptAsset                              = 1,
	DirectTextEntry                          = 2,
	ENiagaraPythonUpdateScriptReference_MAX  = 3,
};

// Enum Niagara.ENiagaraOrientationAxis
// NumValues: 0x0004
enum class ENiagaraOrientationAxis : uint8
{
	XAxis                                    = 0,
	YAxis                                    = 1,
	ZAxis                                    = 2,
	ENiagaraOrientationAxis_MAX              = 3,
};

// Enum Niagara.ENiagaraInputWidgetType
// NumValues: 0x0006
enum class ENiagaraInputWidgetType : uint8
{
	Default                                  = 0,
	Slider                                   = 1,
	Volume                                   = 2,
	NumericDropdown                          = 3,
	EnumStyle                                = 4,
	ENiagaraInputWidgetType_MAX              = 5,
};

// Enum Niagara.ENiagaraBoolDisplayMode
// NumValues: 0x0004
enum class ENiagaraBoolDisplayMode : uint8
{
	DisplayAlways                            = 0,
	DisplayIfTrue                            = 1,
	DisplayIfFalse                           = 2,
	ENiagaraBoolDisplayMode_MAX              = 3,
};

// Enum Niagara.ENiagaraValidationSeverity
// NumValues: 0x0004
enum class ENiagaraValidationSeverity : uint8
{
	Info                                     = 0,
	Warning                                  = 1,
	Error                                    = 2,
	ENiagaraValidationSeverity_MAX           = 3,
};

// Enum Niagara.ENiagaraVariantMode
// NumValues: 0x0005
enum class ENiagaraVariantMode : uint32
{
	None                                     = 0,
	Object                                   = 1,
	DataInterface                            = 2,
	Bytes                                    = 3,
	ENiagaraVariantMode_MAX                  = 4,
};

// Enum Niagara.EVolumeCacheType
// NumValues: 0x0002
enum class EVolumeCacheType : uint8
{
	OpenVDB                                  = 0,
	EVolumeCacheType_MAX                     = 1,
};

// ScriptStruct Niagara.NiagaraSimCacheCaptureParameters
// 0x001C (0x001C - 0x0000)
struct FNiagaraSimCacheCaptureParameters final
{
public:
	uint8                                         bAppendToSimCache : 1;                             // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCaptureFixedNumberOfFrames : 1;                   // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2572[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumFrames;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CaptureRate;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseTimeout : 1;                                   // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2573[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TimeoutFrameCount;                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCaptureAllFramesImmediatly : 1;                   // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2574[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ImmediateCaptureDeltaTime;                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraSimCacheCaptureParameters) == 0x000004, "Wrong alignment on FNiagaraSimCacheCaptureParameters");
static_assert(sizeof(FNiagaraSimCacheCaptureParameters) == 0x00001C, "Wrong size on FNiagaraSimCacheCaptureParameters");
static_assert(offsetof(FNiagaraSimCacheCaptureParameters, NumFrames) == 0x000004, "Member 'FNiagaraSimCacheCaptureParameters::NumFrames' has a wrong offset!");
static_assert(offsetof(FNiagaraSimCacheCaptureParameters, CaptureRate) == 0x000008, "Member 'FNiagaraSimCacheCaptureParameters::CaptureRate' has a wrong offset!");
static_assert(offsetof(FNiagaraSimCacheCaptureParameters, TimeoutFrameCount) == 0x000010, "Member 'FNiagaraSimCacheCaptureParameters::TimeoutFrameCount' has a wrong offset!");
static_assert(offsetof(FNiagaraSimCacheCaptureParameters, ImmediateCaptureDeltaTime) == 0x000018, "Member 'FNiagaraSimCacheCaptureParameters::ImmediateCaptureDeltaTime' has a wrong offset!");

// ScriptStruct Niagara.NiagaraTypeDefinitionHandle
// 0x0004 (0x0004 - 0x0000)
struct FNiagaraTypeDefinitionHandle final
{
public:
	int32                                         RegisteredTypeIndex;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FNiagaraTypeDefinitionHandle) == 0x000004, "Wrong alignment on FNiagaraTypeDefinitionHandle");
static_assert(sizeof(FNiagaraTypeDefinitionHandle) == 0x000004, "Wrong size on FNiagaraTypeDefinitionHandle");
static_assert(offsetof(FNiagaraTypeDefinitionHandle, RegisteredTypeIndex) == 0x000000, "Member 'FNiagaraTypeDefinitionHandle::RegisteredTypeIndex' has a wrong offset!");

// ScriptStruct Niagara.NiagaraVariableBase
// 0x000C (0x000C - 0x0000)
struct FNiagaraVariableBase
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNiagaraTypeDefinitionHandle           TypeDefHandle;                                     // 0x0008(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FNiagaraVariableBase) == 0x000004, "Wrong alignment on FNiagaraVariableBase");
static_assert(sizeof(FNiagaraVariableBase) == 0x00000C, "Wrong size on FNiagaraVariableBase");
static_assert(offsetof(FNiagaraVariableBase, Name) == 0x000000, "Member 'FNiagaraVariableBase::Name' has a wrong offset!");
static_assert(offsetof(FNiagaraVariableBase, TypeDefHandle) == 0x000008, "Member 'FNiagaraVariableBase::TypeDefHandle' has a wrong offset!");

// ScriptStruct Niagara.NiagaraVariable
// 0x0014 (0x0020 - 0x000C)
struct FNiagaraVariable final : public FNiagaraVariableBase
{
public:
	uint8                                         Pad_2575[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 VarData;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FNiagaraVariable) == 0x000008, "Wrong alignment on FNiagaraVariable");
static_assert(sizeof(FNiagaraVariable) == 0x000020, "Wrong size on FNiagaraVariable");
static_assert(offsetof(FNiagaraVariable, VarData) == 0x000010, "Member 'FNiagaraVariable::VarData' has a wrong offset!");

// ScriptStruct Niagara.MovieSceneNiagaraParameterSectionTemplate
// 0x0020 (0x0040 - 0x0020)
struct FMovieSceneNiagaraParameterSectionTemplate : public FMovieSceneEvalTemplate
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0020(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMovieSceneNiagaraParameterSectionTemplate) == 0x000008, "Wrong alignment on FMovieSceneNiagaraParameterSectionTemplate");
static_assert(sizeof(FMovieSceneNiagaraParameterSectionTemplate) == 0x000040, "Wrong size on FMovieSceneNiagaraParameterSectionTemplate");
static_assert(offsetof(FMovieSceneNiagaraParameterSectionTemplate, Parameter) == 0x000020, "Member 'FMovieSceneNiagaraParameterSectionTemplate::Parameter' has a wrong offset!");

// ScriptStruct Niagara.NiagaraSimCacheCreateParameters
// 0x0058 (0x0058 - 0x0000)
struct FNiagaraSimCacheCreateParameters final
{
public:
	ENiagaraSimCacheAttributeCaptureMode          AttributeCaptureMode;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2576[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAllowRebasing : 1;                                // 0x0004(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowDataInterfaceCaching : 1;                    // 0x0004(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowInterpolation : 1;                           // 0x0004(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowVelocityExtrapolation : 1;                   // 0x0004(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2577[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           RebaseIncludeAttributes;                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           RebaseExcludeAttributes;                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           InterpolationIncludeAttributes;                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           InterpolationExcludeAttributes;                    // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExplicitCaptureAttributes;                         // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraSimCacheCreateParameters) == 0x000008, "Wrong alignment on FNiagaraSimCacheCreateParameters");
static_assert(sizeof(FNiagaraSimCacheCreateParameters) == 0x000058, "Wrong size on FNiagaraSimCacheCreateParameters");
static_assert(offsetof(FNiagaraSimCacheCreateParameters, AttributeCaptureMode) == 0x000000, "Member 'FNiagaraSimCacheCreateParameters::AttributeCaptureMode' has a wrong offset!");
static_assert(offsetof(FNiagaraSimCacheCreateParameters, RebaseIncludeAttributes) == 0x000008, "Member 'FNiagaraSimCacheCreateParameters::RebaseIncludeAttributes' has a wrong offset!");
static_assert(offsetof(FNiagaraSimCacheCreateParameters, RebaseExcludeAttributes) == 0x000018, "Member 'FNiagaraSimCacheCreateParameters::RebaseExcludeAttributes' has a wrong offset!");
static_assert(offsetof(FNiagaraSimCacheCreateParameters, InterpolationIncludeAttributes) == 0x000028, "Member 'FNiagaraSimCacheCreateParameters::InterpolationIncludeAttributes' has a wrong offset!");
static_assert(offsetof(FNiagaraSimCacheCreateParameters, InterpolationExcludeAttributes) == 0x000038, "Member 'FNiagaraSimCacheCreateParameters::InterpolationExcludeAttributes' has a wrong offset!");
static_assert(offsetof(FNiagaraSimCacheCreateParameters, ExplicitCaptureAttributes) == 0x000048, "Member 'FNiagaraSimCacheCreateParameters::ExplicitCaptureAttributes' has a wrong offset!");

// ScriptStruct Niagara.NiagaraStackSection
// 0x0050 (0x0050 - 0x0000)
struct FNiagaraStackSection final
{
public:
	class FName                                   SectionIdentifier;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   SectionDisplayName;                                // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
	TArray<class FText>                           Categories;                                        // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   ToolTip;                                           // 0x0030(0x0018)(NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2578[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraStackSection) == 0x000008, "Wrong alignment on FNiagaraStackSection");
static_assert(sizeof(FNiagaraStackSection) == 0x000050, "Wrong size on FNiagaraStackSection");
static_assert(offsetof(FNiagaraStackSection, SectionIdentifier) == 0x000000, "Member 'FNiagaraStackSection::SectionIdentifier' has a wrong offset!");
static_assert(offsetof(FNiagaraStackSection, SectionDisplayName) == 0x000008, "Member 'FNiagaraStackSection::SectionDisplayName' has a wrong offset!");
static_assert(offsetof(FNiagaraStackSection, Categories) == 0x000020, "Member 'FNiagaraStackSection::Categories' has a wrong offset!");
static_assert(offsetof(FNiagaraStackSection, ToolTip) == 0x000030, "Member 'FNiagaraStackSection::ToolTip' has a wrong offset!");
static_assert(offsetof(FNiagaraStackSection, bEnabled) == 0x000048, "Member 'FNiagaraStackSection::bEnabled' has a wrong offset!");

// ScriptStruct Niagara.NDIRenderTargetVolumeSimCacheFrame
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FNDIRenderTargetVolumeSimCacheFrame final
{
public:
	struct FIntVector                             Size;                                              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  Format;                                            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2579[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UncompressedSize;                                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompressedSize;                                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_257A[0x30];                                    // 0x0018(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNDIRenderTargetVolumeSimCacheFrame) == 0x000008, "Wrong alignment on FNDIRenderTargetVolumeSimCacheFrame");
static_assert(sizeof(FNDIRenderTargetVolumeSimCacheFrame) == 0x000048, "Wrong size on FNDIRenderTargetVolumeSimCacheFrame");
static_assert(offsetof(FNDIRenderTargetVolumeSimCacheFrame, Size) == 0x000000, "Member 'FNDIRenderTargetVolumeSimCacheFrame::Size' has a wrong offset!");
static_assert(offsetof(FNDIRenderTargetVolumeSimCacheFrame, Format) == 0x00000C, "Member 'FNDIRenderTargetVolumeSimCacheFrame::Format' has a wrong offset!");
static_assert(offsetof(FNDIRenderTargetVolumeSimCacheFrame, UncompressedSize) == 0x000010, "Member 'FNDIRenderTargetVolumeSimCacheFrame::UncompressedSize' has a wrong offset!");
static_assert(offsetof(FNDIRenderTargetVolumeSimCacheFrame, CompressedSize) == 0x000014, "Member 'FNDIRenderTargetVolumeSimCacheFrame::CompressedSize' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDataSetID
// 0x000C (0x000C - 0x0000)
struct FNiagaraDataSetID final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDataSetType                           Type;                                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_257B[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraDataSetID) == 0x000004, "Wrong alignment on FNiagaraDataSetID");
static_assert(sizeof(FNiagaraDataSetID) == 0x00000C, "Wrong size on FNiagaraDataSetID");
static_assert(offsetof(FNiagaraDataSetID, Name) == 0x000000, "Member 'FNiagaraDataSetID::Name' has a wrong offset!");
static_assert(offsetof(FNiagaraDataSetID, Type) == 0x000008, "Member 'FNiagaraDataSetID::Type' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDataSetProperties
// 0x0020 (0x0020 - 0x0000)
struct FNiagaraDataSetProperties final
{
public:
	struct FNiagaraDataSetID                      ID;                                                // 0x0000(0x000C)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_257C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraVariableBase>           Variables;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraDataSetProperties) == 0x000008, "Wrong alignment on FNiagaraDataSetProperties");
static_assert(sizeof(FNiagaraDataSetProperties) == 0x000020, "Wrong size on FNiagaraDataSetProperties");
static_assert(offsetof(FNiagaraDataSetProperties, ID) == 0x000000, "Member 'FNiagaraDataSetProperties::ID' has a wrong offset!");
static_assert(offsetof(FNiagaraDataSetProperties, Variables) == 0x000010, "Member 'FNiagaraDataSetProperties::Variables' has a wrong offset!");

// ScriptStruct Niagara.NiagaraModuleDependency
// 0x0068 (0x0068 - 0x0000)
struct FNiagaraModuleDependency final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraModuleDependencyType                  Type;                                              // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraModuleDependencyScriptConstraint      ScriptConstraint;                                  // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_257D[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RequiredVersion;                                   // 0x0010(0x0010)(Edit, ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OnlyEvaluateInScriptUsage;                         // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_257E[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x0028(0x0018)(Edit, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	uint8                                         Pad_257F[0x28];                                    // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraModuleDependency) == 0x000008, "Wrong alignment on FNiagaraModuleDependency");
static_assert(sizeof(FNiagaraModuleDependency) == 0x000068, "Wrong size on FNiagaraModuleDependency");
static_assert(offsetof(FNiagaraModuleDependency, ID) == 0x000000, "Member 'FNiagaraModuleDependency::ID' has a wrong offset!");
static_assert(offsetof(FNiagaraModuleDependency, Type) == 0x000008, "Member 'FNiagaraModuleDependency::Type' has a wrong offset!");
static_assert(offsetof(FNiagaraModuleDependency, ScriptConstraint) == 0x000009, "Member 'FNiagaraModuleDependency::ScriptConstraint' has a wrong offset!");
static_assert(offsetof(FNiagaraModuleDependency, RequiredVersion) == 0x000010, "Member 'FNiagaraModuleDependency::RequiredVersion' has a wrong offset!");
static_assert(offsetof(FNiagaraModuleDependency, OnlyEvaluateInScriptUsage) == 0x000020, "Member 'FNiagaraModuleDependency::OnlyEvaluateInScriptUsage' has a wrong offset!");
static_assert(offsetof(FNiagaraModuleDependency, Description) == 0x000028, "Member 'FNiagaraModuleDependency::Description' has a wrong offset!");

// ScriptStruct Niagara.NiagaraScriptDataUsageInfo
// 0x0001 (0x0001 - 0x0000)
struct FNiagaraScriptDataUsageInfo final
{
public:
	bool                                          bReadsAttributeData;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraScriptDataUsageInfo) == 0x000001, "Wrong alignment on FNiagaraScriptDataUsageInfo");
static_assert(sizeof(FNiagaraScriptDataUsageInfo) == 0x000001, "Wrong size on FNiagaraScriptDataUsageInfo");
static_assert(offsetof(FNiagaraScriptDataUsageInfo, bReadsAttributeData) == 0x000000, "Member 'FNiagaraScriptDataUsageInfo::bReadsAttributeData' has a wrong offset!");

// ScriptStruct Niagara.NiagaraFunctionSignature
// 0x0098 (0x0098 - 0x0000)
struct FNiagaraFunctionSignature final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariable>               Inputs;                                            // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariable>               Outputs;                                           // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   OwnerName;                                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
