#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemSteamCore

#include "Basic.hpp"

#include "PacketHandler_classes.hpp"
#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemSteamCore.SteamCoreAuthComponentModuleInterface
// 0x0000 (0x0028 - 0x0028)
class USteamCoreAuthComponentModuleInterface final : public UHandlerComponentFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreAuthComponentModuleInterface">();
	}
	static class USteamCoreAuthComponentModuleInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreAuthComponentModuleInterface>();
	}
};
static_assert(alignof(USteamCoreAuthComponentModuleInterface) == 0x000008, "Wrong alignment on USteamCoreAuthComponentModuleInterface");
static_assert(sizeof(USteamCoreAuthComponentModuleInterface) == 0x000028, "Wrong size on USteamCoreAuthComponentModuleInterface");

// Class OnlineSubsystemSteamCore.SteamCoreSubsystemUtilities
// 0x0000 (0x0028 - 0x0028)
class USteamCoreSubsystemUtilities final : public UBlueprintFunctionLibrary
{
public:
	static bool SendSessionInviteToFriend(int32 LocalUserNum, const class FString& FriendSteamId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreSubsystemUtilities">();
	}
	static class USteamCoreSubsystemUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreSubsystemUtilities>();
	}
};
static_assert(alignof(USteamCoreSubsystemUtilities) == 0x000008, "Wrong alignment on USteamCoreSubsystemUtilities");
static_assert(sizeof(USteamCoreSubsystemUtilities) == 0x000028, "Wrong size on USteamCoreSubsystemUtilities");

// Class OnlineSubsystemSteamCore.SteamCoreNetConnection
// 0x0008 (0x1E90 - 0x1E88)
class USteamCoreNetConnection final : public UIpConnection
{
public:
	bool                                          M_bIsPassthrough;                                  // 0x1E88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16BB[0x7];                                     // 0x1E89(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreNetConnection">();
	}
	static class USteamCoreNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreNetConnection>();
	}
};
static_assert(alignof(USteamCoreNetConnection) == 0x000008, "Wrong alignment on USteamCoreNetConnection");
static_assert(sizeof(USteamCoreNetConnection) == 0x001E90, "Wrong size on USteamCoreNetConnection");
static_assert(offsetof(USteamCoreNetConnection, M_bIsPassthrough) == 0x001E88, "Member 'USteamCoreNetConnection::M_bIsPassthrough' has a wrong offset!");

// Class OnlineSubsystemSteamCore.SteamCoreNetDriver
// 0x0008 (0x08A8 - 0x08A0)
class USteamCoreNetDriver final : public UIpNetDriver
{
public:
	uint8                                         Pad_16BC[0x8];                                     // 0x08A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreNetDriver">();
	}
	static class USteamCoreNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreNetDriver>();
	}
};
static_assert(alignof(USteamCoreNetDriver) == 0x000008, "Wrong alignment on USteamCoreNetDriver");
static_assert(sizeof(USteamCoreNetDriver) == 0x0008A8, "Wrong size on USteamCoreNetDriver");

}

