#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemUtils

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "OnlineSubsystem_structs.hpp"
#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "AudioMixer_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemUtils.AchievementBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAchievementBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetCachedAchievementDescription(class UObject* WorldContextObject, class APlayerController* PlayerController, class FName AchievementID, bool* bFoundID, class FText* Title, class FText* LockedDescription, class FText* UnlockedDescription, bool* bHidden);
	static void GetCachedAchievementProgress(class UObject* WorldContextObject, class APlayerController* PlayerController, class FName AchievementID, bool* bFoundID, float* Progress);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementBlueprintLibrary">();
	}
	static class UAchievementBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementBlueprintLibrary>();
	}
};
static_assert(alignof(UAchievementBlueprintLibrary) == 0x000008, "Wrong alignment on UAchievementBlueprintLibrary");
static_assert(sizeof(UAchievementBlueprintLibrary) == 0x000028, "Wrong size on UAchievementBlueprintLibrary");

// Class OnlineSubsystemUtils.AchievementQueryCallbackProxy
// 0x0038 (0x0068 - 0x0030)
class UAchievementQueryCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1679[0x18];                                    // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAchievementQueryCallbackProxy* CacheAchievementDescriptions(class UObject* WorldContextObject, class APlayerController* PlayerController);
	static class UAchievementQueryCallbackProxy* CacheAchievements(class UObject* WorldContextObject, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementQueryCallbackProxy">();
	}
	static class UAchievementQueryCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementQueryCallbackProxy>();
	}
};
static_assert(alignof(UAchievementQueryCallbackProxy) == 0x000008, "Wrong alignment on UAchievementQueryCallbackProxy");
static_assert(sizeof(UAchievementQueryCallbackProxy) == 0x000068, "Wrong size on UAchievementQueryCallbackProxy");
static_assert(offsetof(UAchievementQueryCallbackProxy, OnSuccess) == 0x000030, "Member 'UAchievementQueryCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UAchievementQueryCallbackProxy, OnFailure) == 0x000040, "Member 'UAchievementQueryCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.AchievementWriteCallbackProxy
// 0x0050 (0x0080 - 0x0030)
class UAchievementWriteCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_167A[0x30];                                    // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAchievementWriteCallbackProxy* WriteAchievementProgress(class UObject* WorldContextObject, class APlayerController* PlayerController, class FName AchievementName, float Progress, int32 UserTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementWriteCallbackProxy">();
	}
	static class UAchievementWriteCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementWriteCallbackProxy>();
	}
};
static_assert(alignof(UAchievementWriteCallbackProxy) == 0x000008, "Wrong alignment on UAchievementWriteCallbackProxy");
static_assert(sizeof(UAchievementWriteCallbackProxy) == 0x000080, "Wrong size on UAchievementWriteCallbackProxy");
static_assert(offsetof(UAchievementWriteCallbackProxy, OnSuccess) == 0x000030, "Member 'UAchievementWriteCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UAchievementWriteCallbackProxy, OnFailure) == 0x000040, "Member 'UAchievementWriteCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.ConnectionCallbackProxy
// 0x0048 (0x0078 - 0x0030)
class UConnectionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_167B[0x28];                                    // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UConnectionCallbackProxy* ConnectToService(class UObject* WorldContextObject, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConnectionCallbackProxy">();
	}
	static class UConnectionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConnectionCallbackProxy>();
	}
};
static_assert(alignof(UConnectionCallbackProxy) == 0x000008, "Wrong alignment on UConnectionCallbackProxy");
static_assert(sizeof(UConnectionCallbackProxy) == 0x000078, "Wrong size on UConnectionCallbackProxy");
static_assert(offsetof(UConnectionCallbackProxy, OnSuccess) == 0x000030, "Member 'UConnectionCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UConnectionCallbackProxy, OnFailure) == 0x000040, "Member 'UConnectionCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.CreateSessionCallbackProxy
// 0x0068 (0x0098 - 0x0030)
class UCreateSessionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_167C[0x48];                                    // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCreateSessionCallbackProxy* CreateSession(class UObject* WorldContextObject, class APlayerController* PlayerController, int32 PublicConnections, bool bUseLAN);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreateSessionCallbackProxy">();
	}
	static class UCreateSessionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreateSessionCallbackProxy>();
	}
};
static_assert(alignof(UCreateSessionCallbackProxy) == 0x000008, "Wrong alignment on UCreateSessionCallbackProxy");
static_assert(sizeof(UCreateSessionCallbackProxy) == 0x000098, "Wrong size on UCreateSessionCallbackProxy");
static_assert(offsetof(UCreateSessionCallbackProxy, OnSuccess) == 0x000030, "Member 'UCreateSessionCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UCreateSessionCallbackProxy, OnFailure) == 0x000040, "Member 'UCreateSessionCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.DestroySessionCallbackProxy
// 0x0048 (0x0078 - 0x0030)
class UDestroySessionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_167E[0x28];                                    // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDestroySessionCallbackProxy* DestroySession(class UObject* WorldContextObject, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DestroySessionCallbackProxy">();
	}
	static class UDestroySessionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestroySessionCallbackProxy>();
	}
};
static_assert(alignof(UDestroySessionCallbackProxy) == 0x000008, "Wrong alignment on UDestroySessionCallbackProxy");
static_assert(sizeof(UDestroySessionCallbackProxy) == 0x000078, "Wrong size on UDestroySessionCallbackProxy");
static_assert(offsetof(UDestroySessionCallbackProxy, OnSuccess) == 0x000030, "Member 'UDestroySessionCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UDestroySessionCallbackProxy, OnFailure) == 0x000040, "Member 'UDestroySessionCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.EndMatchCallbackProxy
// 0x0050 (0x0080 - 0x0030)
class UEndMatchCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_167F[0x30];                                    // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UEndMatchCallbackProxy* EndMatch(class UObject* WorldContextObject, class APlayerController* PlayerController, TScriptInterface<class ITurnBasedMatchInterface> MatchActor, const class FString& MatchID, EMPMatchOutcome LocalPlayerOutcome, EMPMatchOutcome OtherPlayersOutcome);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndMatchCallbackProxy">();
	}
	static class UEndMatchCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndMatchCallbackProxy>();
	}
};
static_assert(alignof(UEndMatchCallbackProxy) == 0x000008, "Wrong alignment on UEndMatchCallbackProxy");
static_assert(sizeof(UEndMatchCallbackProxy) == 0x000080, "Wrong size on UEndMatchCallbackProxy");
static_assert(offsetof(UEndMatchCallbackProxy, OnSuccess) == 0x000030, "Member 'UEndMatchCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UEndMatchCallbackProxy, OnFailure) == 0x000040, "Member 'UEndMatchCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.EndTurnCallbackProxy
// 0x0048 (0x0078 - 0x0030)
class UEndTurnCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1681[0x28];                                    // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UEndTurnCallbackProxy* EndTurn(class UObject* WorldContextObject, class APlayerController* PlayerController, const class FString& MatchID, TScriptInterface<class ITurnBasedMatchInterface> TurnBasedMatchInterface);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndTurnCallbackProxy">();
	}
	static class UEndTurnCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndTurnCallbackProxy>();
	}
};
static_assert(alignof(UEndTurnCallbackProxy) == 0x000008, "Wrong alignment on UEndTurnCallbackProxy");
static_assert(sizeof(UEndTurnCallbackProxy) == 0x000078, "Wrong size on UEndTurnCallbackProxy");
static_assert(offsetof(UEndTurnCallbackProxy, OnSuccess) == 0x000030, "Member 'UEndTurnCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UEndTurnCallbackProxy, OnFailure) == 0x000040, "Member 'UEndTurnCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.FindSessionsCallbackProxy
// 0x0060 (0x0090 - 0x0030)
class UFindSessionsCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1682[0x40];                                    // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFindSessionsCallbackProxy* FindSessions(class UObject* WorldContextObject, class APlayerController* PlayerController, int32 MaxResults, bool bUseLAN);
	static int32 GetCurrentPlayers(const struct FBlueprintSessionResult& Result);
	static int32 GetMaxPlayers(const struct FBlueprintSessionResult& Result);
	static int32 GetPingInMs(const struct FBlueprintSessionResult& Result);
	static class FString GetServerName(const struct FBlueprintSessionResult& Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FindSessionsCallbackProxy">();
	}
	static class UFindSessionsCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFindSessionsCallbackProxy>();
	}
};
static_assert(alignof(UFindSessionsCallbackProxy) == 0x000008, "Wrong alignment on UFindSessionsCallbackProxy");
static_assert(sizeof(UFindSessionsCallbackProxy) == 0x000090, "Wrong size on UFindSessionsCallbackProxy");
static_assert(offsetof(UFindSessionsCallbackProxy, OnSuccess) == 0x000030, "Member 'UFindSessionsCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UFindSessionsCallbackProxy, OnFailure) == 0x000040, "Member 'UFindSessionsCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.FindTurnBasedMatchCallbackProxy
// 0x0058 (0x0088 - 0x0030)
class UFindTurnBasedMatchCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1687[0x38];                                    // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFindTurnBasedMatchCallbackProxy* FindTurnBasedMatch(class UObject* WorldContextObject, class APlayerController* PlayerController, TScriptInterface<class ITurnBasedMatchInterface> MatchActor, int32 MinPlayers, int32 MaxPlayers, int32 PlayerGroup, bool ShowExistingMatches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FindTurnBasedMatchCallbackProxy">();
	}
	static class UFindTurnBasedMatchCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFindTurnBasedMatchCallbackProxy>();
	}
};
static_assert(alignof(UFindTurnBasedMatchCallbackProxy) == 0x000008, "Wrong alignment on UFindTurnBasedMatchCallbackProxy");
static_assert(sizeof(UFindTurnBasedMatchCallbackProxy) == 0x000088, "Wrong size on UFindTurnBasedMatchCallbackProxy");
static_assert(offsetof(UFindTurnBasedMatchCallbackProxy, OnSuccess) == 0x000030, "Member 'UFindTurnBasedMatchCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UFindTurnBasedMatchCallbackProxy, OnFailure) == 0x000040, "Member 'UFindTurnBasedMatchCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.InAppPurchaseCallbackProxy2
// 0x0080 (0x00A8 - 0x0028)
class UInAppPurchaseCallbackProxy2 final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1689[0x60];                                    // 0x0048(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UInAppPurchaseCallbackProxy2* CreateProxyObjectForInAppPurchase(class APlayerController* PlayerController, const struct FInAppPurchaseProductRequest2& ProductRequest);
	static class UInAppPurchaseCallbackProxy2* CreateProxyObjectForInAppPurchaseQueryOwned(class APlayerController* PlayerController);
	static class UInAppPurchaseCallbackProxy2* CreateProxyObjectForInAppPurchaseUnprocessedPurchases(class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseCallbackProxy2">();
	}
	static class UInAppPurchaseCallbackProxy2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseCallbackProxy2>();
	}
};
static_assert(alignof(UInAppPurchaseCallbackProxy2) == 0x000008, "Wrong alignment on UInAppPurchaseCallbackProxy2");
static_assert(sizeof(UInAppPurchaseCallbackProxy2) == 0x0000A8, "Wrong size on UInAppPurchaseCallbackProxy2");
static_assert(offsetof(UInAppPurchaseCallbackProxy2, OnSuccess) == 0x000028, "Member 'UInAppPurchaseCallbackProxy2::OnSuccess' has a wrong offset!");
static_assert(offsetof(UInAppPurchaseCallbackProxy2, OnFailure) == 0x000038, "Member 'UInAppPurchaseCallbackProxy2::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.InAppPurchaseCheckoutCallbackProxy
// 0x0078 (0x00A0 - 0x0028)
class UInAppPurchaseCheckoutCallbackProxy final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_168A[0x58];                                    // 0x0048(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UInAppPurchaseCheckoutCallbackProxy* CreateProxyObjectForInAppPurchaseCheckout(class APlayerController* PlayerController, const struct FInAppPurchaseProductRequest2& ProductRequest);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseCheckoutCallbackProxy">();
	}
	static class UInAppPurchaseCheckoutCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseCheckoutCallbackProxy>();
	}
};
static_assert(alignof(UInAppPurchaseCheckoutCallbackProxy) == 0x000008, "Wrong alignment on UInAppPurchaseCheckoutCallbackProxy");
static_assert(sizeof(UInAppPurchaseCheckoutCallbackProxy) == 0x0000A0, "Wrong size on UInAppPurchaseCheckoutCallbackProxy");
static_assert(offsetof(UInAppPurchaseCheckoutCallbackProxy, OnSuccess) == 0x000028, "Member 'UInAppPurchaseCheckoutCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UInAppPurchaseCheckoutCallbackProxy, OnFailure) == 0x000038, "Member 'UInAppPurchaseCheckoutCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.InAppPurchaseFinalizeProxy
// 0x0000 (0x0028 - 0x0028)
class UInAppPurchaseFinalizeProxy final : public UObject
{
public:
	static class UInAppPurchaseFinalizeProxy* CreateProxyObjectForInAppPurchaseFinalize(const struct FInAppPurchaseReceiptInfo2& InAppPurchaseReceipt, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseFinalizeProxy">();
	}
	static class UInAppPurchaseFinalizeProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseFinalizeProxy>();
	}
};
static_assert(alignof(UInAppPurchaseFinalizeProxy) == 0x000008, "Wrong alignment on UInAppPurchaseFinalizeProxy");
static_assert(sizeof(UInAppPurchaseFinalizeProxy) == 0x000028, "Wrong size on UInAppPurchaseFinalizeProxy");

// Class OnlineSubsystemUtils.InAppPurchaseQueryCallbackProxy2
// 0x0040 (0x0068 - 0x0028)
class UInAppPurchaseQueryCallbackProxy2 final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_168B[0x20];                                    // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UInAppPurchaseQueryCallbackProxy2* CreateProxyObjectForInAppPurchaseQuery(class APlayerController* PlayerController, const TArray<class FString>& ProductIdentifiers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseQueryCallbackProxy2">();
	}
	static class UInAppPurchaseQueryCallbackProxy2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseQueryCallbackProxy2>();
	}
};
static_assert(alignof(UInAppPurchaseQueryCallbackProxy2) == 0x000008, "Wrong alignment on UInAppPurchaseQueryCallbackProxy2");
static_assert(sizeof(UInAppPurchaseQueryCallbackProxy2) == 0x000068, "Wrong size on UInAppPurchaseQueryCallbackProxy2");
static_assert(offsetof(UInAppPurchaseQueryCallbackProxy2, OnSuccess) == 0x000028, "Member 'UInAppPurchaseQueryCallbackProxy2::OnSuccess' has a wrong offset!");
static_assert(offsetof(UInAppPurchaseQueryCallbackProxy2, OnFailure) == 0x000038, "Member 'UInAppPurchaseQueryCallbackProxy2::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.InAppPurchaseReceiptsCallbackProxy
// 0x0060 (0x0088 - 0x0028)
class UInAppPurchaseReceiptsCallbackProxy final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_168C[0x40];                                    // 0x0048(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UInAppPurchaseReceiptsCallbackProxy* CreateProxyObjectForInAppPurchaseGetKnownReceipts(class APlayerController* PlayerController);
	static class UInAppPurchaseReceiptsCallbackProxy* CreateProxyObjectForInAppPurchaseQueryOwnedProducts(class APlayerController* PlayerController);
	static class UInAppPurchaseReceiptsCallbackProxy* CreateProxyObjectForInAppPurchaseRestoreOwnedProducts(class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseReceiptsCallbackProxy">();
	}
	static class UInAppPurchaseReceiptsCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseReceiptsCallbackProxy>();
	}
};
static_assert(alignof(UInAppPurchaseReceiptsCallbackProxy) == 0x000008, "Wrong alignment on UInAppPurchaseReceiptsCallbackProxy");
static_assert(sizeof(UInAppPurchaseReceiptsCallbackProxy) == 0x000088, "Wrong size on UInAppPurchaseReceiptsCallbackProxy");
static_assert(offsetof(UInAppPurchaseReceiptsCallbackProxy, OnSuccess) == 0x000028, "Member 'UInAppPurchaseReceiptsCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UInAppPurchaseReceiptsCallbackProxy, OnFailure) == 0x000038, "Member 'UInAppPurchaseReceiptsCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.InAppPurchaseRestoreCallbackProxy2
// 0x0088 (0x00B0 - 0x0028)
class UInAppPurchaseRestoreCallbackProxy2 final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_168D[0x68];                                    // 0x0048(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UInAppPurchaseRestoreCallbackProxy2* CreateProxyObjectForInAppPurchaseRestore(const TArray<struct FInAppPurchaseProductRequest2>& ConsumableProductFlags, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseRestoreCallbackProxy2">();
	}
	static class UInAppPurchaseRestoreCallbackProxy2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseRestoreCallbackProxy2>();
	}
};
static_assert(alignof(UInAppPurchaseRestoreCallbackProxy2) == 0x000008, "Wrong alignment on UInAppPurchaseRestoreCallbackProxy2");
static_assert(sizeof(UInAppPurchaseRestoreCallbackProxy2) == 0x0000B0, "Wrong size on UInAppPurchaseRestoreCallbackProxy2");
static_assert(offsetof(UInAppPurchaseRestoreCallbackProxy2, OnSuccess) == 0x000028, "Member 'UInAppPurchaseRestoreCallbackProxy2::OnSuccess' has a wrong offset!");
static_assert(offsetof(UInAppPurchaseRestoreCallbackProxy2, OnFailure) == 0x000038, "Member 'UInAppPurchaseRestoreCallbackProxy2::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.IpConnection
// 0x0090 (0x1E88 - 0x1DF8)
class UIpConnection : public UNetConnection
{
public:
	uint8                                         Pad_168E[0x74];                                    // 0x1DF8(0x0074)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SocketErrorDisconnectDelay;                        // 0x1E6C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_168F[0x18];                                    // 0x1E70(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IpConnection">();
	}
	static class UIpConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIpConnection>();
	}
};
static_assert(alignof(UIpConnection) == 0x000008, "Wrong alignment on UIpConnection");
static_assert(sizeof(UIpConnection) == 0x001E88, "Wrong size on UIpConnection");
static_assert(offsetof(UIpConnection, SocketErrorDisconnectDelay) == 0x001E6C, "Member 'UIpConnection::SocketErrorDisconnectDelay' has a wrong offset!");

// Class OnlineSubsystemUtils.IpNetDriver
// 0x00B0 (0x08A0 - 0x07F0)
class UIpNetDriver : public UNetDriver
{
public:
	uint8                                         LogPortUnreach : 1;                                // 0x07F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         AllowPlayerPortUnreach : 1;                        // 0x07F0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExitOnBindFailure : 1;                            // 0x07F0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1690[0x3];                                     // 0x07F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        MaxPortCountToTry;                                 // 0x07F4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1691[0x4];                                     // 0x07F8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        ServerDesiredSocketReceiveBufferBytes;             // 0x07FC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ServerDesiredSocketSendBufferBytes;                // 0x0800(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ClientDesiredSocketReceiveBufferBytes;             // 0x0804(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ClientDesiredSocketSendBufferBytes;                // 0x0808(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1692[0x4];                                     // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxSecondsInReceive;                               // 0x0810(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NbPacketsBetweenReceiveTimeTest;                   // 0x0818(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ResolutionConnectionTimeout;                       // 0x081C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1693[0x80];                                    // 0x0820(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IpNetDriver">();
	}
	static class UIpNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIpNetDriver>();
	}
};
static_assert(alignof(UIpNetDriver) == 0x000008, "Wrong alignment on UIpNetDriver");
static_assert(sizeof(UIpNetDriver) == 0x0008A0, "Wrong size on UIpNetDriver");
static_assert(offsetof(UIpNetDriver, MaxPortCountToTry) == 0x0007F4, "Member 'UIpNetDriver::MaxPortCountToTry' has a wrong offset!");
static_assert(offsetof(UIpNetDriver, ServerDesiredSocketReceiveBufferBytes) == 0x0007FC, "Member 'UIpNetDriver::ServerDesiredSocketReceiveBufferBytes' has a wrong offset!");
static_assert(offsetof(UIpNetDriver, ServerDesiredSocketSendBufferBytes) == 0x000800, "Member 'UIpNetDriver::ServerDesiredSocketSendBufferBytes' has a wrong offset!");
static_assert(offsetof(UIpNetDriver, ClientDesiredSocketReceiveBufferBytes) == 0x000804, "Member 'UIpNetDriver::ClientDesiredSocketReceiveBufferBytes' has a wrong offset!");
static_assert(offsetof(UIpNetDriver, ClientDesiredSocketSendBufferBytes) == 0x000808, "Member 'UIpNetDriver::ClientDesiredSocketSendBufferBytes' has a wrong offset!");
static_assert(offsetof(UIpNetDriver, MaxSecondsInReceive) == 0x000810, "Member 'UIpNetDriver::MaxSecondsInReceive' has a wrong offset!");
static_assert(offsetof(UIpNetDriver, NbPacketsBetweenReceiveTimeTest) == 0x000818, "Member 'UIpNetDriver::NbPacketsBetweenReceiveTimeTest' has a wrong offset!");
static_assert(offsetof(UIpNetDriver, ResolutionConnectionTimeout) == 0x00081C, "Member 'UIpNetDriver::ResolutionConnectionTimeout' has a wrong offset!");

// Class OnlineSubsystemUtils.JoinSessionCallbackProxy
// 0x0168 (0x0198 - 0x0030)
class UJoinSessionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1694[0x148];                                   // 0x0050(0x0148)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UJoinSessionCallbackProxy* JoinSession(class UObject* WorldContextObject, class APlayerController* PlayerController, const struct FBlueprintSessionResult& SearchResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JoinSessionCallbackProxy">();
	}
	static class UJoinSessionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinSessionCallbackProxy>();
	}
};
static_assert(alignof(UJoinSessionCallbackProxy) == 0x000008, "Wrong alignment on UJoinSessionCallbackProxy");
static_assert(sizeof(UJoinSessionCallbackProxy) == 0x000198, "Wrong size on UJoinSessionCallbackProxy");
static_assert(offsetof(UJoinSessionCallbackProxy, OnSuccess) == 0x000030, "Member 'UJoinSessionCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UJoinSessionCallbackProxy, OnFailure) == 0x000040, "Member 'UJoinSessionCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.LeaderboardBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class ULeaderboardBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool WriteLeaderboardInteger(class APlayerController* PlayerController, class FName StatName, int32 StatValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeaderboardBlueprintLibrary">();
	}
	static class ULeaderboardBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardBlueprintLibrary>();
	}
};
static_assert(alignof(ULeaderboardBlueprintLibrary) == 0x000008, "Wrong alignment on ULeaderboardBlueprintLibrary");
static_assert(sizeof(ULeaderboardBlueprintLibrary) == 0x000028, "Wrong size on ULeaderboardBlueprintLibrary");

// Class OnlineSubsystemUtils.LeaderboardFlushCallbackProxy
// 0x0040 (0x0068 - 0x0028)
class ULeaderboardFlushCallbackProxy final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1696[0x20];                                    // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULeaderboardFlushCallbackProxy* CreateProxyObjectForFlush(class APlayerController* PlayerController, class FName SessionName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeaderboardFlushCallbackProxy">();
	}
	static class ULeaderboardFlushCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardFlushCallbackProxy>();
	}
};
static_assert(alignof(ULeaderboardFlushCallbackProxy) == 0x000008, "Wrong alignment on ULeaderboardFlushCallbackProxy");
static_assert(sizeof(ULeaderboardFlushCallbackProxy) == 0x000068, "Wrong size on ULeaderboardFlushCallbackProxy");
static_assert(offsetof(ULeaderboardFlushCallbackProxy, OnSuccess) == 0x000028, "Member 'ULeaderboardFlushCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(ULeaderboardFlushCallbackProxy, OnFailure) == 0x000038, "Member 'ULeaderboardFlushCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.LeaderboardQueryCallbackProxy
// 0x0070 (0x0098 - 0x0028)
class ULeaderboardQueryCallbackProxy final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1697[0x50];                                    // 0x0048(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULeaderboardQueryCallbackProxy* CreateProxyObjectForIntQuery(class APlayerController* PlayerController, class FName StatName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeaderboardQueryCallbackProxy">();
	}
	static class ULeaderboardQueryCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardQueryCallbackProxy>();
	}
};
static_assert(alignof(ULeaderboardQueryCallbackProxy) == 0x000008, "Wrong alignment on ULeaderboardQueryCallbackProxy");
static_assert(sizeof(ULeaderboardQueryCallbackProxy) == 0x000098, "Wrong size on ULeaderboardQueryCallbackProxy");
static_assert(offsetof(ULeaderboardQueryCallbackProxy, OnSuccess) == 0x000028, "Member 'ULeaderboardQueryCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(ULeaderboardQueryCallbackProxy, OnFailure) == 0x000038, "Member 'ULeaderboardQueryCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.LogoutCallbackProxy
// 0x0038 (0x0068 - 0x0030)
class ULogoutCallbackProxy final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1698[0x18];                                    // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULogoutCallbackProxy* Logout(class UObject* WorldContextObject, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LogoutCallbackProxy">();
	}
	static class ULogoutCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogoutCallbackProxy>();
	}
};
static_assert(alignof(ULogoutCallbackProxy) == 0x000008, "Wrong alignment on ULogoutCallbackProxy");
static_assert(sizeof(ULogoutCallbackProxy) == 0x000068, "Wrong size on ULogoutCallbackProxy");
static_assert(offsetof(ULogoutCallbackProxy, OnSuccess) == 0x000030, "Member 'ULogoutCallbackProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(ULogoutCallbackProxy, OnFailure) == 0x000040, "Member 'ULogoutCallbackProxy::OnFailure' has a wrong offset!");

// Class OnlineSubsystemUtils.OnlineBeacon
// 0x0030 (0x02C8 - 0x0298)
class AOnlineBeacon : public AActor
{
public:
	uint8                                         Pad_1699[0x8];                                     // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BeaconConnectionInitialTimeout;                    // 0x02A0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BeaconConnectionTimeout;                           // 0x02A4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNetDriver*                             NetDriver;                                         // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169A[0x18];                                    // 0x02B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineBeacon">();
	}
	static class AOnlineBeacon* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlineBeacon>();
	}
};
static_assert(alignof(AOnlineBeacon) == 0x000008, "Wrong alignment on AOnlineBeacon");
static_assert(sizeof(AOnlineBeacon) == 0x0002C8, "Wrong size on AOnlineBeacon");
static_assert(offsetof(AOnlineBeacon, BeaconConnectionInitialTimeout) == 0x0002A0, "Member 'AOnlineBeacon::BeaconConnectionInitialTimeout' has a wrong offset!");
static_assert(offsetof(AOnlineBeacon, BeaconConnectionTimeout) == 0x0002A4, "Member 'AOnlineBeacon::BeaconConnectionTimeout' has a wrong offset!");
static_assert(offsetof(AOnlineBeacon, NetDriver) == 0x0002A8, "Member 'AOnlineBeacon::NetDriver' has a wrong offset!");

// Class OnlineSubsystemUtils.OnlineBeaconClient
// 0x0060 (0x0328 - 0x02C8)
class AOnlineBeaconClient : public AOnlineBeacon
{
public:
	class AOnlineBeaconHostObject*                BeaconOwner;                                       // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNetConnection*                         BeaconConnection;                                  // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBeaconConnectionState                        ConnectionState;                                   // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169B[0x4F];                                    // 0x02D9(0x004F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientOnConnected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineBeaconClient">();
	}
	static class AOnlineBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlineBeaconClient>();
	}
};
static_assert(alignof(AOnlineBeaconClient) == 0x000008, "Wrong alignment on AOnlineBeaconClient");
static_assert(sizeof(AOnlineBeaconClient) == 0x000328, "Wrong size on AOnlineBeaconClient");
static_assert(offsetof(AOnlineBeaconClient, BeaconOwner) == 0x0002C8, "Member 'AOnlineBeaconClient::BeaconOwner' has a wrong offset!");
static_assert(offsetof(AOnlineBeaconClient, BeaconConnection) == 0x0002D0, "Member 'AOnlineBeaconClient::BeaconConnection' has a wrong offset!");
static_assert(offsetof(AOnlineBeaconClient, ConnectionState) == 0x0002D8, "Member 'AOnlineBeaconClient::ConnectionState' has a wrong offset!");

// Class OnlineSubsystemUtils.OnlineBeaconHost
// 0x0110 (0x03D8 - 0x02C8)
class AOnlineBeaconHost final : public AOnlineBeacon
{
public:
	int32                                         ListenPort;                                        // 0x02C8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseAddressAndPort;                              // 0x02CC(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAuthRequired;                                     // 0x02CD(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169C[0x2];                                     // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        MaxAuthTokenSize;                                  // 0x02D0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169D[0x54];                                    // 0x02D4(0x0054)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AOnlineBeaconClient*>            ClientActors;                                      // 0x0328(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_169E[0xA0];                                    // 0x0338(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineBeaconHost">();
	}
	static class AOnlineBeaconHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlineBeaconHost>();
	}
};
static_assert(alignof(AOnlineBeaconHost) == 0x000008, "Wrong alignment on AOnlineBeaconHost");
static_assert(sizeof(AOnlineBeaconHost) == 0x0003D8, "Wrong size on AOnlineBeaconHost");
static_assert(offsetof(AOnlineBeaconHost, ListenPort) == 0x0002C8, "Member 'AOnlineBeaconHost::ListenPort' has a wrong offset!");
static_assert(offsetof(AOnlineBeaconHost, bReuseAddressAndPort) == 0x0002CC, "Member 'AOnlineBeaconHost::bReuseAddressAndPort' has a wrong offset!");
static_assert(offsetof(AOnlineBeaconHost, bAuthRequired) == 0x0002CD, "Member 'AOnlineBeaconHost::bAuthRequired' has a wrong offset!");
static_assert(offsetof(AOnlineBeaconHost, MaxAuthTokenSize) == 0x0002D0, "Member 'AOnlineBeaconHost::MaxAuthTokenSize' has a wrong offset!");
static_assert(offsetof(AOnlineBeaconHost, ClientActors) == 0x000328, "Member 'AOnlineBeaconHost::ClientActors' has a wrong offset!");

// Class OnlineSubsystemUtils.OnlineBeaconHostObject
// 0x0028 (0x02C0 - 0x0298)
class AOnlineBeaconHostObject : public AActor
{
public:
	class FString                                 BeaconTypeName;                                    // 0x0298(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AOnlineBeaconClient>        ClientBeaconActorClass;                            // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AOnlineBeaconClient*>            ClientActors;                                      // 0x02B0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineBeaconHostObject">();
	}
	static class AOnlineBeaconHostObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlineBeaconHostObject>();
	}
};
static_assert(alignof(AOnlineBeaconHostObject) == 0x000008, "Wrong alignment on AOnlineBeaconHostObject");
static_assert(sizeof(AOnlineBeaconHostObject) == 0x0002C0, "Wrong size on AOnlineBeaconHostObject");
static_assert(offsetof(AOnlineBeaconHostObject, BeaconTypeName) == 0x000298, "Member 'AOnlineBeaconHostObject::BeaconTypeName' has a wrong offset!");
static_assert(offsetof(AOnlineBeaconHostObject, ClientBeaconActorClass) == 0x0002A8, "Member 'AOnlineBeaconHostObject::ClientBeaconActorClass' has a wrong offset!");
static_assert(offsetof(AOnlineBeaconHostObject, ClientActors) == 0x0002B0, "Member 'AOnlineBeaconHostObject::ClientActors' has a wrong offset!");

// Class OnlineSubsystemUtils.OnlineEngineInterfaceImpl
// 0x0160 (0x0188 - 0x0028)
class UOnlineEngineInterfaceImpl final : public UOnlineEngineInterface
{
public:
	TMap<class FName, class FName>                MappedUniqueNetIdTypes;                            // 0x0028(0x0050)(Config, NativeAccessSpecifierPrivate)
	TArray<class FName>                           CompatibleUniqueNetIdTypes;                        // 0x0078(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FName                                   VoiceSubsystemNameOverride;                        // 0x0088(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_169F[0xF8];                                    // 0x0090(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineEngineInterfaceImpl">();
	}
	static class UOnlineEngineInterfaceImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineEngineInterfaceImpl>();
	}
};
static_assert(alignof(UOnlineEngineInterfaceImpl) == 0x000008, "Wrong alignment on UOnlineEngineInterfaceImpl");
static_assert(sizeof(UOnlineEngineInterfaceImpl) == 0x000188, "Wrong size on UOnlineEngineInterfaceImpl");
static_assert(offsetof(UOnlineEngineInterfaceImpl, MappedUniqueNetIdTypes) == 0x000028, "Member 'UOnlineEngineInterfaceImpl::MappedUniqueNetIdTypes' has a wrong offset!");
static_assert(offsetof(UOnlineEngineInterfaceImpl, CompatibleUniqueNetIdTypes) == 0x000078, "Member 'UOnlineEngineInterfaceImpl::CompatibleUniqueNetIdTypes' has a wrong offset!");
static_assert(offsetof(UOnlineEngineInterfaceImpl, VoiceSubsystemNameOverride) == 0x000088, "Member 'UOnlineEngineInterfaceImpl::VoiceSubsystemNameOverride' has a wrong offset!");

// Class OnlineSubsystemUtils.OnlinePIESettings
// 0x0018 (0x0050 - 0x0038)
class UOnlinePIESettings final : public UDeveloperSettings
{
public:
	bool                                          bOnlinePIEEnabled;                                 // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16A0[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPIELoginSettingsInternal>      Logins;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlinePIESettings">();
	}
	static class UOnlinePIESettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlinePIESettings>();
	}
};
static_assert(alignof(UOnlinePIESettings) == 0x000008, "Wrong alignment on UOnlinePIESettings");
static_assert(sizeof(UOnlinePIESettings) == 0x000050, "Wrong size on UOnlinePIESettings");
static_assert(offsetof(UOnlinePIESettings, bOnlinePIEEnabled) == 0x000038, "Member 'UOnlinePIESettings::bOnlinePIEEnabled' has a wrong offset!");
static_assert(offsetof(UOnlinePIESettings, Logins) == 0x000040, "Member 'UOnlinePIESettings::Logins' has a wrong offset!");

// Class OnlineSubsystemUtils.OnlineServicesEngineInterfaceImpl
// 0x0000 (0x0028 - 0x0028)
class UOnlineServicesEngineInterfaceImpl final : public UOnlineEngineInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineServicesEngineInterfaceImpl">();
	}
	static class UOnlineServicesEngineInterfaceImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineServicesEngineInterfaceImpl>();
	}
};
static_assert(alignof(UOnlineServicesEngineInterfaceImpl) == 0x000008, "Wrong alignment on UOnlineServicesEngineInterfaceImpl");
static_assert(sizeof(UOnlineServicesEngineInterfaceImpl) == 0x000028, "Wrong size on UOnlineServicesEngineInterfaceImpl");

// Class OnlineSubsystemUtils.OnlineSessionClient
// 0x01B8 (0x01E0 - 0x0028)
class UOnlineSessionClient final : public UOnlineSession
{
public:
	uint8                                         Pad_16A1[0x1B0];                                   // 0x0028(0x01B0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsFromInvite;                                     // 0x01D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHandlingDisconnect;                               // 0x01D9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16A2[0x6];                                     // 0x01DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSessionClient">();
	}
	static class UOnlineSessionClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSessionClient>();
	}
};
static_assert(alignof(UOnlineSessionClient) == 0x000008, "Wrong alignment on UOnlineSessionClient");
static_assert(sizeof(UOnlineSessionClient) == 0x0001E0, "Wrong size on UOnlineSessionClient");
static_assert(offsetof(UOnlineSessionClient, bIsFromInvite) == 0x0001D8, "Member 'UOnlineSessionClient::bIsFromInvite' has a wrong offset!");
static_assert(offsetof(UOnlineSessionClient, bHandlingDisconnect) == 0x0001D9, "Member 'UOnlineSessionClient::bHandlingDisconnect' has a wrong offset!");

// Class OnlineSubsystemUtils.PartyBeaconClient
// 0x00C8 (0x03F0 - 0x0328)
class APartyBeaconClient final : public AOnlineBeaconClient
{
public:
	uint8                                         Pad_16A3[0x30];                                    // 0x0328(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DestSessionId;                                     // 0x0358(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPartyReservation                      PendingReservation;                                // 0x0368(0x0058)(Protected, NativeAccessSpecifierProtected)
	EClientRequestType                            RequestType;                                       // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingReservationSent;                           // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCancelReservation;                                // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16A4[0x2D];                                    // 0x03C3(0x002D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientCancelReservationResponse(EPartyReservationResult ReservationResponse);
	void ClientReservationResponse(EPartyReservationResult ReservationResponse);
	void ClientSendReservationFull();
	void ClientSendReservationUpdates(int32 NumRemainingReservations);
	void ServerAddOrUpdateReservationRequest(const class FString& SessionID, const struct FPartyReservation& Reservation);
	void ServerCancelReservationRequest(const struct FUniqueNetIdRepl& PartyLeader);
	void ServerRemoveMemberFromReservationRequest(const class FString& SessionID, const struct FPartyReservation& ReservationUpdate);
	void ServerReservationRequest(const class FString& SessionID, const struct FPartyReservation& Reservation);
	void ServerUpdateReservationRequest(const class FString& SessionID, const struct FPartyReservation& ReservationUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartyBeaconClient">();
	}
	static class APartyBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<APartyBeaconClient>();
	}
};
static_assert(alignof(APartyBeaconClient) == 0x000008, "Wrong alignment on APartyBeaconClient");
static_assert(sizeof(APartyBeaconClient) == 0x0003F0, "Wrong size on APartyBeaconClient");
static_assert(offsetof(APartyBeaconClient, DestSessionId) == 0x000358, "Member 'APartyBeaconClient::DestSessionId' has a wrong offset!");
static_assert(offsetof(APartyBeaconClient, PendingReservation) == 0x000368, "Member 'APartyBeaconClient::PendingReservation' has a wrong offset!");
static_assert(offsetof(APartyBeaconClient, RequestType) == 0x0003C0, "Member 'APartyBeaconClient::RequestType' has a wrong offset!");
static_assert(offsetof(APartyBeaconClient, bPendingReservationSent) == 0x0003C1, "Member 'APartyBeaconClient::bPendingReservationSent' has a wrong offset!");
static_assert(offsetof(APartyBeaconClient, bCancelReservation) == 0x0003C2, "Member 'APartyBeaconClient::bCancelReservation' has a wrong offset!");

// Class OnlineSubsystemUtils.PartyBeaconHost
// 0x0078 (0x0338 - 0x02C0)
class APartyBeaconHost final : public AOnlineBeaconHostObject
{
public:
	class UPartyBeaconState*                      State;                                             // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16A5[0x60];                                    // 0x02C8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLogoutOnSessionTimeout;                           // 0x0328(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsValidationStrRequired;                          // 0x0329(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16A6[0x2];                                     // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SessionTimeoutSecs;                                // 0x032C(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TravelSessionTimeoutSecs;                          // 0x0330(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16A7[0x4];                                     // 0x0334(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
