#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystem

#include "Basic.hpp"


namespace SDK
{

// Enum OnlineSubsystem.EInAppPurchaseState
// NumValues: 0x0009
enum class EInAppPurchaseState : uint8
{
	Unknown                                  = 0,
	Success                                  = 1,
	Failed                                   = 2,
	Cancelled                                = 3,
	Invalid                                  = 4,
	NotAllowed                               = 5,
	Restored                                 = 6,
	AlreadyOwned                             = 7,
	EInAppPurchaseState_MAX                  = 8,
};

// Enum OnlineSubsystem.EMPMatchOutcome
// NumValues: 0x000B
enum class EMPMatchOutcome : uint8
{
	None                                     = 0,
	Quit                                     = 1,
	Won                                      = 2,
	Lost                                     = 3,
	Tied                                     = 4,
	TimeExpired                              = 5,
	First                                    = 6,
	Second                                   = 7,
	Third                                    = 8,
	Fourth                                   = 9,
	EMPMatchOutcome_MAX                      = 10,
};

// ScriptStruct OnlineSubsystem.NamedInterface
// 0x0010 (0x0010 - 0x0000)
struct FNamedInterface final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InterfaceObject;                                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNamedInterface) == 0x000008, "Wrong alignment on FNamedInterface");
static_assert(sizeof(FNamedInterface) == 0x000010, "Wrong size on FNamedInterface");
static_assert(offsetof(FNamedInterface, InterfaceName) == 0x000000, "Member 'FNamedInterface::InterfaceName' has a wrong offset!");
static_assert(offsetof(FNamedInterface, InterfaceObject) == 0x000008, "Member 'FNamedInterface::InterfaceObject' has a wrong offset!");

// ScriptStruct OnlineSubsystem.NamedInterfaceDef
// 0x0018 (0x0018 - 0x0000)
struct FNamedInterfaceDef final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InterfaceClassName;                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNamedInterfaceDef) == 0x000008, "Wrong alignment on FNamedInterfaceDef");
static_assert(sizeof(FNamedInterfaceDef) == 0x000018, "Wrong size on FNamedInterfaceDef");
static_assert(offsetof(FNamedInterfaceDef, InterfaceName) == 0x000000, "Member 'FNamedInterfaceDef::InterfaceName' has a wrong offset!");
static_assert(offsetof(FNamedInterfaceDef, InterfaceClassName) == 0x000008, "Member 'FNamedInterfaceDef::InterfaceClassName' has a wrong offset!");

}

