#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PathSides_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PathSides_BP.PathSides_BP_C
// 0x0070 (0x0308 - 0x0298)
class APathSides_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_ujriaadga;               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_ujriaadga1;              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   W;                                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_tfxteboda;               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_tfxteboda6;              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_tfxteboda5;              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_tfxteboda4;              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_tfxteboda3;              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_tfxteboda2;              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Concrete_Rubble_Pile_LOD0_tfxteboda1;              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   W1;                                                // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   UnderworldPathSides;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Sand;                                              // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PathSides_BP_C">();
	}
	static class APathSides_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APathSides_BP_C>();
	}
};
static_assert(alignof(APathSides_BP_C) == 0x000008, "Wrong alignment on APathSides_BP_C");
static_assert(sizeof(APathSides_BP_C) == 0x000308, "Wrong size on APathSides_BP_C");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_ujriaadga) == 0x000298, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_ujriaadga' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_ujriaadga1) == 0x0002A0, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_ujriaadga1' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, W) == 0x0002A8, "Member 'APathSides_BP_C::W' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_tfxteboda) == 0x0002B0, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_tfxteboda' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_tfxteboda6) == 0x0002B8, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_tfxteboda6' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_tfxteboda5) == 0x0002C0, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_tfxteboda5' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_tfxteboda4) == 0x0002C8, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_tfxteboda4' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_tfxteboda3) == 0x0002D0, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_tfxteboda3' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_tfxteboda2) == 0x0002D8, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_tfxteboda2' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Concrete_Rubble_Pile_LOD0_tfxteboda1) == 0x0002E0, "Member 'APathSides_BP_C::Concrete_Rubble_Pile_LOD0_tfxteboda1' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, W1) == 0x0002E8, "Member 'APathSides_BP_C::W1' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, UnderworldPathSides) == 0x0002F0, "Member 'APathSides_BP_C::UnderworldPathSides' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, DefaultSceneRoot) == 0x0002F8, "Member 'APathSides_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APathSides_BP_C, Sand) == 0x000300, "Member 'APathSides_BP_C::Sand' has a wrong offset!");

}

