#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Game

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ChoosenChar_structs.hpp"
#include "SteamCorePro_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PC_Game.PC_Game_C.DetectInteraction
// 0x02F0 (0x02F0 - 0x0000)
struct PC_Game_C_DetectInteraction final
{
public:
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction;              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3334[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3335[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_LocalMP_Use_C*                       CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToPlayerScreen_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3336[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3337[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLavaDead_Dead;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               CallFunc_TraceVisibility_Result;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3338[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3339[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333A[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333B[0x1];                                     // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333C[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333D[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction_1;            // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeUsed_CanBeUsed;                      // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333E[0x5];                                     // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction_2;            // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333F[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction_3;            // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Game_C_DetectInteraction) == 0x000008, "Wrong alignment on PC_Game_C_DetectInteraction");
static_assert(sizeof(PC_Game_C_DetectInteraction) == 0x0002F0, "Wrong size on PC_Game_C_DetectInteraction");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_K2_GetPawn_ReturnValue) == 0x000000, "Member 'PC_Game_C_DetectInteraction::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_AsBPI_Interaction) == 0x000008, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_AsBPI_Interaction' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_MakeArray_Array) == 0x000020, "Member 'PC_Game_C_DetectInteraction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x000030, "Member 'PC_Game_C_DetectInteraction::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_Create_ReturnValue) == 0x000038, "Member 'PC_Game_C_DetectInteraction::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_GetLocalMultiplayer_ReturnValue_1) == 0x000040, "Member 'PC_Game_C_DetectInteraction::CallFunc_GetLocalMultiplayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_AddToPlayerScreen_ReturnValue) == 0x000041, "Member 'PC_Game_C_DetectInteraction::CallFunc_AddToPlayerScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'PC_Game_C_DetectInteraction::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'PC_Game_C_DetectInteraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_AsBPI_Gamestate) == 0x000058, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_GetLavaDead_Dead) == 0x000069, "Member 'PC_Game_C_DetectInteraction::CallFunc_GetLavaDead_Dead' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_TraceVisibility_Result) == 0x00006A, "Member 'PC_Game_C_DetectInteraction::CallFunc_TraceVisibility_Result' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000070, "Member 'PC_Game_C_DetectInteraction::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'PC_Game_C_DetectInteraction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_GetActorForwardVector_ReturnValue) == 0x000080, "Member 'PC_Game_C_DetectInteraction::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000098, "Member 'PC_Game_C_DetectInteraction::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'PC_Game_C_DetectInteraction::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_DoesImplementInterface_ReturnValue) == 0x0000C8, "Member 'PC_Game_C_DetectInteraction::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'PC_Game_C_DetectInteraction::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_LineTraceSingle_OutHit) == 0x0000E8, "Member 'PC_Game_C_DetectInteraction::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_LineTraceSingle_ReturnValue) == 0x0001D0, "Member 'PC_Game_C_DetectInteraction::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_bBlockingHit) == 0x0001D1, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001D2, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_Time) == 0x0001D4, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_Distance) == 0x0001D8, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_Location) == 0x0001E0, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F8, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_Normal) == 0x000210, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_ImpactNormal) == 0x000228, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_PhysMat) == 0x000240, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_HitActor) == 0x000248, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_HitComponent) == 0x000250, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_HitBoneName) == 0x000258, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_BoneName) == 0x000260, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_HitItem) == 0x000268, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_ElementIndex) == 0x00026C, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_FaceIndex) == 0x000270, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_TraceStart) == 0x000278, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_BreakHitResult_TraceEnd) == 0x000290, "Member 'PC_Game_C_DetectInteraction::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_AsBPI_Interaction_1) == 0x0002A8, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_AsBPI_Interaction_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_bSuccess_2) == 0x0002B8, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_CanBeUsed_CanBeUsed) == 0x0002B9, "Member 'PC_Game_C_DetectInteraction::CallFunc_CanBeUsed_CanBeUsed' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_IsValid_ReturnValue_2) == 0x0002BA, "Member 'PC_Game_C_DetectInteraction::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_AsBPI_Interaction_2) == 0x0002C0, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_AsBPI_Interaction_2' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_bSuccess_3) == 0x0002D0, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_AsBPI_Interaction_3) == 0x0002D8, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_AsBPI_Interaction_3' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, K2Node_DynamicCast_bSuccess_4) == 0x0002E8, "Member 'PC_Game_C_DetectInteraction::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002E9, "Member 'PC_Game_C_DetectInteraction::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectInteraction, CallFunc_IsLocalController_ReturnValue) == 0x0002EA, "Member 'PC_Game_C_DetectInteraction::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");

// Function PC_Game.PC_Game_C.DetectPullCharacters
// 0x02B8 (0x02B8 - 0x0000)
struct PC_Game_C_DetectPullCharacters final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3340[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_1;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3341[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3342[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToPlayerScreen_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3343[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_2;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3344[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CallFunc_GetCapsuleComponent_Capsule;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MultiPullTrace_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3345[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_MultiPullTrace_HitsResult;                // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3346[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SelectCharacterToPull_HitActor;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectCharacterToPull_ReturnValue;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLavaDead_Dead;                         // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3347[0x5];                                     // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_3;              // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3348[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UW_LocalMP_Pull_C*                      CallFunc_Create_ReturnValue;                       // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3349[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_4;              // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnTyrolienne_ReturnValue;               // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334A[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_5;              // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCinematicMode_ReturnValue;            // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334B[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_6;              // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334C[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_7;              // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChained_ReturnValue;                    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_Jump;                    // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_Fall;                    // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334D[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAnimVariables_RadialVelocity;          // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAnimVariables_MoveInput;               // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_Climb;                   // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_Pull;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334E[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAnimVariables_PulledCharacter;         // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_IsDriving;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334F[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAnimVariables_DriveLeftHand;           // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAnimVariables_DriveRightHand;          // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimVariables_LookAround;              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3350[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3351[0x6];                                     // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Character_C>      K2Node_DynamicCast_AsBPI_Character_8;              // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Game_C_DetectPullCharacters) == 0x000008, "Wrong alignment on PC_Game_C_DetectPullCharacters");
static_assert(sizeof(PC_Game_C_DetectPullCharacters) == 0x0002B8, "Wrong size on PC_Game_C_DetectPullCharacters");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, ControlledPawn) == 0x000000, "Member 'PC_Game_C_DetectPullCharacters::ControlledPawn' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character) == 0x000008, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character_1) == 0x000020, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetDisplayName_ReturnValue_1) == 0x000050, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_AddToPlayerScreen_ReturnValue) == 0x000060, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_AddToPlayerScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_K2_GetPawn_ReturnValue) == 0x000068, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character_2) == 0x000088, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character_2' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000A0, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetCapsuleComponent_Capsule) == 0x0000B8, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetCapsuleComponent_Capsule' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000C0, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000F0, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetGameState_ReturnValue) == 0x000108, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_MultiPullTrace_ReturnValue) == 0x000110, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_MultiPullTrace_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_MultiPullTrace_HitsResult) == 0x000118, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_MultiPullTrace_HitsResult' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Gamestate) == 0x000128, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_3) == 0x000138, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_SelectCharacterToPull_HitActor) == 0x000140, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_SelectCharacterToPull_HitActor' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_SelectCharacterToPull_ReturnValue) == 0x000148, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_SelectCharacterToPull_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetLavaDead_Dead) == 0x000149, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetLavaDead_Dead' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsLocalPlayerController_ReturnValue) == 0x00014A, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character_3) == 0x000150, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character_3' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_4) == 0x000160, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_Concat_StrStr_ReturnValue) == 0x000168, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_Create_ReturnValue) == 0x000178, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000180, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x000190, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character_4) == 0x000198, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character_4' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_5) == 0x0001A8, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsOnTyrolienne_ReturnValue) == 0x0001A9, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsOnTyrolienne_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character_5) == 0x0001B0, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character_5' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_6) == 0x0001C0, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsInCinematicMode_ReturnValue) == 0x0001C1, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsInCinematicMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character_6) == 0x0001C8, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character_6' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_7) == 0x0001D8, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character_7) == 0x0001E0, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character_7' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_8) == 0x0001F0, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsChained_ReturnValue) == 0x0001F1, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsChained_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_Jump) == 0x0001F2, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_Jump' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_Fall) == 0x0001F3, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_Fall' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_RadialVelocity) == 0x0001F8, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_RadialVelocity' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_MoveInput) == 0x000210, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_MoveInput' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_Climb) == 0x000220, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_Climb' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_Pull) == 0x000221, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_Pull' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_PulledCharacter) == 0x000228, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_PulledCharacter' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_IsDriving) == 0x000230, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_IsDriving' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_DriveLeftHand) == 0x000238, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_DriveLeftHand' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_DriveRightHand) == 0x000250, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_DriveRightHand' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_GetAnimVariables_LookAround) == 0x000268, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_GetAnimVariables_LookAround' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000270, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000280, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000288, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsValid_ReturnValue_3) == 0x000298, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_IsValid_ReturnValue_4) == 0x000299, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_AsBPI_Character_8) == 0x0002A0, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_AsBPI_Character_8' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, K2Node_DynamicCast_bSuccess_9) == 0x0002B0, "Member 'PC_Game_C_DetectPullCharacters::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(PC_Game_C_DetectPullCharacters, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0002B1, "Member 'PC_Game_C_DetectPullCharacters::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PC_Game.PC_Game_C.ExecuteUbergraph_PC_Game
// 0x0E90 (0x0E90 - 0x0000)
struct PC_Game_C_ExecuteUbergraph_PC_Game final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3352[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3353[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_17;    // 0x0050(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_17;    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_17;  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_17;   // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_16;    // 0x00B8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_16;    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_16;  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_16;   // 0x00E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3354[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_15;    // 0x00F0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_15;    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_15;  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_15;   // 0x0118(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3355[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_1;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_1;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3356[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_14;    // 0x0168(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_14;    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_14;  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_14;   // 0x0190(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3357[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_13;    // 0x01A0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_13;    // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_13;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_13;   // 0x01C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
