#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pennisetum_large2_Blueprint_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass pennisetum_large2_Blueprint_BP.pennisetum_large2_Blueprint_BP_C
// 0x0050 (0x02E8 - 0x0298)
class APennisetum_large2_Blueprint_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Hosta_12_StaticMeshComponent0;                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_10_StaticMeshComponent0;                     // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_7_StaticMeshComponent0;                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_9_StaticMeshComponent0;                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_11_StaticMeshComponent0;                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flower_bed_short_StaticMeshComponent0;             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_8_StaticMeshComponent0;                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hosta_6_StaticMeshComponent0;                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pennisetum_large2_StaticMeshComponent0;            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"pennisetum_large2_Blueprint_BP_C">();
	}
	static class APennisetum_large2_Blueprint_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APennisetum_large2_Blueprint_BP_C>();
	}
};
static_assert(alignof(APennisetum_large2_Blueprint_BP_C) == 0x000008, "Wrong alignment on APennisetum_large2_Blueprint_BP_C");
static_assert(sizeof(APennisetum_large2_Blueprint_BP_C) == 0x0002E8, "Wrong size on APennisetum_large2_Blueprint_BP_C");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Hosta_12_StaticMeshComponent0) == 0x000298, "Member 'APennisetum_large2_Blueprint_BP_C::Hosta_12_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Hosta_10_StaticMeshComponent0) == 0x0002A0, "Member 'APennisetum_large2_Blueprint_BP_C::Hosta_10_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Hosta_7_StaticMeshComponent0) == 0x0002A8, "Member 'APennisetum_large2_Blueprint_BP_C::Hosta_7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Hosta_9_StaticMeshComponent0) == 0x0002B0, "Member 'APennisetum_large2_Blueprint_BP_C::Hosta_9_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Hosta_11_StaticMeshComponent0) == 0x0002B8, "Member 'APennisetum_large2_Blueprint_BP_C::Hosta_11_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Flower_bed_short_StaticMeshComponent0) == 0x0002C0, "Member 'APennisetum_large2_Blueprint_BP_C::Flower_bed_short_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Hosta_8_StaticMeshComponent0) == 0x0002C8, "Member 'APennisetum_large2_Blueprint_BP_C::Hosta_8_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Hosta_6_StaticMeshComponent0) == 0x0002D0, "Member 'APennisetum_large2_Blueprint_BP_C::Hosta_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, Pennisetum_large2_StaticMeshComponent0) == 0x0002D8, "Member 'APennisetum_large2_Blueprint_BP_C::Pennisetum_large2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APennisetum_large2_Blueprint_BP_C, SharedRoot) == 0x0002E0, "Member 'APennisetum_large2_Blueprint_BP_C::SharedRoot' has a wrong offset!");

}

