#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickMaterialSlot_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ChainedTogether_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PickMaterialSlot_W.PickMaterialSlot_W_C
// 0x00A0 (0x0360 - 0x02C0)
class UPickMaterialSlot_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_1;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_68;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMaterialPickerStruct                  PickerMaterial;                                    // 0x02F0(0x0068)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UUserWidget*                            Parent;                                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__PickMaterialSlot_W_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PickMaterialSlot_W_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__PickMaterialSlot_W_Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_PickMaterialSlot_W(int32 EntryPoint);
	void OnLoaded_C9FFD6DA4D816200F53493B02DF73EC5(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickMaterialSlot_W_C">();
	}
	static class UPickMaterialSlot_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickMaterialSlot_W_C>();
	}
};
static_assert(alignof(UPickMaterialSlot_W_C) == 0x000008, "Wrong alignment on UPickMaterialSlot_W_C");
static_assert(sizeof(UPickMaterialSlot_W_C) == 0x000360, "Wrong size on UPickMaterialSlot_W_C");
static_assert(offsetof(UPickMaterialSlot_W_C, UberGraphFrame) == 0x0002C0, "Member 'UPickMaterialSlot_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPickMaterialSlot_W_C, Border_1) == 0x0002C8, "Member 'UPickMaterialSlot_W_C::Border_1' has a wrong offset!");
static_assert(offsetof(UPickMaterialSlot_W_C, Button_0) == 0x0002D0, "Member 'UPickMaterialSlot_W_C::Button_0' has a wrong offset!");
static_assert(offsetof(UPickMaterialSlot_W_C, Image) == 0x0002D8, "Member 'UPickMaterialSlot_W_C::Image' has a wrong offset!");
static_assert(offsetof(UPickMaterialSlot_W_C, Image_64) == 0x0002E0, "Member 'UPickMaterialSlot_W_C::Image_64' has a wrong offset!");
static_assert(offsetof(UPickMaterialSlot_W_C, TextBlock_68) == 0x0002E8, "Member 'UPickMaterialSlot_W_C::TextBlock_68' has a wrong offset!");
static_assert(offsetof(UPickMaterialSlot_W_C, PickerMaterial) == 0x0002F0, "Member 'UPickMaterialSlot_W_C::PickerMaterial' has a wrong offset!");
static_assert(offsetof(UPickMaterialSlot_W_C, Parent) == 0x000358, "Member 'UPickMaterialSlot_W_C::Parent' has a wrong offset!");

}

