#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickMaterial_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PickMaterial_W.PickMaterial_W_C
// 0x0028 (0x02E8 - 0x02C0)
class UPickMaterial_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Cancel;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_140;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_37;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_0;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__PickMaterial_W_Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void ExecuteUbergraph_PickMaterial_W(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickMaterial_W_C">();
	}
	static class UPickMaterial_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickMaterial_W_C>();
	}
};
static_assert(alignof(UPickMaterial_W_C) == 0x000008, "Wrong alignment on UPickMaterial_W_C");
static_assert(sizeof(UPickMaterial_W_C) == 0x0002E8, "Wrong size on UPickMaterial_W_C");
static_assert(offsetof(UPickMaterial_W_C, UberGraphFrame) == 0x0002C0, "Member 'UPickMaterial_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPickMaterial_W_C, Button_Cancel) == 0x0002C8, "Member 'UPickMaterial_W_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UPickMaterial_W_C, EditableTextBox_140) == 0x0002D0, "Member 'UPickMaterial_W_C::EditableTextBox_140' has a wrong offset!");
static_assert(offsetof(UPickMaterial_W_C, ScrollBox_37) == 0x0002D8, "Member 'UPickMaterial_W_C::ScrollBox_37' has a wrong offset!");
static_assert(offsetof(UPickMaterial_W_C, WrapBox_0) == 0x0002E0, "Member 'UPickMaterial_W_C::WrapBox_0' has a wrong offset!");

}

