#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickMaterial_W

#include "Basic.hpp"

#include "ChainedTogether_structs.hpp"


namespace SDK::Params
{

// Function PickMaterial_W.PickMaterial_W_C.BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct PickMaterial_W_C_BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PickMaterial_W_C_BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on PickMaterial_W_C_BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(PickMaterial_W_C_BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on PickMaterial_W_C_BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(PickMaterial_W_C_BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'PickMaterial_W_C_BndEvt__PickMaterial_W_EditableTextBox_140_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function PickMaterial_W.PickMaterial_W_C.ExecuteUbergraph_PickMaterial_W
// 0x0148 (0x0148 - 0x0000)
struct PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickMaterialSlot_W_C*                  CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0028(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMaterialPickerStruct                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0068)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00B8(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPickMaterialSlot_W_C*>          CallFunc_WidgetGetChildrenOfClass_ChildWidgets;    // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UPickMaterialSlot_W_C*>          CallFunc_WidgetGetChildrenOfClass_ChildWidgets_1;  // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPickMaterialSlot_W_C*                  CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPickMaterialSlot_W_C*                  CallFunc_Array_Get_Item_2;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AIGLE_Pawn_Example_C*                   K2Node_DynamicCast_AsIGLE_Pawn_Example;            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W) == 0x000008, "Wrong alignment on PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W");
static_assert(sizeof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W) == 0x000148, "Wrong size on PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, EntryPoint) == 0x000000, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Create_ReturnValue) == 0x000010, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000028, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Array_Get_Item) == 0x000038, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000040, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, K2Node_ComponentBoundEvent_Text) == 0x0000B8, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_TextIsEmpty_ReturnValue) == 0x0000E0, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, Temp_int_Loop_Counter_Variable_2) == 0x0000E4, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000EC, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_WidgetGetChildrenOfClass_ChildWidgets) == 0x0000F0, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_WidgetGetChildrenOfClass_ChildWidgets' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_WidgetGetChildrenOfClass_ChildWidgets_1) == 0x000100, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_WidgetGetChildrenOfClass_ChildWidgets_1' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Array_Get_Item_2) == 0x000118, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Contains_ReturnValue) == 0x000124, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Less_IntInt_ReturnValue_1) == 0x000125, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Array_Length_ReturnValue_2) == 0x000128, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_Less_IntInt_ReturnValue_2) == 0x00012C, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_GetPlayerPawn_ReturnValue) == 0x000130, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, K2Node_DynamicCast_AsIGLE_Pawn_Example) == 0x000138, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::K2Node_DynamicCast_AsIGLE_Pawn_Example' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W, CallFunc_IsValid_ReturnValue) == 0x000141, "Member 'PickMaterial_W_C_ExecuteUbergraph_PickMaterial_W::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

