#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plain_wall_garden_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass plain_wall_garden_BP.plain_wall_garden_BP_C
// 0x0068 (0x0300 - 0x0298)
class APlain_wall_garden_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Moonflower_03;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_02;                                     // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_01;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hedge_straight;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Floor_tile_1x1;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown_end;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Square_pillar;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent3;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent2;                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	TArray<class UStaticMesh*>                    Ivy_array;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"plain_wall_garden_BP_C">();
	}
	static class APlain_wall_garden_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlain_wall_garden_BP_C>();
	}
};
static_assert(alignof(APlain_wall_garden_BP_C) == 0x000008, "Wrong alignment on APlain_wall_garden_BP_C");
static_assert(sizeof(APlain_wall_garden_BP_C) == 0x000300, "Wrong size on APlain_wall_garden_BP_C");
static_assert(offsetof(APlain_wall_garden_BP_C, Moonflower_03) == 0x000298, "Member 'APlain_wall_garden_BP_C::Moonflower_03' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, Moonflower_02) == 0x0002A0, "Member 'APlain_wall_garden_BP_C::Moonflower_02' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, Moonflower_01) == 0x0002A8, "Member 'APlain_wall_garden_BP_C::Moonflower_01' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, Hedge_straight) == 0x0002B0, "Member 'APlain_wall_garden_BP_C::Hedge_straight' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, Floor_tile_1x1) == 0x0002B8, "Member 'APlain_wall_garden_BP_C::Floor_tile_1x1' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, Trim_crown_end) == 0x0002C0, "Member 'APlain_wall_garden_BP_C::Trim_crown_end' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, Square_pillar) == 0x0002C8, "Member 'APlain_wall_garden_BP_C::Square_pillar' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, StaticMeshComponent3) == 0x0002D0, "Member 'APlain_wall_garden_BP_C::StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, StaticMeshComponent2) == 0x0002D8, "Member 'APlain_wall_garden_BP_C::StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, SharedRoot) == 0x0002E0, "Member 'APlain_wall_garden_BP_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, Stream) == 0x0002E8, "Member 'APlain_wall_garden_BP_C::Stream' has a wrong offset!");
static_assert(offsetof(APlain_wall_garden_BP_C, Ivy_array) == 0x0002F0, "Member 'APlain_wall_garden_BP_C::Ivy_array' has a wrong offset!");

}

