#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plain_wall_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass plain_wall_BP.plain_wall_BP_C
// 0x0068 (0x0300 - 0x0298)
class APlain_wall_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Floor_tile_1x1_SM;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pillar;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pillar_top;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_03;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_02;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_01;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Ivy_stream;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	TArray<class UStaticMesh*>                    Ivy_array;                                         // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          base_;                                             // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"plain_wall_BP_C">();
	}
	static class APlain_wall_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlain_wall_BP_C>();
	}
};
static_assert(alignof(APlain_wall_BP_C) == 0x000008, "Wrong alignment on APlain_wall_BP_C");
static_assert(sizeof(APlain_wall_BP_C) == 0x000300, "Wrong size on APlain_wall_BP_C");
static_assert(offsetof(APlain_wall_BP_C, Floor_tile_1x1_SM) == 0x000298, "Member 'APlain_wall_BP_C::Floor_tile_1x1_SM' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Pillar) == 0x0002A0, "Member 'APlain_wall_BP_C::Pillar' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Trim) == 0x0002A8, "Member 'APlain_wall_BP_C::Trim' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Pillar_top) == 0x0002B0, "Member 'APlain_wall_BP_C::Pillar_top' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Moonflower_03) == 0x0002B8, "Member 'APlain_wall_BP_C::Moonflower_03' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Moonflower_02) == 0x0002C0, "Member 'APlain_wall_BP_C::Moonflower_02' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Moonflower_01) == 0x0002C8, "Member 'APlain_wall_BP_C::Moonflower_01' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Wall) == 0x0002D0, "Member 'APlain_wall_BP_C::Wall' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, SharedRoot) == 0x0002D8, "Member 'APlain_wall_BP_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Ivy_stream) == 0x0002E0, "Member 'APlain_wall_BP_C::Ivy_stream' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, Ivy_array) == 0x0002E8, "Member 'APlain_wall_BP_C::Ivy_array' has a wrong offset!");
static_assert(offsetof(APlain_wall_BP_C, base_) == 0x0002F8, "Member 'APlain_wall_BP_C::base_' has a wrong offset!");

}

