#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plain_corner_gardens_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass plain_corner_gardens_BP.plain_corner_gardens_BP_C
// 0x00C0 (0x0358 - 0x0298)
class APlain_corner_gardens_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Moonflower_05;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_04;                                     // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_03;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_02;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moonflower_01;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hedge_straight1;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hedge_straight;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown_end;                                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Square_pillar1;                                    // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Square_pillar;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   banister_end;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Top_trim1;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Alcove_wall1;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Floor_tile_1x1;                                    // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Top_trim;                                          // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Alcove_wall;                                       // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	TArray<class UStaticMesh*>                    Ivy_array;                                         // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    Ivy_array_corner_01;                               // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    Ivy_array_corner_02;                               // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"plain_corner_gardens_BP_C">();
	}
	static class APlain_corner_gardens_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlain_corner_gardens_BP_C>();
	}
};
static_assert(alignof(APlain_corner_gardens_BP_C) == 0x000008, "Wrong alignment on APlain_corner_gardens_BP_C");
static_assert(sizeof(APlain_corner_gardens_BP_C) == 0x000358, "Wrong size on APlain_corner_gardens_BP_C");
static_assert(offsetof(APlain_corner_gardens_BP_C, Moonflower_05) == 0x000298, "Member 'APlain_corner_gardens_BP_C::Moonflower_05' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Moonflower_04) == 0x0002A0, "Member 'APlain_corner_gardens_BP_C::Moonflower_04' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Moonflower_03) == 0x0002A8, "Member 'APlain_corner_gardens_BP_C::Moonflower_03' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Moonflower_02) == 0x0002B0, "Member 'APlain_corner_gardens_BP_C::Moonflower_02' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Moonflower_01) == 0x0002B8, "Member 'APlain_corner_gardens_BP_C::Moonflower_01' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Hedge_straight1) == 0x0002C0, "Member 'APlain_corner_gardens_BP_C::Hedge_straight1' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Hedge_straight) == 0x0002C8, "Member 'APlain_corner_gardens_BP_C::Hedge_straight' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Trim_crown_end) == 0x0002D0, "Member 'APlain_corner_gardens_BP_C::Trim_crown_end' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Square_pillar1) == 0x0002D8, "Member 'APlain_corner_gardens_BP_C::Square_pillar1' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Square_pillar) == 0x0002E0, "Member 'APlain_corner_gardens_BP_C::Square_pillar' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, banister_end) == 0x0002E8, "Member 'APlain_corner_gardens_BP_C::banister_end' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Top_trim1) == 0x0002F0, "Member 'APlain_corner_gardens_BP_C::Top_trim1' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Alcove_wall1) == 0x0002F8, "Member 'APlain_corner_gardens_BP_C::Alcove_wall1' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Floor_tile_1x1) == 0x000300, "Member 'APlain_corner_gardens_BP_C::Floor_tile_1x1' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Top_trim) == 0x000308, "Member 'APlain_corner_gardens_BP_C::Top_trim' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Alcove_wall) == 0x000310, "Member 'APlain_corner_gardens_BP_C::Alcove_wall' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, SharedRoot) == 0x000318, "Member 'APlain_corner_gardens_BP_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Stream) == 0x000320, "Member 'APlain_corner_gardens_BP_C::Stream' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Ivy_array) == 0x000328, "Member 'APlain_corner_gardens_BP_C::Ivy_array' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Ivy_array_corner_01) == 0x000338, "Member 'APlain_corner_gardens_BP_C::Ivy_array_corner_01' has a wrong offset!");
static_assert(offsetof(APlain_corner_gardens_BP_C, Ivy_array_corner_02) == 0x000348, "Member 'APlain_corner_gardens_BP_C::Ivy_array_corner_02' has a wrong offset!");

}

