#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plain_corner_gardens_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function plain_corner_gardens_BP.plain_corner_gardens_BP_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct Plain_corner_gardens_BP_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B9[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_2;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Plain_corner_gardens_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Plain_corner_gardens_BP_C_UserConstructionScript");
static_assert(sizeof(Plain_corner_gardens_BP_C_UserConstructionScript) == 0x000030, "Wrong size on Plain_corner_gardens_BP_C_UserConstructionScript");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x000000, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1) == 0x000004, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000008, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000018, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000019, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x00001A, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_3) == 0x00001B, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000020, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Plain_corner_gardens_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_4) == 0x000028, "Member 'Plain_corner_gardens_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");

}

