#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayMenu_W

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PlayMenu_W.PlayMenu_W_C.BndEvt__PlayMenu_W_CheckBox_69_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PlayMenu_W_C_BndEvt__PlayMenu_W_CheckBox_69_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayMenu_W_C_BndEvt__PlayMenu_W_CheckBox_69_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on PlayMenu_W_C_BndEvt__PlayMenu_W_CheckBox_69_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(PlayMenu_W_C_BndEvt__PlayMenu_W_CheckBox_69_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on PlayMenu_W_C_BndEvt__PlayMenu_W_CheckBox_69_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(PlayMenu_W_C_BndEvt__PlayMenu_W_CheckBox_69_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'PlayMenu_W_C_BndEvt__PlayMenu_W_CheckBox_69_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function PlayMenu_W.PlayMenu_W_C.ExecuteUbergraph_PlayMenu_W
// 0x0130 (0x0130 - 0x0000)
struct PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoloPlay_W_C*                          CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_3;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalMultiplayer_W_C*                  CallFunc_Create_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_4;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_CreateSession_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance;            // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3320[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance_1;          // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3321[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3322[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetCollectedWings_Wings;                  // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3323[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameMapsSettings*                      CallFunc_GetGameMapsSettings_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameMapsSettings*                      CallFunc_GetGameMapsSettings_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameMapsSettings*                      CallFunc_GetGameMapsSettings_ReturnValue_2;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3324[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI_1;                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3325[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_JoinSessionMenu_C*                   CallFunc_Create_ReturnValue_3;                     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_W_C*                          CallFunc_Create_ReturnValue_4;                     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W) == 0x000008, "Wrong alignment on PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W");
static_assert(sizeof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W) == 0x000130, "Wrong size on PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, EntryPoint) == 0x000000, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_Create_ReturnValue) == 0x000010, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_MakeStruct_Margin) == 0x000018, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetPlayerController_ReturnValue_2) == 0x000038, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000048, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000050, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_SpawnSound2D_ReturnValue_3) == 0x000058, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_SpawnSound2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetPlayerController_ReturnValue_3) == 0x000060, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_Create_ReturnValue_1) == 0x000068, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_SpawnSound2D_ReturnValue_4) == 0x000070, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_SpawnSound2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetGameInstance_ReturnValue) == 0x000078, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_Create_ReturnValue_2) == 0x000080, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_DynamicCast_AsBPI_Game_Instance) == 0x000088, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_DynamicCast_AsBPI_Game_Instance' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_DynamicCast_AsBPI_Game_Instance_1) == 0x0000A0, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_DynamicCast_AsBPI_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_DynamicCast_AsCustom_GI) == 0x0000B8, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetCollectedWings_Wings) == 0x0000C8, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetCollectedWings_Wings' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetGameMapsSettings_ReturnValue) == 0x0000E0, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetGameMapsSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetGameMapsSettings_ReturnValue_1) == 0x0000E8, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetGameMapsSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetGameMapsSettings_ReturnValue_2) == 0x0000F0, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetGameMapsSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_ComponentBoundEvent_bIsChecked) == 0x0000F8, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetGameInstance_ReturnValue_1) == 0x000100, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_DynamicCast_AsCustom_GI_1) == 0x000108, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_DynamicCast_AsCustom_GI_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_Create_ReturnValue_3) == 0x000118, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_GetPlayerController_ReturnValue_4) == 0x000120, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W, CallFunc_Create_ReturnValue_4) == 0x000128, "Member 'PlayMenu_W_C_ExecuteUbergraph_PlayMenu_W::CallFunc_Create_ReturnValue_4' has a wrong offset!");

// Function PlayMenu_W.PlayMenu_W_C.RefreshWingVisibility
// 0x0009 (0x0009 - 0x0000)
struct PlayMenu_W_C_RefreshWingVisibility final
{
public:
	bool                                          HasWings;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayMenu_W_C_RefreshWingVisibility) == 0x000001, "Wrong alignment on PlayMenu_W_C_RefreshWingVisibility");
static_assert(sizeof(PlayMenu_W_C_RefreshWingVisibility) == 0x000009, "Wrong size on PlayMenu_W_C_RefreshWingVisibility");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, HasWings) == 0x000000, "Member 'PlayMenu_W_C_RefreshWingVisibility::HasWings' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, Temp_bool_Variable) == 0x000001, "Member 'PlayMenu_W_C_RefreshWingVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, Temp_byte_Variable) == 0x000002, "Member 'PlayMenu_W_C_RefreshWingVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'PlayMenu_W_C_RefreshWingVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, Temp_bool_Variable_1) == 0x000004, "Member 'PlayMenu_W_C_RefreshWingVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, K2Node_Select_Default) == 0x000005, "Member 'PlayMenu_W_C_RefreshWingVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, Temp_byte_Variable_2) == 0x000006, "Member 'PlayMenu_W_C_RefreshWingVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, Temp_byte_Variable_3) == 0x000007, "Member 'PlayMenu_W_C_RefreshWingVisibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayMenu_W_C_RefreshWingVisibility, K2Node_Select_Default_1) == 0x000008, "Member 'PlayMenu_W_C_RefreshWingVisibility::K2Node_Select_Default_1' has a wrong offset!");

}

