#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PS_Game

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PS_Lobby_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PS_Game.PS_Game_C
// 0x0020 (0x0388 - 0x0368)
class APS_Game_C final : public APS_Lobby_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           Color;                                             // 0x0370(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeginLevelsLoaded;                                 // 0x0380(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PS_Game(int32 EntryPoint);
	void GetColor(struct FLinearColor* Param_Color);
	void NotifyLevelLoaded_Server_();
	void NotifyLevelsLoaded();
	void OnRep_BeginLevelsLoaded();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PS_Game_C">();
	}
	static class APS_Game_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APS_Game_C>();
	}
};
static_assert(alignof(APS_Game_C) == 0x000008, "Wrong alignment on APS_Game_C");
static_assert(sizeof(APS_Game_C) == 0x000388, "Wrong size on APS_Game_C");
static_assert(offsetof(APS_Game_C, UberGraphFrame) == 0x000368, "Member 'APS_Game_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APS_Game_C, Color) == 0x000370, "Member 'APS_Game_C::Color' has a wrong offset!");
static_assert(offsetof(APS_Game_C, BeginLevelsLoaded) == 0x000380, "Member 'APS_Game_C::BeginLevelsLoaded' has a wrong offset!");

}

