#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PS_Lobby

#include "Basic.hpp"


namespace SDK::Params
{

// Function PS_Lobby.PS_Lobby_C.OnRep_ChosenChar
// 0x0020 (0x0020 - 0x0000)
struct PS_Lobby_C_OnRep_ChosenChar final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LobbyCharacter_C> K2Node_DynamicCast_AsBPI_Lobby_Character;          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PS_Lobby_C_OnRep_ChosenChar) == 0x000008, "Wrong alignment on PS_Lobby_C_OnRep_ChosenChar");
static_assert(sizeof(PS_Lobby_C_OnRep_ChosenChar) == 0x000020, "Wrong size on PS_Lobby_C_OnRep_ChosenChar");
static_assert(offsetof(PS_Lobby_C_OnRep_ChosenChar, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'PS_Lobby_C_OnRep_ChosenChar::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PS_Lobby_C_OnRep_ChosenChar, K2Node_DynamicCast_AsBPI_Lobby_Character) == 0x000008, "Member 'PS_Lobby_C_OnRep_ChosenChar::K2Node_DynamicCast_AsBPI_Lobby_Character' has a wrong offset!");
static_assert(offsetof(PS_Lobby_C_OnRep_ChosenChar, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PS_Lobby_C_OnRep_ChosenChar::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

