#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigVM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// Enum RigVM.ERigVMPinDirection
// NumValues: 0x0007
enum class ERigVMPinDirection : uint8
{
	Input                                    = 0,
	Output                                   = 1,
	IO                                       = 2,
	Visible                                  = 3,
	Hidden                                   = 4,
	Invalid                                  = 5,
	ERigVMPinDirection_MAX                   = 6,
};

// Enum RigVM.ERigVMFunctionArgumentDirection
// NumValues: 0x0004
enum class ERigVMFunctionArgumentDirection : uint8
{
	Input                                    = 0,
	Output                                   = 1,
	Invalid                                  = 2,
	ERigVMFunctionArgumentDirection_MAX      = 3,
};

// Enum RigVM.ERigVMTransformSpace
// NumValues: 0x0003
enum class ERigVMTransformSpace : uint8
{
	LocalSpace                               = 0,
	GlobalSpace                              = 1,
	Max                                      = 2,
};

// Enum RigVM.ERigVMClampSpatialMode
// NumValues: 0x0004
enum class ERigVMClampSpatialMode : uint8
{
	Plane                                    = 0,
	Cylinder                                 = 1,
	Sphere                                   = 2,
	ERigVMClampSpatialMode_MAX               = 3,
};

// Enum RigVM.ERigVMParameterType
// NumValues: 0x0004
enum class ERigVMParameterType : uint8
{
	Input                                    = 0,
	Output                                   = 1,
	Invalid                                  = 2,
	ERigVMParameterType_MAX                  = 3,
};

// Enum RigVM.ERigVMOpCode
// NumValues: 0x006A
enum class ERigVMOpCode : uint8
{
	Execute_0_Operands                       = 0,
	Execute_1_Operands                       = 1,
	Execute_2_Operands                       = 2,
	Execute_3_Operands                       = 3,
	Execute_4_Operands                       = 4,
	Execute_5_Operands                       = 5,
	Execute_6_Operands                       = 6,
	Execute_7_Operands                       = 7,
	Execute_8_Operands                       = 8,
	Execute_9_Operands                       = 9,
	Execute_10_Operands                      = 10,
	Execute_11_Operands                      = 11,
	Execute_12_Operands                      = 12,
	Execute_13_Operands                      = 13,
	Execute_14_Operands                      = 14,
	Execute_15_Operands                      = 15,
	Execute_16_Operands                      = 16,
	Execute_17_Operands                      = 17,
	Execute_18_Operands                      = 18,
	Execute_19_Operands                      = 19,
	Execute_20_Operands                      = 20,
	Execute_21_Operands                      = 21,
	Execute_22_Operands                      = 22,
	Execute_23_Operands                      = 23,
	Execute_24_Operands                      = 24,
	Execute_25_Operands                      = 25,
	Execute_26_Operands                      = 26,
	Execute_27_Operands                      = 27,
	Execute_28_Operands                      = 28,
	Execute_29_Operands                      = 29,
	Execute_30_Operands                      = 30,
	Execute_31_Operands                      = 31,
	Execute_32_Operands                      = 32,
	Execute_33_Operands                      = 33,
	Execute_34_Operands                      = 34,
	Execute_35_Operands                      = 35,
	Execute_36_Operands                      = 36,
	Execute_37_Operands                      = 37,
	Execute_38_Operands                      = 38,
	Execute_39_Operands                      = 39,
	Execute_40_Operands                      = 40,
	Execute_41_Operands                      = 41,
	Execute_42_Operands                      = 42,
	Execute_43_Operands                      = 43,
	Execute_44_Operands                      = 44,
	Execute_45_Operands                      = 45,
	Execute_46_Operands                      = 46,
	Execute_47_Operands                      = 47,
	Execute_48_Operands                      = 48,
	Execute_49_Operands                      = 49,
	Execute_50_Operands                      = 50,
	Execute_51_Operands                      = 51,
	Execute_52_Operands                      = 52,
	Execute_53_Operands                      = 53,
	Execute_54_Operands                      = 54,
	Execute_55_Operands                      = 55,
	Execute_56_Operands                      = 56,
	Execute_57_Operands                      = 57,
	Execute_58_Operands                      = 58,
	Execute_59_Operands                      = 59,
	Execute_60_Operands                      = 60,
	Execute_61_Operands                      = 61,
	Execute_62_Operands                      = 62,
	Execute_63_Operands                      = 63,
	Execute_64_Operands                      = 64,
	Zero                                     = 65,
	BoolFalse                                = 66,
	BoolTrue                                 = 67,
	Copy                                     = 68,
	Increment                                = 69,
	Decrement                                = 70,
	Equals                                   = 71,
	NotEquals                                = 72,
	JumpAbsolute                             = 73,
	JumpForward                              = 74,
	JumpBackward                             = 75,
	JumpAbsoluteIf                           = 76,
	JumpForwardIf                            = 77,
	JumpBackwardIf                           = 78,
	ChangeType                               = 79,
	Exit                                     = 80,
	BeginBlock                               = 81,
	EndBlock                                 = 82,
	ArrayReset                               = 83,
	ArrayGetNum                              = 84,
	ArraySetNum                              = 85,
	ArrayGetAtIndex                          = 86,
	ArraySetAtIndex                          = 87,
	ArrayAdd                                 = 88,
	ArrayInsert                              = 89,
	ArrayRemove                              = 90,
	ArrayFind                                = 91,
	ArrayAppend                              = 92,
	ArrayClone                               = 93,
	ArrayIterator                            = 94,
	ArrayUnion                               = 95,
	ArrayDifference                          = 96,
	ArrayIntersection                        = 97,
	ArrayReverse                             = 98,
	InvokeEntry                              = 99,
	JumpToBranch                             = 100,
	Execute                                  = 101,
	Invalid                                  = 102,
	FirstArrayOpCode                         = 83,
	LastArrayOpCode                          = 98,
	ERigVMOpCode_MAX                         = 103,
};

// Enum RigVM.ERigVMCopyType
// NumValues: 0x0004
enum class ERigVMCopyType : uint8
{
	Default                                  = 0,
	FloatToDouble                            = 1,
	DoubleToFloat                            = 2,
	ERigVMCopyType_MAX                       = 3,
};

// Enum RigVM.ERigVMBreakpointAction
// NumValues: 0x0006
enum class ERigVMBreakpointAction : uint8
{
	None                                     = 0,
	Resume                                   = 1,
	StepOver                                 = 2,
	StepInto                                 = 3,
	StepOut                                  = 4,
	Max                                      = 5,
};

// Enum RigVM.ERigVMDrawSettings
// NumValues: 0x0005
enum class ERigVMDrawSettings : uint8
{
	Points                                   = 0,
	Lines                                    = 1,
	LineStrip                                = 2,
	DynamicMesh                              = 3,
	ERigVMDrawSettings_MAX                   = 4,
};

// Enum RigVM.ERigVMMemoryType
// NumValues: 0x0006
enum class ERigVMMemoryType : uint8
{
	Work                                     = 0,
	Literal                                  = 1,
	External                                 = 2,
	Debug                                    = 3,
	Invalid                                  = 4,
	ERigVMMemoryType_MAX                     = 5,
};

// Enum RigVM.ERigVMRegisterType
// NumValues: 0x0006
enum class ERigVMRegisterType : uint8
{
	Plain                                    = 0,
	String                                   = 1,
	Name                                     = 2,
	Struct                                   = 3,
	Invalid                                  = 4,
	ERigVMRegisterType_MAX                   = 5,
};

// Enum RigVM.ERigVMUserWorkflowType
// NumValues: 0x0006
enum class ERigVMUserWorkflowType : uint8
{
	Invalid                                  = 0,
	NodeContext                              = 1,
	PinContext                               = 2,
	OnPinDefaultChanged                      = 4,
	All                                      = 7,
	ERigVMUserWorkflowType_MAX               = 8,
};

// Enum RigVM.ERigUnitDebugPointMode
// NumValues: 0x0003
enum class ERigUnitDebugPointMode : uint8
{
	Point                                    = 0,
	Vector                                   = 1,
	Max                                      = 2,
};

// Enum RigVM.ERigUnitDebugTransformMode
// NumValues: 0x0004
enum class ERigUnitDebugTransformMode : uint8
{
	Point                                    = 0,
	Axes                                     = 1,
	Box                                      = 2,
	Max                                      = 3,
};

// Enum RigVM.ERigUnitVisualDebugPointMode
// NumValues: 0x0003
enum class ERigUnitVisualDebugPointMode : uint8
{
	Point                                    = 0,
	Vector                                   = 1,
	Max                                      = 2,
};

// Enum RigVM.ERBFKernelType
// NumValues: 0x0006
enum class ERBFKernelType : uint8
{
	Gaussian                                 = 0,
	Exponential                              = 1,
	Linear                                   = 2,
	Cubic                                    = 3,
	Quintic                                  = 4,
	ERBFKernelType_MAX                       = 5,
};

// Enum RigVM.ERBFQuatDistanceType
// NumValues: 0x0005
enum class ERBFQuatDistanceType : uint8
{
	Euclidean                                = 0,
	ArcLength                                = 1,
	SwingAngle                               = 2,
	TwistAngle                               = 3,
	ERBFQuatDistanceType_MAX                 = 4,
};

// Enum RigVM.ERBFVectorDistanceType
// NumValues: 0x0004
enum class ERBFVectorDistanceType : uint8
{
	Euclidean                                = 0,
	Manhattan                                = 1,
	ArcLength                                = 2,
	ERBFVectorDistanceType_MAX               = 3,
};

// Enum RigVM.ERigVMAnimEasingType
// NumValues: 0x0020
enum class ERigVMAnimEasingType : uint8
{
	Linear                                   = 0,
	QuadraticEaseIn                          = 1,
	QuadraticEaseOut                         = 2,
	QuadraticEaseInOut                       = 3,
	CubicEaseIn                              = 4,
	CubicEaseOut                             = 5,
	CubicEaseInOut                           = 6,
	QuarticEaseIn                            = 7,
	QuarticEaseOut                           = 8,
	QuarticEaseInOut                         = 9,
	QuinticEaseIn                            = 10,
	QuinticEaseOut                           = 11,
	QuinticEaseInOut                         = 12,
	SineEaseIn                               = 13,
	SineEaseOut                              = 14,
	SineEaseInOut                            = 15,
	CircularEaseIn                           = 16,
	CircularEaseOut                          = 17,
	CircularEaseInOut                        = 18,
	ExponentialEaseIn                        = 19,
	ExponentialEaseOut                       = 20,
	ExponentialEaseInOut                     = 21,
	ElasticEaseIn                            = 22,
	ElasticEaseOut                           = 23,
	ElasticEaseInOut                         = 24,
	BackEaseIn                               = 25,
	BackEaseOut                              = 26,
	BackEaseInOut                            = 27,
	BounceEaseIn                             = 28,
	BounceEaseOut                            = 29,
	BounceEaseInOut                          = 30,
	ERigVMAnimEasingType_MAX                 = 31,
};

// Enum RigVM.ERigVMSimPointIntegrateType
// NumValues: 0x0003
enum class ERigVMSimPointIntegrateType : uint8
{
	Verlet                                   = 0,
	SemiExplicitEuler                        = 1,
	ERigVMSimPointIntegrateType_MAX          = 2,
};

// ScriptStruct RigVM.RigVMStruct
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FRigVMStruct
{
public:
	uint8                                         Pad_1EBD[0x8];                                     // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMStruct) == 0x000008, "Wrong alignment on FRigVMStruct");
static_assert(sizeof(FRigVMStruct) == 0x000008, "Wrong size on FRigVMStruct");

// ScriptStruct RigVM.RigVMFunction_MathBase
// 0x0000 (0x0008 - 0x0008)
struct FRigVMFunction_MathBase : public FRigVMStruct
{
};
static_assert(alignof(FRigVMFunction_MathBase) == 0x000008, "Wrong alignment on FRigVMFunction_MathBase");
static_assert(sizeof(FRigVMFunction_MathBase) == 0x000008, "Wrong size on FRigVMFunction_MathBase");

// ScriptStruct RigVM.RigVMFunction_MathVectorBase
// 0x0000 (0x0008 - 0x0008)
struct FRigVMFunction_MathVectorBase : public FRigVMFunction_MathBase
{
};
static_assert(alignof(FRigVMFunction_MathVectorBase) == 0x000008, "Wrong alignment on FRigVMFunction_MathVectorBase");
static_assert(sizeof(FRigVMFunction_MathVectorBase) == 0x000008, "Wrong size on FRigVMFunction_MathVectorBase");

// ScriptStruct RigVM.RigVMFunction_MathVectorBinaryOp
// 0x0048 (0x0050 - 0x0008)
struct FRigVMFunction_MathVectorBinaryOp : public FRigVMFunction_MathVectorBase
{
public:
	struct FVector                                A;                                                 // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                B;                                                 // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Result;                                            // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMFunction_MathVectorBinaryOp) == 0x000008, "Wrong alignment on FRigVMFunction_MathVectorBinaryOp");
static_assert(sizeof(FRigVMFunction_MathVectorBinaryOp) == 0x000050, "Wrong size on FRigVMFunction_MathVectorBinaryOp");
static_assert(offsetof(FRigVMFunction_MathVectorBinaryOp, A) == 0x000008, "Member 'FRigVMFunction_MathVectorBinaryOp::A' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_MathVectorBinaryOp, B) == 0x000020, "Member 'FRigVMFunction_MathVectorBinaryOp::B' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_MathVectorBinaryOp, Result) == 0x000038, "Member 'FRigVMFunction_MathVectorBinaryOp::Result' has a wrong offset!");

// ScriptStruct RigVM.RigVMFunction_MathVectorCross
// 0x0000 (0x0050 - 0x0050)
struct FRigVMFunction_MathVectorCross final : public FRigVMFunction_MathVectorBinaryOp
{
};
static_assert(alignof(FRigVMFunction_MathVectorCross) == 0x000008, "Wrong alignment on FRigVMFunction_MathVectorCross");
static_assert(sizeof(FRigVMFunction_MathVectorCross) == 0x000050, "Wrong size on FRigVMFunction_MathVectorCross");

// ScriptStruct RigVM.RigVMMemoryStatistics
// 0x000C (0x000C - 0x0000)
struct FRigVMMemoryStatistics final
{
public:
	int32                                         RegisterCount;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DataBytes;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalBytes;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMMemoryStatistics) == 0x000004, "Wrong alignment on FRigVMMemoryStatistics");
static_assert(sizeof(FRigVMMemoryStatistics) == 0x00000C, "Wrong size on FRigVMMemoryStatistics");
static_assert(offsetof(FRigVMMemoryStatistics, RegisterCount) == 0x000000, "Member 'FRigVMMemoryStatistics::RegisterCount' has a wrong offset!");
static_assert(offsetof(FRigVMMemoryStatistics, DataBytes) == 0x000004, "Member 'FRigVMMemoryStatistics::DataBytes' has a wrong offset!");
static_assert(offsetof(FRigVMMemoryStatistics, TotalBytes) == 0x000008, "Member 'FRigVMMemoryStatistics::TotalBytes' has a wrong offset!");

// ScriptStruct RigVM.RigVMByteCodeStatistics
// 0x0008 (0x0008 - 0x0000)
struct FRigVMByteCodeStatistics final
{
public:
	int32                                         InstructionCount;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DataBytes;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMByteCodeStatistics) == 0x000004, "Wrong alignment on FRigVMByteCodeStatistics");
static_assert(sizeof(FRigVMByteCodeStatistics) == 0x000008, "Wrong size on FRigVMByteCodeStatistics");
static_assert(offsetof(FRigVMByteCodeStatistics, InstructionCount) == 0x000000, "Member 'FRigVMByteCodeStatistics::InstructionCount' has a wrong offset!");
static_assert(offsetof(FRigVMByteCodeStatistics, DataBytes) == 0x000004, "Member 'FRigVMByteCodeStatistics::DataBytes' has a wrong offset!");

// ScriptStruct RigVM.RigVMStatistics
// 0x0038 (0x0038 - 0x0000)
struct FRigVMStatistics final
{
public:
	int32                                         BytesForCDO;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BytesPerInstance;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigVMMemoryStatistics                 LiteralMemory;                                     // 0x0008(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigVMMemoryStatistics                 WorkMemory;                                        // 0x0014(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigVMMemoryStatistics                 DebugMemory;                                       // 0x0020(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         BytesForCaching;                                   // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigVMByteCodeStatistics               ByteCode;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMStatistics) == 0x000004, "Wrong alignment on FRigVMStatistics");
static_assert(sizeof(FRigVMStatistics) == 0x000038, "Wrong size on FRigVMStatistics");
static_assert(offsetof(FRigVMStatistics, BytesForCDO) == 0x000000, "Member 'FRigVMStatistics::BytesForCDO' has a wrong offset!");
static_assert(offsetof(FRigVMStatistics, BytesPerInstance) == 0x000004, "Member 'FRigVMStatistics::BytesPerInstance' has a wrong offset!");
static_assert(offsetof(FRigVMStatistics, LiteralMemory) == 0x000008, "Member 'FRigVMStatistics::LiteralMemory' has a wrong offset!");
static_assert(offsetof(FRigVMStatistics, WorkMemory) == 0x000014, "Member 'FRigVMStatistics::WorkMemory' has a wrong offset!");
static_assert(offsetof(FRigVMStatistics, DebugMemory) == 0x000020, "Member 'FRigVMStatistics::DebugMemory' has a wrong offset!");
static_assert(offsetof(FRigVMStatistics, BytesForCaching) == 0x00002C, "Member 'FRigVMStatistics::BytesForCaching' has a wrong offset!");
static_assert(offsetof(FRigVMStatistics, ByteCode) == 0x000030, "Member 'FRigVMStatistics::ByteCode' has a wrong offset!");

// ScriptStruct RigVM.RigVMFunction_MathIntBase
// 0x0000 (0x0008 - 0x0008)
struct FRigVMFunction_MathIntBase : public FRigVMFunction_MathBase
{
};
static_assert(alignof(FRigVMFunction_MathIntBase) == 0x000008, "Wrong alignment on FRigVMFunction_MathIntBase");
static_assert(sizeof(FRigVMFunction_MathIntBase) == 0x000008, "Wrong size on FRigVMFunction_MathIntBase");

// ScriptStruct RigVM.RigVMFunction_MathIntGreaterEqual
// 0x0010 (0x0018 - 0x0008)
struct FRigVMFunction_MathIntGreaterEqual final : public FRigVMFunction_MathIntBase
{
public:
	int32                                         A;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         B;                                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EBE[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMFunction_MathIntGreaterEqual) == 0x000008, "Wrong alignment on FRigVMFunction_MathIntGreaterEqual");
static_assert(sizeof(FRigVMFunction_MathIntGreaterEqual) == 0x000018, "Wrong size on FRigVMFunction_MathIntGreaterEqual");
static_assert(offsetof(FRigVMFunction_MathIntGreaterEqual, A) == 0x000008, "Member 'FRigVMFunction_MathIntGreaterEqual::A' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_MathIntGreaterEqual, B) == 0x00000C, "Member 'FRigVMFunction_MathIntGreaterEqual::B' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_MathIntGreaterEqual, Result) == 0x000010, "Member 'FRigVMFunction_MathIntGreaterEqual::Result' has a wrong offset!");

// ScriptStruct RigVM.RigVMDrawInstruction
// 0x00D0 (0x00D0 - 0x0000)
struct FRigVMDrawInstruction final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigVMDrawSettings                            PrimitiveType;                                     // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EBF[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Positions;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EC0[0xC];                                     // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EC1[0x30];                                    // 0x00A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMDrawInstruction) == 0x000010, "Wrong alignment on FRigVMDrawInstruction");
static_assert(sizeof(FRigVMDrawInstruction) == 0x0000D0, "Wrong size on FRigVMDrawInstruction");
static_assert(offsetof(FRigVMDrawInstruction, Name) == 0x000000, "Member 'FRigVMDrawInstruction::Name' has a wrong offset!");
static_assert(offsetof(FRigVMDrawInstruction, PrimitiveType) == 0x000008, "Member 'FRigVMDrawInstruction::PrimitiveType' has a wrong offset!");
static_assert(offsetof(FRigVMDrawInstruction, Positions) == 0x000010, "Member 'FRigVMDrawInstruction::Positions' has a wrong offset!");
static_assert(offsetof(FRigVMDrawInstruction, Color) == 0x000020, "Member 'FRigVMDrawInstruction::Color' has a wrong offset!");
static_assert(offsetof(FRigVMDrawInstruction, Thickness) == 0x000030, "Member 'FRigVMDrawInstruction::Thickness' has a wrong offset!");
static_assert(offsetof(FRigVMDrawInstruction, Transform) == 0x000040, "Member 'FRigVMDrawInstruction::Transform' has a wrong offset!");

// ScriptStruct RigVM.RigVMBaseOp
// 0x0001 (0x0001 - 0x0000)
struct FRigVMBaseOp
{
public:
	uint8                                         Pad_1EC2[0x1];                                     // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMBaseOp) == 0x000001, "Wrong alignment on FRigVMBaseOp");
static_assert(sizeof(FRigVMBaseOp) == 0x000001, "Wrong size on FRigVMBaseOp");

// ScriptStruct RigVM.RigVMUnaryOp
// 0x0007 (0x0008 - 0x0001)
struct alignas(0x02) FRigVMUnaryOp : public FRigVMBaseOp
{
public:
	uint8                                         Pad_1EC3[0x7];                                     // 0x0001(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMUnaryOp) == 0x000002, "Wrong alignment on FRigVMUnaryOp");
static_assert(sizeof(FRigVMUnaryOp) == 0x000008, "Wrong size on FRigVMUnaryOp");

// ScriptStruct RigVM.RigVMJumpToBranchOp
// 0x0004 (0x000C - 0x0008)
struct alignas(0x04) FRigVMJumpToBranchOp final : public FRigVMUnaryOp
{
public:
	uint8                                         Pad_1EC4[0x4];                                     // 0x0008(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMJumpToBranchOp) == 0x000004, "Wrong alignment on FRigVMJumpToBranchOp");
static_assert(sizeof(FRigVMJumpToBranchOp) == 0x00000C, "Wrong size on FRigVMJumpToBranchOp");

// ScriptStruct RigVM.RigVMFunction_MathFloatBase
// 0x0000 (0x0008 - 0x0008)
struct FRigVMFunction_MathFloatBase : public FRigVMFunction_MathBase
{
};
static_assert(alignof(FRigVMFunction_MathFloatBase) == 0x000008, "Wrong alignment on FRigVMFunction_MathFloatBase");
static_assert(sizeof(FRigVMFunction_MathFloatBase) == 0x000008, "Wrong size on FRigVMFunction_MathFloatBase");

// ScriptStruct RigVM.RigVMFunction_MathFloatUnaryOp
// 0x0008 (0x0010 - 0x0008)
struct FRigVMFunction_MathFloatUnaryOp : public FRigVMFunction_MathFloatBase
{
public:
	float                                         Value;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Result;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMFunction_MathFloatUnaryOp) == 0x000008, "Wrong alignment on FRigVMFunction_MathFloatUnaryOp");
static_assert(sizeof(FRigVMFunction_MathFloatUnaryOp) == 0x000010, "Wrong size on FRigVMFunction_MathFloatUnaryOp");
static_assert(offsetof(FRigVMFunction_MathFloatUnaryOp, Value) == 0x000008, "Member 'FRigVMFunction_MathFloatUnaryOp::Value' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_MathFloatUnaryOp, Result) == 0x00000C, "Member 'FRigVMFunction_MathFloatUnaryOp::Result' has a wrong offset!");

// ScriptStruct RigVM.RigVMFunction_MathFloatSign
// 0x0000 (0x0010 - 0x0010)
struct FRigVMFunction_MathFloatSign final : public FRigVMFunction_MathFloatUnaryOp
{
};
static_assert(alignof(FRigVMFunction_MathFloatSign) == 0x000008, "Wrong alignment on FRigVMFunction_MathFloatSign");
static_assert(sizeof(FRigVMFunction_MathFloatSign) == 0x000010, "Wrong size on FRigVMFunction_MathFloatSign");

// ScriptStruct RigVM.RigVMExtendedExecuteContext
// 0x01B8 (0x01B8 - 0x0000)
struct FRigVMExtendedExecuteContext final
{
public:
	uint8                                         Pad_1EC5[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        VMHash;                                            // 0x0008(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EC6[0x104];                                   // 0x000C(0x0104)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        NumExecutions;                                     // 0x0110(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EC7[0x5C];                                    // 0x0114(0x005C)(Fixing Size After Last Property [ Dumper-7 ])
	class URigVM*                                 DeferredVMToCopy;                                  // 0x0170(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EC8[0x40];                                    // 0x0178(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMExtendedExecuteContext) == 0x000008, "Wrong alignment on FRigVMExtendedExecuteContext");
static_assert(sizeof(FRigVMExtendedExecuteContext) == 0x0001B8, "Wrong size on FRigVMExtendedExecuteContext");
static_assert(offsetof(FRigVMExtendedExecuteContext, VMHash) == 0x000008, "Member 'FRigVMExtendedExecuteContext::VMHash' has a wrong offset!");
static_assert(offsetof(FRigVMExtendedExecuteContext, NumExecutions) == 0x000110, "Member 'FRigVMExtendedExecuteContext::NumExecutions' has a wrong offset!");
static_assert(offsetof(FRigVMExtendedExecuteContext, DeferredVMToCopy) == 0x000170, "Member 'FRigVMExtendedExecuteContext::DeferredVMToCopy' has a wrong offset!");

// ScriptStruct RigVM.RigVMDrawContainer
// 0x0018 (0x0018 - 0x0000)
struct FRigVMDrawContainer
{
public:
	uint8                                         Pad_1EC9[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigVMDrawInstruction>          Instructions;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMDrawContainer) == 0x000008, "Wrong alignment on FRigVMDrawContainer");
static_assert(sizeof(FRigVMDrawContainer) == 0x000018, "Wrong size on FRigVMDrawContainer");
static_assert(offsetof(FRigVMDrawContainer, Instructions) == 0x000008, "Member 'FRigVMDrawContainer::Instructions' has a wrong offset!");

// ScriptStruct RigVM.RigVMParameter
// 0x0030 (0x0030 - 0x0000)
struct FRigVMParameter final
{
public:
	ERigVMParameterType                           Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1ECA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RegisterIndex;                                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CPPType;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScriptStruct*                          ScriptStruct;                                      // 0x0020(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ScriptStructPath;                                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FRigVMParameter) == 0x000008, "Wrong alignment on FRigVMParameter");
static_assert(sizeof(FRigVMParameter) == 0x000030, "Wrong size on FRigVMParameter");
static_assert(offsetof(FRigVMParameter, Type) == 0x000000, "Member 'FRigVMParameter::Type' has a wrong offset!");
static_assert(offsetof(FRigVMParameter, Name) == 0x000004, "Member 'FRigVMParameter::Name' has a wrong offset!");
static_assert(offsetof(FRigVMParameter, RegisterIndex) == 0x00000C, "Member 'FRigVMParameter::RegisterIndex' has a wrong offset!");
static_assert(offsetof(FRigVMParameter, CPPType) == 0x000010, "Member 'FRigVMParameter::CPPType' has a wrong offset!");
static_assert(offsetof(FRigVMParameter, ScriptStruct) == 0x000020, "Member 'FRigVMParameter::ScriptStruct' has a wrong offset!");
static_assert(offsetof(FRigVMParameter, ScriptStructPath) == 0x000028, "Member 'FRigVMParameter::ScriptStructPath' has a wrong offset!");

// ScriptStruct RigVM.RigVMQuaternaryOp
// 0x0019 (0x001A - 0x0001)
struct alignas(0x02) FRigVMQuaternaryOp final : public FRigVMBaseOp
{
public:
	uint8                                         Pad_1ECB[0x19];                                    // 0x0001(0x0019)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMQuaternaryOp) == 0x000002, "Wrong alignment on FRigVMQuaternaryOp");
static_assert(sizeof(FRigVMQuaternaryOp) == 0x00001A, "Wrong size on FRigVMQuaternaryOp");

// ScriptStruct RigVM.RigVMDispatchFactory
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x08) FRigVMDispatchFactory
{
public:
	uint8                                         Pad_1ECC[0x70];                                    // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMDispatchFactory) == 0x000008, "Wrong alignment on FRigVMDispatchFactory");
static_assert(sizeof(FRigVMDispatchFactory) == 0x000070, "Wrong size on FRigVMDispatchFactory");

// ScriptStruct RigVM.RigVMDispatch_CoreBase
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_CoreBase : public FRigVMDispatchFactory
{
};
static_assert(alignof(FRigVMDispatch_CoreBase) == 0x000008, "Wrong alignment on FRigVMDispatch_CoreBase");
static_assert(sizeof(FRigVMDispatch_CoreBase) == 0x000070, "Wrong size on FRigVMDispatch_CoreBase");

// ScriptStruct RigVM.RigVMDispatch_ArrayBase
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_ArrayBase : public FRigVMDispatch_CoreBase
{
};
static_assert(alignof(FRigVMDispatch_ArrayBase) == 0x000008, "Wrong alignment on FRigVMDispatch_ArrayBase");
static_assert(sizeof(FRigVMDispatch_ArrayBase) == 0x000070, "Wrong size on FRigVMDispatch_ArrayBase");

// ScriptStruct RigVM.RigVMDispatch_ArrayFind
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_ArrayFind final : public FRigVMDispatch_ArrayBase
{
};
static_assert(alignof(FRigVMDispatch_ArrayFind) == 0x000008, "Wrong alignment on FRigVMDispatch_ArrayFind");
static_assert(sizeof(FRigVMDispatch_ArrayFind) == 0x000070, "Wrong size on FRigVMDispatch_ArrayFind");

// ScriptStruct RigVM.RigVMRuntimeSettings
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FRigVMRuntimeSettings final
{
public:
	int32                                         MaximumArraySize;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1ECD[0x14];                                    // 0x0004(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMRuntimeSettings) == 0x000008, "Wrong alignment on FRigVMRuntimeSettings");
static_assert(sizeof(FRigVMRuntimeSettings) == 0x000018, "Wrong size on FRigVMRuntimeSettings");
static_assert(offsetof(FRigVMRuntimeSettings, MaximumArraySize) == 0x000000, "Member 'FRigVMRuntimeSettings::MaximumArraySize' has a wrong offset!");

// ScriptStruct RigVM.RigVMDecorator
// 0x0010 (0x0018 - 0x0008)
struct FRigVMDecorator final : public FRigVMStruct
{
public:
	uint8                                         Pad_1ECE[0x10];                                    // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMDecorator) == 0x000008, "Wrong alignment on FRigVMDecorator");
static_assert(sizeof(FRigVMDecorator) == 0x000018, "Wrong size on FRigVMDecorator");

// ScriptStruct RigVM.RigVMExternalVariableDef
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FRigVMExternalVariableDef
{
public:
	uint8                                         Pad_1ECF[0x28];                                    // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMExternalVariableDef) == 0x000008, "Wrong alignment on FRigVMExternalVariableDef");
static_assert(sizeof(FRigVMExternalVariableDef) == 0x000028, "Wrong size on FRigVMExternalVariableDef");

// ScriptStruct RigVM.RigVMFunction_NoiseFloat
// 0x0020 (0x0028 - 0x0008)
struct FRigVMFunction_NoiseFloat final : public FRigVMFunction_MathBase
{
public:
	float                                         Value;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Frequency;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Minimum;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Maximum;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Result;                                            // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1ED0[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMFunction_NoiseFloat) == 0x000008, "Wrong alignment on FRigVMFunction_NoiseFloat");
static_assert(sizeof(FRigVMFunction_NoiseFloat) == 0x000028, "Wrong size on FRigVMFunction_NoiseFloat");
static_assert(offsetof(FRigVMFunction_NoiseFloat, Value) == 0x000008, "Member 'FRigVMFunction_NoiseFloat::Value' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_NoiseFloat, Speed) == 0x00000C, "Member 'FRigVMFunction_NoiseFloat::Speed' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_NoiseFloat, Frequency) == 0x000010, "Member 'FRigVMFunction_NoiseFloat::Frequency' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_NoiseFloat, Minimum) == 0x000014, "Member 'FRigVMFunction_NoiseFloat::Minimum' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_NoiseFloat, Maximum) == 0x000018, "Member 'FRigVMFunction_NoiseFloat::Maximum' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_NoiseFloat, Result) == 0x00001C, "Member 'FRigVMFunction_NoiseFloat::Result' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_NoiseFloat, Time) == 0x000020, "Member 'FRigVMFunction_NoiseFloat::Time' has a wrong offset!");

// ScriptStruct RigVM.RigVMExternalVariable
// 0x0008 (0x0030 - 0x0028)
struct FRigVMExternalVariable final : public FRigVMExternalVariableDef
{
public:
	uint8                                         Pad_1ED1[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMExternalVariable) == 0x000008, "Wrong alignment on FRigVMExternalVariable");
static_assert(sizeof(FRigVMExternalVariable) == 0x000030, "Wrong size on FRigVMExternalVariable");

// ScriptStruct RigVM.RigVMFunction_AnimBase
// 0x0000 (0x0008 - 0x0008)
struct FRigVMFunction_AnimBase : public FRigVMStruct
{
};
static_assert(alignof(FRigVMFunction_AnimBase) == 0x000008, "Wrong alignment on FRigVMFunction_AnimBase");
static_assert(sizeof(FRigVMFunction_AnimBase) == 0x000008, "Wrong size on FRigVMFunction_AnimBase");

// ScriptStruct RigVM.RigVMFunction_DebugBase
// 0x0000 (0x0008 - 0x0008)
struct FRigVMFunction_DebugBase : public FRigVMStruct
{
};
static_assert(alignof(FRigVMFunction_DebugBase) == 0x000008, "Wrong alignment on FRigVMFunction_DebugBase");
static_assert(sizeof(FRigVMFunction_DebugBase) == 0x000008, "Wrong size on FRigVMFunction_DebugBase");

// ScriptStruct RigVM.RigVMExecuteContext
// 0x00F0 (0x00F0 - 0x0000)
struct alignas(0x10) FRigVMExecuteContext
{
public:
	uint8                                         Pad_1ED2[0xF0];                                    // 0x0000(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigVMExecuteContext) == 0x000010, "Wrong alignment on FRigVMExecuteContext");
static_assert(sizeof(FRigVMExecuteContext) == 0x0000F0, "Wrong size on FRigVMExecuteContext");

// ScriptStruct RigVM.RigVMStructMutable
// 0x00F8 (0x0100 - 0x0008)
struct FRigVMStructMutable : public FRigVMStruct
{
public:
	uint8                                         Pad_1ED3[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMExecuteContext                   ExecuteContext;                                    // 0x0010(0x00F0)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMStructMutable) == 0x000010, "Wrong alignment on FRigVMStructMutable");
static_assert(sizeof(FRigVMStructMutable) == 0x000100, "Wrong size on FRigVMStructMutable");
static_assert(offsetof(FRigVMStructMutable, ExecuteContext) == 0x000010, "Member 'FRigVMStructMutable::ExecuteContext' has a wrong offset!");

// ScriptStruct RigVM.RigVMDispatch_ArrayBaseMutable
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_ArrayBaseMutable : public FRigVMDispatch_ArrayBase
{
};
static_assert(alignof(FRigVMDispatch_ArrayBaseMutable) == 0x000008, "Wrong alignment on FRigVMDispatch_ArrayBaseMutable");
static_assert(sizeof(FRigVMDispatch_ArrayBaseMutable) == 0x000070, "Wrong size on FRigVMDispatch_ArrayBaseMutable");

// ScriptStruct RigVM.RigVMDispatch_ArrayReset
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_ArrayReset : public FRigVMDispatch_ArrayBaseMutable
{
};
static_assert(alignof(FRigVMDispatch_ArrayReset) == 0x000008, "Wrong alignment on FRigVMDispatch_ArrayReset");
static_assert(sizeof(FRigVMDispatch_ArrayReset) == 0x000070, "Wrong size on FRigVMDispatch_ArrayReset");

// ScriptStruct RigVM.RigVMDispatch_ArrayReverse
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_ArrayReverse final : public FRigVMDispatch_ArrayReset
{
};
static_assert(alignof(FRigVMDispatch_ArrayReverse) == 0x000008, "Wrong alignment on FRigVMDispatch_ArrayReverse");
static_assert(sizeof(FRigVMDispatch_ArrayReverse) == 0x000070, "Wrong size on FRigVMDispatch_ArrayReverse");

// ScriptStruct RigVM.RigVMFunction_DebugBaseMutable
// 0x0000 (0x0100 - 0x0100)
struct FRigVMFunction_DebugBaseMutable : public FRigVMStructMutable
{
};
static_assert(alignof(FRigVMFunction_DebugBaseMutable) == 0x000010, "Wrong alignment on FRigVMFunction_DebugBaseMutable");
static_assert(sizeof(FRigVMFunction_DebugBaseMutable) == 0x000100, "Wrong size on FRigVMFunction_DebugBaseMutable");

// ScriptStruct RigVM.RigVMDispatch_ArraySetNum
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_ArraySetNum final : public FRigVMDispatch_ArrayBaseMutable
{
};
static_assert(alignof(FRigVMDispatch_ArraySetNum) == 0x000008, "Wrong alignment on FRigVMDispatch_ArraySetNum");
static_assert(sizeof(FRigVMDispatch_ArraySetNum) == 0x000070, "Wrong size on FRigVMDispatch_ArraySetNum");

// ScriptStruct RigVM.RigVMFunction_MathMutableBase
// 0x0000 (0x0100 - 0x0100)
struct FRigVMFunction_MathMutableBase : public FRigVMStructMutable
{
};
static_assert(alignof(FRigVMFunction_MathMutableBase) == 0x000010, "Wrong alignment on FRigVMFunction_MathMutableBase");
static_assert(sizeof(FRigVMFunction_MathMutableBase) == 0x000100, "Wrong size on FRigVMFunction_MathMutableBase");

// ScriptStruct RigVM.RigVMFunction_Sequence
// 0x02D8 (0x02E0 - 0x0008)
struct FRigVMFunction_Sequence final : public FRigVMStruct
{
public:
	uint8                                         Pad_1ED4[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMExecuteContext                   ExecuteContext;                                    // 0x0010(0x00F0)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	struct FRigVMExecuteContext                   A;                                                 // 0x0100(0x00F0)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	struct FRigVMExecuteContext                   B;                                                 // 0x01F0(0x00F0)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMFunction_Sequence) == 0x000010, "Wrong alignment on FRigVMFunction_Sequence");
static_assert(sizeof(FRigVMFunction_Sequence) == 0x0002E0, "Wrong size on FRigVMFunction_Sequence");
static_assert(offsetof(FRigVMFunction_Sequence, ExecuteContext) == 0x000010, "Member 'FRigVMFunction_Sequence::ExecuteContext' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_Sequence, A) == 0x000100, "Member 'FRigVMFunction_Sequence::A' has a wrong offset!");
static_assert(offsetof(FRigVMFunction_Sequence, B) == 0x0001F0, "Member 'FRigVMFunction_Sequence::B' has a wrong offset!");

// ScriptStruct RigVM.RigVMDispatch_ArraySetAtIndex
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_ArraySetAtIndex : public FRigVMDispatch_ArrayBaseMutable
{
};
static_assert(alignof(FRigVMDispatch_ArraySetAtIndex) == 0x000008, "Wrong alignment on FRigVMDispatch_ArraySetAtIndex");
static_assert(sizeof(FRigVMDispatch_ArraySetAtIndex) == 0x000070, "Wrong size on FRigVMDispatch_ArraySetAtIndex");

// ScriptStruct RigVM.RigVMDispatch_ArrayInsert
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_ArrayInsert final : public FRigVMDispatch_ArraySetAtIndex
{
};
static_assert(alignof(FRigVMDispatch_ArrayInsert) == 0x000008, "Wrong alignment on FRigVMDispatch_ArrayInsert");
static_assert(sizeof(FRigVMDispatch_ArrayInsert) == 0x000070, "Wrong size on FRigVMDispatch_ArrayInsert");

// ScriptStruct RigVM.RigVMUnknownType
// 0x0004 (0x0004 - 0x0000)
struct FRigVMUnknownType final
{
public:
	uint32                                        Hash;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FRigVMUnknownType) == 0x000004, "Wrong alignment on FRigVMUnknownType");
static_assert(sizeof(FRigVMUnknownType) == 0x000004, "Wrong size on FRigVMUnknownType");
static_assert(offsetof(FRigVMUnknownType, Hash) == 0x000000, "Member 'FRigVMUnknownType::Hash' has a wrong offset!");

// ScriptStruct RigVM.RigVMFunction_SimBase
// 0x0000 (0x0008 - 0x0008)
struct FRigVMFunction_SimBase : public FRigVMStruct
{
};
static_assert(alignof(FRigVMFunction_SimBase) == 0x000008, "Wrong alignment on FRigVMFunction_SimBase");
static_assert(sizeof(FRigVMFunction_SimBase) == 0x000008, "Wrong size on FRigVMFunction_SimBase");

// ScriptStruct RigVM.RigVMDispatch_Constant
// 0x0000 (0x0070 - 0x0070)
struct FRigVMDispatch_Constant final : public FRigVMDispatch_CoreBase
{
};
static_assert(alignof(FRigVMDispatch_Constant) == 0x000008, "Wrong alignment on FRigVMDispatch_Constant");
static_assert(sizeof(FRigVMDispatch_Constant) == 0x000070, "Wrong size on FRigVMDispatch_Constant");

// ScriptStruct RigVM.RigVMFunction_SimBaseMutable
// 0x0000 (0x0100 - 0x0100)
struct FRigVMFunction_SimBaseMutable : public FRigVMStructMutable
{
};
static_assert(alignof(FRigVMFunction_SimBaseMutable) == 0x000010, "Wrong alignment on FRigVMFunction_SimBaseMutable");
static_assert(sizeof(FRigVMFunction_SimBaseMutable) == 0x000100, "Wrong size on FRigVMFunction_SimBaseMutable");

// ScriptStruct RigVM.RigVMGraphFunctionIdentifier
// 0x0040 (0x0040 - 0x0000)
struct FRigVMGraphFunctionIdentifier final
{
public:
	struct FSoftObjectPath                        LibraryNode;                                       // 0x0000(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HostObject;                                        // 0x0020(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMGraphFunctionIdentifier) == 0x000008, "Wrong alignment on FRigVMGraphFunctionIdentifier");
static_assert(sizeof(FRigVMGraphFunctionIdentifier) == 0x000040, "Wrong size on FRigVMGraphFunctionIdentifier");
static_assert(offsetof(FRigVMGraphFunctionIdentifier, LibraryNode) == 0x000000, "Member 'FRigVMGraphFunctionIdentifier::LibraryNode' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionIdentifier, HostObject) == 0x000020, "Member 'FRigVMGraphFunctionIdentifier::HostObject' has a wrong offset!");

// ScriptStruct RigVM.RigVMGraphFunctionArgument
// 0x00B0 (0x00B0 - 0x0000)
struct FRigVMGraphFunctionArgument final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DisplayName;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CPPType;                                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 CPPTypeObject;                                     // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsArray;                                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigVMPinDirection                            Direction;                                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1ED5[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultValue;                                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConst;                                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1ED6[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FText>              PathToTooltip;                                     // 0x0060(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMGraphFunctionArgument) == 0x000008, "Wrong alignment on FRigVMGraphFunctionArgument");
static_assert(sizeof(FRigVMGraphFunctionArgument) == 0x0000B0, "Wrong size on FRigVMGraphFunctionArgument");
static_assert(offsetof(FRigVMGraphFunctionArgument, Name) == 0x000000, "Member 'FRigVMGraphFunctionArgument::Name' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionArgument, DisplayName) == 0x000008, "Member 'FRigVMGraphFunctionArgument::DisplayName' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionArgument, CPPType) == 0x000010, "Member 'FRigVMGraphFunctionArgument::CPPType' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionArgument, CPPTypeObject) == 0x000018, "Member 'FRigVMGraphFunctionArgument::CPPTypeObject' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionArgument, bIsArray) == 0x000040, "Member 'FRigVMGraphFunctionArgument::bIsArray' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionArgument, Direction) == 0x000041, "Member 'FRigVMGraphFunctionArgument::Direction' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionArgument, DefaultValue) == 0x000048, "Member 'FRigVMGraphFunctionArgument::DefaultValue' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionArgument, bIsConst) == 0x000058, "Member 'FRigVMGraphFunctionArgument::bIsConst' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionArgument, PathToTooltip) == 0x000060, "Member 'FRigVMGraphFunctionArgument::PathToTooltip' has a wrong offset!");

// ScriptStruct RigVM.RigVMGraphFunctionHeader
// 0x0110 (0x0110 - 0x0000)
struct FRigVMGraphFunctionHeader final
{
public:
	struct FRigVMGraphFunctionIdentifier          LibraryPointer;                                    // 0x0000(0x0040)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodeTitle;                                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeColor;                                         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ToolTip;                                           // 0x0068(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Keywords;                                          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRigVMGraphFunctionArgument>    Arguments;                                         // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FRigVMGraphFunctionIdentifier, uint32> Dependencies;                                      // 0x00B0(0x0050)(NativeAccessSpecifierPublic)
	TArray<struct FRigVMExternalVariable>         ExternalVariables;                                 // 0x0100(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigVMGraphFunctionHeader) == 0x000008, "Wrong alignment on FRigVMGraphFunctionHeader");
static_assert(sizeof(FRigVMGraphFunctionHeader) == 0x000110, "Wrong size on FRigVMGraphFunctionHeader");
static_assert(offsetof(FRigVMGraphFunctionHeader, LibraryPointer) == 0x000000, "Member 'FRigVMGraphFunctionHeader::LibraryPointer' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, Name) == 0x000040, "Member 'FRigVMGraphFunctionHeader::Name' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, NodeTitle) == 0x000048, "Member 'FRigVMGraphFunctionHeader::NodeTitle' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, NodeColor) == 0x000058, "Member 'FRigVMGraphFunctionHeader::NodeColor' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, ToolTip) == 0x000068, "Member 'FRigVMGraphFunctionHeader::ToolTip' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, Category) == 0x000080, "Member 'FRigVMGraphFunctionHeader::Category' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, Keywords) == 0x000090, "Member 'FRigVMGraphFunctionHeader::Keywords' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, Arguments) == 0x0000A0, "Member 'FRigVMGraphFunctionHeader::Arguments' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, Dependencies) == 0x0000B0, "Member 'FRigVMGraphFunctionHeader::Dependencies' has a wrong offset!");
static_assert(offsetof(FRigVMGraphFunctionHeader, ExternalVariables) == 0x000100, "Member 'FRigVMGraphFunctionHeader::ExternalVariables' has a wrong offset!");

// ScriptStruct RigVM.RigVMByteCodeEntry
// 0x000C (0x000C - 0x0000)
struct FRigVMByteCodeEntry final
{
public:
