#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Road_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Road_Data_structs.hpp"
#include "ConnectionNum_structs.hpp"


namespace SDK::Params
{

// Function Road_BP.Road_BP_C.Adjust Landscape To Road
// 0x00D0 (0x00D0 - 0x0000)
struct Road_BP_C_Adjust_Landscape_To_Road final
{
public:
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class ULandscapeLayerInfoObject*>      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class ULandscapeLayerInfoObject*              CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE6[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE7[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE8[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE9[0x1];                                     // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EditorApplySpline_StartWidth_ImplicitCast; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_EndWidth_ImplicitCast;  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_BP_C_Adjust_Landscape_To_Road) == 0x000008, "Wrong alignment on Road_BP_C_Adjust_Landscape_To_Road");
static_assert(sizeof(Road_BP_C_Adjust_Landscape_To_Road) == 0x0000D0, "Wrong size on Road_BP_C_Adjust_Landscape_To_Road");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_GetObjectName_ReturnValue) == 0x000000, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, K2Node_MakeArray_Array) == 0x000010, "Member 'Road_BP_C_Adjust_Landscape_To_Road::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Array_Get_Item) == 0x000020, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, Temp_int_Variable) == 0x00002C, "Member 'Road_BP_C_Adjust_Landscape_To_Road::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000034, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_GetObjectName_ReturnValue_1) == 0x000050, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000A8, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0000B8, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_BooleanOR_ReturnValue) == 0x0000B9, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_BooleanAND_ReturnValue) == 0x0000BA, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_EditorApplySpline_StartWidth_ImplicitCast) == 0x0000BC, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_EditorApplySpline_StartWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_EditorApplySpline_EndWidth_ImplicitCast) == 0x0000C0, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_EditorApplySpline_EndWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast) == 0x0000C4, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Adjust_Landscape_To_Road, CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast) == 0x0000C8, "Member 'Road_BP_C_Adjust_Landscape_To_Road::CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast' has a wrong offset!");

// Function Road_BP.Road_BP_C.Align Road To Landscape
// 0x02C0 (0x02C0 - 0x0000)
struct Road_BP_C_Align_Road_To_Landscape final
{
public:
	EDrawDebugTrace                               CallFunc_TraceVisibility_Result;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEB[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEC[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BED[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEE[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEF[0x1];                                     // 0x01CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF0[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF1[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_BP_C_Align_Road_To_Landscape) == 0x000008, "Wrong alignment on Road_BP_C_Align_Road_To_Landscape");
static_assert(sizeof(Road_BP_C_Align_Road_To_Landscape) == 0x0002C0, "Wrong size on Road_BP_C_Align_Road_To_Landscape");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_TraceVisibility_Result) == 0x000000, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_TraceVisibility_Result' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, Temp_object_Variable) == 0x000008, "Member 'Road_BP_C_Align_Road_To_Landscape::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, Temp_int_Variable) == 0x000018, "Member 'Road_BP_C_Align_Road_To_Landscape::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000060, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000070, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, K2Node_MakeArray_Array) == 0x0000A0, "Member 'Road_BP_C_Align_Road_To_Landscape::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B0, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000E0, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001C8, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C9, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001CA, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_Time) == 0x0001CC, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_Distance) == 0x0001D0, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_Location) == 0x0001D8, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F0, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_Normal) == 0x000208, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_ImpactNormal) == 0x000220, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_PhysMat) == 0x000238, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_HitActor) == 0x000240, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_HitComponent) == 0x000248, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_HitBoneName) == 0x000250, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_BoneName) == 0x000258, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_HitItem) == 0x000260, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_ElementIndex) == 0x000264, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_FaceIndex) == 0x000268, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_TraceStart) == 0x000270, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_BreakHitResult_TraceEnd) == 0x000288, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_GetObjectName_ReturnValue) == 0x0002A0, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_Align_Road_To_Landscape, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0002B0, "Member 'Road_BP_C_Align_Road_To_Landscape::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function Road_BP.Road_BP_C.BuildRoadMesh
// 0x0350 (0x0350 - 0x0000)
struct Road_BP_C_BuildRoadMesh final
{
public:
	int32                                         Loop_Index;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            RoadElementMesh;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SidesWalkStartScale;                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SidesWalkLocationOffset;                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SidesWalkEndScale;                                 // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_s_Slot_0;                                 // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_s_Slot_1_;                                // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_s_Slot_2;                                 // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_s_Slot_3;                                 // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_s_Slot_4;                                 // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Shadow;                                       // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF3[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Maximum_Draw_Distance;                             // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Override_Material;                             // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF4[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CurentSplineMesh;                                  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TangentEndLocation;                                // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TangentStartLocation;                              // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x00D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Local_RoadElementMesh;                             // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NextLoopIndex;                                     // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLoopIndex;                                  // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue;    // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF5[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_X_Size;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_Y_Size;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_Z_Size;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Calculate_Mesh_Size_Static_Mesh;          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_X_Size_1;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_Y_Size_1;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_Z_Size_1;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Calculate_Mesh_Size_Static_Mesh_1;        // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue; // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1; // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF6[0x8];                                     // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0250(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF7[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF8[0x5];                                     // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF9[0x6];                                     // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_2; // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_2; // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_BP_C_BuildRoadMesh) == 0x000010, "Wrong alignment on Road_BP_C_BuildRoadMesh");
static_assert(sizeof(Road_BP_C_BuildRoadMesh) == 0x000350, "Wrong size on Road_BP_C_BuildRoadMesh");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Loop_Index) == 0x000000, "Member 'Road_BP_C_BuildRoadMesh::Loop_Index' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, RoadElementMesh) == 0x000008, "Member 'Road_BP_C_BuildRoadMesh::RoadElementMesh' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, SidesWalkStartScale) == 0x000010, "Member 'Road_BP_C_BuildRoadMesh::SidesWalkStartScale' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, SidesWalkLocationOffset) == 0x000020, "Member 'Road_BP_C_BuildRoadMesh::SidesWalkLocationOffset' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, SidesWalkEndScale) == 0x000030, "Member 'Road_BP_C_BuildRoadMesh::SidesWalkEndScale' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Material_s_Slot_0) == 0x000040, "Member 'Road_BP_C_BuildRoadMesh::Material_s_Slot_0' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Material_s_Slot_1_) == 0x000048, "Member 'Road_BP_C_BuildRoadMesh::Material_s_Slot_1_' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Material_s_Slot_2) == 0x000050, "Member 'Road_BP_C_BuildRoadMesh::Material_s_Slot_2' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Material_s_Slot_3) == 0x000058, "Member 'Road_BP_C_BuildRoadMesh::Material_s_Slot_3' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Material_s_Slot_4) == 0x000060, "Member 'Road_BP_C_BuildRoadMesh::Material_s_Slot_4' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Cast_Shadow) == 0x000068, "Member 'Road_BP_C_BuildRoadMesh::Cast_Shadow' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Maximum_Draw_Distance) == 0x000070, "Member 'Road_BP_C_BuildRoadMesh::Maximum_Draw_Distance' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Can_Override_Material) == 0x000078, "Member 'Road_BP_C_BuildRoadMesh::Can_Override_Material' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CurentSplineMesh) == 0x000080, "Member 'Road_BP_C_BuildRoadMesh::CurentSplineMesh' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, TangentEndLocation) == 0x000088, "Member 'Road_BP_C_BuildRoadMesh::TangentEndLocation' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, EndLocation) == 0x0000A0, "Member 'Road_BP_C_BuildRoadMesh::EndLocation' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, TangentStartLocation) == 0x0000B8, "Member 'Road_BP_C_BuildRoadMesh::TangentStartLocation' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, StartLocation) == 0x0000D0, "Member 'Road_BP_C_BuildRoadMesh::StartLocation' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Local_RoadElementMesh) == 0x0000E8, "Member 'Road_BP_C_BuildRoadMesh::Local_RoadElementMesh' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, NextLoopIndex) == 0x0000F0, "Member 'Road_BP_C_BuildRoadMesh::NextLoopIndex' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CurrentLoopIndex) == 0x0000F4, "Member 'Road_BP_C_BuildRoadMesh::CurrentLoopIndex' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000FC, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetDirectionAtSplinePoint_ReturnValue) == 0x000100, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetDirectionAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000118, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000130, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000148, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00014C, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Calculate_Mesh_Size_Mesh_X_Size) == 0x000150, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Calculate_Mesh_Size_Mesh_X_Size' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Calculate_Mesh_Size_Mesh_Y_Size) == 0x000158, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Calculate_Mesh_Size_Mesh_Y_Size' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Calculate_Mesh_Size_Mesh_Z_Size) == 0x000160, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Calculate_Mesh_Size_Mesh_Z_Size' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Calculate_Mesh_Size_Static_Mesh) == 0x000168, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Calculate_Mesh_Size_Static_Mesh' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000170, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Calculate_Mesh_Size_Mesh_X_Size_1) == 0x000178, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Calculate_Mesh_Size_Mesh_X_Size_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Calculate_Mesh_Size_Mesh_Y_Size_1) == 0x000180, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Calculate_Mesh_Size_Mesh_Y_Size_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Calculate_Mesh_Size_Mesh_Z_Size_1) == 0x000188, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Calculate_Mesh_Size_Mesh_Z_Size_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Calculate_Mesh_Size_Static_Mesh_1) == 0x000190, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Calculate_Mesh_Size_Static_Mesh_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000198, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001A0, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue) == 0x0001B8, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0001D0, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x0001E8, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1) == 0x000200, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000218, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000230, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Temp_struct_Variable) == 0x000250, "Member 'Road_BP_C_BuildRoadMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Temp_byte_Variable) == 0x0002B0, "Member 'Road_BP_C_BuildRoadMesh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_AddComponent_ReturnValue) == 0x0002B8, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Temp_byte_Variable_1) == 0x0002C0, "Member 'Road_BP_C_BuildRoadMesh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x0002C1, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Temp_bool_Variable) == 0x0002C2, "Member 'Road_BP_C_BuildRoadMesh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x0002C8, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x0002E0, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, K2Node_Select_Default) == 0x0002F8, "Member 'Road_BP_C_BuildRoadMesh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, Temp_bool_Variable_1) == 0x0002F9, "Member 'Road_BP_C_BuildRoadMesh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAndTangentAtSplinePoint_Location_2) == 0x000300, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAndTangentAtSplinePoint_Location_2' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_2) == 0x000318, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_2' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_Percent_IntInt_ReturnValue) == 0x000330, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, K2Node_Select_Default_1) == 0x000334, "Member 'Road_BP_C_BuildRoadMesh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast) == 0x000338, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x00033C, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000340, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000344, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Road_BP_C_BuildRoadMesh, CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000348, "Member 'Road_BP_C_BuildRoadMesh::CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");

// Function Road_BP.Road_BP_C.BuildSideGuardMesh
// 0x07D0 (0x07D0 - 0x0000)
struct Road_BP_C_BuildSideGuardMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Right_or_Middle_or_Left;                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFA[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Mesh_Y_Z_Scale;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        X_Scale;                                           // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Param_Location_Offset;                             // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number_Of_Meshes;                                  // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MakeStraight;                                      // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Lights;                                        // 0x003D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Double_lights_;                                 // 0x003E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Spacing_Method;                                // 0x003F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spacing;                                           // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Culling_Distance;                                  // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Shadow;                                       // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Remove_first_mesh;                                 // 0x0051(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Remove_last_mesh;                                  // 0x0052(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFB[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentLoop;                                       // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFC[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_X_Size;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_Y_Size;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Mesh_Size_Mesh_Z_Size;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Calculate_Mesh_Size_Static_Mesh;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
