#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Road_Four_Jonction_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Road_Four_Jonction_BP.Road_Four_Jonction_BP_C.Add Roads At End
// 0x01C0 (0x01C0 - 0x0000)
struct Road_Four_Jonction_BP_C_Add_Roads_At_End final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_3;     // 0x0140(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_Four_Jonction_BP_C_Add_Roads_At_End) == 0x000010, "Wrong alignment on Road_Four_Jonction_BP_C_Add_Roads_At_End");
static_assert(sizeof(Road_Four_Jonction_BP_C_Add_Roads_At_End) == 0x0001C0, "Wrong size on Road_Four_Jonction_BP_C_Add_Roads_At_End");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000060, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000C8, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000D8, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x0000E0, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_K2_GetComponentToWorld_ReturnValue_3) == 0x000140, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_K2_GetComponentToWorld_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0001A0, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0001A8, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0001B0, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Add_Roads_At_End, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x0001B8, "Member 'Road_Four_Jonction_BP_C_Add_Roads_At_End::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");

// Function Road_Four_Jonction_BP.Road_Four_Jonction_BP_C.Connect Road To 
// 0x00C8 (0x00C8 - 0x0000)
struct Road_Four_Jonction_BP_C_Connect_Road_To_ final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Con_Rotation;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAE[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAF[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_Four_Jonction_BP_C_Connect_Road_To_) == 0x000008, "Wrong alignment on Road_Four_Jonction_BP_C_Connect_Road_To_");
static_assert(sizeof(Road_Four_Jonction_BP_C_Connect_Road_To_) == 0x0000C8, "Wrong size on Road_Four_Jonction_BP_C_Connect_Road_To_");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, Location) == 0x000000, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::Location' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, Con_Rotation) == 0x000018, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::Con_Rotation' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_GetForwardVector_ReturnValue) == 0x000030, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_GetDistanceTo_ReturnValue) == 0x00004C, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000054, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_SelectFloat_ReturnValue) == 0x000068, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000088, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_SelectVector_ReturnValue) == 0x0000A0, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000B8, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_Connect_Road_To_, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000C0, "Member 'Road_Four_Jonction_BP_C_Connect_Road_To_::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Road_Four_Jonction_BP.Road_Four_Jonction_BP_C.ExecuteUbergraph_Road_Four_Jonction_BP
// 0x0488 (0x0488 - 0x0000)
struct Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB0[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB1[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB2[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0050(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x0060(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB3[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB4[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x00A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB5[0x2];                                     // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB6[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB7[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARoad_BP_C*                             K2Node_DynamicCast_AsRoad_BP;                      // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB8[0x5];                                     // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0280(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits_1;     // 0x0290(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue_1; // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB9[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item_1;                         // 0x02A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBA[0x2];                                     // 0x0396(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBB[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBC[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARoad_BP_C*                             K2Node_DynamicCast_AsRoad_BP_1;                    // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBD[0x1];                                     // 0x047B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast; // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast_1; // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP) == 0x000008, "Wrong alignment on Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP");
static_assert(sizeof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP) == 0x000488, "Wrong size on Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, EntryPoint) == 0x000000, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000015, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000016, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, K2Node_MakeArray_Array) == 0x000018, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, Temp_int_Loop_Counter_Variable_1) == 0x000044, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, Temp_int_Array_Index_Variable_1) == 0x000048, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, Temp_object_Variable) == 0x000050, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, K2Node_MakeArray_Array_1) == 0x000060, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000070, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, K2Node_SwitchEnum_CmpSuccess_1) == 0x000088, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x000090, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x0000A0, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_bBlockingHit) == 0x000194, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_bInitialOverlap) == 0x000195, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_Time) == 0x000198, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_Distance) == 0x00019C, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_Location) == 0x0001A0, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B8, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_Normal) == 0x0001D0, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_ImpactNormal) == 0x0001E8, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_PhysMat) == 0x000200, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_HitActor) == 0x000208, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_HitComponent) == 0x000210, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_HitBoneName) == 0x000218, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_BoneName) == 0x000220, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_TraceStart) == 0x000238, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_TraceEnd) == 0x000250, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000268, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, K2Node_DynamicCast_AsRoad_BP) == 0x000270, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::K2Node_DynamicCast_AsRoad_BP' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BooleanAND_ReturnValue) == 0x000279, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00027A, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, Temp_object_Variable_1) == 0x000280, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_SphereTraceMultiForObjects_OutHits_1) == 0x000290, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_SphereTraceMultiForObjects_OutHits_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_SphereTraceMultiForObjects_ReturnValue_1) == 0x0002A0, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_SphereTraceMultiForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Array_Get_Item_1) == 0x0002A8, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000390, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000394, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000395, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_Time_1) == 0x000398, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_Distance_1) == 0x00039C, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_Location_1) == 0x0003A0, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0003B8, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_Normal_1) == 0x0003D0, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0003E8, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_PhysMat_1) == 0x000400, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_HitActor_1) == 0x000408, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_HitComponent_1) == 0x000410, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_HitBoneName_1) == 0x000418, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_BoneName_1) == 0x000420, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_HitItem_1) == 0x000428, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_ElementIndex_1) == 0x00042C, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_FaceIndex_1) == 0x000430, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_TraceStart_1) == 0x000438, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BreakHitResult_TraceEnd_1) == 0x000450, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000468, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, K2Node_DynamicCast_AsRoad_BP_1) == 0x000470, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::K2Node_DynamicCast_AsRoad_BP_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, K2Node_DynamicCast_bSuccess_1) == 0x000478, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_BooleanAND_ReturnValue_1) == 0x000479, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00047A, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast) == 0x00047C, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP, CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast_1) == 0x000480, "Member 'Road_Four_Jonction_BP_C_ExecuteUbergraph_Road_Four_Jonction_BP::CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast_1' has a wrong offset!");

// Function Road_Four_Jonction_BP.Road_Four_Jonction_BP_C.PerformLandscapeAdjustation
// 0x00F0 (0x00F0 - 0x0000)
struct Road_Four_Jonction_BP_C_PerformLandscapeAdjustation final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBE[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class ULandscapeLayerInfoObject*>      K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class ULandscapeLayerInfoObject*              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC0[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Calculate_Static_Mesh_Size_Static_Mesh;   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_StartWidth_ImplicitCast; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_EndWidth_ImplicitCast;  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation) == 0x000008, "Wrong alignment on Road_Four_Jonction_BP_C_PerformLandscapeAdjustation");
static_assert(sizeof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation) == 0x0000F0, "Wrong size on Road_Four_Jonction_BP_C_PerformLandscapeAdjustation");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, Temp_int_Variable) == 0x000000, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_GetObjectName_ReturnValue) == 0x000028, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, K2Node_MakeArray_Array) == 0x000038, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Array_Get_Item) == 0x000048, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_GetObjectName_ReturnValue_1) == 0x000050, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size) == 0x0000A8, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size) == 0x0000B0, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size) == 0x0000B8, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Calculate_Static_Mesh_Size_Static_Mesh) == 0x0000C0, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Calculate_Static_Mesh_Size_Static_Mesh' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C8, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Road_Four_Jonction_BP_C_PerformLandscapeAdjustation, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'Road_Four_Jonction_BP_C_PerformLandscapeAdjustation::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
