#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Road_T_Jonction_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Road_T_Jonction_BP.Road_T_Jonction_BP_C.Add Road At End
// 0x0150 (0x0150 - 0x0000)
struct Road_T_Jonction_BP_C_Add_Road_At_End final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_T_Jonction_BP_C_Add_Road_At_End) == 0x000010, "Wrong alignment on Road_T_Jonction_BP_C_Add_Road_At_End");
static_assert(sizeof(Road_T_Jonction_BP_C_Add_Road_At_End) == 0x000150, "Wrong size on Road_T_Jonction_BP_C_Add_Road_At_End");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000060, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000C8, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000D8, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x0000E0, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000140, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Add_Road_At_End, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000148, "Member 'Road_T_Jonction_BP_C_Add_Road_At_End::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");

// Function Road_T_Jonction_BP.Road_T_Jonction_BP_C.Adjust Landscape
// 0x00F0 (0x00F0 - 0x0000)
struct Road_T_Jonction_BP_C_Adjust_Landscape final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B8F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B90[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class ULandscapeLayerInfoObject*>      K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class ULandscapeLayerInfoObject*              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B91[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Calculate_Static_Mesh_Size_Static_Mesh;   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_StartWidth_ImplicitCast; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_EndWidth_ImplicitCast;  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_T_Jonction_BP_C_Adjust_Landscape) == 0x000008, "Wrong alignment on Road_T_Jonction_BP_C_Adjust_Landscape");
static_assert(sizeof(Road_T_Jonction_BP_C_Adjust_Landscape) == 0x0000F0, "Wrong size on Road_T_Jonction_BP_C_Adjust_Landscape");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, Temp_int_Variable) == 0x000000, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_GetObjectName_ReturnValue) == 0x000028, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, K2Node_MakeArray_Array) == 0x000038, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Array_Get_Item) == 0x000048, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_GetObjectName_ReturnValue_1) == 0x000050, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size) == 0x0000A8, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size) == 0x0000B0, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size) == 0x0000B8, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Calculate_Static_Mesh_Size_Static_Mesh) == 0x0000C0, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Calculate_Static_Mesh_Size_Static_Mesh' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C8, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_EditorApplySpline_StartWidth_ImplicitCast) == 0x0000E0, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_EditorApplySpline_StartWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_EditorApplySpline_EndWidth_ImplicitCast) == 0x0000E4, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_EditorApplySpline_EndWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast) == 0x0000E8, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Adjust_Landscape, CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast) == 0x0000EC, "Member 'Road_T_Jonction_BP_C_Adjust_Landscape::CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast' has a wrong offset!");

// Function Road_T_Jonction_BP.Road_T_Jonction_BP_C.Connect Road To 
// 0x00D0 (0x00D0 - 0x0000)
struct Road_T_Jonction_BP_C_Connect_Road_To_ final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Con_Rotation;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B92[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B93[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B94[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_T_Jonction_BP_C_Connect_Road_To_) == 0x000008, "Wrong alignment on Road_T_Jonction_BP_C_Connect_Road_To_");
static_assert(sizeof(Road_T_Jonction_BP_C_Connect_Road_To_) == 0x0000D0, "Wrong size on Road_T_Jonction_BP_C_Connect_Road_To_");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, Location) == 0x000000, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::Location' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, Con_Rotation) == 0x000018, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::Con_Rotation' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_GetForwardVector_ReturnValue) == 0x000030, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00004C, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_GetDistanceTo_ReturnValue) == 0x000050, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000060, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_SelectFloat_ReturnValue) == 0x000070, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000078, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000090, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_SelectVector_ReturnValue) == 0x0000A8, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000C0, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Connect_Road_To_, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000C8, "Member 'Road_T_Jonction_BP_C_Connect_Road_To_::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Road_T_Jonction_BP.Road_T_Jonction_BP_C.ExecuteUbergraph_Road_T_Jonction_BP
// 0x0004 (0x0004 - 0x0000)
struct Road_T_Jonction_BP_C_ExecuteUbergraph_Road_T_Jonction_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_T_Jonction_BP_C_ExecuteUbergraph_Road_T_Jonction_BP) == 0x000004, "Wrong alignment on Road_T_Jonction_BP_C_ExecuteUbergraph_Road_T_Jonction_BP");
static_assert(sizeof(Road_T_Jonction_BP_C_ExecuteUbergraph_Road_T_Jonction_BP) == 0x000004, "Wrong size on Road_T_Jonction_BP_C_ExecuteUbergraph_Road_T_Jonction_BP");
static_assert(offsetof(Road_T_Jonction_BP_C_ExecuteUbergraph_Road_T_Jonction_BP, EntryPoint) == 0x000000, "Member 'Road_T_Jonction_BP_C_ExecuteUbergraph_Road_T_Jonction_BP::EntryPoint' has a wrong offset!");

// Function Road_T_Jonction_BP.Road_T_Jonction_BP_C.Set Road Location
// 0x0190 (0x0190 - 0x0000)
struct Road_T_Jonction_BP_C_Set_Road_Location final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_HitActor;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B95[0x8];                                     // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_T_Jonction_BP_C_Set_Road_Location) == 0x000010, "Wrong alignment on Road_T_Jonction_BP_C_Set_Road_Location");
static_assert(sizeof(Road_T_Jonction_BP_C_Set_Road_Location) == 0x000190, "Wrong size on Road_T_Jonction_BP_C_Set_Road_Location");
static_assert(offsetof(Road_T_Jonction_BP_C_Set_Road_Location, Location) == 0x000000, "Member 'Road_T_Jonction_BP_C_Set_Road_Location::Location' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Set_Road_Location, Param_HitActor) == 0x000018, "Member 'Road_T_Jonction_BP_C_Set_Road_Location::Param_HitActor' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Set_Road_Location, Rotation) == 0x000020, "Member 'Road_T_Jonction_BP_C_Set_Road_Location::Rotation' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Set_Road_Location, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'Road_T_Jonction_BP_C_Set_Road_Location::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Set_Road_Location, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000A0, "Member 'Road_T_Jonction_BP_C_Set_Road_Location::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Set_Road_Location, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000188, "Member 'Road_T_Jonction_BP_C_Set_Road_Location::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function Road_T_Jonction_BP.Road_T_Jonction_BP_C.Spawn Road At this Con
// 0x0180 (0x0180 - 0x0000)
struct Road_T_Jonction_BP_C_Spawn_Road_At_this_Con final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con) == 0x000010, "Wrong alignment on Road_T_Jonction_BP_C_Spawn_Road_At_this_Con");
static_assert(sizeof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con) == 0x000180, "Wrong size on Road_T_Jonction_BP_C_Spawn_Road_At_this_Con");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_MakeTransform_ReturnValue_1) == 0x000060, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000C8, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000D8, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_MakeTransform_ReturnValue_2) == 0x0000E0, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000140, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000150, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_Concat_StrStr_ReturnValue) == 0x000158, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000168, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_Spawn_Road_At_this_Con, K2Node_SwitchEnum_CmpSuccess) == 0x000170, "Member 'Road_T_Jonction_BP_C_Spawn_Road_At_this_Con::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Road_T_Jonction_BP.Road_T_Jonction_BP_C.UserConstructionScript
// 0x0AC0 (0x0AC0 - 0x0000)
struct Road_T_Jonction_BP_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B96[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B97[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B98[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Calculate_Static_Mesh_Size_Static_Mesh;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0188(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B99[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size_1; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size_1; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size_1; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Calculate_Static_Mesh_Size_Static_Mesh_1; // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x02E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x03C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_4;  // 0x04D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_5;              // 0x05BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9A[0x5];                                     // 0x05BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x05C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x05D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x05F0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0600(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0610(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9B[0x7];                                     // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0640(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9C[0x3];                                     // 0x0651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9D[0x6];                                     // 0x065A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_2;    // 0x0660(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9E[0x3];                                     // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0680(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0768(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9F[0x2];                                     // 0x0782(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA0[0x4];                                     // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0790(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x07A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x07C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x07D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x07F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0800(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA1[0x4];                                     // 0x0824(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0828(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             K2Node_DynamicCast_AsRoad_BP;                      // 0x0858(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0861(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA2[0x6];                                     // 0x0862(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0868(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0880(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0898(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x08B0(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits_1;     // 0x08C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue_1; // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA3[0x3];                                     // 0x08D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item_1;                         // 0x08D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x09C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x09C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x09C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA4[0x1];                                     // 0x09C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x09C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x09C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA5[0x4];                                     // 0x09CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x09D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x09E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0A00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0A18(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0A30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0A38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0A40(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0A58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0A5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA6[0x4];                                     // 0x0A64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0A68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0A80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0A98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA7[0x7];                                     // 0x0A99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARoad_BP_C*                             K2Node_DynamicCast_AsRoad_BP_1;                    // 0x0AA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0AA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0AA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA8[0x2];                                     // 0x0AAA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast; // 0x0AAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_1; // 0x0AB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast; // 0x0AB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast_1; // 0x0AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Road_T_Jonction_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Road_T_Jonction_BP_C_UserConstructionScript");
static_assert(sizeof(Road_T_Jonction_BP_C_UserConstructionScript) == 0x000AC0, "Wrong size on Road_T_Jonction_BP_C_UserConstructionScript");
static_assert(offsetof(Road_T_Jonction_BP_C_UserConstructionScript, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'Road_T_Jonction_BP_C_UserConstructionScript::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Road_T_Jonction_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'Road_T_Jonction_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
