#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoomProperties

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct RoomProperties.RoomProperties
// 0x0014 (0x0014 - 0x0000)
struct FRoomProperties final
{
public:
	int32                                         MinSizeX_2_1FD089404E08BDEFC9B0AE9DBE4FF7A8;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinSizeY_5_66AA04854ED76C190A079B9E340EF4C5;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSizeX_8_7D2625A7496A752FAFF6ADA4F524052D;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSizeY_14_E33AA16F4E72878131861F86FAEC7429;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoomFrequency_13_8774FDBB41334A69E49DD8A411F6B4F4; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FRoomProperties) == 0x000004, "Wrong alignment on FRoomProperties");
static_assert(sizeof(FRoomProperties) == 0x000014, "Wrong size on FRoomProperties");
static_assert(offsetof(FRoomProperties, MinSizeX_2_1FD089404E08BDEFC9B0AE9DBE4FF7A8) == 0x000000, "Member 'FRoomProperties::MinSizeX_2_1FD089404E08BDEFC9B0AE9DBE4FF7A8' has a wrong offset!");
static_assert(offsetof(FRoomProperties, MinSizeY_5_66AA04854ED76C190A079B9E340EF4C5) == 0x000004, "Member 'FRoomProperties::MinSizeY_5_66AA04854ED76C190A079B9E340EF4C5' has a wrong offset!");
static_assert(offsetof(FRoomProperties, MaxSizeX_8_7D2625A7496A752FAFF6ADA4F524052D) == 0x000008, "Member 'FRoomProperties::MaxSizeX_8_7D2625A7496A752FAFF6ADA4F524052D' has a wrong offset!");
static_assert(offsetof(FRoomProperties, MaxSizeY_14_E33AA16F4E72878131861F86FAEC7429) == 0x00000C, "Member 'FRoomProperties::MaxSizeY_14_E33AA16F4E72878131861F86FAEC7429' has a wrong offset!");
static_assert(offsetof(FRoomProperties, RoomFrequency_13_8774FDBB41334A69E49DD8A411F6B4F4) == 0x000010, "Member 'FRoomProperties::RoomFrequency_13_8774FDBB41334A69E49DD8A411F6B4F4' has a wrong offset!");

}

