#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rose_beds_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function rose_beds_BP.rose_beds_BP_C.UserConstructionScript
// 0x0188 (0x0188 - 0x0000)
struct Rose_beds_BP_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RandomRotatorFromStream_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_X;                       // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Y;                       // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Z;                       // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B7[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B8[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Rose_beds_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Rose_beds_BP_C_UserConstructionScript");
static_assert(sizeof(Rose_beds_BP_C_UserConstructionScript) == 0x000188, "Wrong size on Rose_beds_BP_C_UserConstructionScript");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x000000, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_RandomRotatorFromStream_ReturnValue) == 0x000008, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_RandomRotatorFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000020, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_X) == 0x000028, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_X' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_Y) == 0x000040, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_Y' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_BreakRotIntoAxes_Z) == 0x000058, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_BreakRotIntoAxes_Z' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000070, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000088, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000089, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000098, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Rose_beds_BP_C_UserConstructionScript, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x0000A0, "Member 'Rose_beds_BP_C_UserConstructionScript::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");

}

