#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RotativePlateforme_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RotativePlateforme_BP.RotativePlateforme_BP_C.ExecuteUbergraph_RotativePlateforme_BP
// 0x0180 (0x0180 - 0x0000)
struct RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5E[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0080(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP) == 0x000008, "Wrong alignment on RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP");
static_assert(sizeof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP) == 0x000180, "Wrong size on RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, EntryPoint) == 0x000000, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, Temp_bool_Variable) == 0x000004, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000028, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed) == 0x000040, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_UpdateSpeedByPlayersNumber_ReturnSpeed' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000058, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, K2Node_Select_Default) == 0x000060, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_MakeRotator_ReturnValue) == 0x000068, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000080, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000168, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000170, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000178, "Member 'RotativePlateforme_BP_C_ExecuteUbergraph_RotativePlateforme_BP::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function RotativePlateforme_BP.RotativePlateforme_BP_C.OnRep_NewVar_0
// 0x00F0 (0x00F0 - 0x0000)
struct RotativePlateforme_BP_C_OnRep_NewVar_0 final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B60[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(RotativePlateforme_BP_C_OnRep_NewVar_0) == 0x000008, "Wrong alignment on RotativePlateforme_BP_C_OnRep_NewVar_0");
static_assert(sizeof(RotativePlateforme_BP_C_OnRep_NewVar_0) == 0x0000F0, "Wrong size on RotativePlateforme_BP_C_OnRep_NewVar_0");
static_assert(offsetof(RotativePlateforme_BP_C_OnRep_NewVar_0, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'RotativePlateforme_BP_C_OnRep_NewVar_0::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_OnRep_NewVar_0, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000008, "Member 'RotativePlateforme_BP_C_OnRep_NewVar_0::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function RotativePlateforme_BP.RotativePlateforme_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RotativePlateforme_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RotativePlateforme_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on RotativePlateforme_BP_C_ReceiveTick");
static_assert(sizeof(RotativePlateforme_BP_C_ReceiveTick) == 0x000004, "Wrong size on RotativePlateforme_BP_C_ReceiveTick");
static_assert(offsetof(RotativePlateforme_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RotativePlateforme_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function RotativePlateforme_BP.RotativePlateforme_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct RotativePlateforme_BP_C_UserConstructionScript final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RotativePlateforme_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on RotativePlateforme_BP_C_UserConstructionScript");
static_assert(sizeof(RotativePlateforme_BP_C_UserConstructionScript) == 0x000010, "Wrong size on RotativePlateforme_BP_C_UserConstructionScript");
static_assert(offsetof(RotativePlateforme_BP_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'RotativePlateforme_BP_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(RotativePlateforme_BP_C_UserConstructionScript, CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast) == 0x000008, "Member 'RotativePlateforme_BP_C_UserConstructionScript::CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast' has a wrong offset!");

}

