#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RotateCage_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RotateCage_BP.RotateCage_BP_C
// 0x0050 (0x02E8 - 0x0298)
class ARotateCage_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder1;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Invers_;                                           // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2480[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RepRotation;                                       // 0x02D0(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void CustomEvent_0();
	void ExecuteUbergraph_RotateCage_BP(int32 EntryPoint);
	void OnRep_RepRotation();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RotateCage_BP_C">();
	}
	static class ARotateCage_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARotateCage_BP_C>();
	}
};
static_assert(alignof(ARotateCage_BP_C) == 0x000008, "Wrong alignment on ARotateCage_BP_C");
static_assert(sizeof(ARotateCage_BP_C) == 0x0002E8, "Wrong size on ARotateCage_BP_C");
static_assert(offsetof(ARotateCage_BP_C, UberGraphFrame) == 0x000298, "Member 'ARotateCage_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARotateCage_BP_C, C_TickOptimizer) == 0x0002A0, "Member 'ARotateCage_BP_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ARotateCage_BP_C, Cylinder1) == 0x0002A8, "Member 'ARotateCage_BP_C::Cylinder1' has a wrong offset!");
static_assert(offsetof(ARotateCage_BP_C, Cylinder) == 0x0002B0, "Member 'ARotateCage_BP_C::Cylinder' has a wrong offset!");
static_assert(offsetof(ARotateCage_BP_C, StaticMesh) == 0x0002B8, "Member 'ARotateCage_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ARotateCage_BP_C, DefaultSceneRoot) == 0x0002C0, "Member 'ARotateCage_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARotateCage_BP_C, Invers_) == 0x0002C8, "Member 'ARotateCage_BP_C::Invers_' has a wrong offset!");
static_assert(offsetof(ARotateCage_BP_C, RepRotation) == 0x0002D0, "Member 'ARotateCage_BP_C::RepRotation' has a wrong offset!");

}

