#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Runs_S

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Runs_S.Runs_S
// 0x0050 (0x0050 - 0x0000)
struct FRuns_S final
{
public:
	TArray<class FString>                         PlayerID_34_735A6B844971687868525287A011FF83;      // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlayerName_35_A1944099455D9445D7D522B6F3BA60D3;    // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FString                                 CategorieID_30_2B394D744772043E875016B561C42AD3;   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         PlayerNumber_10_EDDF339042537178A9273D98DB3A5864;  // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Time_21_993A7DC7423CFD72EB53B09F568BE870;          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Date_24_4C961F9742D6EA0325739CAE7752E860;          // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Place_33_5946A60B48AE8E2F9BDFD7876618865E;         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FRuns_S) == 0x000008, "Wrong alignment on FRuns_S");
static_assert(sizeof(FRuns_S) == 0x000050, "Wrong size on FRuns_S");
static_assert(offsetof(FRuns_S, PlayerID_34_735A6B844971687868525287A011FF83) == 0x000000, "Member 'FRuns_S::PlayerID_34_735A6B844971687868525287A011FF83' has a wrong offset!");
static_assert(offsetof(FRuns_S, PlayerName_35_A1944099455D9445D7D522B6F3BA60D3) == 0x000010, "Member 'FRuns_S::PlayerName_35_A1944099455D9445D7D522B6F3BA60D3' has a wrong offset!");
static_assert(offsetof(FRuns_S, CategorieID_30_2B394D744772043E875016B561C42AD3) == 0x000020, "Member 'FRuns_S::CategorieID_30_2B394D744772043E875016B561C42AD3' has a wrong offset!");
static_assert(offsetof(FRuns_S, PlayerNumber_10_EDDF339042537178A9273D98DB3A5864) == 0x000030, "Member 'FRuns_S::PlayerNumber_10_EDDF339042537178A9273D98DB3A5864' has a wrong offset!");
static_assert(offsetof(FRuns_S, Time_21_993A7DC7423CFD72EB53B09F568BE870) == 0x000034, "Member 'FRuns_S::Time_21_993A7DC7423CFD72EB53B09F568BE870' has a wrong offset!");
static_assert(offsetof(FRuns_S, Date_24_4C961F9742D6EA0325739CAE7752E860) == 0x000038, "Member 'FRuns_S::Date_24_4C961F9742D6EA0325739CAE7752E860' has a wrong offset!");
static_assert(offsetof(FRuns_S, Place_33_5946A60B48AE8E2F9BDFD7876618865E) == 0x000048, "Member 'FRuns_S::Place_33_5946A60B48AE8E2F9BDFD7876618865E' has a wrong offset!");

}

