#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_BiomeSave

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_BiomeSave.S_BiomeSave
// 0x0038 (0x0038 - 0x0000)
struct FS_BiomeSave final
{
public:
	class FString                                 BiomeName_2_935F8B42433F85E574BB8D9572F85CBE;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              Date_5_8229F5384EBBA53FC84EEC87A381E211;           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Timer_10_37405F2F41F5C3F51482B688340E0A09;         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Height_13_1679867A40028181BC84B2910CE0AC14;        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerLocation_16_FF411C5F4C46B7A3731AD9864C6888C3; // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_BiomeSave) == 0x000008, "Wrong alignment on FS_BiomeSave");
static_assert(sizeof(FS_BiomeSave) == 0x000038, "Wrong size on FS_BiomeSave");
static_assert(offsetof(FS_BiomeSave, BiomeName_2_935F8B42433F85E574BB8D9572F85CBE) == 0x000000, "Member 'FS_BiomeSave::BiomeName_2_935F8B42433F85E574BB8D9572F85CBE' has a wrong offset!");
static_assert(offsetof(FS_BiomeSave, Date_5_8229F5384EBBA53FC84EEC87A381E211) == 0x000010, "Member 'FS_BiomeSave::Date_5_8229F5384EBBA53FC84EEC87A381E211' has a wrong offset!");
static_assert(offsetof(FS_BiomeSave, Timer_10_37405F2F41F5C3F51482B688340E0A09) == 0x000018, "Member 'FS_BiomeSave::Timer_10_37405F2F41F5C3F51482B688340E0A09' has a wrong offset!");
static_assert(offsetof(FS_BiomeSave, Height_13_1679867A40028181BC84B2910CE0AC14) == 0x00001C, "Member 'FS_BiomeSave::Height_13_1679867A40028181BC84B2910CE0AC14' has a wrong offset!");
static_assert(offsetof(FS_BiomeSave, PlayerLocation_16_FF411C5F4C46B7A3731AD9864C6888C3) == 0x000020, "Member 'FS_BiomeSave::PlayerLocation_16_FF411C5F4C46B7A3731AD9864C6888C3' has a wrong offset!");

}

