#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LocationAtTime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LocationAtTime.S_LocationAtTime
// 0x0028 (0x0028 - 0x0000)
struct FS_LocationAtTime final
{
public:
	struct FDateTime                              Timestamp_2_4CB3F9744DA76D06D00919B4503CC972;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_5_43D0CD204E42DDE8C6A9CF8F79580D80;       // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Grounded_7_0D187DA549C4E3A9904D52923A1A7E75;       // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LocationAtTime) == 0x000008, "Wrong alignment on FS_LocationAtTime");
static_assert(sizeof(FS_LocationAtTime) == 0x000028, "Wrong size on FS_LocationAtTime");
static_assert(offsetof(FS_LocationAtTime, Timestamp_2_4CB3F9744DA76D06D00919B4503CC972) == 0x000000, "Member 'FS_LocationAtTime::Timestamp_2_4CB3F9744DA76D06D00919B4503CC972' has a wrong offset!");
static_assert(offsetof(FS_LocationAtTime, Location_5_43D0CD204E42DDE8C6A9CF8F79580D80) == 0x000008, "Member 'FS_LocationAtTime::Location_5_43D0CD204E42DDE8C6A9CF8F79580D80' has a wrong offset!");
static_assert(offsetof(FS_LocationAtTime, Grounded_7_0D187DA549C4E3A9904D52923A1A7E75) == 0x000020, "Member 'FS_LocationAtTime::Grounded_7_0D187DA549C4E3A9904D52923A1A7E75' has a wrong offset!");

}

