#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PhysxChainLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PhysxChainLocation.S_PhysxChainLocation
// 0x0038 (0x0038 - 0x0000)
struct FS_PhysxChainLocation final
{
public:
	class FString                                 Attached01_2_BFAFA06F48BCF30D38E362AB1E51A681;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Attached02_4_141B7E9847E9ABF4F25B2DA3F9348708;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                MiddleLocation_7_B35FC9584126655A2C0959B73331DD19; // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PhysxChainLocation) == 0x000008, "Wrong alignment on FS_PhysxChainLocation");
static_assert(sizeof(FS_PhysxChainLocation) == 0x000038, "Wrong size on FS_PhysxChainLocation");
static_assert(offsetof(FS_PhysxChainLocation, Attached01_2_BFAFA06F48BCF30D38E362AB1E51A681) == 0x000000, "Member 'FS_PhysxChainLocation::Attached01_2_BFAFA06F48BCF30D38E362AB1E51A681' has a wrong offset!");
static_assert(offsetof(FS_PhysxChainLocation, Attached02_4_141B7E9847E9ABF4F25B2DA3F9348708) == 0x000010, "Member 'FS_PhysxChainLocation::Attached02_4_141B7E9847E9ABF4F25B2DA3F9348708' has a wrong offset!");
static_assert(offsetof(FS_PhysxChainLocation, MiddleLocation_7_B35FC9584126655A2C0959B73331DD19) == 0x000020, "Member 'FS_PhysxChainLocation::MiddleLocation_7_B35FC9584126655A2C0959B73331DD19' has a wrong offset!");

}

