#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SliderParams

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_SliderParams.S_SliderParams
// 0x0010 (0x0010 - 0x0000)
struct FS_SliderParams final
{
public:
	float                                         MinValue_9_E001752C4671B129C6C17BBA9E55A5FD;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue_11_5AD5987C4ED7C3A6571B8D85B70C8EFE;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StepSize_13_688395134FFD828D2E4FD6B91A0A5D34;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultValue_15_32E9D7E9400B790F84378BAD6CE868FC;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_SliderParams) == 0x000004, "Wrong alignment on FS_SliderParams");
static_assert(sizeof(FS_SliderParams) == 0x000010, "Wrong size on FS_SliderParams");
static_assert(offsetof(FS_SliderParams, MinValue_9_E001752C4671B129C6C17BBA9E55A5FD) == 0x000000, "Member 'FS_SliderParams::MinValue_9_E001752C4671B129C6C17BBA9E55A5FD' has a wrong offset!");
static_assert(offsetof(FS_SliderParams, MaxValue_11_5AD5987C4ED7C3A6571B8D85B70C8EFE) == 0x000004, "Member 'FS_SliderParams::MaxValue_11_5AD5987C4ED7C3A6571B8D85B70C8EFE' has a wrong offset!");
static_assert(offsetof(FS_SliderParams, StepSize_13_688395134FFD828D2E4FD6B91A0A5D34) == 0x000008, "Member 'FS_SliderParams::StepSize_13_688395134FFD828D2E4FD6B91A0A5D34' has a wrong offset!");
static_assert(offsetof(FS_SliderParams, DefaultValue_15_32E9D7E9400B790F84378BAD6CE868FC) == 0x00000C, "Member 'FS_SliderParams::DefaultValue_15_32E9D7E9400B790F84378BAD6CE868FC' has a wrong offset!");

}

