#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_TchatElement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_TchatElement.S_TchatElement
// 0x0030 (0x0030 - 0x0000)
struct FS_TchatElement final
{
public:
	class FString                                 Playername_2_61BD72644F6167A7C06BDEB30F4246AA;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message_4_8C914A0F473A572E93CAF580FB02CB0D;        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_7_A239731C4EEB96F288E5D694060AB0D0;          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_TchatElement) == 0x000008, "Wrong alignment on FS_TchatElement");
static_assert(sizeof(FS_TchatElement) == 0x000030, "Wrong size on FS_TchatElement");
static_assert(offsetof(FS_TchatElement, Playername_2_61BD72644F6167A7C06BDEB30F4246AA) == 0x000000, "Member 'FS_TchatElement::Playername_2_61BD72644F6167A7C06BDEB30F4246AA' has a wrong offset!");
static_assert(offsetof(FS_TchatElement, Message_4_8C914A0F473A572E93CAF580FB02CB0D) == 0x000010, "Member 'FS_TchatElement::Message_4_8C914A0F473A572E93CAF580FB02CB0D' has a wrong offset!");
static_assert(offsetof(FS_TchatElement, Color_7_A239731C4EEB96F288E5D694060AB0D0) == 0x000020, "Member 'FS_TchatElement::Color_7_A239731C4EEB96F288E5D694060AB0D0' has a wrong offset!");

}

