#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveSlot_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_BiomeSave_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveSlot_W.SaveSlot_W_C
// 0x0070 (0x0330 - 0x02C0)
class USaveSlot_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Altitude_Txt;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BiomeName_txt;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_68;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Load;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SaveName_txt;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Time_txt;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_BiomeSave                           SaveStruct;                                        // 0x02F8(0x0038)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__SaveSlot_W_Button_59_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SaveSlot_W_Button_Load_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SaveSlot_W_Button_Load_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_SaveSlot_W(int32 EntryPoint);
	void GetBiomeByName(const class FString& InString, bool* Found, class ABiomeText_BP_C** Biome);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveSlot_W_C">();
	}
	static class USaveSlot_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveSlot_W_C>();
	}
};
static_assert(alignof(USaveSlot_W_C) == 0x000008, "Wrong alignment on USaveSlot_W_C");
static_assert(sizeof(USaveSlot_W_C) == 0x000330, "Wrong size on USaveSlot_W_C");
static_assert(offsetof(USaveSlot_W_C, UberGraphFrame) == 0x0002C0, "Member 'USaveSlot_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USaveSlot_W_C, Altitude_Txt) == 0x0002C8, "Member 'USaveSlot_W_C::Altitude_Txt' has a wrong offset!");
static_assert(offsetof(USaveSlot_W_C, BiomeName_txt) == 0x0002D0, "Member 'USaveSlot_W_C::BiomeName_txt' has a wrong offset!");
static_assert(offsetof(USaveSlot_W_C, Border_68) == 0x0002D8, "Member 'USaveSlot_W_C::Border_68' has a wrong offset!");
static_assert(offsetof(USaveSlot_W_C, Button_Load) == 0x0002E0, "Member 'USaveSlot_W_C::Button_Load' has a wrong offset!");
static_assert(offsetof(USaveSlot_W_C, SaveName_txt) == 0x0002E8, "Member 'USaveSlot_W_C::SaveName_txt' has a wrong offset!");
static_assert(offsetof(USaveSlot_W_C, Time_txt) == 0x0002F0, "Member 'USaveSlot_W_C::Time_txt' has a wrong offset!");
static_assert(offsetof(USaveSlot_W_C, SaveStruct) == 0x0002F8, "Member 'USaveSlot_W_C::SaveStruct' has a wrong offset!");

}

