#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_Progress

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "S_ProgressSave_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_Progress.SG_Progress_C
// 0x0060 (0x0088 - 0x0028)
class USG_Progress_C final : public USaveGame
{
public:
	struct FVector                                Location;                                          // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Time;                                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D2[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ProgressSave>                ProgressesNormal;                                  // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_ProgressSave>                ProgressesNormalBackup;                            // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_ProgressSave>                ProgressesBeginner;                                // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_ProgressSave>                ProgressesBeginnerBackup;                          // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SG_Progress_C">();
	}
	static class USG_Progress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_Progress_C>();
	}
};
static_assert(alignof(USG_Progress_C) == 0x000008, "Wrong alignment on USG_Progress_C");
static_assert(sizeof(USG_Progress_C) == 0x000088, "Wrong size on USG_Progress_C");
static_assert(offsetof(USG_Progress_C, Location) == 0x000028, "Member 'USG_Progress_C::Location' has a wrong offset!");
static_assert(offsetof(USG_Progress_C, Time) == 0x000040, "Member 'USG_Progress_C::Time' has a wrong offset!");
static_assert(offsetof(USG_Progress_C, ProgressesNormal) == 0x000048, "Member 'USG_Progress_C::ProgressesNormal' has a wrong offset!");
static_assert(offsetof(USG_Progress_C, ProgressesNormalBackup) == 0x000058, "Member 'USG_Progress_C::ProgressesNormalBackup' has a wrong offset!");
static_assert(offsetof(USG_Progress_C, ProgressesBeginner) == 0x000068, "Member 'USG_Progress_C::ProgressesBeginner' has a wrong offset!");
static_assert(offsetof(USG_Progress_C, ProgressesBeginnerBackup) == 0x000078, "Member 'USG_Progress_C::ProgressesBeginnerBackup' has a wrong offset!");

}

