#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_Progress

#include "Basic.hpp"

#include "S_BiomeSave_structs.hpp"


namespace SDK::Params
{

// Function SG_Progress.SG_Progress_C.AddNewSave
// 0x0038 (0x0038 - 0x0000)
struct SG_Progress_C_AddNewSave final
{
public:
	struct FS_BiomeSave                           NewItem;                                           // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(SG_Progress_C_AddNewSave) == 0x000008, "Wrong alignment on SG_Progress_C_AddNewSave");
static_assert(sizeof(SG_Progress_C_AddNewSave) == 0x000038, "Wrong size on SG_Progress_C_AddNewSave");
static_assert(offsetof(SG_Progress_C_AddNewSave, NewItem) == 0x000000, "Member 'SG_Progress_C_AddNewSave::NewItem' has a wrong offset!");

// Function SG_Progress.SG_Progress_C.ExecuteUbergraph_SG_Progress
// 0x0048 (0x0048 - 0x0000)
struct SG_Progress_C_ExecuteUbergraph_SG_Progress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BiomeSave                           K2Node_CustomEvent_NewItem;                        // 0x0008(0x0038)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1160[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SG_Progress_C_ExecuteUbergraph_SG_Progress) == 0x000008, "Wrong alignment on SG_Progress_C_ExecuteUbergraph_SG_Progress");
static_assert(sizeof(SG_Progress_C_ExecuteUbergraph_SG_Progress) == 0x000048, "Wrong size on SG_Progress_C_ExecuteUbergraph_SG_Progress");
static_assert(offsetof(SG_Progress_C_ExecuteUbergraph_SG_Progress, EntryPoint) == 0x000000, "Member 'SG_Progress_C_ExecuteUbergraph_SG_Progress::EntryPoint' has a wrong offset!");
static_assert(offsetof(SG_Progress_C_ExecuteUbergraph_SG_Progress, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'SG_Progress_C_ExecuteUbergraph_SG_Progress::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SG_Progress_C_ExecuteUbergraph_SG_Progress, K2Node_CustomEvent_NewItem) == 0x000008, "Member 'SG_Progress_C_ExecuteUbergraph_SG_Progress::K2Node_CustomEvent_NewItem' has a wrong offset!");
static_assert(offsetof(SG_Progress_C_ExecuteUbergraph_SG_Progress, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'SG_Progress_C_ExecuteUbergraph_SG_Progress::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SG_Progress_C_ExecuteUbergraph_SG_Progress, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'SG_Progress_C_ExecuteUbergraph_SG_Progress::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

