#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Small_wall_bowl_01_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass small_wall_bowl_01_BP.small_wall_bowl_01_BP_C
// 0x0038 (0x02D0 - 0x0298)
class ASmall_wall_bowl_01_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Geranium_small2;                                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geranium_small;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geranium_small1;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Creeping_jenny_03;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Creeping_jenny_01;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bowl8_StaticMeshComponent0;                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"small_wall_bowl_01_BP_C">();
	}
	static class ASmall_wall_bowl_01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASmall_wall_bowl_01_BP_C>();
	}
};
static_assert(alignof(ASmall_wall_bowl_01_BP_C) == 0x000008, "Wrong alignment on ASmall_wall_bowl_01_BP_C");
static_assert(sizeof(ASmall_wall_bowl_01_BP_C) == 0x0002D0, "Wrong size on ASmall_wall_bowl_01_BP_C");
static_assert(offsetof(ASmall_wall_bowl_01_BP_C, Geranium_small2) == 0x000298, "Member 'ASmall_wall_bowl_01_BP_C::Geranium_small2' has a wrong offset!");
static_assert(offsetof(ASmall_wall_bowl_01_BP_C, Geranium_small) == 0x0002A0, "Member 'ASmall_wall_bowl_01_BP_C::Geranium_small' has a wrong offset!");
static_assert(offsetof(ASmall_wall_bowl_01_BP_C, Geranium_small1) == 0x0002A8, "Member 'ASmall_wall_bowl_01_BP_C::Geranium_small1' has a wrong offset!");
static_assert(offsetof(ASmall_wall_bowl_01_BP_C, Creeping_jenny_03) == 0x0002B0, "Member 'ASmall_wall_bowl_01_BP_C::Creeping_jenny_03' has a wrong offset!");
static_assert(offsetof(ASmall_wall_bowl_01_BP_C, Creeping_jenny_01) == 0x0002B8, "Member 'ASmall_wall_bowl_01_BP_C::Creeping_jenny_01' has a wrong offset!");
static_assert(offsetof(ASmall_wall_bowl_01_BP_C, bowl8_StaticMeshComponent0) == 0x0002C0, "Member 'ASmall_wall_bowl_01_BP_C::bowl8_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ASmall_wall_bowl_01_BP_C, SharedRoot) == 0x0002C8, "Member 'ASmall_wall_bowl_01_BP_C::SharedRoot' has a wrong offset!");

}

