#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloPlay_W

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "S_BiomeSave_structs.hpp"


namespace SDK::Params
{

// Function SoloPlay_W.SoloPlay_W_C.BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function SoloPlay_W.SoloPlay_W_C.ExecuteUbergraph_SoloPlay_W
// 0x0180 (0x0180 - 0x0000)
struct SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30AC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameMapsSettings*                      CallFunc_GetGameMapsSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_NewSelection;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30AD[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30AE[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI_1;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30AF[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BiomeSave                           K2Node_MakeStruct_S_BiomeSave;                     // 0x0058(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_BiomeSave                           K2Node_Event_Save;                                 // 0x00A0(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B0[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BiomeSave                           K2Node_MakeStruct_S_BiomeSave_1;                   // 0x00E8(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	class ULoadSaveSwitcher_W_C*                  CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_BiomeSave                           K2Node_MakeStruct_S_BiomeSave_2;                   // 0x0128(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI_2;                  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B1[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMenu_W_C*                          CallFunc_Create_ReturnValue_1;                     // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W) == 0x000008, "Wrong alignment on SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W");
static_assert(sizeof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W) == 0x000180, "Wrong size on SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, EntryPoint) == 0x000000, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetGameMapsSettings_ReturnValue) == 0x000008, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetGameMapsSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_ComponentBoundEvent_NewSelection) == 0x000018, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_ComponentBoundEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_ComponentBoundEvent_SelectType) == 0x000028, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_ComponentBoundEvent_SelectType' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_AsCustom_GI) == 0x000030, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_SwitchString_CmpSuccess) == 0x000039, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetGameInstance_ReturnValue_1) == 0x000040, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_AsCustom_GI_1) == 0x000048, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_AsCustom_GI_1' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_MakeStruct_S_BiomeSave) == 0x000058, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_MakeStruct_S_BiomeSave' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetPlayerController_ReturnValue) == 0x000090, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_SpawnSound2D_ReturnValue) == 0x000098, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_Event_Save) == 0x0000A0, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_Event_Save' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_PlayAnimation_ReturnValue) == 0x0000D8, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000E0, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_MakeStruct_S_BiomeSave_1) == 0x0000E8, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_MakeStruct_S_BiomeSave_1' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_Create_ReturnValue) == 0x000120, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_MakeStruct_S_BiomeSave_2) == 0x000128, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_MakeStruct_S_BiomeSave_2' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetGameInstance_ReturnValue_2) == 0x000160, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_AsCustom_GI_2) == 0x000168, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_AsCustom_GI_2' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_Create_ReturnValue_1) == 0x000178, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function SoloPlay_W.SoloPlay_W_C.RefreshSave
// 0x0038 (0x0038 - 0x0000)
struct SoloPlay_W_C_RefreshSave final
{
public:
	struct FS_BiomeSave                           Save;                                              // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloPlay_W_C_RefreshSave) == 0x000008, "Wrong alignment on SoloPlay_W_C_RefreshSave");
static_assert(sizeof(SoloPlay_W_C_RefreshSave) == 0x000038, "Wrong size on SoloPlay_W_C_RefreshSave");
static_assert(offsetof(SoloPlay_W_C_RefreshSave, Save) == 0x000000, "Member 'SoloPlay_W_C_RefreshSave::Save' has a wrong offset!");

}

