#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloPlay_W

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SoloPlay_W.SoloPlay_W_C.BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'SoloPlay_W_C_BndEvt__SoloPlay_W_W_ComboBox_2_K2Node_ComponentBoundEvent_11_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function SoloPlay_W.SoloPlay_W_C.ExecuteUbergraph_SoloPlay_W
// 0x0078 (0x0078 - 0x0000)
struct SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C39[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameMapsSettings*                      CallFunc_GetGameMapsSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_NewSelection;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C3A[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C3B[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI_1;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C3C[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMenu_W_C*                          CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W) == 0x000008, "Wrong alignment on SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W");
static_assert(sizeof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W) == 0x000078, "Wrong size on SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, EntryPoint) == 0x000000, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetGameMapsSettings_ReturnValue) == 0x000010, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetGameMapsSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_ComponentBoundEvent_NewSelection) == 0x000020, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_ComponentBoundEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_ComponentBoundEvent_SelectType) == 0x000030, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_ComponentBoundEvent_SelectType' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_AsCustom_GI) == 0x000038, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_SwitchString_CmpSuccess) == 0x000041, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetGameInstance_ReturnValue_1) == 0x000048, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_AsCustom_GI_1) == 0x000050, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_AsCustom_GI_1' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_Create_ReturnValue) == 0x000060, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W, CallFunc_SpawnSound2D_ReturnValue) == 0x000070, "Member 'SoloPlay_W_C_ExecuteUbergraph_SoloPlay_W::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

}

