#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Speedrun_Category_S

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Speedrun_Category_S.Speedrun_Category_S
// 0x0030 (0x0030 - 0x0000)
struct FSpeedrun_Category_S final
{
public:
	class FString                                 Type_12_40FC42EC4EE2EEA35ABE239AC7E5046A;          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Name_13_CFAC9FEB4CAC73A0EC6E1CB06D9832FC;          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ID_16_1D3BC04D47A6B144D7C85295404CAED7;            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FSpeedrun_Category_S) == 0x000008, "Wrong alignment on FSpeedrun_Category_S");
static_assert(sizeof(FSpeedrun_Category_S) == 0x000030, "Wrong size on FSpeedrun_Category_S");
static_assert(offsetof(FSpeedrun_Category_S, Type_12_40FC42EC4EE2EEA35ABE239AC7E5046A) == 0x000000, "Member 'FSpeedrun_Category_S::Type_12_40FC42EC4EE2EEA35ABE239AC7E5046A' has a wrong offset!");
static_assert(offsetof(FSpeedrun_Category_S, Name_13_CFAC9FEB4CAC73A0EC6E1CB06D9832FC) == 0x000010, "Member 'FSpeedrun_Category_S::Name_13_CFAC9FEB4CAC73A0EC6E1CB06D9832FC' has a wrong offset!");
static_assert(offsetof(FSpeedrun_Category_S, ID_16_1D3BC04D47A6B144D7C85295404CAED7) == 0x000020, "Member 'FSpeedrun_Category_S::ID_16_1D3BC04D47A6B144D7C85295404CAED7' has a wrong offset!");

}

