#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpeedRun_Category_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Categories_S_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpeedRun_Category_W.SpeedRun_Category_W_C
// 0x0070 (0x0330 - 0x02C0)
class USpeedRun_Category_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_25;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_51;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FCategories_S                          Category;                                          // 0x02E0(0x0030)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UW_SpeedrunCom_C*                       Leaderboard_W;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FString>                         PlayersID;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Selected;                                          // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__SpeedRun_Category_W_Button_25_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Deselect();
	void DeselectAllTabs();
	void ExecuteUbergraph_SpeedRun_Category_W(int32 EntryPoint);
	void OnCategoriesCallback(class UVaRestRequestJSON* Request);
	void RefreshParentPlayerList(int32 PlayerNumber);
	void Select();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpeedRun_Category_W_C">();
	}
	static class USpeedRun_Category_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpeedRun_Category_W_C>();
	}
};
static_assert(alignof(USpeedRun_Category_W_C) == 0x000008, "Wrong alignment on USpeedRun_Category_W_C");
static_assert(sizeof(USpeedRun_Category_W_C) == 0x000330, "Wrong size on USpeedRun_Category_W_C");
static_assert(offsetof(USpeedRun_Category_W_C, UberGraphFrame) == 0x0002C0, "Member 'USpeedRun_Category_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpeedRun_Category_W_C, Border_0) == 0x0002C8, "Member 'USpeedRun_Category_W_C::Border_0' has a wrong offset!");
static_assert(offsetof(USpeedRun_Category_W_C, Button_25) == 0x0002D0, "Member 'USpeedRun_Category_W_C::Button_25' has a wrong offset!");
static_assert(offsetof(USpeedRun_Category_W_C, TextBlock_51) == 0x0002D8, "Member 'USpeedRun_Category_W_C::TextBlock_51' has a wrong offset!");
static_assert(offsetof(USpeedRun_Category_W_C, Category) == 0x0002E0, "Member 'USpeedRun_Category_W_C::Category' has a wrong offset!");
static_assert(offsetof(USpeedRun_Category_W_C, Leaderboard_W) == 0x000310, "Member 'USpeedRun_Category_W_C::Leaderboard_W' has a wrong offset!");
static_assert(offsetof(USpeedRun_Category_W_C, PlayersID) == 0x000318, "Member 'USpeedRun_Category_W_C::PlayersID' has a wrong offset!");
static_assert(offsetof(USpeedRun_Category_W_C, Selected) == 0x000328, "Member 'USpeedRun_Category_W_C::Selected' has a wrong offset!");

}

