#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spire_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Spire_BP.Spire_BP_C.ExecuteUbergraph_Spire_BP
// 0x0188 (0x0188 - 0x0000)
struct Spire_BP_C_ExecuteUbergraph_Spire_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB4[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0040(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSound2D_VolumeMultiplier_ImplicitCast; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSound2D_PitchMultiplier_ImplicitCast; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spire_BP_C_ExecuteUbergraph_Spire_BP) == 0x000008, "Wrong alignment on Spire_BP_C_ExecuteUbergraph_Spire_BP");
static_assert(sizeof(Spire_BP_C_ExecuteUbergraph_Spire_BP) == 0x000188, "Wrong size on Spire_BP_C_ExecuteUbergraph_Spire_BP");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, EntryPoint) == 0x000000, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_VLerp_ReturnValue) == 0x000028, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000040, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_GetPlayerController_ReturnValue) == 0x000128, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_RandomFloatInRange_ReturnValue) == 0x000130, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000138, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_SpawnSound2D_ReturnValue) == 0x000140, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000148, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000160, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000168, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_SpawnSound2D_VolumeMultiplier_ImplicitCast) == 0x000180, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_SpawnSound2D_VolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Spire_BP_C_ExecuteUbergraph_Spire_BP, CallFunc_SpawnSound2D_PitchMultiplier_ImplicitCast) == 0x000184, "Member 'Spire_BP_C_ExecuteUbergraph_Spire_BP::CallFunc_SpawnSound2D_PitchMultiplier_ImplicitCast' has a wrong offset!");

}

