#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spline_Plateformer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Spline_Plateformer_BP.Spline_Plateformer_BP_C.BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Spline_Plateformer_BP.Spline_Plateformer_BP_C.BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Spline_Plateformer_BP_C_BndEvt__Spline_Plateformer_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Spline_Plateformer_BP.Spline_Plateformer_BP_C.ExecuteUbergraph_Spline_Plateformer_BP
// 0x0240 (0x0240 - 0x0000)
struct Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378D[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378E[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378F[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0060(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3790[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0168(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3791[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0188(0x0010)(ReferenceParm)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3792[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3793[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3794[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicsConstraintComponent*>    CallFunc_K2_GetComponentsByClass_ReturnValue_2;    // 0x01C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPhysicsConstraintComponent*            CallFunc_Array_Get_Item_2;                         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USphereComponent*>               CallFunc_K2_GetComponentsByClass_ReturnValue_3;    // 0x01E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USphereComponent*                       CallFunc_Array_Get_Item_3;                         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayers_ReturnValue;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3795[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Timer_C*                             CallFunc_ShowTimer_ReturnValue;                    // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP) == 0x000008, "Wrong alignment on Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP");
static_assert(sizeof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP) == 0x000240, "Wrong size on Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, EntryPoint) == 0x000000, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Lerp_ReturnValue_1) == 0x000020, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_HasAuthority_ReturnValue) == 0x00002C, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, Temp_bool_Has_Been_Initd_Variable) == 0x000039, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000040, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000048, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000050, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000058, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x00005C, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x000060, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000148, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x000150, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x000158, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000160, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000168, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Array_Get_Item) == 0x000178, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000184, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000188, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000198, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Array_Length_ReturnValue_1) == 0x0001A8, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Array_Get_Item_1) == 0x0001B0, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001B8, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0001BC, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C0, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_K2_GetComponentsByClass_ReturnValue_2) == 0x0001C8, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_K2_GetComponentsByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Array_Get_Item_2) == 0x0001D8, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_K2_GetComponentsByClass_ReturnValue_3) == 0x0001E0, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_K2_GetComponentsByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Array_Get_Item_3) == 0x0001F0, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_SpawnSound2D_ReturnValue) == 0x0001F8, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_GetNumPlayers_ReturnValue) == 0x000200, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_GetNumPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000208, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x000210, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000218, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_ShowTimer_ReturnValue) == 0x000220, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_ShowTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000228, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000230, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast) == 0x000238, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x00023C, "Member 'Spline_Plateformer_BP_C_ExecuteUbergraph_Spline_Plateformer_BP::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function Spline_Plateformer_BP.Spline_Plateformer_BP_C.Generate Path
// 0x08D0 (0x08D0 - 0x0000)
struct Spline_Plateformer_BP_C_Generate_Path final
{
public:
	double                                        SegmentDistance;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3796[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3797[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3798[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3799[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379A[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0168(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379B[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379C[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0270(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            CallFunc_AddComponent_ReturnValue_1;               // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x02E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_379D[0x8];                                     // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x03D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            Temp_byte_Variable;                                // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379E[0x7];                                     // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_AddComponent_ReturnValue_2;               // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x0440(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EComponentMobility                            Temp_byte_Variable_1;                              // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379F[0x7];                                     // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    CallFunc_Map_Keys_Keys;                            // 0x0530(0x0010)(ReferenceParm)
	EComponentMobility                            K2Node_Select_Default;                             // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A0[0x7];                                     // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_1;                         // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A1[0xC];                                     // 0x0554(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Map_Find_Value;                           // 0x0560(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A2[0x3];                                     // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x05E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x05F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A3[0x7];                                     // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue; // 0x0618(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A4[0x4];                                     // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A5[0xF];                                     // 0x0671(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0680(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_3;               // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x06E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalTransform_SweepHitResult;      // 0x07D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A6[0x3];                                     // 0x08B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetLinearDriveParams_PositionStrength_ImplicitCast; // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spline_Plateformer_BP_C_Generate_Path) == 0x000010, "Wrong alignment on Spline_Plateformer_BP_C_Generate_Path");
static_assert(sizeof(Spline_Plateformer_BP_C_Generate_Path) == 0x0008D0, "Wrong size on Spline_Plateformer_BP_C_Generate_Path");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, SegmentDistance) == 0x000000, "Member 'Spline_Plateformer_BP_C_Generate_Path::SegmentDistance' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CurrentIndex) == 0x000008, "Member 'Spline_Plateformer_BP_C_Generate_Path::CurrentIndex' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Spline_Plateformer_BP_C_Generate_Path::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Spline_Plateformer_BP_C_Generate_Path::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, Temp_bool_Variable) == 0x000018, "Member 'Spline_Plateformer_BP_C_Generate_Path::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, Temp_int_Variable) == 0x00001C, "Member 'Spline_Plateformer_BP_C_Generate_Path::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, Temp_int_Variable_1) == 0x000020, "Member 'Spline_Plateformer_BP_C_Generate_Path::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000028, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetActorBounds_Origin) == 0x000030, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetActorBounds_BoxExtent) == 0x000048, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000078, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000090, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetDisplayName_ReturnValue) == 0x0000B0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Contains_ReturnValue) == 0x0000C1, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetComponentBounds_Origin) == 0x0000C8, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetComponentBounds_BoxExtent) == 0x0000E0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetComponentBounds_SphereRadius) == 0x0000F8, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetRelativeTransform_ReturnValue) == 0x000100, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_AddComponent_ReturnValue) == 0x000160, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000168, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000250, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Add_IntInt_ReturnValue_2) == 0x000258, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000260, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetSplineLength_ReturnValue) == 0x000268, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_MakeTransform_ReturnValue) == 0x000270, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0002D0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_AddComponent_ReturnValue_1) == 0x0002D8, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0002E0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_MakeTransform_ReturnValue_1) == 0x0003D0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, Temp_byte_Variable) == 0x000430, "Member 'Spline_Plateformer_BP_C_Generate_Path::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_AddComponent_ReturnValue_2) == 0x000438, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_K2_SetWorldLocation_SweepHitResult_2) == 0x000440, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_K2_SetWorldLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, Temp_byte_Variable_1) == 0x000528, "Member 'Spline_Plateformer_BP_C_Generate_Path::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Map_Keys_Keys) == 0x000530, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, K2Node_Select_Default) == 0x000540, "Member 'Spline_Plateformer_BP_C_Generate_Path::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Array_Get_Item_1) == 0x000548, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Map_Length_ReturnValue) == 0x000550, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Map_Find_Value) == 0x000560, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Map_Find_ReturnValue) == 0x0005C0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Subtract_IntInt_ReturnValue) == 0x0005C4, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_BreakTransform_Location) == 0x0005C8, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_BreakTransform_Rotation) == 0x0005E0, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_BreakTransform_Scale) == 0x0005F8, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_Greater_IntInt_ReturnValue) == 0x000610, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue) == 0x000618, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000630, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_BreakRotator_Roll) == 0x000648, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_BreakRotator_Pitch) == 0x00064C, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_BreakRotator_Yaw) == 0x000650, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_MakeRotator_ReturnValue_1) == 0x000658, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spline_Plateformer_BP_C_Generate_Path, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000670, "Member 'Spline_Plateformer_BP_C_Generate_Path::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
