#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Stairs_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Stairs_BP.Stairs_BP_C.ExecuteUbergraph_Stairs_BP
// 0x0168 (0x0168 - 0x0000)
struct Stairs_BP_C_ExecuteUbergraph_Stairs_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E12[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E13[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E14[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E15[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E16[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue;           // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E17[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E18[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E19[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAmbientSound*>                  CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0118(0x0010)(ReferenceParm)
	class AAmbientSound*                          CallFunc_Array_Get_Item_5;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast_1; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_2;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast_2; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_2;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP) == 0x000008, "Wrong alignment on Stairs_BP_C_ExecuteUbergraph_Stairs_BP");
static_assert(sizeof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP) == 0x000168, "Wrong size on Stairs_BP_C_ExecuteUbergraph_Stairs_BP");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, EntryPoint) == 0x000000, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Lerp_ReturnValue_2) == 0x000018, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_bool_Has_Been_Initd_Variable) == 0x000030, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_bool_IsClosed_Variable) == 0x000040, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_int_Loop_Counter_Variable_2) == 0x000044, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_int_Array_Index_Variable_2) == 0x00004C, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_int_Loop_Counter_Variable_3) == 0x000050, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Add_IntInt_ReturnValue_3) == 0x000054, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000058, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Add_IntInt_ReturnValue_4) == 0x000070, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, Temp_int_Array_Index_Variable_3) == 0x000074, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Get_Item) == 0x000078, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Conv_IntToString_ReturnValue) == 0x000080, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Conv_StringToName_ReturnValue) == 0x000090, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_GetComponentsByTag_ReturnValue) == 0x000098, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Get_Item_2) == 0x0000C8, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Get_Item_3) == 0x0000D0, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0000DC, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E0, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000E1, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E8, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000100, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Get_Item_4) == 0x000108, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Length_ReturnValue_3) == 0x000110, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Less_IntInt_ReturnValue_3) == 0x000114, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000118, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Array_Get_Item_5) == 0x000128, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000130, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000138, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast) == 0x000140, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast_1) == 0x000144, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Lerp_Alpha_ImplicitCast_2) == 0x000148, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Lerp_Alpha_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast_2) == 0x000158, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_SetPitchMultiplier_NewPitchMultiplier_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Delay_Duration_ImplicitCast) == 0x00015C, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Delay_Duration_ImplicitCast_1) == 0x000160, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_ExecuteUbergraph_Stairs_BP, CallFunc_Delay_Duration_ImplicitCast_2) == 0x000164, "Member 'Stairs_BP_C_ExecuteUbergraph_Stairs_BP::CallFunc_Delay_Duration_ImplicitCast_2' has a wrong offset!");

// Function Stairs_BP.Stairs_BP_C.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct Stairs_BP_C_IsActivated final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Stairs_BP_C_IsActivated) == 0x000001, "Wrong alignment on Stairs_BP_C_IsActivated");
static_assert(sizeof(Stairs_BP_C_IsActivated) == 0x000001, "Wrong size on Stairs_BP_C_IsActivated");
static_assert(offsetof(Stairs_BP_C_IsActivated, Activated) == 0x000000, "Member 'Stairs_BP_C_IsActivated::Activated' has a wrong offset!");

// Function Stairs_BP.Stairs_BP_C.UserConstructionScript
// 0x0110 (0x0110 - 0x0000)
struct Stairs_BP_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1B[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1C[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1D[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Stairs_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on Stairs_BP_C_UserConstructionScript");
static_assert(sizeof(Stairs_BP_C_UserConstructionScript) == 0x000110, "Wrong size on Stairs_BP_C_UserConstructionScript");
static_assert(offsetof(Stairs_BP_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'Stairs_BP_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_UserConstructionScript, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'Stairs_BP_C_UserConstructionScript::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stairs_BP_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'Stairs_BP_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
