#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StopWayManager_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass StopWayManager_BP.StopWayManager_BP_C
// 0x0028 (0x02C0 - 0x0298)
class AStopWayManager_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABlockStopWay_BP_C*>             WayBlocks;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)

public:
	void ExecuteUbergraph_StopWayManager_BP(int32 EntryPoint);
	void IsActivated(bool* Activated);
	void Pushed();
	void Released();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StopWayManager_BP_C">();
	}
	static class AStopWayManager_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStopWayManager_BP_C>();
	}
};
static_assert(alignof(AStopWayManager_BP_C) == 0x000008, "Wrong alignment on AStopWayManager_BP_C");
static_assert(sizeof(AStopWayManager_BP_C) == 0x0002C0, "Wrong size on AStopWayManager_BP_C");
static_assert(offsetof(AStopWayManager_BP_C, UberGraphFrame) == 0x000298, "Member 'AStopWayManager_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AStopWayManager_BP_C, Billboard) == 0x0002A0, "Member 'AStopWayManager_BP_C::Billboard' has a wrong offset!");
static_assert(offsetof(AStopWayManager_BP_C, DefaultSceneRoot) == 0x0002A8, "Member 'AStopWayManager_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AStopWayManager_BP_C, WayBlocks) == 0x0002B0, "Member 'AStopWayManager_BP_C::WayBlocks' has a wrong offset!");

}

