#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StopWayManager_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function StopWayManager_BP.StopWayManager_BP_C.ExecuteUbergraph_StopWayManager_BP
// 0x0048 (0x0048 - 0x0000)
struct StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC6[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC7[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABlockStopWay_BP_C*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC8[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABlockStopWay_BP_C*                     CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP) == 0x000008, "Wrong alignment on StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP");
static_assert(sizeof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP) == 0x000048, "Wrong size on StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, EntryPoint) == 0x000000, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, Temp_int_Array_Index_Variable) == 0x000014, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, CallFunc_Array_Get_Item) == 0x000020, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000040, "Member 'StopWayManager_BP_C_ExecuteUbergraph_StopWayManager_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function StopWayManager_BP.StopWayManager_BP_C.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct StopWayManager_BP_C_IsActivated final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StopWayManager_BP_C_IsActivated) == 0x000001, "Wrong alignment on StopWayManager_BP_C_IsActivated");
static_assert(sizeof(StopWayManager_BP_C_IsActivated) == 0x000001, "Wrong size on StopWayManager_BP_C_IsActivated");
static_assert(offsetof(StopWayManager_BP_C_IsActivated, Activated) == 0x000000, "Member 'StopWayManager_BP_C_IsActivated::Activated' has a wrong offset!");

}

