#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TakeMovieScene

#include "Basic.hpp"

#include "MovieSceneTracks_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class TakeMovieScene.MovieSceneTakeSection
// 0x0620 (0x0710 - 0x00F0)
class UMovieSceneTakeSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneIntegerChannel              HoursCurve;                                        // 0x00F0(0x0100)(NativeAccessSpecifierPublic)
	struct FMovieSceneIntegerChannel              MinutesCurve;                                      // 0x01F0(0x0100)(NativeAccessSpecifierPublic)
	struct FMovieSceneIntegerChannel              SecondsCurve;                                      // 0x02F0(0x0100)(NativeAccessSpecifierPublic)
	struct FMovieSceneIntegerChannel              FramesCurve;                                       // 0x03F0(0x0100)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                SubFramesCurve;                                    // 0x04F0(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneStringChannel               Slate;                                             // 0x0600(0x0110)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTakeSection">();
	}
	static class UMovieSceneTakeSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTakeSection>();
	}
};
static_assert(alignof(UMovieSceneTakeSection) == 0x000008, "Wrong alignment on UMovieSceneTakeSection");
static_assert(sizeof(UMovieSceneTakeSection) == 0x000710, "Wrong size on UMovieSceneTakeSection");
static_assert(offsetof(UMovieSceneTakeSection, HoursCurve) == 0x0000F0, "Member 'UMovieSceneTakeSection::HoursCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSection, MinutesCurve) == 0x0001F0, "Member 'UMovieSceneTakeSection::MinutesCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSection, SecondsCurve) == 0x0002F0, "Member 'UMovieSceneTakeSection::SecondsCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSection, FramesCurve) == 0x0003F0, "Member 'UMovieSceneTakeSection::FramesCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSection, SubFramesCurve) == 0x0004F0, "Member 'UMovieSceneTakeSection::SubFramesCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSection, Slate) == 0x000600, "Member 'UMovieSceneTakeSection::Slate' has a wrong offset!");

// Class TakeMovieScene.MovieSceneTakeSettings
// 0x0060 (0x0088 - 0x0028)
class UMovieSceneTakeSettings final : public UObject
{
public:
	class FString                                 HoursName;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MinutesName;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SecondsName;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FramesName;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubFramesName;                                     // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SlateName;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTakeSettings">();
	}
	static class UMovieSceneTakeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTakeSettings>();
	}
};
static_assert(alignof(UMovieSceneTakeSettings) == 0x000008, "Wrong alignment on UMovieSceneTakeSettings");
static_assert(sizeof(UMovieSceneTakeSettings) == 0x000088, "Wrong size on UMovieSceneTakeSettings");
static_assert(offsetof(UMovieSceneTakeSettings, HoursName) == 0x000028, "Member 'UMovieSceneTakeSettings::HoursName' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSettings, MinutesName) == 0x000038, "Member 'UMovieSceneTakeSettings::MinutesName' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSettings, SecondsName) == 0x000048, "Member 'UMovieSceneTakeSettings::SecondsName' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSettings, FramesName) == 0x000058, "Member 'UMovieSceneTakeSettings::FramesName' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSettings, SubFramesName) == 0x000068, "Member 'UMovieSceneTakeSettings::SubFramesName' has a wrong offset!");
static_assert(offsetof(UMovieSceneTakeSettings, SlateName) == 0x000078, "Member 'UMovieSceneTakeSettings::SlateName' has a wrong offset!");

// Class TakeMovieScene.MovieSceneTakeTrack
// 0x0010 (0x00A8 - 0x0098)
class UMovieSceneTakeTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTakeTrack">();
	}
	static class UMovieSceneTakeTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTakeTrack>();
	}
};
static_assert(alignof(UMovieSceneTakeTrack) == 0x000008, "Wrong alignment on UMovieSceneTakeTrack");
static_assert(sizeof(UMovieSceneTakeTrack) == 0x0000A8, "Wrong size on UMovieSceneTakeTrack");
static_assert(offsetof(UMovieSceneTakeTrack, Sections) == 0x000098, "Member 'UMovieSceneTakeTrack::Sections' has a wrong offset!");

}

