#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextureUtilitiesCommon

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "TextureUtilitiesCommon_structs.hpp"


namespace SDK
{

// Class TextureUtilitiesCommon.TextureImportSettings
// 0x0008 (0x0040 - 0x0038)
class UTextureImportSettings final : public UDeveloperSettings
{
public:
	int32                                         AutoVTSize;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNormalizeNormals;                           // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFastMipFilter;                              // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportFloatingPointFormat             CompressedFormatForFloatTextures;                  // 0x003E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportPNGInfill                       PNGInfill;                                         // 0x003F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextureImportSettings">();
	}
	static class UTextureImportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureImportSettings>();
	}
};
static_assert(alignof(UTextureImportSettings) == 0x000008, "Wrong alignment on UTextureImportSettings");
static_assert(sizeof(UTextureImportSettings) == 0x000040, "Wrong size on UTextureImportSettings");
static_assert(offsetof(UTextureImportSettings, AutoVTSize) == 0x000038, "Member 'UTextureImportSettings::AutoVTSize' has a wrong offset!");
static_assert(offsetof(UTextureImportSettings, bEnableNormalizeNormals) == 0x00003C, "Member 'UTextureImportSettings::bEnableNormalizeNormals' has a wrong offset!");
static_assert(offsetof(UTextureImportSettings, bEnableFastMipFilter) == 0x00003D, "Member 'UTextureImportSettings::bEnableFastMipFilter' has a wrong offset!");
static_assert(offsetof(UTextureImportSettings, CompressedFormatForFloatTextures) == 0x00003E, "Member 'UTextureImportSettings::CompressedFormatForFloatTextures' has a wrong offset!");
static_assert(offsetof(UTextureImportSettings, PNGInfill) == 0x00003F, "Member 'UTextureImportSettings::PNGInfill' has a wrong offset!");

}

