#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThirdPerson_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ThirdPerson_AnimBP.ThirdPerson_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_362D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_166;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_167;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_168;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_169;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_170;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_171;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_172;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_173;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_174;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_175;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_176;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_177;                                  // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_178;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_179;                                // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362E[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_180;                               // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_181;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362F[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_182;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_183;                              // 0x0070(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_184;                               // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_185;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_186;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_187;                                // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3630[0x1];                                     // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_188;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3631[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_189;                              // 0x00B0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_166) == 0x000004, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_166' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_167) == 0x00000C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_167' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_168) == 0x000014, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_168' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_169) == 0x000018, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_169' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_170) == 0x00001C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_170' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_171) == 0x000024, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_171' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_172) == 0x000028, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_172' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_173) == 0x000030, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_173' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_174) == 0x000034, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_174' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_175) == 0x00003C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_175' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_176) == 0x000040, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_176' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_177) == 0x000048, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_177' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_178) == 0x000050, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_178' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_179) == 0x000051, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_179' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_180) == 0x000058, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_180' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_181) == 0x000068, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_181' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_182) == 0x00006C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_182' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_183) == 0x000070, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_183' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_184) == 0x00009C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_184' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_185) == 0x0000A0, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_185' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_186) == 0x0000A1, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_186' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_187) == 0x0000A2, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_187' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_188) == 0x0000A4, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_188' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_189) == 0x0000B0, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_189' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ThirdPerson_AnimBP.ThirdPerson_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0013 (0x0014 - 0x0001)
struct ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_3632[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3633[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000014, "Wrong size on ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000010, "Member 'ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");

}

