#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThirdPerson_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ThirdPerson_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ThirdPerson_AnimBP.ThirdPerson_AnimBP_C
// 0x08D0 (0x0C20 - 0x0350)
class UThirdPerson_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3634[0x8];                                     // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ThirdPerson_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0358(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_3635[0x4];                                     // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0370(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0378(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0380(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x03A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x03C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0418(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0440(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0488(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x04A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x04F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0510(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0558(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0578(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x05E8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0630(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x06A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x06C0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0788(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0808(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0830(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0920(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0968(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x09E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A30(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0A78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0AA0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0AC8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0B10(0x00F0)()
	bool                                          IsInAir_;                                          // 0x0C00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3636[0x7];                                     // 0x0C01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Speed;                                             // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouching;                                       // 0x0C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHoldingLight;                                    // 0x0C11(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_LeftFootprint();
	void AnimNotify_RightFootprint();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ThirdPerson_AnimBP_AnimGraphNode_LayeredBoneBlend_2E63F6624AD3CF2429BD9B96863C3D68();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ThirdPerson_AnimBP_AnimGraphNode_TransitionResult_175FFF54400CA0EC412B7083B0989D7E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ThirdPerson_AnimBP_AnimGraphNode_TransitionResult_F867B5374C7EFB9ED9010FA7431019DF();
	void ExecuteUbergraph_ThirdPerson_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ThirdPerson_AnimBP_C">();
	}
	static class UThirdPerson_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThirdPerson_AnimBP_C>();
	}
};
static_assert(alignof(UThirdPerson_AnimBP_C) == 0x000010, "Wrong alignment on UThirdPerson_AnimBP_C");
static_assert(sizeof(UThirdPerson_AnimBP_C) == 0x000C20, "Wrong size on UThirdPerson_AnimBP_C");
static_assert(offsetof(UThirdPerson_AnimBP_C, UberGraphFrame) == 0x000350, "Member 'UThirdPerson_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, __AnimBlueprintMutables) == 0x000358, "Member 'UThirdPerson_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000370, "Member 'UThirdPerson_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimBlueprintExtension_Base) == 0x000378, "Member 'UThirdPerson_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_Root) == 0x000380, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0003A0, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x0003C8, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x0003F0, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000418, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000440, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_StateResult_3) == 0x000488, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0004A8, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0004F0, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000510, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000558, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000578, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x0005E8, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x000630, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_StateResult) == 0x0006A0, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_StateMachine) == 0x0006C0, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x000788, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x000808, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x000830, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000920, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000968, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0009E8, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000A30, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000A78, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000AA0, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_Slot) == 0x000AC8, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000B10, "Member 'UThirdPerson_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, IsInAir_) == 0x000C00, "Member 'UThirdPerson_AnimBP_C::IsInAir_' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, Speed) == 0x000C08, "Member 'UThirdPerson_AnimBP_C::Speed' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, IsCrouching) == 0x000C10, "Member 'UThirdPerson_AnimBP_C::IsCrouching' has a wrong offset!");
static_assert(offsetof(UThirdPerson_AnimBP_C, IsHoldingLight) == 0x000C11, "Member 'UThirdPerson_AnimBP_C::IsHoldingLight' has a wrong offset!");

}

