#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_BP.Trap_BP_C
// 0x0060 (0x02F8 - 0x0298)
class ATrap_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_VinceSync_C*                         C_VinceSync;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UC_TickOptimizer_C*                     C_TickOptimizer;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PistonSound;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_DD8EEB8B46A76A8C2708E1A9825CD1AF; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_DD8EEB8B46A76A8C2708E1A9825CD1AF; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C89[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Relative_Rotation;                                 // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        Duration;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Trap_BP(int32 EntryPoint);
	void PlaySoundAll();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_BP_C">();
	}
	static class ATrap_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_BP_C>();
	}
};
static_assert(alignof(ATrap_BP_C) == 0x000008, "Wrong alignment on ATrap_BP_C");
static_assert(sizeof(ATrap_BP_C) == 0x0002F8, "Wrong size on ATrap_BP_C");
static_assert(offsetof(ATrap_BP_C, UberGraphFrame) == 0x000298, "Member 'ATrap_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, C_VinceSync) == 0x0002A0, "Member 'ATrap_BP_C::C_VinceSync' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, C_TickOptimizer) == 0x0002A8, "Member 'ATrap_BP_C::C_TickOptimizer' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, PistonSound) == 0x0002B0, "Member 'ATrap_BP_C::PistonSound' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, StaticMesh) == 0x0002B8, "Member 'ATrap_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, DefaultSceneRoot) == 0x0002C0, "Member 'ATrap_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, Timeline_0_NewTrack_0_DD8EEB8B46A76A8C2708E1A9825CD1AF) == 0x0002C8, "Member 'ATrap_BP_C::Timeline_0_NewTrack_0_DD8EEB8B46A76A8C2708E1A9825CD1AF' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, Timeline_0__Direction_DD8EEB8B46A76A8C2708E1A9825CD1AF) == 0x0002CC, "Member 'ATrap_BP_C::Timeline_0__Direction_DD8EEB8B46A76A8C2708E1A9825CD1AF' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, Timeline_0) == 0x0002D0, "Member 'ATrap_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, Relative_Rotation) == 0x0002D8, "Member 'ATrap_BP_C::Relative_Rotation' has a wrong offset!");
static_assert(offsetof(ATrap_BP_C, Duration) == 0x0002F0, "Member 'ATrap_BP_C::Duration' has a wrong offset!");

}

