#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Trap_BP.Trap_BP_C.ExecuteUbergraph_Trap_BP
// 0x0110 (0x0110 - 0x0000)
struct Trap_BP_C_ExecuteUbergraph_Trap_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C8A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0020(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C8B[0x2];                                     // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_BP_C_ExecuteUbergraph_Trap_BP) == 0x000008, "Wrong alignment on Trap_BP_C_ExecuteUbergraph_Trap_BP");
static_assert(sizeof(Trap_BP_C_ExecuteUbergraph_Trap_BP) == 0x000110, "Wrong size on Trap_BP_C_ExecuteUbergraph_Trap_BP");
static_assert(offsetof(Trap_BP_C_ExecuteUbergraph_Trap_BP, EntryPoint) == 0x000000, "Member 'Trap_BP_C_ExecuteUbergraph_Trap_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_BP_C_ExecuteUbergraph_Trap_BP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Trap_BP_C_ExecuteUbergraph_Trap_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_BP_C_ExecuteUbergraph_Trap_BP, CallFunc_RLerp_ReturnValue) == 0x000008, "Member 'Trap_BP_C_ExecuteUbergraph_Trap_BP::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_BP_C_ExecuteUbergraph_Trap_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000020, "Member 'Trap_BP_C_ExecuteUbergraph_Trap_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_BP_C_ExecuteUbergraph_Trap_BP, Temp_bool_Variable) == 0x000108, "Member 'Trap_BP_C_ExecuteUbergraph_Trap_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Trap_BP_C_ExecuteUbergraph_Trap_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000109, "Member 'Trap_BP_C_ExecuteUbergraph_Trap_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_BP_C_ExecuteUbergraph_Trap_BP, CallFunc_Delay_Duration_ImplicitCast) == 0x00010C, "Member 'Trap_BP_C_ExecuteUbergraph_Trap_BP::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

