#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trim_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trim_BP.trim_BP_C
// 0x0018 (0x02B0 - 0x0298)
class ATrim_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Trim_crown;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trim_BP_C">();
	}
	static class ATrim_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrim_BP_C>();
	}
};
static_assert(alignof(ATrim_BP_C) == 0x000008, "Wrong alignment on ATrim_BP_C");
static_assert(sizeof(ATrim_BP_C) == 0x0002B0, "Wrong size on ATrim_BP_C");
static_assert(offsetof(ATrim_BP_C, Trim_crown) == 0x000298, "Member 'ATrim_BP_C::Trim_crown' has a wrong offset!");
static_assert(offsetof(ATrim_BP_C, StaticMeshComponent1) == 0x0002A0, "Member 'ATrim_BP_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ATrim_BP_C, SharedRoot) == 0x0002A8, "Member 'ATrim_BP_C::SharedRoot' has a wrong offset!");

}

