#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tunnel_Entrance_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.Add sidewalk
// 0x0120 (0x0120 - 0x0000)
struct Tunnel_Entrance_BP_C_Add_sidewalk final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Mesh;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C7[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Entrance_BP_C_Add_sidewalk) == 0x000010, "Wrong alignment on Tunnel_Entrance_BP_C_Add_sidewalk");
static_assert(sizeof(Tunnel_Entrance_BP_C_Add_sidewalk) == 0x000120, "Wrong size on Tunnel_Entrance_BP_C_Add_sidewalk");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, Location) == 0x000000, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::Location' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, Mesh) == 0x000018, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::Mesh' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000088, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, CallFunc_MakeTransform_ReturnValue_1) == 0x0000A0, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, CallFunc_SetStaticMesh_ReturnValue) == 0x000100, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, CallFunc_AddComponent_ReturnValue_1) == 0x000108, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Add_sidewalk, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000110, "Member 'Tunnel_Entrance_BP_C_Add_sidewalk::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.Connect Road To 
// 0x00C8 (0x00C8 - 0x0000)
struct Tunnel_Entrance_BP_C_Connect_Road_To_ final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Con_Rotation;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C8[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C9[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Entrance_BP_C_Connect_Road_To_) == 0x000008, "Wrong alignment on Tunnel_Entrance_BP_C_Connect_Road_To_");
static_assert(sizeof(Tunnel_Entrance_BP_C_Connect_Road_To_) == 0x0000C8, "Wrong size on Tunnel_Entrance_BP_C_Connect_Road_To_");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, Location) == 0x000000, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::Location' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, Con_Rotation) == 0x000018, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::Con_Rotation' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_GetForwardVector_ReturnValue) == 0x000030, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_GetDistanceTo_ReturnValue) == 0x00004C, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000054, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_SelectFloat_ReturnValue) == 0x000068, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000088, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_SelectVector_ReturnValue) == 0x0000A0, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000B8, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Connect_Road_To_, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000C0, "Member 'Tunnel_Entrance_BP_C_Connect_Road_To_::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.ExecuteUbergraph_Tunnel_Entrance_BP
// 0x0004 (0x0004 - 0x0000)
struct Tunnel_Entrance_BP_C_ExecuteUbergraph_Tunnel_Entrance_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Entrance_BP_C_ExecuteUbergraph_Tunnel_Entrance_BP) == 0x000004, "Wrong alignment on Tunnel_Entrance_BP_C_ExecuteUbergraph_Tunnel_Entrance_BP");
static_assert(sizeof(Tunnel_Entrance_BP_C_ExecuteUbergraph_Tunnel_Entrance_BP) == 0x000004, "Wrong size on Tunnel_Entrance_BP_C_ExecuteUbergraph_Tunnel_Entrance_BP");
static_assert(offsetof(Tunnel_Entrance_BP_C_ExecuteUbergraph_Tunnel_Entrance_BP, EntryPoint) == 0x000000, "Member 'Tunnel_Entrance_BP_C_ExecuteUbergraph_Tunnel_Entrance_BP::EntryPoint' has a wrong offset!");

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.Move Road At Con
// 0x0248 (0x0248 - 0x0000)
struct Tunnel_Entrance_BP_C_Move_Road_At_Con final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CB[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CC[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CD[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CE[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CF[0x1];                                     // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D0[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D1[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D2[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARoad_BP_C*                             K2Node_DynamicCast_AsRoad_BP;                      // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D3[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast; // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Entrance_BP_C_Move_Road_At_Con) == 0x000008, "Wrong alignment on Tunnel_Entrance_BP_C_Move_Road_At_Con");
static_assert(sizeof(Tunnel_Entrance_BP_C_Move_Road_At_Con) == 0x000248, "Wrong size on Tunnel_Entrance_BP_C_Move_Road_At_Con");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, Temp_object_Variable) == 0x000018, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, K2Node_MakeArray_Array) == 0x000048, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x000058, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x000068, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_Array_Get_Item) == 0x000070, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_bBlockingHit) == 0x000159, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_bInitialOverlap) == 0x00015A, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_Time) == 0x00015C, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_Distance) == 0x000160, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_Location) == 0x000168, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_ImpactPoint) == 0x000180, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_Normal) == 0x000198, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B0, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_PhysMat) == 0x0001C8, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_HitActor) == 0x0001D0, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_HitComponent) == 0x0001D8, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_HitBoneName) == 0x0001E0, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_BoneName) == 0x0001E8, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_HitItem) == 0x0001F0, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_ElementIndex) == 0x0001F4, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_FaceIndex) == 0x0001F8, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_TraceStart) == 0x000200, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BreakHitResult_TraceEnd) == 0x000218, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_BooleanAND_ReturnValue) == 0x000230, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, K2Node_DynamicCast_AsRoad_BP) == 0x000238, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::K2Node_DynamicCast_AsRoad_BP' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000241, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Move_Road_At_Con, CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast) == 0x000244, "Member 'Tunnel_Entrance_BP_C_Move_Road_At_Con::CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast' has a wrong offset!");

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.Perform Landscape Adjustation 
// 0x00F0 (0x00F0 - 0x0000)
struct Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_ final
{
public:
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size;   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Calculate_Static_Mesh_Size_Static_Mesh;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D4[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D5[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULandscapeLayerInfoObject*>      K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	class ULandscapeLayerInfoObject*              CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_StartWidth_ImplicitCast; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_EndWidth_ImplicitCast;  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_) == 0x000008, "Wrong alignment on Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_");
static_assert(sizeof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_) == 0x0000F0, "Wrong size on Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size) == 0x000000, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Calculate_Static_Mesh_Size_Mesh_X_size' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size) == 0x000008, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Calculate_Static_Mesh_Size_Mesh_Y_size' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size) == 0x000010, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Calculate_Static_Mesh_Size_Mesh_Z_size' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Calculate_Static_Mesh_Size_Static_Mesh) == 0x000018, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Calculate_Static_Mesh_Size_Static_Mesh' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, Temp_int_Variable) == 0x000030, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_GetObjectName_ReturnValue) == 0x000038, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, K2Node_MakeArray_Array) == 0x000060, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Array_Get_Item) == 0x000070, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_GetObjectName_ReturnValue_1) == 0x000078, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A0, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B0, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000C0, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000D0, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_EditorApplySpline_StartWidth_ImplicitCast) == 0x0000E0, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_EditorApplySpline_StartWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_EditorApplySpline_EndWidth_ImplicitCast) == 0x0000E4, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_EditorApplySpline_EndWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast) == 0x0000E8, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_EditorApplySpline_EndSideFalloff_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_, CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast) == 0x0000EC, "Member 'Tunnel_Entrance_BP_C_Perform_Landscape_Adjustation_::CallFunc_EditorApplySpline_StartSideFalloff_ImplicitCast' has a wrong offset!");

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.Set Road Location
// 0x0190 (0x0190 - 0x0000)
struct Tunnel_Entrance_BP_C_Set_Road_Location final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_HitActor;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D7[0x8];                                     // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Entrance_BP_C_Set_Road_Location) == 0x000010, "Wrong alignment on Tunnel_Entrance_BP_C_Set_Road_Location");
static_assert(sizeof(Tunnel_Entrance_BP_C_Set_Road_Location) == 0x000190, "Wrong size on Tunnel_Entrance_BP_C_Set_Road_Location");
static_assert(offsetof(Tunnel_Entrance_BP_C_Set_Road_Location, Location) == 0x000000, "Member 'Tunnel_Entrance_BP_C_Set_Road_Location::Location' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Set_Road_Location, Param_HitActor) == 0x000018, "Member 'Tunnel_Entrance_BP_C_Set_Road_Location::Param_HitActor' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Set_Road_Location, Rotation) == 0x000020, "Member 'Tunnel_Entrance_BP_C_Set_Road_Location::Rotation' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Set_Road_Location, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'Tunnel_Entrance_BP_C_Set_Road_Location::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Set_Road_Location, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000A0, "Member 'Tunnel_Entrance_BP_C_Set_Road_Location::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_Set_Road_Location, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000188, "Member 'Tunnel_Entrance_BP_C_Set_Road_Location::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.SpawnNewRoadBP
// 0x0170 (0x0170 - 0x0000)
struct Tunnel_Entrance_BP_C_SpawnNewRoadBP final
{
public:
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D8[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Entrance_BP_C_SpawnNewRoadBP) == 0x000010, "Wrong alignment on Tunnel_Entrance_BP_C_SpawnNewRoadBP");
static_assert(sizeof(Tunnel_Entrance_BP_C_SpawnNewRoadBP) == 0x000170, "Wrong size on Tunnel_Entrance_BP_C_SpawnNewRoadBP");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000000, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_MakeTransform_ReturnValue_1) == 0x000080, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_MakeTransform_ReturnValue_2) == 0x0000E0, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000140, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000148, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000150, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000158, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnNewRoadBP, K2Node_SwitchEnum_CmpSuccess) == 0x000160, "Member 'Tunnel_Entrance_BP_C_SpawnNewRoadBP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.SpawnRoadAtAllCOn
// 0x0160 (0x0160 - 0x0000)
struct Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn final
{
public:
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D9[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoad_BP_C*                             CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn) == 0x000010, "Wrong alignment on Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn");
static_assert(sizeof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn) == 0x000160, "Wrong size on Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000000, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_MakeTransform_ReturnValue_1) == 0x000080, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_MakeTransform_ReturnValue_2) == 0x0000E0, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000140, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000148, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000150, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000158, "Member 'Tunnel_Entrance_BP_C_SpawnRoadAtAllCOn::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");

// Function Tunnel_Entrance_BP.Tunnel_Entrance_BP_C.UserConstructionScript
// 0x10A8 (0x10A8 - 0x0000)
struct Tunnel_Entrance_BP_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DA[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DB[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DC[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0028(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_2;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DD[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DE[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0150(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0238(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Select_Default;                             // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DF[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x0328(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_4;  // 0x0410(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_5;  // 0x04F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_6;  // 0x05E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_7;  // 0x06C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_8;  // 0x07B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30E0[0x7];                                     // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_9;  // 0x08A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_10; // 0x0988(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_11; // 0x0A70(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_12; // 0x0B58(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_13; // 0x0C40(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
