#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tunnel_Fan_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tunnel_Fan_BP.Tunnel_Fan_BP_C
// 0x0030 (0x02C8 - 0x0298)
class ATunnel_Fan_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Helix;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Body;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Rotation_Rate;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Rotation_Angle;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tunnel_Fan_BP(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tunnel_Fan_BP_C">();
	}
	static class ATunnel_Fan_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATunnel_Fan_BP_C>();
	}
};
static_assert(alignof(ATunnel_Fan_BP_C) == 0x000008, "Wrong alignment on ATunnel_Fan_BP_C");
static_assert(sizeof(ATunnel_Fan_BP_C) == 0x0002C8, "Wrong size on ATunnel_Fan_BP_C");
static_assert(offsetof(ATunnel_Fan_BP_C, UberGraphFrame) == 0x000298, "Member 'ATunnel_Fan_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATunnel_Fan_BP_C, Helix) == 0x0002A0, "Member 'ATunnel_Fan_BP_C::Helix' has a wrong offset!");
static_assert(offsetof(ATunnel_Fan_BP_C, Body) == 0x0002A8, "Member 'ATunnel_Fan_BP_C::Body' has a wrong offset!");
static_assert(offsetof(ATunnel_Fan_BP_C, DefaultSceneRoot) == 0x0002B0, "Member 'ATunnel_Fan_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATunnel_Fan_BP_C, Rotation_Rate) == 0x0002B8, "Member 'ATunnel_Fan_BP_C::Rotation_Rate' has a wrong offset!");
static_assert(offsetof(ATunnel_Fan_BP_C, Rotation_Angle) == 0x0002C0, "Member 'ATunnel_Fan_BP_C::Rotation_Angle' has a wrong offset!");

}

