#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpdateWorkshopLevelList_W

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SteamCorePro_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UpdateWorkshopLevelList_W.UpdateWorkshopLevelList_W_C
// 0x00F8 (0x03B8 - 0x02C0)
class UUpdateWorkshopLevelList_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEditableTextBox*                       ChangeNote_EditableTextBox;                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Description_EditableTextBox;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ItemName_EditableTextBox;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               MyLevels_WrapBox;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MyWorkshop_ScrollBox;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Previewfile_EditableTextBox;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Tags_EditableTextBox;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        Visibility_ComboBox;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSteamUGCDetails                       Details;                                           // 0x0308(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FUGCUpdateHandle                       CurrentItemHandle;                                 // 0x03B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__UpdateWorkshopLevelList_W_ChangeNote_EditableTextBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void Construct();
	void ExecuteUbergraph_UpdateWorkshopLevelList_W(int32 EntryPoint);
	void OnCallback_B686B5274619AFBCAFCB319607BC5D95(const struct FSteamUGCQueryCompleted& Data, bool bWasSuccessful);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UpdateWorkshopLevelList_W_C">();
	}
	static class UUpdateWorkshopLevelList_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpdateWorkshopLevelList_W_C>();
	}
};
static_assert(alignof(UUpdateWorkshopLevelList_W_C) == 0x000008, "Wrong alignment on UUpdateWorkshopLevelList_W_C");
static_assert(sizeof(UUpdateWorkshopLevelList_W_C) == 0x0003B8, "Wrong size on UUpdateWorkshopLevelList_W_C");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, UberGraphFrame) == 0x0002C0, "Member 'UUpdateWorkshopLevelList_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, ChangeNote_EditableTextBox) == 0x0002C8, "Member 'UUpdateWorkshopLevelList_W_C::ChangeNote_EditableTextBox' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, Description_EditableTextBox) == 0x0002D0, "Member 'UUpdateWorkshopLevelList_W_C::Description_EditableTextBox' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, ItemName_EditableTextBox) == 0x0002D8, "Member 'UUpdateWorkshopLevelList_W_C::ItemName_EditableTextBox' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, MyLevels_WrapBox) == 0x0002E0, "Member 'UUpdateWorkshopLevelList_W_C::MyLevels_WrapBox' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, MyWorkshop_ScrollBox) == 0x0002E8, "Member 'UUpdateWorkshopLevelList_W_C::MyWorkshop_ScrollBox' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, Previewfile_EditableTextBox) == 0x0002F0, "Member 'UUpdateWorkshopLevelList_W_C::Previewfile_EditableTextBox' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, Tags_EditableTextBox) == 0x0002F8, "Member 'UUpdateWorkshopLevelList_W_C::Tags_EditableTextBox' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, Visibility_ComboBox) == 0x000300, "Member 'UUpdateWorkshopLevelList_W_C::Visibility_ComboBox' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, Details) == 0x000308, "Member 'UUpdateWorkshopLevelList_W_C::Details' has a wrong offset!");
static_assert(offsetof(UUpdateWorkshopLevelList_W_C, CurrentItemHandle) == 0x0003B0, "Member 'UUpdateWorkshopLevelList_W_C::CurrentItemHandle' has a wrong offset!");

}

