#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UploadUGC_W

#include "Basic.hpp"

#include "SteamCorePro_structs.hpp"
#include "IGLE_ST_GlobalSettings_structs.hpp"


namespace SDK::Params
{

// Function UploadUGC_W.UploadUGC_W_C.ExecuteUbergraph_UploadUGC_W
// 0x0470 (0x0470 - 0x0000)
struct UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreProUGCAsyncActionCreateItem*  CallFunc_CreateItemAsync_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FSubmitItemUpdateResult& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmitItemUpdateResult                K2Node_CustomEvent_Data;                           // 0x0028(0x0010)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmitItemUpdateResult                Temp_struct_Variable;                              // 0x0040(0x0010)(NoDestructor)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	ESteamRemoteStoragePublishedFileVisibility    Temp_byte_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamRemoteStoragePublishedFileVisibility    Temp_byte_Variable_1;                              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamRemoteStoragePublishedFileVisibility    Temp_byte_Variable_2;                              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadSubscribedWorkshop_W_C*        CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreateItemResult                      Temp_struct_Variable_1;                            // 0x00A0(0x0018)(NoDestructor)
	struct FUGCUpdateHandle                       CallFunc_StartItemUpdate_ReturnValue;              // 0x00B8(0x0008)(NoDestructor)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0100(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemTitle_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreProUGCAsyncActionSubmitItemUpdate* CallFunc_SubmitItemUpdateAsync_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0138(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemDescription_ReturnValue;           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x0168(0x0018)()
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemPreview_ReturnValue;               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamRemoteStoragePublishedFileVisibility    K2Node_Select_Default;                             // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemVisibility_ReturnValue;            // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x01A0(0x0018)()
	struct FCreateItemResult                      K2Node_CustomEvent_Data_1;                         // 0x01B8(0x0018)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful_1;               // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x01E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetItemTags_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULocalLevelSlot_W_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0200(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ULocalLevelSlot_W_C*                    CallFunc_Array_Get_Item;                           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLE_ST_GlobalSettings                CallFunc_IGLE_GetGlobalSettings_Settings;          // 0x0220(0x0088)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_IGLE_GetAllSubdirectories_ReturnValue;    // 0x02B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_IGLE_GetFilesWithExtension_ReturnValue;   // 0x0308(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCleanFilename_ReturnValue;             // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLE_ST_GlobalSettings                CallFunc_IGLE_GetGlobalSettings_Settings_1;        // 0x0370(0x0088)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalLevelSlot_W_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0408(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemContent_ReturnValue;               // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FCreateItemResult& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0414(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_4;                    // 0x0428(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_5;                    // 0x0440(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W) == 0x000008, "Wrong alignment on UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W");
static_assert(sizeof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W) == 0x000470, "Wrong size on UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, EntryPoint) == 0x000000, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_CreateItemAsync_ReturnValue) == 0x000008, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_CreateItemAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, K2Node_CustomEvent_Data) == 0x000028, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, K2Node_CustomEvent_bWasSuccessful) == 0x000038, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::K2Node_CustomEvent_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_bool_Variable) == 0x000039, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_struct_Variable) == 0x000040, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000050, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_int_Variable) == 0x000060, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_byte_Variable) == 0x000080, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_byte_Variable_1) == 0x000081, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_byte_Variable_2) == 0x000082, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Create_ReturnValue) == 0x000088, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_int_Loop_Counter_Variable) == 0x000090, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_int_Array_Index_Variable) == 0x000098, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_struct_Variable_1) == 0x0000A0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_StartItemUpdate_ReturnValue) == 0x0000B8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_StartItemUpdate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0000C0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000D0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, K2Node_SwitchEnum_CmpSuccess) == 0x0000E8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_bool_Variable_1) == 0x0000E9, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_int_Array_Index_Variable_1) == 0x0000EC, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_int_Loop_Counter_Variable_1) == 0x0000F0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F4, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_int_Array_Index_Variable_2) == 0x0000F8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetText_ReturnValue) == 0x000100, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Conv_TextToString_ReturnValue) == 0x000118, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_SetItemTitle_ReturnValue) == 0x000128, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_SetItemTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_SubmitItemUpdateAsync_ReturnValue) == 0x000130, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_SubmitItemUpdateAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetText_ReturnValue_1) == 0x000138, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000150, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_IsValid_ReturnValue_1) == 0x000160, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_SetItemDescription_ReturnValue) == 0x000161, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_SetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetText_ReturnValue_2) == 0x000168, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetSelectedIndex_ReturnValue) == 0x000180, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000188, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_SetItemPreview_ReturnValue) == 0x000198, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_SetItemPreview_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, K2Node_Select_Default) == 0x000199, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_SetItemVisibility_ReturnValue) == 0x00019A, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_SetItemVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetText_ReturnValue_3) == 0x0001A0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, K2Node_CustomEvent_Data_1) == 0x0001B8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::K2Node_CustomEvent_Data_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, K2Node_CustomEvent_bWasSuccessful_1) == 0x0001D0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::K2Node_CustomEvent_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0001D8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_ParseIntoArray_ReturnValue) == 0x0001E8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_SetItemTags_ReturnValue) == 0x0001F8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_SetItemTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000200, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Array_Get_Item) == 0x000210, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Array_Length_ReturnValue) == 0x000218, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_IGLE_GetGlobalSettings_Settings) == 0x000220, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_IGLE_GetGlobalSettings_Settings' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, Temp_int_Loop_Counter_Variable_2) == 0x0002A8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_IGLE_GetAllSubdirectories_ReturnValue) == 0x0002B0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_IGLE_GetAllSubdirectories_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Less_IntInt_ReturnValue) == 0x0002C0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Array_Get_Item_1) == 0x0002C8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Concat_StrStr_ReturnValue) == 0x0002D8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Array_Length_ReturnValue_1) == 0x0002E8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0002F0, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Less_IntInt_ReturnValue_1) == 0x000300, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_IGLE_GetFilesWithExtension_ReturnValue) == 0x000308, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_IGLE_GetFilesWithExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Array_Get_Item_2) == 0x000318, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Array_Length_ReturnValue_2) == 0x000328, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetCleanFilename_ReturnValue) == 0x000330, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetCleanFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Less_IntInt_ReturnValue_2) == 0x000340, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000348, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetBaseFilename_ReturnValue) == 0x000358, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Add_IntInt_ReturnValue_2) == 0x000368, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_IGLE_GetGlobalSettings_Settings_1) == 0x000370, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_IGLE_GetGlobalSettings_Settings_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetOwningPlayer_ReturnValue) == 0x0003F8, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Create_ReturnValue_1) == 0x000400, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000408, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_SetItemContent_ReturnValue) == 0x000410, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_SetItemContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, K2Node_CreateDelegate_OutputDelegate_1) == 0x000414, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetText_ReturnValue_4) == 0x000428, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_GetText_ReturnValue_5) == 0x000440, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_GetText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000458, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W, CallFunc_TextIsEmpty_ReturnValue) == 0x000468, "Member 'UploadUGC_W_C_ExecuteUbergraph_UploadUGC_W::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function UploadUGC_W.UploadUGC_W_C.OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB
// 0x0018 (0x0018 - 0x0000)
struct UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB final
{
public:
	struct FSubmitItemUpdateResult                Data;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bWasSuccessful;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB) == 0x000008, "Wrong alignment on UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB");
static_assert(sizeof(UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB) == 0x000018, "Wrong size on UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB");
static_assert(offsetof(UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB, Data) == 0x000000, "Member 'UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB::Data' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB, bWasSuccessful) == 0x000010, "Member 'UploadUGC_W_C_OnCallback_4739FE9A4F2B1D96FC80EE9801D6B6DB::bWasSuccessful' has a wrong offset!");

// Function UploadUGC_W.UploadUGC_W_C.OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF
// 0x0020 (0x0020 - 0x0000)
struct UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF final
{
public:
	struct FCreateItemResult                      Data;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bWasSuccessful;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF) == 0x000008, "Wrong alignment on UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF");
static_assert(sizeof(UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF) == 0x000020, "Wrong size on UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF");
static_assert(offsetof(UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF, Data) == 0x000000, "Member 'UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF::Data' has a wrong offset!");
static_assert(offsetof(UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF, bWasSuccessful) == 0x000018, "Member 'UploadUGC_W_C_OnCallback_6323929A47D867C7CBDC2E8AC4BD04EF::bWasSuccessful' has a wrong offset!");

}

