#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryBPLibrary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "VictoryBPLibrary_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function VictoryBPLibrary.RamaColorPicker.SetJoyColor
// 0x0014 (0x0014 - 0x0000)
struct RamaColorPicker_SetJoyColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkipAnimation;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B02[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RamaColorPicker_SetJoyColor) == 0x000004, "Wrong alignment on RamaColorPicker_SetJoyColor");
static_assert(sizeof(RamaColorPicker_SetJoyColor) == 0x000014, "Wrong size on RamaColorPicker_SetJoyColor");
static_assert(offsetof(RamaColorPicker_SetJoyColor, NewColor) == 0x000000, "Member 'RamaColorPicker_SetJoyColor::NewColor' has a wrong offset!");
static_assert(offsetof(RamaColorPicker_SetJoyColor, SkipAnimation) == 0x000010, "Member 'RamaColorPicker_SetJoyColor::SkipAnimation' has a wrong offset!");

// Function VictoryBPLibrary.RamaVictoryPluginCreateProcessPipe.CreatePipe
// 0x0001 (0x0001 - 0x0000)
struct RamaVictoryPluginCreateProcessPipe_CreatePipe final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RamaVictoryPluginCreateProcessPipe_CreatePipe) == 0x000001, "Wrong alignment on RamaVictoryPluginCreateProcessPipe_CreatePipe");
static_assert(sizeof(RamaVictoryPluginCreateProcessPipe_CreatePipe) == 0x000001, "Wrong size on RamaVictoryPluginCreateProcessPipe_CreatePipe");
static_assert(offsetof(RamaVictoryPluginCreateProcessPipe_CreatePipe, ReturnValue) == 0x000000, "Member 'RamaVictoryPluginCreateProcessPipe_CreatePipe::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.RamaVictoryPluginCreateProcessPipe.PipeIsValid
// 0x0001 (0x0001 - 0x0000)
struct RamaVictoryPluginCreateProcessPipe_PipeIsValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RamaVictoryPluginCreateProcessPipe_PipeIsValid) == 0x000001, "Wrong alignment on RamaVictoryPluginCreateProcessPipe_PipeIsValid");
static_assert(sizeof(RamaVictoryPluginCreateProcessPipe_PipeIsValid) == 0x000001, "Wrong size on RamaVictoryPluginCreateProcessPipe_PipeIsValid");
static_assert(offsetof(RamaVictoryPluginCreateProcessPipe_PipeIsValid, ReturnValue) == 0x000000, "Member 'RamaVictoryPluginCreateProcessPipe_PipeIsValid::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.RamaVictoryPluginCreateProcessPipe.ReadFromPipe
// 0x0018 (0x0018 - 0x0000)
struct RamaVictoryPluginCreateProcessPipe_ReadFromPipe final
{
public:
	class FString                                 PipeContents;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B04[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RamaVictoryPluginCreateProcessPipe_ReadFromPipe) == 0x000008, "Wrong alignment on RamaVictoryPluginCreateProcessPipe_ReadFromPipe");
static_assert(sizeof(RamaVictoryPluginCreateProcessPipe_ReadFromPipe) == 0x000018, "Wrong size on RamaVictoryPluginCreateProcessPipe_ReadFromPipe");
static_assert(offsetof(RamaVictoryPluginCreateProcessPipe_ReadFromPipe, PipeContents) == 0x000000, "Member 'RamaVictoryPluginCreateProcessPipe_ReadFromPipe::PipeContents' has a wrong offset!");
static_assert(offsetof(RamaVictoryPluginCreateProcessPipe_ReadFromPipe, ReturnValue) == 0x000010, "Member 'RamaVictoryPluginCreateProcessPipe_ReadFromPipe::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.Accessor__GetPlayerController
// 0x0018 (0x0018 - 0x0000)
struct VictoryBPFunctionLibrary_Accessor__GetPlayerController final
{
public:
	class AActor*                                 TheCharacter;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B05[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_Accessor__GetPlayerController) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_Accessor__GetPlayerController");
static_assert(sizeof(VictoryBPFunctionLibrary_Accessor__GetPlayerController) == 0x000018, "Wrong size on VictoryBPFunctionLibrary_Accessor__GetPlayerController");
static_assert(offsetof(VictoryBPFunctionLibrary_Accessor__GetPlayerController, TheCharacter) == 0x000000, "Member 'VictoryBPFunctionLibrary_Accessor__GetPlayerController::TheCharacter' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Accessor__GetPlayerController, IsValid) == 0x000008, "Member 'VictoryBPFunctionLibrary_Accessor__GetPlayerController::IsValid' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Accessor__GetPlayerController, ReturnValue) == 0x000010, "Member 'VictoryBPFunctionLibrary_Accessor__GetPlayerController::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.Animation__GetAimOffsets
// 0x0018 (0x0018 - 0x0000)
struct VictoryBPFunctionLibrary_Animation__GetAimOffsets final
{
public:
	class AActor*                                 AnimBPOwner;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B06[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_Animation__GetAimOffsets) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_Animation__GetAimOffsets");
static_assert(sizeof(VictoryBPFunctionLibrary_Animation__GetAimOffsets) == 0x000018, "Wrong size on VictoryBPFunctionLibrary_Animation__GetAimOffsets");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsets, AnimBPOwner) == 0x000000, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsets::AnimBPOwner' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsets, Pitch) == 0x000008, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsets::Pitch' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsets, Yaw) == 0x00000C, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsets::Yaw' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsets, ReturnValue) == 0x000010, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsets::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.Animation__GetAimOffsetsFromRotation
// 0x0030 (0x0030 - 0x0000)
struct VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation final
{
public:
	class AActor*                                 AnimBPOwner;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TheRotation;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B07[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation");
static_assert(sizeof(VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation) == 0x000030, "Wrong size on VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation, AnimBPOwner) == 0x000000, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation::AnimBPOwner' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation, TheRotation) == 0x000008, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation::TheRotation' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation, Pitch) == 0x000020, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation::Pitch' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation, Yaw) == 0x000024, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation::Yaw' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation, ReturnValue) == 0x000028, "Member 'VictoryBPFunctionLibrary_Animation__GetAimOffsetsFromRotation::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.Capture2D_Project
// 0x0038 (0x0038 - 0x0000)
struct VictoryBPFunctionLibrary_Capture2D_Project final
{
public:
	class ASceneCapture2D*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              OutPixelLocation;                                  // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B08[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_Capture2D_Project) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_Capture2D_Project");
static_assert(sizeof(VictoryBPFunctionLibrary_Capture2D_Project) == 0x000038, "Wrong size on VictoryBPFunctionLibrary_Capture2D_Project");
static_assert(offsetof(VictoryBPFunctionLibrary_Capture2D_Project, Target) == 0x000000, "Member 'VictoryBPFunctionLibrary_Capture2D_Project::Target' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Capture2D_Project, Location) == 0x000008, "Member 'VictoryBPFunctionLibrary_Capture2D_Project::Location' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Capture2D_Project, OutPixelLocation) == 0x000020, "Member 'VictoryBPFunctionLibrary_Capture2D_Project::OutPixelLocation' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Capture2D_Project, ReturnValue) == 0x000030, "Member 'VictoryBPFunctionLibrary_Capture2D_Project::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.Capture2D_SaveImage
// 0x0030 (0x0030 - 0x0000)
struct VictoryBPFunctionLibrary_Capture2D_SaveImage final
{
public:
	class ASceneCapture2D*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImagePath;                                         // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ClearColour;                                       // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B09[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_Capture2D_SaveImage) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_Capture2D_SaveImage");
static_assert(sizeof(VictoryBPFunctionLibrary_Capture2D_SaveImage) == 0x000030, "Wrong size on VictoryBPFunctionLibrary_Capture2D_SaveImage");
static_assert(offsetof(VictoryBPFunctionLibrary_Capture2D_SaveImage, Target) == 0x000000, "Member 'VictoryBPFunctionLibrary_Capture2D_SaveImage::Target' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Capture2D_SaveImage, ImagePath) == 0x000008, "Member 'VictoryBPFunctionLibrary_Capture2D_SaveImage::ImagePath' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Capture2D_SaveImage, ClearColour) == 0x000018, "Member 'VictoryBPFunctionLibrary_Capture2D_SaveImage::ClearColour' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_Capture2D_SaveImage, ReturnValue) == 0x000028, "Member 'VictoryBPFunctionLibrary_Capture2D_SaveImage::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.CaptureComponent2D_Project
// 0x0038 (0x0038 - 0x0000)
struct VictoryBPFunctionLibrary_CaptureComponent2D_Project final
{
public:
	class USceneCaptureComponent2D*               Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              OutPixelLocation;                                  // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0A[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_CaptureComponent2D_Project) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_CaptureComponent2D_Project");
static_assert(sizeof(VictoryBPFunctionLibrary_CaptureComponent2D_Project) == 0x000038, "Wrong size on VictoryBPFunctionLibrary_CaptureComponent2D_Project");
static_assert(offsetof(VictoryBPFunctionLibrary_CaptureComponent2D_Project, Target) == 0x000000, "Member 'VictoryBPFunctionLibrary_CaptureComponent2D_Project::Target' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CaptureComponent2D_Project, Location) == 0x000008, "Member 'VictoryBPFunctionLibrary_CaptureComponent2D_Project::Location' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CaptureComponent2D_Project, OutPixelLocation) == 0x000020, "Member 'VictoryBPFunctionLibrary_CaptureComponent2D_Project::OutPixelLocation' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CaptureComponent2D_Project, ReturnValue) == 0x000030, "Member 'VictoryBPFunctionLibrary_CaptureComponent2D_Project::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.CaptureComponent2D_SaveImage
// 0x0030 (0x0030 - 0x0000)
struct VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage final
{
public:
	class USceneCaptureComponent2D*               Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImagePath;                                         // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ClearColour;                                       // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0B[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage");
static_assert(sizeof(VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage) == 0x000030, "Wrong size on VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage");
static_assert(offsetof(VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage, Target) == 0x000000, "Member 'VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage::Target' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage, ImagePath) == 0x000008, "Member 'VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage::ImagePath' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage, ClearColour) == 0x000018, "Member 'VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage::ClearColour' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage, ReturnValue) == 0x000028, "Member 'VictoryBPFunctionLibrary_CaptureComponent2D_SaveImage::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.ClientWindow__GameWindowIsForeGroundInOS
// 0x0001 (0x0001 - 0x0000)
struct VictoryBPFunctionLibrary_ClientWindow__GameWindowIsForeGroundInOS final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_ClientWindow__GameWindowIsForeGroundInOS) == 0x000001, "Wrong alignment on VictoryBPFunctionLibrary_ClientWindow__GameWindowIsForeGroundInOS");
static_assert(sizeof(VictoryBPFunctionLibrary_ClientWindow__GameWindowIsForeGroundInOS) == 0x000001, "Wrong size on VictoryBPFunctionLibrary_ClientWindow__GameWindowIsForeGroundInOS");
static_assert(offsetof(VictoryBPFunctionLibrary_ClientWindow__GameWindowIsForeGroundInOS, ReturnValue) == 0x000000, "Member 'VictoryBPFunctionLibrary_ClientWindow__GameWindowIsForeGroundInOS::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.ClosestPointsOfLineSegments
// 0x0090 (0x0090 - 0x0000)
struct VictoryBPFunctionLibrary_ClosestPointsOfLineSegments final
{
public:
	struct FVector                                Line1Start;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Line1End;                                          // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Line2Start;                                        // 0x0030(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Line2End;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint1;                                        // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint2;                                        // 0x0078(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_ClosestPointsOfLineSegments) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_ClosestPointsOfLineSegments");
static_assert(sizeof(VictoryBPFunctionLibrary_ClosestPointsOfLineSegments) == 0x000090, "Wrong size on VictoryBPFunctionLibrary_ClosestPointsOfLineSegments");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOfLineSegments, Line1Start) == 0x000000, "Member 'VictoryBPFunctionLibrary_ClosestPointsOfLineSegments::Line1Start' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOfLineSegments, Line1End) == 0x000018, "Member 'VictoryBPFunctionLibrary_ClosestPointsOfLineSegments::Line1End' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOfLineSegments, Line2Start) == 0x000030, "Member 'VictoryBPFunctionLibrary_ClosestPointsOfLineSegments::Line2Start' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOfLineSegments, Line2End) == 0x000048, "Member 'VictoryBPFunctionLibrary_ClosestPointsOfLineSegments::Line2End' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOfLineSegments, LinePoint1) == 0x000060, "Member 'VictoryBPFunctionLibrary_ClosestPointsOfLineSegments::LinePoint1' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOfLineSegments, LinePoint2) == 0x000078, "Member 'VictoryBPFunctionLibrary_ClosestPointsOfLineSegments::LinePoint2' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.ClosestPointsOnTwoLines
// 0x0098 (0x0098 - 0x0000)
struct VictoryBPFunctionLibrary_ClosestPointsOnTwoLines final
{
public:
	struct FVector                                ClosestPointLine1;                                 // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClosestPointLine2;                                 // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint1;                                        // 0x0030(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineVec1;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint2;                                        // 0x0060(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineVec2;                                          // 0x0078(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0C[0x7];                                     // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_ClosestPointsOnTwoLines");
static_assert(sizeof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines) == 0x000098, "Wrong size on VictoryBPFunctionLibrary_ClosestPointsOnTwoLines");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines, ClosestPointLine1) == 0x000000, "Member 'VictoryBPFunctionLibrary_ClosestPointsOnTwoLines::ClosestPointLine1' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines, ClosestPointLine2) == 0x000018, "Member 'VictoryBPFunctionLibrary_ClosestPointsOnTwoLines::ClosestPointLine2' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines, LinePoint1) == 0x000030, "Member 'VictoryBPFunctionLibrary_ClosestPointsOnTwoLines::LinePoint1' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines, LineVec1) == 0x000048, "Member 'VictoryBPFunctionLibrary_ClosestPointsOnTwoLines::LineVec1' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines, LinePoint2) == 0x000060, "Member 'VictoryBPFunctionLibrary_ClosestPointsOnTwoLines::LinePoint2' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines, LineVec2) == 0x000078, "Member 'VictoryBPFunctionLibrary_ClosestPointsOnTwoLines::LineVec2' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_ClosestPointsOnTwoLines, ReturnValue) == 0x000090, "Member 'VictoryBPFunctionLibrary_ClosestPointsOnTwoLines::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.CreateStaticMeshAssetFromDynamicMesh
// 0x0048 (0x0048 - 0x0000)
struct VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh final
{
public:
	class FString                                 ContentFolderPath;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMeshComponent*                  DynamicMeshComp;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Status;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewAssetFilePath;                                  // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0D[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh");
static_assert(sizeof(VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh) == 0x000048, "Wrong size on VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh");
static_assert(offsetof(VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh, ContentFolderPath) == 0x000000, "Member 'VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh::ContentFolderPath' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh, DynamicMeshComp) == 0x000010, "Member 'VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh::DynamicMeshComp' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh, Status) == 0x000018, "Member 'VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh::Status' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh, NewAssetFilePath) == 0x000028, "Member 'VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh::NewAssetFilePath' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh, Success) == 0x000038, "Member 'VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh::Success' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh, ReturnValue) == 0x000040, "Member 'VictoryBPFunctionLibrary_CreateStaticMeshAssetFromDynamicMesh::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.FileIO__SaveStringArrayToFile
// 0x0038 (0x0038 - 0x0000)
struct VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile final
{
public:
	class FString                                 SaveDirectory;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JoyfulFileName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SaveText;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          AllowOverWriting;                                  // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowAppend;                                       // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0E[0x5];                                     // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile");
static_assert(sizeof(VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile) == 0x000038, "Wrong size on VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile, SaveDirectory) == 0x000000, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile::SaveDirectory' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile, JoyfulFileName) == 0x000010, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile::JoyfulFileName' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile, SaveText) == 0x000020, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile::SaveText' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile, AllowOverWriting) == 0x000030, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile::AllowOverWriting' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile, AllowAppend) == 0x000031, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile::AllowAppend' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile, ReturnValue) == 0x000032, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringArrayToFile::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.FileIO__SaveStringTextToFile
// 0x0038 (0x0038 - 0x0000)
struct VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile final
{
public:
	class FString                                 SaveDirectory;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JoyfulFileName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveText;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowOverWriting;                                  // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowAppend;                                       // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0F[0x5];                                     // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile");
static_assert(sizeof(VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile) == 0x000038, "Wrong size on VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile, SaveDirectory) == 0x000000, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile::SaveDirectory' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile, JoyfulFileName) == 0x000010, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile::JoyfulFileName' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile, SaveText) == 0x000020, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile::SaveText' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile, AllowOverWriting) == 0x000030, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile::AllowOverWriting' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile, AllowAppend) == 0x000031, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile::AllowAppend' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile, ReturnValue) == 0x000032, "Member 'VictoryBPFunctionLibrary_FileIO__SaveStringTextToFile::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.FlashGameOnTaskBar
// 0x0018 (0x0018 - 0x0000)
struct VictoryBPFunctionLibrary_FlashGameOnTaskBar final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FlashContinuous;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B10[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxFlashCount;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FlashFrequencyMilliseconds;                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B11[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_FlashGameOnTaskBar) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_FlashGameOnTaskBar");
static_assert(sizeof(VictoryBPFunctionLibrary_FlashGameOnTaskBar) == 0x000018, "Wrong size on VictoryBPFunctionLibrary_FlashGameOnTaskBar");
static_assert(offsetof(VictoryBPFunctionLibrary_FlashGameOnTaskBar, PC) == 0x000000, "Member 'VictoryBPFunctionLibrary_FlashGameOnTaskBar::PC' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FlashGameOnTaskBar, FlashContinuous) == 0x000008, "Member 'VictoryBPFunctionLibrary_FlashGameOnTaskBar::FlashContinuous' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FlashGameOnTaskBar, MaxFlashCount) == 0x00000C, "Member 'VictoryBPFunctionLibrary_FlashGameOnTaskBar::MaxFlashCount' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_FlashGameOnTaskBar, FlashFrequencyMilliseconds) == 0x000010, "Member 'VictoryBPFunctionLibrary_FlashGameOnTaskBar::FlashFrequencyMilliseconds' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.GenerateUniqueContentRelativeFileName
// 0x0038 (0x0038 - 0x0000)
struct VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName final
{
public:
	class FString                                 ContentRelativeFilePath;                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentRelativeNewFileName;                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AbsolutePath;                                      // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CreateFolderTree;                                  // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B12[0x6];                                     // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName");
static_assert(sizeof(VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName) == 0x000038, "Wrong size on VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName");
static_assert(offsetof(VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName, ContentRelativeFilePath) == 0x000000, "Member 'VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName::ContentRelativeFilePath' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName, ContentRelativeNewFileName) == 0x000010, "Member 'VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName::ContentRelativeNewFileName' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName, AbsolutePath) == 0x000020, "Member 'VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName::AbsolutePath' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName, CreateFolderTree) == 0x000030, "Member 'VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName::CreateFolderTree' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName, ReturnValue) == 0x000031, "Member 'VictoryBPFunctionLibrary_GenerateUniqueContentRelativeFileName::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.GetAllBoneNamesBelowBone
// 0x0028 (0x0028 - 0x0000)
struct VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComp;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartingBoneName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B13[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone");
static_assert(sizeof(VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone) == 0x000028, "Wrong size on VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone");
static_assert(offsetof(VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone, SkeletalMeshComp) == 0x000000, "Member 'VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone::SkeletalMeshComp' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone, StartingBoneName) == 0x000008, "Member 'VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone::StartingBoneName' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone, BoneNames) == 0x000010, "Member 'VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone::BoneNames' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone, ReturnValue) == 0x000020, "Member 'VictoryBPFunctionLibrary_GetAllBoneNamesBelowBone::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.GetClosestActorOfClassInRadiusOfActor
// 0x0028 (0x0028 - 0x0000)
struct VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorCenter;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B14[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor");
static_assert(sizeof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor) == 0x000028, "Wrong size on VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor, WorldContextObject) == 0x000000, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor, ActorClass) == 0x000008, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor::ActorClass' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor, ActorCenter) == 0x000010, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor::ActorCenter' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor, Radius) == 0x000018, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor::Radius' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor, IsValid) == 0x00001C, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor::IsValid' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor, ReturnValue) == 0x000020, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfActor::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.GetClosestActorOfClassInRadiusOfLocation
// 0x0038 (0x0038 - 0x0000)
struct VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Center;                                            // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B15[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation");
static_assert(sizeof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation) == 0x000038, "Wrong size on VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation, WorldContextObject) == 0x000000, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation::WorldContextObject' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation, ActorClass) == 0x000008, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation::ActorClass' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation, Center) == 0x000010, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation::Center' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation, Radius) == 0x000028, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation::Radius' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation, IsValid) == 0x00002C, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation::IsValid' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation, ReturnValue) == 0x000030, "Member 'VictoryBPFunctionLibrary_GetClosestActorOfClassInRadiusOfLocation::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.GetFirstWidgetOfClass
// 0x0020 (0x0020 - 0x0000)
struct VictoryBPFunctionLibrary_GetFirstWidgetOfClass final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TopLevelOnly;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B16[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_GetFirstWidgetOfClass) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_GetFirstWidgetOfClass");
static_assert(sizeof(VictoryBPFunctionLibrary_GetFirstWidgetOfClass) == 0x000020, "Wrong size on VictoryBPFunctionLibrary_GetFirstWidgetOfClass");
static_assert(offsetof(VictoryBPFunctionLibrary_GetFirstWidgetOfClass, WorldContextObject) == 0x000000, "Member 'VictoryBPFunctionLibrary_GetFirstWidgetOfClass::WorldContextObject' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetFirstWidgetOfClass, WidgetClass) == 0x000008, "Member 'VictoryBPFunctionLibrary_GetFirstWidgetOfClass::WidgetClass' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetFirstWidgetOfClass, TopLevelOnly) == 0x000010, "Member 'VictoryBPFunctionLibrary_GetFirstWidgetOfClass::TopLevelOnly' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetFirstWidgetOfClass, ReturnValue) == 0x000018, "Member 'VictoryBPFunctionLibrary_GetFirstWidgetOfClass::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.GetNamesOfLoadedLevels
// 0x0018 (0x0018 - 0x0000)
struct VictoryBPFunctionLibrary_GetNamesOfLoadedLevels final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         NamesOfLoadedLevels;                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_GetNamesOfLoadedLevels) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_GetNamesOfLoadedLevels");
static_assert(sizeof(VictoryBPFunctionLibrary_GetNamesOfLoadedLevels) == 0x000018, "Wrong size on VictoryBPFunctionLibrary_GetNamesOfLoadedLevels");
static_assert(offsetof(VictoryBPFunctionLibrary_GetNamesOfLoadedLevels, WorldContextObject) == 0x000000, "Member 'VictoryBPFunctionLibrary_GetNamesOfLoadedLevels::WorldContextObject' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetNamesOfLoadedLevels, NamesOfLoadedLevels) == 0x000008, "Member 'VictoryBPFunctionLibrary_GetNamesOfLoadedLevels::NamesOfLoadedLevels' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.GetObjectPath
// 0x0010 (0x0010 - 0x0000)
struct VictoryBPFunctionLibrary_GetObjectPath final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryBPFunctionLibrary_GetObjectPath) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_GetObjectPath");
static_assert(sizeof(VictoryBPFunctionLibrary_GetObjectPath) == 0x000010, "Wrong size on VictoryBPFunctionLibrary_GetObjectPath");
static_assert(offsetof(VictoryBPFunctionLibrary_GetObjectPath, Obj) == 0x000000, "Member 'VictoryBPFunctionLibrary_GetObjectPath::Obj' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetObjectPath, ReturnValue) == 0x000008, "Member 'VictoryBPFunctionLibrary_GetObjectPath::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryBPFunctionLibrary.GetStaticMeshVertexLocations
// 0x0020 (0x0020 - 0x0000)
struct VictoryBPFunctionLibrary_GetStaticMeshVertexLocations final
{
public:
	class UStaticMeshComponent*                   Comp;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VertexPositions;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B17[0x3];                                     // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryBPFunctionLibrary_GetStaticMeshVertexLocations) == 0x000008, "Wrong alignment on VictoryBPFunctionLibrary_GetStaticMeshVertexLocations");
static_assert(sizeof(VictoryBPFunctionLibrary_GetStaticMeshVertexLocations) == 0x000020, "Wrong size on VictoryBPFunctionLibrary_GetStaticMeshVertexLocations");
static_assert(offsetof(VictoryBPFunctionLibrary_GetStaticMeshVertexLocations, Comp) == 0x000000, "Member 'VictoryBPFunctionLibrary_GetStaticMeshVertexLocations::Comp' has a wrong offset!");
static_assert(offsetof(VictoryBPFunctionLibrary_GetStaticMeshVertexLocations, VertexPositions) == 0x000008, "Member 'VictoryBPFunctionLibrary_GetStaticMeshVertexLocations::VertexPositions' has a wrong offset!");
