#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_321Go

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_321Go.W_321Go_C.ExecuteUbergraph_W_321Go
// 0x0060 (0x0060 - 0x0000)
struct W_321Go_C_ExecuteUbergraph_W_321Go final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_3;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSound2D_PitchMultiplier_ImplicitCast; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_321Go_C_ExecuteUbergraph_W_321Go) == 0x000008, "Wrong alignment on W_321Go_C_ExecuteUbergraph_W_321Go");
static_assert(sizeof(W_321Go_C_ExecuteUbergraph_W_321Go) == 0x000060, "Wrong size on W_321Go_C_ExecuteUbergraph_W_321Go");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, EntryPoint) == 0x000000, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_SpawnSound2D_ReturnValue) == 0x000030, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000038, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000040, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_SpawnSound2D_ReturnValue_3) == 0x000048, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_SpawnSound2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_321Go_C_ExecuteUbergraph_W_321Go, CallFunc_SpawnSound2D_PitchMultiplier_ImplicitCast) == 0x000058, "Member 'W_321Go_C_ExecuteUbergraph_W_321Go::CallFunc_SpawnSound2D_PitchMultiplier_ImplicitCast' has a wrong offset!");

}

