#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BackToMainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BackToMainMenu.W_BackToMainMenu_C
// 0x0018 (0x02D8 - 0x02C0)
class UW_BackToMainMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_23;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool AllPC_Ended();
	void BndEvt__W_BackToMainMenu_Button_23_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_BackToMainMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BackToMainMenu_C">();
	}
	static class UW_BackToMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BackToMainMenu_C>();
	}
};
static_assert(alignof(UW_BackToMainMenu_C) == 0x000008, "Wrong alignment on UW_BackToMainMenu_C");
static_assert(sizeof(UW_BackToMainMenu_C) == 0x0002D8, "Wrong size on UW_BackToMainMenu_C");
static_assert(offsetof(UW_BackToMainMenu_C, UberGraphFrame) == 0x0002C0, "Member 'UW_BackToMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BackToMainMenu_C, NewAnimation) == 0x0002C8, "Member 'UW_BackToMainMenu_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_BackToMainMenu_C, Button_23) == 0x0002D0, "Member 'UW_BackToMainMenu_C::Button_23' has a wrong offset!");

}

