#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Button

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Button.W_Button_C.ExecuteUbergraph_W_Button
// 0x0018 (0x0018 - 0x0000)
struct W_Button_C_ExecuteUbergraph_W_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3481[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_ExecuteUbergraph_W_Button) == 0x000008, "Wrong alignment on W_Button_C_ExecuteUbergraph_W_Button");
static_assert(sizeof(W_Button_C_ExecuteUbergraph_W_Button) == 0x000018, "Wrong size on W_Button_C_ExecuteUbergraph_W_Button");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, EntryPoint) == 0x000000, "Member 'W_Button_C_ExecuteUbergraph_W_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_SpawnSound2D_ReturnValue) == 0x000010, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

// Function W_Button.W_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_PreConstruct) == 0x000001, "Wrong alignment on W_Button_C_PreConstruct");
static_assert(sizeof(W_Button_C_PreConstruct) == 0x000001, "Wrong size on W_Button_C_PreConstruct");
static_assert(offsetof(W_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

