#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CarUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CarUI.W_CarUI_C
// 0x0048 (0x0308 - 0x02C0)
class UW_CarUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_69;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_33;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsElevatorTruck;                                   // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_W_CarUI(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CarUI_C">();
	}
	static class UW_CarUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CarUI_C>();
	}
};
static_assert(alignof(UW_CarUI_C) == 0x000008, "Wrong alignment on UW_CarUI_C");
static_assert(sizeof(UW_CarUI_C) == 0x000308, "Wrong size on UW_CarUI_C");
static_assert(offsetof(UW_CarUI_C, UberGraphFrame) == 0x0002C0, "Member 'UW_CarUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CarUI_C, HorizontalBox) == 0x0002C8, "Member 'UW_CarUI_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UW_CarUI_C, Image) == 0x0002D0, "Member 'UW_CarUI_C::Image' has a wrong offset!");
static_assert(offsetof(UW_CarUI_C, Image_69) == 0x0002D8, "Member 'UW_CarUI_C::Image_69' has a wrong offset!");
static_assert(offsetof(UW_CarUI_C, TextBlock_2) == 0x0002E0, "Member 'UW_CarUI_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UW_CarUI_C, TextBlock_33) == 0x0002E8, "Member 'UW_CarUI_C::TextBlock_33' has a wrong offset!");
static_assert(offsetof(UW_CarUI_C, WidgetSwitcher) == 0x0002F0, "Member 'UW_CarUI_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UW_CarUI_C, WidgetSwitcher_0) == 0x0002F8, "Member 'UW_CarUI_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UW_CarUI_C, IsElevatorTruck) == 0x000300, "Member 'UW_CarUI_C::IsElevatorTruck' has a wrong offset!");

}

