#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterSelector

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_CharacterSelector.W_CharacterSelector_C.ExecuteUbergraph_W_CharacterSelector
// 0x0058 (0x0058 - 0x0000)
struct W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD1[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	TArray<class UW_CharacterSlot_C*>             K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD2[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_CharacterSlot_C*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector) == 0x000008, "Wrong alignment on W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector");
static_assert(sizeof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector) == 0x000058, "Wrong size on W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, EntryPoint) == 0x000000, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x000010, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, K2Node_MakeArray_Array) == 0x000030, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, CallFunc_Array_Get_Item) == 0x000048, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'W_CharacterSelector_C_ExecuteUbergraph_W_CharacterSelector::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

