#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_CharacterSlot.W_CharacterSlot_C.ExecuteUbergraph_W_CharacterSlot
// 0x00B0 (0x00B0 - 0x0000)
struct W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9F[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Select;                         // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA0[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_CharacterSlot_C*>             CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_CharacterSlot_C*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA1[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APC_Game_C*                             K2Node_DynamicCast_AsPC_Game;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA2[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game;                      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA3[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_LobbyCharacter_C*>           CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0080(0x0010)(ReferenceParm)
	class ABP_LobbyCharacter_C*                   CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LobbyCharacter_C> K2Node_DynamicCast_AsBPI_Lobby_Character;          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot) == 0x000008, "Wrong alignment on W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot");
static_assert(sizeof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot) == 0x0000B0, "Wrong size on W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, EntryPoint) == 0x000000, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_byte_Variable) == 0x000004, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_byte_Variable_1) == 0x000005, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_int_Array_Index_Variable) == 0x000008, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_Event_IsDesignTime) == 0x000014, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_CustomEvent_Select) == 0x000016, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_CustomEvent_Select' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000018, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Array_Get_Item) == 0x000028, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_AsPC_Game) == 0x000040, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_AsPC_Game' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000049, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Conv_IntToString_ReturnValue) == 0x000050, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetGameState_ReturnValue) == 0x000060, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Conv_StringToName_ReturnValue) == 0x000068, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_AsGS_Game) == 0x000070, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_AsGS_Game' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000080, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_AsBPI_Lobby_Character) == 0x000098, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_AsBPI_Lobby_Character' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x0000A9, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_bool_Variable) == 0x0000AA, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_Select_Default) == 0x0000AB, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_Select_Default' has a wrong offset!");

// Function W_CharacterSlot.W_CharacterSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterSlot_C_PreConstruct) == 0x000001, "Wrong alignment on W_CharacterSlot_C_PreConstruct");
static_assert(sizeof(W_CharacterSlot_C_PreConstruct) == 0x000001, "Wrong size on W_CharacterSlot_C_PreConstruct");
static_assert(offsetof(W_CharacterSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CharacterSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CharacterSlot.W_CharacterSlot_C.Select
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterSlot_C_Select final
{
public:
	bool                                          Param_Select;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterSlot_C_Select) == 0x000001, "Wrong alignment on W_CharacterSlot_C_Select");
static_assert(sizeof(W_CharacterSlot_C_Select) == 0x000001, "Wrong size on W_CharacterSlot_C_Select");
static_assert(offsetof(W_CharacterSlot_C_Select, Param_Select) == 0x000000, "Member 'W_CharacterSlot_C_Select::Param_Select' has a wrong offset!");

}

