#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_ChoosenChar_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharacterSlot.W_CharacterSlot_C
// 0x0038 (0x02F8 - 0x02C0)
class UW_CharacterSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                DetectiveButton;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_ChoosenChar                                 Char;                                              // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E9E[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Lobby_C*                             Parent;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_CharacterSlot_DetectiveButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_W_CharacterSlot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Select(bool Param_Select);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CharacterSlot_C">();
	}
	static class UW_CharacterSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CharacterSlot_C>();
	}
};
static_assert(alignof(UW_CharacterSlot_C) == 0x000008, "Wrong alignment on UW_CharacterSlot_C");
static_assert(sizeof(UW_CharacterSlot_C) == 0x0002F8, "Wrong size on UW_CharacterSlot_C");
static_assert(offsetof(UW_CharacterSlot_C, UberGraphFrame) == 0x0002C0, "Member 'UW_CharacterSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CharacterSlot_C, DetectiveButton) == 0x0002C8, "Member 'UW_CharacterSlot_C::DetectiveButton' has a wrong offset!");
static_assert(offsetof(UW_CharacterSlot_C, Image_73) == 0x0002D0, "Member 'UW_CharacterSlot_C::Image_73' has a wrong offset!");
static_assert(offsetof(UW_CharacterSlot_C, Selected) == 0x0002D8, "Member 'UW_CharacterSlot_C::Selected' has a wrong offset!");
static_assert(offsetof(UW_CharacterSlot_C, Char) == 0x0002E0, "Member 'UW_CharacterSlot_C::Char' has a wrong offset!");
static_assert(offsetof(UW_CharacterSlot_C, Parent) == 0x0002E8, "Member 'UW_CharacterSlot_C::Parent' has a wrong offset!");
static_assert(offsetof(UW_CharacterSlot_C, PlayerIndex) == 0x0002F0, "Member 'UW_CharacterSlot_C::PlayerIndex' has a wrong offset!");

}

