#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharacterSelector.W_CharacterSelector_C
// 0x0050 (0x0310 - 0x02C0)
class UW_CharacterSelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_167;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_79;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSlot_C*                     W_CharacterSlot;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSlot_C*                     W_CharacterSlot_1;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSlot_C*                     W_CharacterSlot_3;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSlot_C*                     W_CharacterSlot_4;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_CharacterSelector(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CharacterSelector_C">();
	}
	static class UW_CharacterSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CharacterSelector_C>();
	}
};
static_assert(alignof(UW_CharacterSelector_C) == 0x000008, "Wrong alignment on UW_CharacterSelector_C");
static_assert(sizeof(UW_CharacterSelector_C) == 0x000310, "Wrong size on UW_CharacterSelector_C");
static_assert(offsetof(UW_CharacterSelector_C, UberGraphFrame) == 0x0002C0, "Member 'UW_CharacterSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelector_C, Image_167) == 0x0002C8, "Member 'UW_CharacterSelector_C::Image_167' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelector_C, TextBlock_79) == 0x0002D0, "Member 'UW_CharacterSelector_C::TextBlock_79' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelector_C, W_CharacterSlot) == 0x0002D8, "Member 'UW_CharacterSelector_C::W_CharacterSlot' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelector_C, W_CharacterSlot_1) == 0x0002E0, "Member 'UW_CharacterSelector_C::W_CharacterSlot_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelector_C, W_CharacterSlot_3) == 0x0002E8, "Member 'UW_CharacterSelector_C::W_CharacterSlot_3' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelector_C, W_CharacterSlot_4) == 0x0002F0, "Member 'UW_CharacterSelector_C::W_CharacterSlot_4' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelector_C, Text) == 0x0002F8, "Member 'UW_CharacterSelector_C::Text' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelector_C, PlayerIndex) == 0x000308, "Member 'UW_CharacterSelector_C::PlayerIndex' has a wrong offset!");

}

