#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_CharacterSlot.W_CharacterSlot_C.ExecuteUbergraph_W_CharacterSlot
// 0x00B8 (0x00B8 - 0x0000)
struct W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerController_C> K2Node_DynamicCast_AsBPI_Player_Controller;        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Select;                         // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Right;                          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0088(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LobbyCharacter_C> K2Node_DynamicCast_AsBPI_Lobby_Character;          // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot) == 0x000008, "Wrong alignment on W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot");
static_assert(sizeof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot) == 0x0000B8, "Wrong size on W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, EntryPoint) == 0x000000, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_bool_Variable) == 0x000004, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_byte_Variable) == 0x000005, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_byte_Variable_1) == 0x000006, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_bool_Variable_1) == 0x000007, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_byte_Variable_2) == 0x000008, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, Temp_byte_Variable_3) == 0x000009, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_AsBPI_Player_Controller) == 0x000018, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_AsBPI_Player_Controller' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_Event_IsDesignTime) == 0x000029, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_CustomEvent_Select) == 0x00002B, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_CustomEvent_Select' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_Select_Default) == 0x00002C, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_AsBPI_Gamestate) == 0x000050, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x000061, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_CustomEvent_Right) == 0x000062, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_CustomEvent_Right' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_Select_Default_1) == 0x000063, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000070, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_ClassDynamicCast_AsActor) == 0x000078, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_ClassDynamicCast_bSuccess) == 0x000080, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000088, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, CallFunc_Array_Get_Item) == 0x000098, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_AsBPI_Lobby_Character) == 0x0000A0, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_AsBPI_Lobby_Character' has a wrong offset!");
static_assert(offsetof(W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'W_CharacterSlot_C_ExecuteUbergraph_W_CharacterSlot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function W_CharacterSlot.W_CharacterSlot_C.FirstChoose
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterSlot_C_FirstChoose final
{
public:
	bool                                          Right;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterSlot_C_FirstChoose) == 0x000001, "Wrong alignment on W_CharacterSlot_C_FirstChoose");
static_assert(sizeof(W_CharacterSlot_C_FirstChoose) == 0x000001, "Wrong size on W_CharacterSlot_C_FirstChoose");
static_assert(offsetof(W_CharacterSlot_C_FirstChoose, Right) == 0x000000, "Member 'W_CharacterSlot_C_FirstChoose::Right' has a wrong offset!");

// Function W_CharacterSlot.W_CharacterSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterSlot_C_PreConstruct) == 0x000001, "Wrong alignment on W_CharacterSlot_C_PreConstruct");
static_assert(sizeof(W_CharacterSlot_C_PreConstruct) == 0x000001, "Wrong size on W_CharacterSlot_C_PreConstruct");
static_assert(offsetof(W_CharacterSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CharacterSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CharacterSlot.W_CharacterSlot_C.Select
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterSlot_C_Select final
{
public:
	bool                                          Select_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterSlot_C_Select) == 0x000001, "Wrong alignment on W_CharacterSlot_C_Select");
static_assert(sizeof(W_CharacterSlot_C_Select) == 0x000001, "Wrong size on W_CharacterSlot_C_Select");
static_assert(offsetof(W_CharacterSlot_C_Select, Select_0) == 0x000000, "Member 'W_CharacterSlot_C_Select::Select_0' has a wrong offset!");

}

