#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ConfirmQuit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_BiomeSave_structs.hpp"


namespace SDK::Params
{

// Function W_ConfirmQuit.W_ConfirmQuit_C.ExecuteUbergraph_W_ConfirmQuit
// 0x0268 (0x0268 - 0x0000)
struct W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_SettingsMain_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game;                      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_RescuePoint_C*>              CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x00A8(0x0010)(ReferenceParm)
	TScriptInterface<class IBPI_ControllerWithSettings_C> K2Node_DynamicCast_AsBPI_Controller_with_Settings; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RescuePoint_C*                      CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_SettingsMain_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SettingsMain_C*                      CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_1;                    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Height0_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0140(0x0010)(ReferenceParm)
	class ABP_Height0_C*                          CallFunc_Array_Get_Item_2;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Lava_C*>                     CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0160(0x0010)(ReferenceParm)
	class ABP_Lava_C*                             CallFunc_Array_Get_Item_3;                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_2;                    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SettingsMain_C*                      CallFunc_Array_Get_Item_4;                         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BiomeSave                           K2Node_MakeStruct_S_BiomeSave;                     // 0x0230(0x0038)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit) == 0x000008, "Wrong alignment on W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit");
static_assert(sizeof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit) == 0x000268, "Wrong size on W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, EntryPoint) == 0x000000, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_BreakVector_X) == 0x000028, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_BreakVector_Y) == 0x000030, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_BreakVector_Z) == 0x000038, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, Temp_int_Array_Index_Variable) == 0x000040, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, Temp_bool_IsClosed_Variable) == 0x00004C, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, Temp_bool_Has_Been_Initd_Variable) == 0x00004D, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000058, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_IsServer_ReturnValue) == 0x00006C, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetGameState_ReturnValue) == 0x000070, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_AsBPI_Gamestate) == 0x000078, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_AsGS_Game) == 0x000090, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_AsGS_Game' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A0, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x0000A8, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_AsBPI_Controller_with_Settings) == 0x0000B8, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_AsBPI_Controller_with_Settings' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x0000E0, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, Temp_int_Loop_Counter_Variable_1) == 0x0000F0, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Add_IntInt_ReturnValue_1) == 0x000104, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Array_Length_ReturnValue_1) == 0x000108, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Less_IntInt_ReturnValue_1) == 0x00010C, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetGameInstance_ReturnValue) == 0x000110, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetGameState_ReturnValue_1) == 0x000118, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_AsCustom_GI) == 0x000120, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_AsGS_Game_1) == 0x000130, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_AsGS_Game_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_bSuccess_4) == 0x000138, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetAllActorsOfClass_OutActors) == 0x000140, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Array_Get_Item_2) == 0x000150, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_SwitchEnum_CmpSuccess) == 0x000158, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000160, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Array_Get_Item_3) == 0x000170, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetGameState_ReturnValue_2) == 0x000178, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_IsValid_ReturnValue_1) == 0x000180, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_AsGS_Game_2) == 0x000188, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_AsGS_Game_2' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_DynamicCast_bSuccess_5) == 0x000190, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000198, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Now_ReturnValue) == 0x0001A0, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001A8, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_CustomEvent_Success) == 0x0001C0, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, Temp_int_Array_Index_Variable_1) == 0x0001C4, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Array_Get_Item_4) == 0x0001C8, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_CreateDelegate_OutputDelegate) == 0x0001D0, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_IsInViewport_ReturnValue) == 0x0001E0, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001E8, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_BreakVector_X_1) == 0x000200, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_BreakVector_Y_1) == 0x000208, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_BreakVector_Z_1) == 0x000210, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000218, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000220, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, CallFunc_Round_ReturnValue) == 0x000228, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit, K2Node_MakeStruct_S_BiomeSave) == 0x000230, "Member 'W_ConfirmQuit_C_ExecuteUbergraph_W_ConfirmQuit::K2Node_MakeStruct_S_BiomeSave' has a wrong offset!");

// Function W_ConfirmQuit.W_ConfirmQuit_C.ManualSaveFinished_Event
// 0x0001 (0x0001 - 0x0000)
struct W_ConfirmQuit_C_ManualSaveFinished_Event final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ConfirmQuit_C_ManualSaveFinished_Event) == 0x000001, "Wrong alignment on W_ConfirmQuit_C_ManualSaveFinished_Event");
static_assert(sizeof(W_ConfirmQuit_C_ManualSaveFinished_Event) == 0x000001, "Wrong size on W_ConfirmQuit_C_ManualSaveFinished_Event");
static_assert(offsetof(W_ConfirmQuit_C_ManualSaveFinished_Event, Success) == 0x000000, "Member 'W_ConfirmQuit_C_ManualSaveFinished_Event::Success' has a wrong offset!");

}

