#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Controls

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function W_Controls.W_Controls_C.ExecuteUbergraph_W_Controls
// 0x0180 (0x0180 - 0x0000)
struct W_Controls_C_ExecuteUbergraph_W_Controls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E51[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetKeyName_DisplayName;                   // 0x0018(0x0018)()
	TScriptInterface<class IBPI_ControllerWithSettings_C> K2Node_DynamicCast_AsBPI_Controller_with_Settings; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E52[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerOnGamepad_Gamepad;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E53[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetKeyName_DisplayName_1;                 // 0x0070(0x0018)()
	class FText                                   CallFunc_GetKeyName_DisplayName_2;                 // 0x0088(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetKeyName_DisplayName_3;                 // 0x00D0(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetKeyName_DisplayName_4;                 // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0150(0x0018)()
	class FText                                   CallFunc_GetKeyName_DisplayName_5;                 // 0x0168(0x0018)()
};
static_assert(alignof(W_Controls_C_ExecuteUbergraph_W_Controls) == 0x000008, "Wrong alignment on W_Controls_C_ExecuteUbergraph_W_Controls");
static_assert(sizeof(W_Controls_C_ExecuteUbergraph_W_Controls) == 0x000180, "Wrong size on W_Controls_C_ExecuteUbergraph_W_Controls");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, EntryPoint) == 0x000000, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_GetKeyName_DisplayName) == 0x000018, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_GetKeyName_DisplayName' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, K2Node_DynamicCast_AsBPI_Controller_with_Settings) == 0x000030, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::K2Node_DynamicCast_AsBPI_Controller_with_Settings' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_IsPlayerOnGamepad_Gamepad) == 0x000058, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_IsPlayerOnGamepad_Gamepad' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_GetKeyName_DisplayName_1) == 0x000070, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_GetKeyName_DisplayName_1' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_GetKeyName_DisplayName_2) == 0x000088, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_GetKeyName_DisplayName_2' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000A0, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000B0, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000C0, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_GetKeyName_DisplayName_3) == 0x0000D0, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_GetKeyName_DisplayName_3' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000E8, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0000F8, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000108, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000118, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000128, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_GetKeyName_DisplayName_4) == 0x000138, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_GetKeyName_DisplayName_4' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_Conv_StringToText_ReturnValue) == 0x000150, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ExecuteUbergraph_W_Controls, CallFunc_GetKeyName_DisplayName_5) == 0x000168, "Member 'W_Controls_C_ExecuteUbergraph_W_Controls::CallFunc_GetKeyName_DisplayName_5' has a wrong offset!");

// Function W_Controls.W_Controls_C.GetKeyName
// 0x0268 (0x0268 - 0x0000)
struct W_Controls_C_GetKeyName final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerMappableKeySlot                        Param_Slot;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E54[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0010(0x0018)(Parm, OutParm)
	struct FPlayerKeyMapping                      FoundMap;                                          // 0x0028(0x0090)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E55[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_GetUserSettings_self_CastInput;           // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputUserSettings*             CallFunc_GetUserSettings_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedPlayerMappableKeyProfile*      CallFunc_GetCurrentKeyProfile_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FKeyMappingRow>      CallFunc_GetPlayerMappingRows_ReturnValue;         // 0x00F0(0x0050)(ConstParm)
	struct FKeyMappingRow                         CallFunc_Map_Find_Value;                           // 0x0140(0x0050)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E56[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlayerKeyMapping>              CallFunc_Set_ToArray_Result;                       // 0x0198(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E57[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerKeyMapping                      CallFunc_Array_Get_Item;                           // 0x01B0(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E58[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0248(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Controls_C_GetKeyName) == 0x000008, "Wrong alignment on W_Controls_C_GetKeyName");
static_assert(sizeof(W_Controls_C_GetKeyName) == 0x000268, "Wrong size on W_Controls_C_GetKeyName");
static_assert(offsetof(W_Controls_C_GetKeyName, Key) == 0x000000, "Member 'W_Controls_C_GetKeyName::Key' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, Param_Slot) == 0x000008, "Member 'W_Controls_C_GetKeyName::Param_Slot' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, DisplayName) == 0x000010, "Member 'W_Controls_C_GetKeyName::DisplayName' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, FoundMap) == 0x000028, "Member 'W_Controls_C_GetKeyName::FoundMap' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, Temp_int_Array_Index_Variable) == 0x0000B8, "Member 'W_Controls_C_GetKeyName::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, Temp_int_Loop_Counter_Variable) == 0x0000BC, "Member 'W_Controls_C_GetKeyName::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'W_Controls_C_GetKeyName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000C8, "Member 'W_Controls_C_GetKeyName::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_GetUserSettings_self_CastInput) == 0x0000D0, "Member 'W_Controls_C_GetKeyName::CallFunc_GetUserSettings_self_CastInput' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_GetUserSettings_ReturnValue) == 0x0000E0, "Member 'W_Controls_C_GetKeyName::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_GetCurrentKeyProfile_ReturnValue) == 0x0000E8, "Member 'W_Controls_C_GetKeyName::CallFunc_GetCurrentKeyProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_GetPlayerMappingRows_ReturnValue) == 0x0000F0, "Member 'W_Controls_C_GetKeyName::CallFunc_GetPlayerMappingRows_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_Map_Find_Value) == 0x000140, "Member 'W_Controls_C_GetKeyName::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_Map_Find_ReturnValue) == 0x000190, "Member 'W_Controls_C_GetKeyName::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_Set_ToArray_Result) == 0x000198, "Member 'W_Controls_C_GetKeyName::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_Array_Length_ReturnValue) == 0x0001A8, "Member 'W_Controls_C_GetKeyName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_Array_Get_Item) == 0x0001B0, "Member 'W_Controls_C_GetKeyName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_Less_IntInt_ReturnValue) == 0x000240, "Member 'W_Controls_C_GetKeyName::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000248, "Member 'W_Controls_C_GetKeyName::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_GetKeyName, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000260, "Member 'W_Controls_C_GetKeyName::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function W_Controls.W_Controls_C.PermuterZQSD
// 0x0110 (0x0110 - 0x0000)
struct W_Controls_C_PermuterZQSD final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Out;                                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Q;                                                 // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 D;                                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Z;                                                 // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 S;                                                 // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Local;                                             // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_1;               // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_2;               // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_3;               // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Controls_C_PermuterZQSD) == 0x000008, "Wrong alignment on W_Controls_C_PermuterZQSD");
static_assert(sizeof(W_Controls_C_PermuterZQSD) == 0x000110, "Wrong size on W_Controls_C_PermuterZQSD");
static_assert(offsetof(W_Controls_C_PermuterZQSD, String) == 0x000000, "Member 'W_Controls_C_PermuterZQSD::String' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, Out) == 0x000010, "Member 'W_Controls_C_PermuterZQSD::Out' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, Q) == 0x000020, "Member 'W_Controls_C_PermuterZQSD::Q' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, D) == 0x000030, "Member 'W_Controls_C_PermuterZQSD::D' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, Z) == 0x000040, "Member 'W_Controls_C_PermuterZQSD::Z' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, S) == 0x000050, "Member 'W_Controls_C_PermuterZQSD::S' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, Local) == 0x000060, "Member 'W_Controls_C_PermuterZQSD::Local' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_GetSubstring_ReturnValue) == 0x000070, "Member 'W_Controls_C_PermuterZQSD::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'W_Controls_C_PermuterZQSD::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'W_Controls_C_PermuterZQSD::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_GetSubstring_ReturnValue_1) == 0x0000A0, "Member 'W_Controls_C_PermuterZQSD::CallFunc_GetSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B0, "Member 'W_Controls_C_PermuterZQSD::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000C0, "Member 'W_Controls_C_PermuterZQSD::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000D0, "Member 'W_Controls_C_PermuterZQSD::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_GetSubstring_ReturnValue_2) == 0x0000E0, "Member 'W_Controls_C_PermuterZQSD::CallFunc_GetSubstring_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F0, "Member 'W_Controls_C_PermuterZQSD::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_Controls_C_PermuterZQSD, CallFunc_GetSubstring_ReturnValue_3) == 0x000100, "Member 'W_Controls_C_PermuterZQSD::CallFunc_GetSubstring_ReturnValue_3' has a wrong offset!");

// Function W_Controls.W_Controls_C.ReturnKeyName
// 0x0088 (0x0088 - 0x0000)
struct W_Controls_C_ReturnKeyName final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E59[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KeyName;                                           // 0x0018(0x0018)(Parm, OutParm)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_QueryKeysMappedToAction_self_CastInput;   // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_QueryKeysMappedToAction_ReturnValue;      // 0x0048(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0058(0x0018)(HasGetValueTypeHash)
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0070(0x0018)()
};
static_assert(alignof(W_Controls_C_ReturnKeyName) == 0x000008, "Wrong alignment on W_Controls_C_ReturnKeyName");
static_assert(sizeof(W_Controls_C_ReturnKeyName) == 0x000088, "Wrong size on W_Controls_C_ReturnKeyName");
static_assert(offsetof(W_Controls_C_ReturnKeyName, PlayerController) == 0x000000, "Member 'W_Controls_C_ReturnKeyName::PlayerController' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ReturnKeyName, Action) == 0x000008, "Member 'W_Controls_C_ReturnKeyName::Action' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ReturnKeyName, Param_Index) == 0x000010, "Member 'W_Controls_C_ReturnKeyName::Param_Index' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ReturnKeyName, KeyName) == 0x000018, "Member 'W_Controls_C_ReturnKeyName::KeyName' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ReturnKeyName, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000030, "Member 'W_Controls_C_ReturnKeyName::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ReturnKeyName, CallFunc_QueryKeysMappedToAction_self_CastInput) == 0x000038, "Member 'W_Controls_C_ReturnKeyName::CallFunc_QueryKeysMappedToAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ReturnKeyName, CallFunc_QueryKeysMappedToAction_ReturnValue) == 0x000048, "Member 'W_Controls_C_ReturnKeyName::CallFunc_QueryKeysMappedToAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ReturnKeyName, CallFunc_Array_Get_Item) == 0x000058, "Member 'W_Controls_C_ReturnKeyName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Controls_C_ReturnKeyName, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000070, "Member 'W_Controls_C_ReturnKeyName::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");

// Function W_Controls.W_Controls_C.UpdateBinding
// 0x0058 (0x0058 - 0x0000)
struct W_Controls_C_UpdateBinding final
{
public:
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   KeyName;                                           // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 KeyDisplayName;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           MoveAxisNames;                                     // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
};
static_assert(alignof(W_Controls_C_UpdateBinding) == 0x000008, "Wrong alignment on W_Controls_C_UpdateBinding");
static_assert(sizeof(W_Controls_C_UpdateBinding) == 0x000058, "Wrong size on W_Controls_C_UpdateBinding");
static_assert(offsetof(W_Controls_C_UpdateBinding, WidgetSwitcher) == 0x000000, "Member 'W_Controls_C_UpdateBinding::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(W_Controls_C_UpdateBinding, TextBlock) == 0x000008, "Member 'W_Controls_C_UpdateBinding::TextBlock' has a wrong offset!");
static_assert(offsetof(W_Controls_C_UpdateBinding, KeyName) == 0x000010, "Member 'W_Controls_C_UpdateBinding::KeyName' has a wrong offset!");
static_assert(offsetof(W_Controls_C_UpdateBinding, KeyDisplayName) == 0x000028, "Member 'W_Controls_C_UpdateBinding::KeyDisplayName' has a wrong offset!");
