#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndScreen

#include "Basic.hpp"

#include "SteamCorePro_structs.hpp"


namespace SDK::Params
{

// Function W_EndScreen.W_EndScreen_C.ExecuteUbergraph_W_EndScreen
// 0x0208 (0x0208 - 0x0000)
struct W_EndScreen_C_ExecuteUbergraph_W_EndScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D20[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLeaderboardFindResult                 Temp_struct_Variable;                              // 0x0020(0x0010)(NoDestructor)
	struct FLeaderboardScoreUploaded              K2Node_CustomEvent_Data;                           // 0x0030(0x0020)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D21[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FLeaderboardScoreUploaded& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D22[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLeaderboardScoreUploaded              Temp_struct_Variable_1;                            // 0x0068(0x0020)(NoDestructor)
	class UW_FadeInOut_C*                         CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FLeaderboardFindResult& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_1;                    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D23[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreProUserStatsAsyncActionUploadLeaderboardScore* CallFunc_UploadLeaderboardScoreAsync_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDevMode_DevMode;                       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D24[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D25[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTimer_Timer;                           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D26[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USteamCoreProUserStatsAsyncActionFindLeaderboard* CallFunc_FindLeaderboardAsync_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D27[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLeaderboardFindResult                 K2Node_CustomEvent_Data_1;                         // 0x0130(0x0010)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful_1;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievement_ReturnValue;               // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D28[0x5];                                     // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAchievement_ReturnValue_1;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D29[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate_1;              // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2A[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLaveMode_Lava;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2B[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2C[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEndAngelDevil_BP_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0190(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEndAngelDevil_BP_C*                    CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StoreStats_ReturnValue;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StoreStats_ReturnValue_1;                 // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2D[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_4;               // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_5;               // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_2;                    // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2E[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_3;                    // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2F[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_6;               // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_4;                    // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen) == 0x000008, "Wrong alignment on W_EndScreen_C_ExecuteUbergraph_W_EndScreen");
static_assert(sizeof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen) == 0x000208, "Wrong size on W_EndScreen_C_ExecuteUbergraph_W_EndScreen");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, EntryPoint) == 0x000000, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_AsGS_Game) == 0x000010, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_AsGS_Game' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, Temp_bool_Variable) == 0x00001A, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, Temp_struct_Variable) == 0x000020, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_CustomEvent_Data) == 0x000030, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_CustomEvent_bWasSuccessful) == 0x000050, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_CustomEvent_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, Temp_bool_Variable_1) == 0x000064, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, Temp_struct_Variable_1) == 0x000068, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_Create_ReturnValue) == 0x000088, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000090, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetGameState_ReturnValue_1) == 0x0000A8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_AsGS_Game_1) == 0x0000B0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_AsGS_Game_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_UploadLeaderboardScoreAsync_ReturnValue) == 0x0000C0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_UploadLeaderboardScoreAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetDevMode_DevMode) == 0x0000C9, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetDevMode_DevMode' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetGameState_ReturnValue_2) == 0x0000D8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_AsBPI_Gamestate) == 0x0000E0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_AsBPI_Gamestate' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_Conv_IntToString_ReturnValue) == 0x0000F8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetTimer_Timer) == 0x000108, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetTimer_Timer' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_FindLeaderboardAsync_ReturnValue) == 0x000120, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_FindLeaderboardAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_CustomEvent_Data_1) == 0x000130, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_CustomEvent_Data_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_CustomEvent_bWasSuccessful_1) == 0x000140, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_CustomEvent_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000141, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_SetAchievement_ReturnValue) == 0x000142, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_SetAchievement_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetGameState_ReturnValue_3) == 0x000148, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetGameState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_SetAchievement_ReturnValue_1) == 0x000150, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_SetAchievement_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_AsBPI_Gamestate_1) == 0x000158, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_AsBPI_Gamestate_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_bSuccess_3) == 0x000168, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetGameInstance_ReturnValue) == 0x000170, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetLaveMode_Lava) == 0x000178, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetLaveMode_Lava' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_AsCustom_GI) == 0x000180, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_bSuccess_4) == 0x000188, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetAllActorsOfClass_OutActors) == 0x000190, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001A0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetPlayerController_ReturnValue_2) == 0x0001B0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_StoreStats_ReturnValue) == 0x0001B8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_StoreStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_StoreStats_ReturnValue_1) == 0x0001B9, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_StoreStats_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetGameState_ReturnValue_4) == 0x0001C0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetGameState_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetGameState_ReturnValue_5) == 0x0001C8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetGameState_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_AsGS_Game_2) == 0x0001D0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_AsGS_Game_2' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_bSuccess_5) == 0x0001D8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_AsGS_Game_3) == 0x0001E0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_AsGS_Game_3' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_bSuccess_6) == 0x0001E8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, CallFunc_GetGameState_ReturnValue_6) == 0x0001F0, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::CallFunc_GetGameState_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_AsGS_Game_4) == 0x0001F8, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_AsGS_Game_4' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_ExecuteUbergraph_W_EndScreen, K2Node_DynamicCast_bSuccess_7) == 0x000200, "Member 'W_EndScreen_C_ExecuteUbergraph_W_EndScreen::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");

// Function W_EndScreen.W_EndScreen_C.OnCallback_C40E329846C5390DF3526BB1AC51162A
// 0x0018 (0x0018 - 0x0000)
struct W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A final
{
public:
	struct FLeaderboardFindResult                 Data;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bWasSuccessful;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A) == 0x000008, "Wrong alignment on W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A");
static_assert(sizeof(W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A) == 0x000018, "Wrong size on W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A");
static_assert(offsetof(W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A, Data) == 0x000000, "Member 'W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A::Data' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A, bWasSuccessful) == 0x000010, "Member 'W_EndScreen_C_OnCallback_C40E329846C5390DF3526BB1AC51162A::bWasSuccessful' has a wrong offset!");

// Function W_EndScreen.W_EndScreen_C.OnCallback_D4619B5E464DD7DF58786BBF440CCADD
// 0x0028 (0x0028 - 0x0000)
struct W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD final
{
public:
	struct FLeaderboardScoreUploaded              Data;                                              // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bWasSuccessful;                                    // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD) == 0x000008, "Wrong alignment on W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD");
static_assert(sizeof(W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD) == 0x000028, "Wrong size on W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD");
static_assert(offsetof(W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD, Data) == 0x000000, "Member 'W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD::Data' has a wrong offset!");
static_assert(offsetof(W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD, bWasSuccessful) == 0x000020, "Member 'W_EndScreen_C_OnCallback_D4619B5E464DD7DF58786BBF440CCADD::bWasSuccessful' has a wrong offset!");

// Function W_EndScreen.W_EndScreen_C.RefreshTime
// 0x0018 (0x0018 - 0x0000)
struct W_EndScreen_C_RefreshTime final
{
public:
	class FText                                   CallFunc_ConvertTimeToTextFormat_ReturnValue;      // 0x0000(0x0018)()
};
static_assert(alignof(W_EndScreen_C_RefreshTime) == 0x000008, "Wrong alignment on W_EndScreen_C_RefreshTime");
static_assert(sizeof(W_EndScreen_C_RefreshTime) == 0x000018, "Wrong size on W_EndScreen_C_RefreshTime");
static_assert(offsetof(W_EndScreen_C_RefreshTime, CallFunc_ConvertTimeToTextFormat_ReturnValue) == 0x000000, "Member 'W_EndScreen_C_RefreshTime::CallFunc_ConvertTimeToTextFormat_ReturnValue' has a wrong offset!");

}

