#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Hud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Gamemodes_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Hud.W_Hud_C
// 0x0098 (0x0358 - 0x02C0)
class UW_Hud_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Checkpoint01;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Checkpoint02;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Checkpoint03;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_237;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_333;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LavaCursor;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_52;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 Height0;                                           // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Height1_C*                          Height1;                                           // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PlayerHeight;                                      // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxHeight;                                         // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Gamemodes                                   Selected_Game_Mode;                                // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC3[0x3];                                     // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lava_C*                             Lava;                                              // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        LavaHeight;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CollapseCheckpoints();
	void Construct();
	void CustomEvent_0();
	void EvaluateLavaHeight();
	void EvaluatePlayerHeight();
	void ExecuteUbergraph_W_Hud(int32 EntryPoint);
	class FText GetTimer();
	void RemoveSRV();
	void ShowHideHud(ESlateVisibility InVisibility);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateCheckpointsHeight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Hud_C">();
	}
	static class UW_Hud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Hud_C>();
	}
};
static_assert(alignof(UW_Hud_C) == 0x000008, "Wrong alignment on UW_Hud_C");
static_assert(sizeof(UW_Hud_C) == 0x000358, "Wrong size on UW_Hud_C");
static_assert(offsetof(UW_Hud_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Hud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Checkpoint01) == 0x0002C8, "Member 'UW_Hud_C::Checkpoint01' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Checkpoint02) == 0x0002D0, "Member 'UW_Hud_C::Checkpoint02' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Checkpoint03) == 0x0002D8, "Member 'UW_Hud_C::Checkpoint03' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Image) == 0x0002E0, "Member 'UW_Hud_C::Image' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Image_237) == 0x0002E8, "Member 'UW_Hud_C::Image_237' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Image_333) == 0x0002F0, "Member 'UW_Hud_C::Image_333' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, LavaCursor) == 0x0002F8, "Member 'UW_Hud_C::LavaCursor' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, TextBlock) == 0x000300, "Member 'UW_Hud_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, TextBlock_1) == 0x000308, "Member 'UW_Hud_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, TextBlock_2) == 0x000310, "Member 'UW_Hud_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, TextBlock_52) == 0x000318, "Member 'UW_Hud_C::TextBlock_52' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, VerticalBox_0) == 0x000320, "Member 'UW_Hud_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Height0) == 0x000328, "Member 'UW_Hud_C::Height0' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Height1) == 0x000330, "Member 'UW_Hud_C::Height1' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, PlayerHeight) == 0x000338, "Member 'UW_Hud_C::PlayerHeight' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, MaxHeight) == 0x000340, "Member 'UW_Hud_C::MaxHeight' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Selected_Game_Mode) == 0x000344, "Member 'UW_Hud_C::Selected_Game_Mode' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, Lava) == 0x000348, "Member 'UW_Hud_C::Lava' has a wrong offset!");
static_assert(offsetof(UW_Hud_C, LavaHeight) == 0x000350, "Member 'UW_Hud_C::LavaHeight' has a wrong offset!");

}

