#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_JoinSessionMenu

#include "Basic.hpp"

#include "SteamCorePro_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.ExecuteUbergraph_W_JoinSessionMenu
// 0x0528 (0x0528 - 0x0000)
struct W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3070[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SessionButton_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3071[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamSessionResult>            Temp_struct_Variable;                              // 0x0018(0x0010)(ReferenceParm)
	struct FSteamSessionResult                    CallFunc_Array_Get_Item;                           // 0x0028(0x0130)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamSessionResult>            Temp_struct_Variable_1;                            // 0x0160(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3072[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3073[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3074[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamSessionResult>            K2Node_CustomEvent_Results_1;                      // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	struct FSteamSessionResult                    CallFunc_Array_Get_Item_1;                         // 0x01B0(0x0130)()
	TArray<struct FSteamSessionResult>            K2Node_CustomEvent_Results;                        // 0x02E0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(TArray<struct FSteamSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate;              // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FSteamSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0300(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3075[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3076[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_NewSelection_1;         // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType_1;           // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3077[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_NewSelection;           // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType;             // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3078[0x6];                                     // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESteamFriendFlags>                     K2Node_MakeArray_Array;                            // 0x0360(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetFriendCount_ReturnValue;               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3079[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESteamFriendFlags>                     K2Node_MakeArray_Array_1;                          // 0x0378(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SomethingWrittenInTextField_SomethingWritten; // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307A[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307B[0x3];                                     // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307C[0x4];                                     // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               CallFunc_GetFriendByIndex_ReturnValue;             // 0x03C8(0x0008)(NoDestructor)
	struct FSteamGameID                           CallFunc_GetFriendGamePlayed_GameID;               // 0x03D0(0x0008)(NoDestructor)
	class FString                                 CallFunc_GetFriendGamePlayed_GameIP;               // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFriendGamePlayed_ConnectionPort;       // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFriendGamePlayed_QueryPort;            // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamID                               CallFunc_GetFriendGamePlayed_SteamIDLobby;         // 0x03F0(0x0008)(NoDestructor)
	bool                                          CallFunc_GetFriendGamePlayed_ReturnValue;          // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307D[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetFriendPersonaName_ReturnValue;         // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307E[0x2];                                     // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FSteamSessionSearchSetting> CallFunc_GetFriendSearchFilters_ReturnValue;       // 0x0418(0x0050)()
	class USteamCoreProFindSession*               CallFunc_FindSteamCoreProSessions_ReturnValue;     // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307F[0x6];                                     // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3080[0x6];                                     // 0x049A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FSteamSessionSearchSetting> CallFunc_GetFriendSearchFilters_ReturnValue_1;     // 0x04A0(0x0050)()
	class USteamCoreProFindSession*               CallFunc_FindSteamCoreProSessions_ReturnValue_1;   // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3081[0x6];                                     // 0x04FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMenu_W_C*                          CallFunc_Create_ReturnValue_1;                     // 0x0500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_SessionButton_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0510(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3082[0x4];                                     // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0520(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu");
static_assert(sizeof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu) == 0x000528, "Wrong size on W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, EntryPoint) == 0x000000, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_int_Array_Index_Variable) == 0x000010, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_struct_Variable) == 0x000018, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Get_Item) == 0x000028, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Length_ReturnValue_1) == 0x00015C, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_struct_Variable_1) == 0x000160, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000170, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Length_ReturnValue_2) == 0x000174, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Length_ReturnValue_3) == 0x000178, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Conv_IntToString_ReturnValue) == 0x000180, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_int_Loop_Counter_Variable) == 0x000190, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000194, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000198, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_int_Array_Index_Variable_1) == 0x00019C, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_CustomEvent_Results_1) == 0x0001A0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_CustomEvent_Results_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Get_Item_1) == 0x0001B0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_CustomEvent_Results) == 0x0002E0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_CreateDelegate_OutputDelegate) == 0x0002F0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000300, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_IsInViewport_ReturnValue) == 0x000310, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000318, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_CustomEvent_Show) == 0x000320, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000328, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_ComponentBoundEvent_NewSelection_1) == 0x000330, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_ComponentBoundEvent_NewSelection_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_ComponentBoundEvent_SelectType_1) == 0x000340, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_ComponentBoundEvent_SelectType_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_ComponentBoundEvent_NewSelection) == 0x000348, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_ComponentBoundEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_ComponentBoundEvent_SelectType) == 0x000358, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_ComponentBoundEvent_SelectType' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_SwitchString_CmpSuccess) == 0x000359, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_MakeArray_Array) == 0x000360, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendCount_ReturnValue) == 0x000370, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_MakeArray_Array_1) == 0x000378, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000388, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_SomethingWrittenInTextField_SomethingWritten) == 0x000398, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_SomethingWrittenInTextField_SomethingWritten' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Concat_StrStr_ReturnValue) == 0x0003A0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_int_Variable) == 0x0003B0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x0003B4, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_int_Loop_Counter_Variable_1) == 0x0003B8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003BC, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x0003C0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendByIndex_ReturnValue) == 0x0003C8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendGamePlayed_GameID) == 0x0003D0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendGamePlayed_GameID' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendGamePlayed_GameIP) == 0x0003D8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendGamePlayed_GameIP' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendGamePlayed_ConnectionPort) == 0x0003E8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendGamePlayed_ConnectionPort' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendGamePlayed_QueryPort) == 0x0003EC, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendGamePlayed_QueryPort' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendGamePlayed_SteamIDLobby) == 0x0003F0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendGamePlayed_SteamIDLobby' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendGamePlayed_ReturnValue) == 0x0003F8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendGamePlayed_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendPersonaName_ReturnValue) == 0x000400, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendPersonaName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_byte_Variable) == 0x000410, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_byte_Variable_1) == 0x000411, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_int_Variable_1) == 0x000414, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendSearchFilters_ReturnValue) == 0x000418, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendSearchFilters_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_FindSteamCoreProSessions_ReturnValue) == 0x000468, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_FindSteamCoreProSessions_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Less_IntInt_ReturnValue_2) == 0x000470, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_IsValid_ReturnValue) == 0x000471, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000478, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000488, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_bool_Variable) == 0x000498, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_Select_Default) == 0x000499, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetFriendSearchFilters_ReturnValue_1) == 0x0004A0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetFriendSearchFilters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_FindSteamCoreProSessions_ReturnValue_1) == 0x0004F0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_FindSteamCoreProSessions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_IsValid_ReturnValue_1) == 0x0004F8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_IsInViewport_ReturnValue_1) == 0x0004F9, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Create_ReturnValue_1) == 0x000500, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Create_ReturnValue_2) == 0x000508, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000510, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Add_IntInt_ReturnValue_3) == 0x000518, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000520, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.FilterResults
// 0x0478 (0x0478 - 0x0000)
struct W_JoinSessionMenu_C_FilterResults final
{
public:
	TArray<struct FSteamSessionResult>            Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSteamSessionResult>            OutResults;                                        // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FSteamSessionResult>            Results;                                           // 0x0020(0x0010)(Edit, BlueprintVisible)
	struct FSteamSessionResult                    SessionResult;                                     // 0x0030(0x0130)(Edit, BlueprintVisible)
	class FString                                 CallFunc_No_Password_Code_ReturnValue;             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3083[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_No_Password_Code_ReturnValue_1;           // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3084[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0190(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue;         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3085[0x2];                                     // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3086[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3087[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionResult                    CallFunc_Array_Get_Item;                           // 0x01D0(0x0130)()
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_1;       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_2;       // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3088[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_3;       // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_4;       // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3089[0x2];                                     // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0310(0x0018)()
	class FString                                 CallFunc_GetServerName_ReturnValue;                // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308A[0x6];                                     // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionResult                    Temp_struct_Variable;                              // 0x0340(0x0130)(ConstParm)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_5;       // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_FilterResults) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_FilterResults");
static_assert(sizeof(W_JoinSessionMenu_C_FilterResults) == 0x000478, "Wrong size on W_JoinSessionMenu_C_FilterResults");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Array) == 0x000000, "Member 'W_JoinSessionMenu_C_FilterResults::Array' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, OutResults) == 0x000010, "Member 'W_JoinSessionMenu_C_FilterResults::OutResults' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Results) == 0x000020, "Member 'W_JoinSessionMenu_C_FilterResults::Results' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, SessionResult) == 0x000030, "Member 'W_JoinSessionMenu_C_FilterResults::SessionResult' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_No_Password_Code_ReturnValue) == 0x000160, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_No_Password_Code_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_No_Password_Code_ReturnValue_1) == 0x000178, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_No_Password_Code_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000188, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_GetText_ReturnValue) == 0x000190, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Conv_TextToString_ReturnValue) == 0x0001A8, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue) == 0x0001B8, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0001B9, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Temp_int_Loop_Counter_Variable) == 0x0001BC, "Member 'W_JoinSessionMenu_C_FilterResults::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Less_IntInt_ReturnValue) == 0x0001C0, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Add_IntInt_ReturnValue) == 0x0001C4, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Temp_int_Array_Index_Variable) == 0x0001C8, "Member 'W_JoinSessionMenu_C_FilterResults::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_1) == 0x000300, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_2) == 0x000301, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000302, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000303, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000304, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Array_Add_ReturnValue) == 0x000308, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_3) == 0x00030C, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_4) == 0x00030D, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_GetText_ReturnValue_1) == 0x000310, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_GetServerName_ReturnValue) == 0x000328, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_GetServerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_TextIsEmpty_ReturnValue) == 0x000338, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Contains_ReturnValue) == 0x000339, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Temp_struct_Variable) == 0x000340, "Member 'W_JoinSessionMenu_C_FilterResults::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_5) == 0x000470, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_5' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.GetFriendSearchFilters
// 0x0230 (0x0230 - 0x0000)
struct W_JoinSessionMenu_C_GetFriendSearchFilters final
{
public:
	class FString                                 FriendName;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          SearchFriend;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FSteamSessionSearchSetting> ReturnValue;                                       // 0x0018(0x0050)(Parm, OutParm, ReturnParm)
	TMap<class FString, struct FSteamSessionSearchSetting> SearchMap;                                         // 0x0068(0x0050)(Edit, BlueprintVisible)
	class FString                                 Temp_string_Variable;                              // 0x00B8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00C8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x00D8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x00E8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x00F8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0108(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308C[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamSessionSearchSetting             CallFunc_MakeSearchString_ReturnValue;             // 0x0130(0x0020)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308D[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionSearchSetting             CallFunc_MakeSearchString_ReturnValue_1;           // 0x0158(0x0020)()
	bool                                          CallFunc_IsFilled_returnValue;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308E[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionSearchSetting             CallFunc_MakeSearchString_ReturnValue_2;           // 0x0180(0x0020)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308F[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionSearchSetting             CallFunc_MakeSearchString_ReturnValue_3;           // 0x01A8(0x0020)()
	struct FSteamSessionSearchSetting             CallFunc_MakeSearchString_ReturnValue_4;           // 0x01C8(0x0020)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x01E8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamSessionSearchSetting             CallFunc_MakeSearchString_ReturnValue_5;           // 0x0210(0x0020)()
};
static_assert(alignof(W_JoinSessionMenu_C_GetFriendSearchFilters) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_GetFriendSearchFilters");
static_assert(sizeof(W_JoinSessionMenu_C_GetFriendSearchFilters) == 0x000230, "Wrong size on W_JoinSessionMenu_C_GetFriendSearchFilters");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, FriendName) == 0x000000, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::FriendName' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, SearchFriend) == 0x000010, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::SearchFriend' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, ReturnValue) == 0x000018, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, SearchMap) == 0x000068, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::SearchMap' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, Temp_string_Variable) == 0x0000B8, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, Temp_string_Variable_1) == 0x0000C8, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, Temp_string_Variable_2) == 0x0000D8, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, Temp_string_Variable_3) == 0x0000E8, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, Temp_string_Variable_4) == 0x0000F8, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, Temp_string_Variable_5) == 0x000108, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000118, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_SelectString_ReturnValue) == 0x000120, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_MakeSearchString_ReturnValue) == 0x000130, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_MakeSearchString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000150, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_MakeSearchString_ReturnValue_1) == 0x000158, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_MakeSearchString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_IsFilled_returnValue) == 0x000178, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_IsFilled_returnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_MakeSearchString_ReturnValue_2) == 0x000180, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_MakeSearchString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x0001A0, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_MakeSearchString_ReturnValue_3) == 0x0001A8, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_MakeSearchString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_MakeSearchString_ReturnValue_4) == 0x0001C8, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_MakeSearchString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_GetText_ReturnValue) == 0x0001E8, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_GetFriendSearchFilters, CallFunc_Conv_TextToString_ReturnValue) == 0x000200, "Member 'W_JoinSessionMenu_C_GetFriendSearchFilters::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
