#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_JoinSessionMenu

#include "Basic.hpp"

#include "SteamCorePro_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_1_K2Node_ComponentBoundEvent_3_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_JoinSessionMenu_C_BndEvt__W_JoinSessionMenu_PublicComboBox_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.ExecuteUbergraph_W_JoinSessionMenu
// 0x0288 (0x0288 - 0x0000)
struct W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3193[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionSearchSetting             CallFunc_MakeSearchString_ReturnValue;             // 0x0008(0x0020)()
	TArray<struct FSteamSessionResult>            K2Node_CustomEvent_Results;                        // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TMap<class FString, struct FSteamSessionSearchSetting> K2Node_MakeMap_Map;                                // 0x0038(0x0050)()
	TArray<struct FSteamSessionResult>            Temp_struct_Variable;                              // 0x0088(0x0010)(ReferenceParm)
	class USteamCoreProFindSession*               CallFunc_FindSteamCoreProSessions_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3194[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamSessionResult>            CallFunc_FilterResults_OutResults;                 // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SessionButton_C*                     CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3195[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMenu_W_C*                          CallFunc_Create_ReturnValue_1;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3196[0x1];                                     // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamSessionResult                    CallFunc_Array_Get_Item;                           // 0x00E0(0x0130)()
	TDelegate<void(TArray<struct FSteamSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate;              // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3197[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3198[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3199[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_NewSelection_1;         // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType_1;           // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319A[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_NewSelection;           // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType;             // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319B[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319C[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu");
static_assert(sizeof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu) == 0x000288, "Wrong size on W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, EntryPoint) == 0x000000, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_MakeSearchString_ReturnValue) == 0x000008, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_MakeSearchString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_CustomEvent_Results) == 0x000028, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_MakeMap_Map) == 0x000038, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_struct_Variable) == 0x000088, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_FindSteamCoreProSessions_ReturnValue) == 0x000098, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_FindSteamCoreProSessions_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_FilterResults_OutResults) == 0x0000A8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_FilterResults_OutResults' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0000BC, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Create_ReturnValue_1) == 0x0000D0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_bool_Variable) == 0x0000D8, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_byte_Variable) == 0x0000D9, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_byte_Variable_1) == 0x0000DA, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_int_Array_Index_Variable) == 0x0000DC, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000210, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000220, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_IsInViewport_ReturnValue) == 0x000228, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000230, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_CustomEvent_Show) == 0x000238, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000240, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_Select_Default) == 0x000248, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_ComponentBoundEvent_NewSelection_1) == 0x000250, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_ComponentBoundEvent_NewSelection_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_ComponentBoundEvent_SelectType_1) == 0x000260, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_ComponentBoundEvent_SelectType_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_ComponentBoundEvent_NewSelection) == 0x000268, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_ComponentBoundEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, K2Node_ComponentBoundEvent_SelectType) == 0x000278, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::K2Node_ComponentBoundEvent_SelectType' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, Temp_int_Loop_Counter_Variable) == 0x00027C, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000280, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000284, "Member 'W_JoinSessionMenu_C_ExecuteUbergraph_W_JoinSessionMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.FilterResults
// 0x0478 (0x0478 - 0x0000)
struct W_JoinSessionMenu_C_FilterResults final
{
public:
	TArray<struct FSteamSessionResult>            Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSteamSessionResult>            OutResults;                                        // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FSteamSessionResult>            Results;                                           // 0x0020(0x0010)(Edit, BlueprintVisible)
	struct FSteamSessionResult                    SessionResult;                                     // 0x0030(0x0130)(Edit, BlueprintVisible)
	class FString                                 CallFunc_No_Password_Code_ReturnValue;             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319D[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_No_Password_Code_ReturnValue_1;           // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319E[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0190(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue;         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319F[0x2];                                     // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A0[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A1[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionResult                    CallFunc_Array_Get_Item;                           // 0x01D0(0x0130)()
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_1;       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_2;       // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A2[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_3;       // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_4;       // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A3[0x2];                                     // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0310(0x0018)()
	class FString                                 CallFunc_GetServerName_ReturnValue;                // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A4[0x6];                                     // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionResult                    Temp_struct_Variable;                              // 0x0340(0x0130)(ConstParm)
	bool                                          CallFunc_VerifySessionSetting_ReturnValue_5;       // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_FilterResults) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_FilterResults");
static_assert(sizeof(W_JoinSessionMenu_C_FilterResults) == 0x000478, "Wrong size on W_JoinSessionMenu_C_FilterResults");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Array) == 0x000000, "Member 'W_JoinSessionMenu_C_FilterResults::Array' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, OutResults) == 0x000010, "Member 'W_JoinSessionMenu_C_FilterResults::OutResults' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Results) == 0x000020, "Member 'W_JoinSessionMenu_C_FilterResults::Results' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, SessionResult) == 0x000030, "Member 'W_JoinSessionMenu_C_FilterResults::SessionResult' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_No_Password_Code_ReturnValue) == 0x000160, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_No_Password_Code_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_No_Password_Code_ReturnValue_1) == 0x000178, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_No_Password_Code_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000188, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_GetText_ReturnValue) == 0x000190, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Conv_TextToString_ReturnValue) == 0x0001A8, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue) == 0x0001B8, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0001B9, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Temp_int_Loop_Counter_Variable) == 0x0001BC, "Member 'W_JoinSessionMenu_C_FilterResults::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Less_IntInt_ReturnValue) == 0x0001C0, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Add_IntInt_ReturnValue) == 0x0001C4, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Temp_int_Array_Index_Variable) == 0x0001C8, "Member 'W_JoinSessionMenu_C_FilterResults::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_1) == 0x000300, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_2) == 0x000301, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000302, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000303, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000304, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Array_Add_ReturnValue) == 0x000308, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_3) == 0x00030C, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_4) == 0x00030D, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_GetText_ReturnValue_1) == 0x000310, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_GetServerName_ReturnValue) == 0x000328, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_GetServerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_TextIsEmpty_ReturnValue) == 0x000338, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_Contains_ReturnValue) == 0x000339, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, Temp_struct_Variable) == 0x000340, "Member 'W_JoinSessionMenu_C_FilterResults::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_JoinSessionMenu_C_FilterResults, CallFunc_VerifySessionSetting_ReturnValue_5) == 0x000470, "Member 'W_JoinSessionMenu_C_FilterResults::CallFunc_VerifySessionSetting_ReturnValue_5' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.OnCallback_D727BDAF4FAB43F507DD30A14A3E42D7
// 0x0010 (0x0010 - 0x0000)
struct W_JoinSessionMenu_C_OnCallback_D727BDAF4FAB43F507DD30A14A3E42D7 final
{
public:
	TArray<struct FSteamSessionResult>            Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_JoinSessionMenu_C_OnCallback_D727BDAF4FAB43F507DD30A14A3E42D7) == 0x000008, "Wrong alignment on W_JoinSessionMenu_C_OnCallback_D727BDAF4FAB43F507DD30A14A3E42D7");
static_assert(sizeof(W_JoinSessionMenu_C_OnCallback_D727BDAF4FAB43F507DD30A14A3E42D7) == 0x000010, "Wrong size on W_JoinSessionMenu_C_OnCallback_D727BDAF4FAB43F507DD30A14A3E42D7");
static_assert(offsetof(W_JoinSessionMenu_C_OnCallback_D727BDAF4FAB43F507DD30A14A3E42D7, Results) == 0x000000, "Member 'W_JoinSessionMenu_C_OnCallback_D727BDAF4FAB43F507DD30A14A3E42D7::Results' has a wrong offset!");

// Function W_JoinSessionMenu.W_JoinSessionMenu_C.ShowJoiningText
// 0x0001 (0x0001 - 0x0000)
struct W_JoinSessionMenu_C_ShowJoiningText final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_JoinSessionMenu_C_ShowJoiningText) == 0x000001, "Wrong alignment on W_JoinSessionMenu_C_ShowJoiningText");
static_assert(sizeof(W_JoinSessionMenu_C_ShowJoiningText) == 0x000001, "Wrong size on W_JoinSessionMenu_C_ShowJoiningText");
static_assert(offsetof(W_JoinSessionMenu_C_ShowJoiningText, Show) == 0x000000, "Member 'W_JoinSessionMenu_C_ShowJoiningText::Show' has a wrong offset!");

}

