#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LeaderBoardSlot

#include "Basic.hpp"

#include "SteamCorePro_structs.hpp"


namespace SDK::Params
{

// Function W_LeaderBoardSlot.W_LeaderBoardSlot_C.ExecuteUbergraph_W_LeaderBoardSlot
// 0x0098 (0x0098 - 0x0000)
struct W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_306A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               K2Node_CustomEvent_SteamID;                        // 0x0008(0x0008)(NoDestructor)
	int32                                         K2Node_CustomEvent_Time;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Rank;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetFriendPersonaName_ReturnValue;         // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	class UTexture2D*                             CallFunc_GetSmallFriendAvatar_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot) == 0x000008, "Wrong alignment on W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot");
static_assert(sizeof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot) == 0x000098, "Wrong size on W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, EntryPoint) == 0x000000, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, K2Node_CustomEvent_SteamID) == 0x000008, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::K2Node_CustomEvent_SteamID' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, K2Node_CustomEvent_Time) == 0x000010, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, K2Node_CustomEvent_Rank) == 0x000014, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::K2Node_CustomEvent_Rank' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, CallFunc_GetFriendPersonaName_ReturnValue) == 0x000050, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::CallFunc_GetFriendPersonaName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot, CallFunc_GetSmallFriendAvatar_ReturnValue) == 0x000090, "Member 'W_LeaderBoardSlot_C_ExecuteUbergraph_W_LeaderBoardSlot::CallFunc_GetSmallFriendAvatar_ReturnValue' has a wrong offset!");

// Function W_LeaderBoardSlot.W_LeaderBoardSlot_C.RefreshSlot
// 0x0010 (0x0010 - 0x0000)
struct W_LeaderBoardSlot_C_RefreshSlot final
{
public:
	struct FSteamID                               Param_SteamID;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         Param_Time;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Rank;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LeaderBoardSlot_C_RefreshSlot) == 0x000008, "Wrong alignment on W_LeaderBoardSlot_C_RefreshSlot");
static_assert(sizeof(W_LeaderBoardSlot_C_RefreshSlot) == 0x000010, "Wrong size on W_LeaderBoardSlot_C_RefreshSlot");
static_assert(offsetof(W_LeaderBoardSlot_C_RefreshSlot, Param_SteamID) == 0x000000, "Member 'W_LeaderBoardSlot_C_RefreshSlot::Param_SteamID' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_RefreshSlot, Param_Time) == 0x000008, "Member 'W_LeaderBoardSlot_C_RefreshSlot::Param_Time' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardSlot_C_RefreshSlot, Param_Rank) == 0x00000C, "Member 'W_LeaderBoardSlot_C_RefreshSlot::Param_Rank' has a wrong offset!");

// Function W_LeaderBoardSlot.W_LeaderBoardSlot_C.UpdateTime
// 0x0018 (0x0018 - 0x0000)
struct W_LeaderBoardSlot_C_UpdateTime final
{
public:
	class FText                                   CallFunc_ConvertTimeToTextFormat_ReturnValue;      // 0x0000(0x0018)()
};
static_assert(alignof(W_LeaderBoardSlot_C_UpdateTime) == 0x000008, "Wrong alignment on W_LeaderBoardSlot_C_UpdateTime");
static_assert(sizeof(W_LeaderBoardSlot_C_UpdateTime) == 0x000018, "Wrong size on W_LeaderBoardSlot_C_UpdateTime");
static_assert(offsetof(W_LeaderBoardSlot_C_UpdateTime, CallFunc_ConvertTimeToTextFormat_ReturnValue) == 0x000000, "Member 'W_LeaderBoardSlot_C_UpdateTime::CallFunc_ConvertTimeToTextFormat_ReturnValue' has a wrong offset!");

}

