#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadingWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadingWorld.W_LoadingWorld_C
// 0x0018 (0x02D8 - 0x02C0)
class UW_LoadingWorld_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_344;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_LoadingWorld(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LoadingWorld_C">();
	}
	static class UW_LoadingWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LoadingWorld_C>();
	}
};
static_assert(alignof(UW_LoadingWorld_C) == 0x000008, "Wrong alignment on UW_LoadingWorld_C");
static_assert(sizeof(UW_LoadingWorld_C) == 0x0002D8, "Wrong size on UW_LoadingWorld_C");
static_assert(offsetof(UW_LoadingWorld_C, UberGraphFrame) == 0x0002C0, "Member 'UW_LoadingWorld_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LoadingWorld_C, NewAnimation) == 0x0002C8, "Member 'UW_LoadingWorld_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_LoadingWorld_C, Image_344) == 0x0002D0, "Member 'UW_LoadingWorld_C::Image_344' has a wrong offset!");

}

