#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadingScreen.W_LoadingScreen_C
// 0x0018 (0x02D8 - 0x02C0)
class UW_LoadingScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_35;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tips;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_LoadingScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LoadingScreen_C">();
	}
	static class UW_LoadingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LoadingScreen_C>();
	}
};
static_assert(alignof(UW_LoadingScreen_C) == 0x000008, "Wrong alignment on UW_LoadingScreen_C");
static_assert(sizeof(UW_LoadingScreen_C) == 0x0002D8, "Wrong size on UW_LoadingScreen_C");
static_assert(offsetof(UW_LoadingScreen_C, UberGraphFrame) == 0x0002C0, "Member 'UW_LoadingScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LoadingScreen_C, Image_35) == 0x0002C8, "Member 'UW_LoadingScreen_C::Image_35' has a wrong offset!");
static_assert(offsetof(UW_LoadingScreen_C, Tips) == 0x0002D0, "Member 'UW_LoadingScreen_C::Tips' has a wrong offset!");

}

