#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Lobby

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Lobby.W_Lobby_C.CountSelectedChars
// 0x0088 (0x0088 - 0x0000)
struct W_Lobby_C_CountSelectedChars final
{
public:
	int32                                         CountOut;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_LobbyCharacter_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	class ABP_LobbyCharacter_C*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F2[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F3[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F4[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F5[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F6[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_Lobby_C*                            K2Node_DynamicCast_AsPS_Lobby;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Lobby_C_CountSelectedChars) == 0x000008, "Wrong alignment on W_Lobby_C_CountSelectedChars");
static_assert(sizeof(W_Lobby_C_CountSelectedChars) == 0x000088, "Wrong size on W_Lobby_C_CountSelectedChars");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CountOut) == 0x000000, "Member 'W_Lobby_C_CountSelectedChars::CountOut' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, Count) == 0x000004, "Member 'W_Lobby_C_CountSelectedChars::Count' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, Temp_int_Array_Index_Variable) == 0x000008, "Member 'W_Lobby_C_CountSelectedChars::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, Temp_int_Variable) == 0x00000C, "Member 'W_Lobby_C_CountSelectedChars::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'W_Lobby_C_CountSelectedChars::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'W_Lobby_C_CountSelectedChars::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'W_Lobby_C_CountSelectedChars::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, Temp_int_Variable_1) == 0x000024, "Member 'W_Lobby_C_CountSelectedChars::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Array_Get_Item) == 0x000038, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000045, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x00004C, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Add_IntInt_ReturnValue_3) == 0x000050, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, K2Node_DynamicCast_AsPS_Lobby) == 0x000078, "Member 'W_Lobby_C_CountSelectedChars::K2Node_DynamicCast_AsPS_Lobby' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'W_Lobby_C_CountSelectedChars::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_CountSelectedChars, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000081, "Member 'W_Lobby_C_CountSelectedChars::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function W_Lobby.W_Lobby_C.ExecuteUbergraph_W_Lobby
// 0x00D0 (0x00D0 - 0x0000)
struct W_Lobby_C_ExecuteUbergraph_W_Lobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F7[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F8[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ConfirmPlay_C*                       CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F9[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountSelectedChars_CountOut;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayers_ReturnValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29FA[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance;            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29FB[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayers_ReturnValue_1;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game;                      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalMultiplayer_ReturnValue_1;        // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29FC[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstance_C>   K2Node_DynamicCast_AsBPI_Game_Instance_1;          // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29FD[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayersInSession_PlayersInSession;     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29FE[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29FF[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayers_ReturnValue_2;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A00[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Lobby_C_ExecuteUbergraph_W_Lobby) == 0x000008, "Wrong alignment on W_Lobby_C_ExecuteUbergraph_W_Lobby");
static_assert(sizeof(W_Lobby_C_ExecuteUbergraph_W_Lobby) == 0x0000D0, "Wrong size on W_Lobby_C_ExecuteUbergraph_W_Lobby");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, EntryPoint) == 0x000000, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, Temp_byte_Variable) == 0x000004, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, Temp_byte_Variable_1) == 0x000005, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, Temp_bool_Variable) == 0x000028, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, Temp_byte_Variable_2) == 0x000029, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, Temp_byte_Variable_3) == 0x00002A, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_Create_ReturnValue) == 0x000030, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_IsServer_ReturnValue) == 0x000038, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_IsServer_ReturnValue_1) == 0x000039, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_CountSelectedChars_CountOut) == 0x00003C, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_CountSelectedChars_CountOut' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetNumPlayers_ReturnValue) == 0x000048, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetNumPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_DynamicCast_AsBPI_Game_Instance) == 0x000050, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_DynamicCast_AsBPI_Game_Instance' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000061, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetNumPlayers_ReturnValue_1) == 0x000064, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetNumPlayers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetGameState_ReturnValue) == 0x000068, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_DynamicCast_AsGS_Game) == 0x000070, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_DynamicCast_AsGS_Game' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetLocalMultiplayer_ReturnValue) == 0x000079, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetLocalMultiplayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_Select_Default) == 0x00007A, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetLocalMultiplayer_ReturnValue_1) == 0x00007B, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetLocalMultiplayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetGameInstance_ReturnValue_1) == 0x000080, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_DynamicCast_AsBPI_Game_Instance_1) == 0x000088, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_DynamicCast_AsBPI_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, Temp_bool_Variable_1) == 0x000099, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetPlayersInSession_PlayersInSession) == 0x00009C, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetPlayersInSession_PlayersInSession' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_Select_Default_1) == 0x0000A0, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_SwitchInteger_CmpSuccess) == 0x0000A1, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetGameInstance_ReturnValue_2) == 0x0000B0, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_DynamicCast_AsCustom_GI) == 0x0000B8, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C1, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_GetNumPlayers_ReturnValue_2) == 0x0000C4, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_GetNumPlayers_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_ExecuteUbergraph_W_Lobby, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0000CC, "Member 'W_Lobby_C_ExecuteUbergraph_W_Lobby::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function W_Lobby.W_Lobby_C.GetText_0
// 0x0038 (0x0038 - 0x0000)
struct W_Lobby_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetNumPlayers_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A01[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(W_Lobby_C_GetText_0) == 0x000008, "Wrong alignment on W_Lobby_C_GetText_0");
static_assert(sizeof(W_Lobby_C_GetText_0) == 0x000038, "Wrong size on W_Lobby_C_GetText_0");
static_assert(offsetof(W_Lobby_C_GetText_0, ReturnValue) == 0x000000, "Member 'W_Lobby_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_GetText_0, CallFunc_GetNumPlayers_ReturnValue) == 0x000018, "Member 'W_Lobby_C_GetText_0::CallFunc_GetNumPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Lobby_C_GetText_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'W_Lobby_C_GetText_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

