#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_LoadingScreen.W_LoadingScreen_C.ExecuteUbergraph_W_LoadingScreen
// 0x00E8 (0x00E8 - 0x0000)
struct W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF1[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00C0(0x0018)()
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF2[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen) == 0x000008, "Wrong alignment on W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen");
static_assert(sizeof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen) == 0x0000E8, "Wrong size on W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, EntryPoint) == 0x000000, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_int_Variable) == 0x000008, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_object_Variable) == 0x000010, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_object_Variable_1) == 0x000018, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_object_Variable_2) == 0x000020, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_int_Variable_1) == 0x000028, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_text_Variable) == 0x000030, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_text_Variable_1) == 0x000048, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_text_Variable_2) == 0x000060, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_text_Variable_3) == 0x000078, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_text_Variable_4) == 0x000090, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, Temp_text_Variable_5) == 0x0000A8, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, K2Node_Select_Default) == 0x0000C0, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x0000D8, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen, K2Node_Select_Default_1) == 0x0000E0, "Member 'W_LoadingScreen_C_ExecuteUbergraph_W_LoadingScreen::K2Node_Select_Default_1' has a wrong offset!");

}

