#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MapButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MapButton.W_MapButton_C
// 0x0048 (0x0308 - 0x02C0)
class UW_MapButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_61;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_55;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3054[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_W_MapButton_C;                                // 0x02E0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UW_CreateSession_C*                     Parent;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CanClick;                                          // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_MapButton_Button_61_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Deselect();
	void ExecuteUbergraph_W_MapButton(int32 EntryPoint);
	void Select();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MapButton_C">();
	}
	static class UW_MapButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MapButton_C>();
	}
};
static_assert(alignof(UW_MapButton_C) == 0x000008, "Wrong alignment on UW_MapButton_C");
static_assert(sizeof(UW_MapButton_C) == 0x000308, "Wrong size on UW_MapButton_C");
static_assert(offsetof(UW_MapButton_C, UberGraphFrame) == 0x0002C0, "Member 'UW_MapButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_MapButton_C, Button_61) == 0x0002C8, "Member 'UW_MapButton_C::Button_61' has a wrong offset!");
static_assert(offsetof(UW_MapButton_C, Image_55) == 0x0002D0, "Member 'UW_MapButton_C::Image_55' has a wrong offset!");
static_assert(offsetof(UW_MapButton_C, Selected) == 0x0002D8, "Member 'UW_MapButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UW_MapButton_C, Name_W_MapButton_C) == 0x0002E0, "Member 'UW_MapButton_C::Name_W_MapButton_C' has a wrong offset!");
static_assert(offsetof(UW_MapButton_C, Parent) == 0x0002F8, "Member 'UW_MapButton_C::Parent' has a wrong offset!");
static_assert(offsetof(UW_MapButton_C, CanClick) == 0x000300, "Member 'UW_MapButton_C::CanClick' has a wrong offset!");

}

