#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MapButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_MapButton.W_MapButton_C.ExecuteUbergraph_W_MapButton
// 0x0030 (0x0030 - 0x0000)
struct W_MapButton_C_ExecuteUbergraph_W_MapButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_MapButton_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_MapButton_C*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3055[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MapButton_C_ExecuteUbergraph_W_MapButton) == 0x000008, "Wrong alignment on W_MapButton_C_ExecuteUbergraph_W_MapButton");
static_assert(sizeof(W_MapButton_C_ExecuteUbergraph_W_MapButton) == 0x000030, "Wrong size on W_MapButton_C_ExecuteUbergraph_W_MapButton");
static_assert(offsetof(W_MapButton_C_ExecuteUbergraph_W_MapButton, EntryPoint) == 0x000000, "Member 'W_MapButton_C_ExecuteUbergraph_W_MapButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MapButton_C_ExecuteUbergraph_W_MapButton, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_MapButton_C_ExecuteUbergraph_W_MapButton::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_MapButton_C_ExecuteUbergraph_W_MapButton, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'W_MapButton_C_ExecuteUbergraph_W_MapButton::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_MapButton_C_ExecuteUbergraph_W_MapButton, CallFunc_Array_Get_Item) == 0x000018, "Member 'W_MapButton_C_ExecuteUbergraph_W_MapButton::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_MapButton_C_ExecuteUbergraph_W_MapButton, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'W_MapButton_C_ExecuteUbergraph_W_MapButton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MapButton_C_ExecuteUbergraph_W_MapButton, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'W_MapButton_C_ExecuteUbergraph_W_MapButton::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_MapButton_C_ExecuteUbergraph_W_MapButton, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'W_MapButton_C_ExecuteUbergraph_W_MapButton::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MapButton_C_ExecuteUbergraph_W_MapButton, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'W_MapButton_C_ExecuteUbergraph_W_MapButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

