#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_NewSpeedrunSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_NewSpeedrunSlot.W_NewSpeedrunSlot_C.ExecuteUbergraph_W_NewSpeedrunSlot
// 0x0004 (0x0004 - 0x0000)
struct W_NewSpeedrunSlot_C_ExecuteUbergraph_W_NewSpeedrunSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_NewSpeedrunSlot_C_ExecuteUbergraph_W_NewSpeedrunSlot) == 0x000004, "Wrong alignment on W_NewSpeedrunSlot_C_ExecuteUbergraph_W_NewSpeedrunSlot");
static_assert(sizeof(W_NewSpeedrunSlot_C_ExecuteUbergraph_W_NewSpeedrunSlot) == 0x000004, "Wrong size on W_NewSpeedrunSlot_C_ExecuteUbergraph_W_NewSpeedrunSlot");
static_assert(offsetof(W_NewSpeedrunSlot_C_ExecuteUbergraph_W_NewSpeedrunSlot, EntryPoint) == 0x000000, "Member 'W_NewSpeedrunSlot_C_ExecuteUbergraph_W_NewSpeedrunSlot::EntryPoint' has a wrong offset!");

// Function W_NewSpeedrunSlot.W_NewSpeedrunSlot_C.UpdateDate
// 0x0028 (0x0028 - 0x0000)
struct W_NewSpeedrunSlot_C_UpdateDate final
{
public:
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(W_NewSpeedrunSlot_C_UpdateDate) == 0x000008, "Wrong alignment on W_NewSpeedrunSlot_C_UpdateDate");
static_assert(sizeof(W_NewSpeedrunSlot_C_UpdateDate) == 0x000028, "Wrong size on W_NewSpeedrunSlot_C_UpdateDate");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdateDate, CallFunc_GetStringField_ReturnValue) == 0x000000, "Member 'W_NewSpeedrunSlot_C_UpdateDate::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdateDate, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'W_NewSpeedrunSlot_C_UpdateDate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_NewSpeedrunSlot.W_NewSpeedrunSlot_C.UpdatePlace
// 0x0040 (0x0040 - 0x0000)
struct W_NewSpeedrunSlot_C_UpdatePlace final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(W_NewSpeedrunSlot_C_UpdatePlace) == 0x000008, "Wrong alignment on W_NewSpeedrunSlot_C_UpdatePlace");
static_assert(sizeof(W_NewSpeedrunSlot_C_UpdatePlace) == 0x000040, "Wrong size on W_NewSpeedrunSlot_C_UpdatePlace");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlace, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'W_NewSpeedrunSlot_C_UpdatePlace::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlace, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'W_NewSpeedrunSlot_C_UpdatePlace::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlace, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'W_NewSpeedrunSlot_C_UpdatePlace::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlace, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'W_NewSpeedrunSlot_C_UpdatePlace::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_NewSpeedrunSlot.W_NewSpeedrunSlot_C.UpdatePlayers
// 0x0098 (0x0098 - 0x0000)
struct W_NewSpeedrunSlot_C_UpdatePlayers final
{
public:
	class UW_SpeedrunPlayer_C*                    CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UVaRestJsonValue*>               CallFunc_GetArrayField_ReturnValue;                // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonValue*                       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_NewSpeedrunSlot_C_UpdatePlayers) == 0x000008, "Wrong alignment on W_NewSpeedrunSlot_C_UpdatePlayers");
static_assert(sizeof(W_NewSpeedrunSlot_C_UpdatePlayers) == 0x000098, "Wrong size on W_NewSpeedrunSlot_C_UpdatePlayers");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_Create_ReturnValue) == 0x000000, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, Temp_int_Array_Index_Variable) == 0x000008, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_GetArrayField_ReturnValue) == 0x000020, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_GetArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_Array_Get_Item) == 0x000038, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_AsObject_ReturnValue) == 0x000048, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_AsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_GetStringField_ReturnValue) == 0x000050, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_GetStringField_ReturnValue_1) == 0x000060, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000070, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_GetStringField_ReturnValue_2) == 0x000078, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdatePlayers, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'W_NewSpeedrunSlot_C_UpdatePlayers::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function W_NewSpeedrunSlot.W_NewSpeedrunSlot_C.UpdateTime
// 0x0040 (0x0040 - 0x0000)
struct W_NewSpeedrunSlot_C_UpdateTime final
{
public:
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntegerField_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_ConvertTimeToTextFormat_ReturnValue;      // 0x0028(0x0018)()
};
static_assert(alignof(W_NewSpeedrunSlot_C_UpdateTime) == 0x000008, "Wrong alignment on W_NewSpeedrunSlot_C_UpdateTime");
static_assert(sizeof(W_NewSpeedrunSlot_C_UpdateTime) == 0x000040, "Wrong size on W_NewSpeedrunSlot_C_UpdateTime");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdateTime, CallFunc_GetField_ReturnValue) == 0x000000, "Member 'W_NewSpeedrunSlot_C_UpdateTime::CallFunc_GetField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdateTime, CallFunc_AsObject_ReturnValue) == 0x000008, "Member 'W_NewSpeedrunSlot_C_UpdateTime::CallFunc_AsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdateTime, CallFunc_GetIntegerField_ReturnValue) == 0x000010, "Member 'W_NewSpeedrunSlot_C_UpdateTime::CallFunc_GetIntegerField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdateTime, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'W_NewSpeedrunSlot_C_UpdateTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewSpeedrunSlot_C_UpdateTime, CallFunc_ConvertTimeToTextFormat_ReturnValue) == 0x000028, "Member 'W_NewSpeedrunSlot_C_UpdateTime::CallFunc_ConvertTimeToTextFormat_ReturnValue' has a wrong offset!");

}

