#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_NewSpeedrunSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_NewSpeedrunSlot.W_NewSpeedrunSlot_C
// 0x0038 (0x02F8 - 0x02C0)
class UW_NewSpeedrunSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Date;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Order;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PlayersBox;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Time;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVaRestJsonObject*                      RunObjectReference;                                // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_NewSpeedrunSlot(int32 EntryPoint);
	void UpdateDate();
	void UpdatePlace();
	void UpdatePlayers();
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_NewSpeedrunSlot_C">();
	}
	static class UW_NewSpeedrunSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_NewSpeedrunSlot_C>();
	}
};
static_assert(alignof(UW_NewSpeedrunSlot_C) == 0x000008, "Wrong alignment on UW_NewSpeedrunSlot_C");
static_assert(sizeof(UW_NewSpeedrunSlot_C) == 0x0002F8, "Wrong size on UW_NewSpeedrunSlot_C");
static_assert(offsetof(UW_NewSpeedrunSlot_C, UberGraphFrame) == 0x0002C0, "Member 'UW_NewSpeedrunSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_NewSpeedrunSlot_C, Date) == 0x0002C8, "Member 'UW_NewSpeedrunSlot_C::Date' has a wrong offset!");
static_assert(offsetof(UW_NewSpeedrunSlot_C, Order) == 0x0002D0, "Member 'UW_NewSpeedrunSlot_C::Order' has a wrong offset!");
static_assert(offsetof(UW_NewSpeedrunSlot_C, PlayersBox) == 0x0002D8, "Member 'UW_NewSpeedrunSlot_C::PlayersBox' has a wrong offset!");
static_assert(offsetof(UW_NewSpeedrunSlot_C, Time) == 0x0002E0, "Member 'UW_NewSpeedrunSlot_C::Time' has a wrong offset!");
static_assert(offsetof(UW_NewSpeedrunSlot_C, RunObjectReference) == 0x0002E8, "Member 'UW_NewSpeedrunSlot_C::RunObjectReference' has a wrong offset!");
static_assert(offsetof(UW_NewSpeedrunSlot_C, Index_0) == 0x0002F0, "Member 'UW_NewSpeedrunSlot_C::Index_0' has a wrong offset!");

}

