#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Notification

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Notification.W_Notification_C.ExecuteUbergraph_W_Notification
// 0x0060 (0x0060 - 0x0000)
struct W_Notification_C_ExecuteUbergraph_W_Notification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3047[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3048[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3049[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Notification_C_ExecuteUbergraph_W_Notification) == 0x000008, "Wrong alignment on W_Notification_C_ExecuteUbergraph_W_Notification");
static_assert(sizeof(W_Notification_C_ExecuteUbergraph_W_Notification) == 0x000060, "Wrong size on W_Notification_C_ExecuteUbergraph_W_Notification");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, EntryPoint) == 0x000000, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000040, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000048, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000050, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_Delay_Duration_ImplicitCast) == 0x00005C, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

