#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ResolutionConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ResolutionConfirmation.W_ResolutionConfirmation_C
// 0x0030 (0x02F0 - 0x02C0)
class UW_ResolutionConfirmation_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Button_C*                            CancelButton;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            ConfirmButton;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_357;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_427;                                     // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Timer;                                             // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_ResolutionConfirmation_W_Button_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__W_ResolutionConfirmation_W_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Cancel();
	void Construct();
	void ExecuteUbergraph_W_ResolutionConfirmation(int32 EntryPoint);
	void FocusOnSettingsMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ResolutionConfirmation_C">();
	}
	static class UW_ResolutionConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ResolutionConfirmation_C>();
	}
};
static_assert(alignof(UW_ResolutionConfirmation_C) == 0x000008, "Wrong alignment on UW_ResolutionConfirmation_C");
static_assert(sizeof(UW_ResolutionConfirmation_C) == 0x0002F0, "Wrong size on UW_ResolutionConfirmation_C");
static_assert(offsetof(UW_ResolutionConfirmation_C, UberGraphFrame) == 0x0002C0, "Member 'UW_ResolutionConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ResolutionConfirmation_C, CancelButton) == 0x0002C8, "Member 'UW_ResolutionConfirmation_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UW_ResolutionConfirmation_C, ConfirmButton) == 0x0002D0, "Member 'UW_ResolutionConfirmation_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UW_ResolutionConfirmation_C, Image_357) == 0x0002D8, "Member 'UW_ResolutionConfirmation_C::Image_357' has a wrong offset!");
static_assert(offsetof(UW_ResolutionConfirmation_C, TextBlock_427) == 0x0002E0, "Member 'UW_ResolutionConfirmation_C::TextBlock_427' has a wrong offset!");
static_assert(offsetof(UW_ResolutionConfirmation_C, Timer) == 0x0002E8, "Member 'UW_ResolutionConfirmation_C::Timer' has a wrong offset!");

}

