#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingsMain

#include "Basic.hpp"

#include "E_SettingSubCategory_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "E_Gamemodes_structs.hpp"
#include "S_Setting_structs.hpp"
#include "S_Checkpoint_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_ProgressSave_structs.hpp"


namespace SDK::Params
{

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.CheckCheckpointOption
// 0x0070 (0x0070 - 0x0000)
struct W_SettingsMain_C_CheckCheckpointOption final
{
public:
	TArray<struct FS_Checkpoint>                  Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Option;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Saved;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Checkpoint                          SaveInfos;                                         // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332B[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Checkpoint                          CallFunc_Array_Get_Item;                           // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332C[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_CheckCheckpointOption) == 0x000008, "Wrong alignment on W_SettingsMain_C_CheckCheckpointOption");
static_assert(sizeof(W_SettingsMain_C_CheckCheckpointOption) == 0x000070, "Wrong size on W_SettingsMain_C_CheckCheckpointOption");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Array) == 0x000000, "Member 'W_SettingsMain_C_CheckCheckpointOption::Array' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Option) == 0x000010, "Member 'W_SettingsMain_C_CheckCheckpointOption::Option' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Saved) == 0x000020, "Member 'W_SettingsMain_C_CheckCheckpointOption::Saved' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, SaveInfos) == 0x000028, "Member 'W_SettingsMain_C_CheckCheckpointOption::SaveInfos' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Temp_int_Array_Index_Variable) == 0x000044, "Member 'W_SettingsMain_C_CheckCheckpointOption::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'W_SettingsMain_C_CheckCheckpointOption::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_Array_Get_Item) == 0x000050, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000069, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.ExecuteUbergraph_W_SettingsMain
// 0x08A8 (0x08A8 - 0x0000)
struct W_SettingsMain_C_ExecuteUbergraph_W_SettingsMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ConfirmQuit_C*                       CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Gamemodes                                   Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332F[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ProgressSave>                Temp_struct_Variable;                              // 0x0030(0x0010)(ReferenceParm)
	class FString                                 K2Node_Event_TabCategory;                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_SelectedTab;                          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_WidgetTab_C>      K2Node_DynamicCast_AsBPI_Widget_Tab;               // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3330[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_Tab_C*>                       CallFunc_GetSettingsTabs_Array;                    // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3331[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_WidgetTab_C>      K2Node_DynamicCast_AsBPI_Widget_Tab_1;             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3332[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ControllerWithSettings_C> K2Node_DynamicCast_AsBPI_Controller_with_Settings; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3333[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save;  // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3334[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save_1; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3335[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save_2; // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3336[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3337[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_1;                    // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3338[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ControllerWithSettings_C> K2Node_DynamicCast_AsBPI_Controller_with_Settings_1; // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3339[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate;                // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333A[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game_2;                    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333B[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_W_C*                          CallFunc_Create_ReturnValue_1;                     // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ControllerWithSettings_C> K2Node_DynamicCast_AsBPI_Controller_with_Settings_2; // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333C[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> K2Node_DynamicCast_AsBPI_Game_Instance_with_Save_3; // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333D[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_Checkpoint>                  CallFunc_GetCheckpoints_Checkpoints;               // 0x01E8(0x0010)(ReferenceParm)
	class FString                                 K2Node_ComponentBoundEvent_NewSelection_8;         // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType_8;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333E[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACheckpoint_BP_C*                       CallFunc_GetCheckpointByName_Checkpoint;           // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCheckpointByName_Found;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCheckpointOption_Saved;              // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333F[0x6];                                     // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Checkpoint                          CallFunc_CheckCheckpointOption_SaveInfos;          // 0x0220(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class UW_ConfirmQuit_C*                       CallFunc_Create_ReturnValue_2;                     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3340[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate_1;              // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3341[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Tab_C*                               CallFunc_Array_Get_Item;                           // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLaveMode_Lava;                         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3342[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_WidgetTab_C>      K2Node_DynamicCast_AsBPI_Widget_Tab_2;             // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3343[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Gamestate_C>      K2Node_DynamicCast_AsBPI_Gamestate_2;              // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Someone_Driving_Car_Server__ReturnValue; // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3344[0x6];                                     // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomCar_C*                        CallFunc_Is_Someone_Driving_Car_Server__AsBP_Custom_Car; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearestRescuePoint_Found;                 // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3345[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RescuePoint_C*                      CallFunc_NearestRescuePoint_RescuePoint;           // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Someone_Driving_Car_Server__ReturnValue_1; // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3346[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomCar_C*                        CallFunc_Is_Someone_Driving_Car_Server__AsBP_Custom_Car_1; // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_8;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Setting_8;              // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UV_SaveGame_C*                          CallFunc_GetSaveGame_SaveGame;                     // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_NewSelection_7;         // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType_7;           // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
