#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingsVerticalBox

#include "Basic.hpp"

#include "E_SettingSubCategory_structs.hpp"


namespace SDK::Params
{

// Function W_SettingsVerticalBox.W_SettingsVerticalBox_C.Try Add Setting Subcategory
// 0x0038 (0x0038 - 0x0000)
struct W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory final
{
public:
	E_SettingSubCategory                          SubCategory;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C93[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SettingSubCategory_C*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_SettingSubCategory                          SubcategoryLocal;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C94[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SettingSubCategory_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_SettingSubCategory_C*                CallFunc_Map_Find_Value;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory) == 0x000008, "Wrong alignment on W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory");
static_assert(sizeof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory) == 0x000038, "Wrong size on W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory");
static_assert(offsetof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory, SubCategory) == 0x000000, "Member 'W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory::SubCategory' has a wrong offset!");
static_assert(offsetof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory, ReturnValue) == 0x000008, "Member 'W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory, SubcategoryLocal) == 0x000010, "Member 'W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory::SubcategoryLocal' has a wrong offset!");
static_assert(offsetof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory, CallFunc_Create_ReturnValue) == 0x000018, "Member 'W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000020, "Member 'W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory, CallFunc_Map_Find_Value) == 0x000028, "Member 'W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'W_SettingsVerticalBox_C_Try_Add_Setting_Subcategory::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

