#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingSubCategory

#include "Basic.hpp"

#include "S_Setting_structs.hpp"


namespace SDK::Params
{

// Function W_SettingSubCategory.W_SettingSubCategory_C.AddSetting
// 0x00A8 (0x00A8 - 0x0000)
struct W_SettingSubCategory_C_AddSetting final
{
public:
	struct FS_Setting                             Setting;                                           // 0x0000(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UW_Setting_C*                           ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Setting_C*                           CallFunc_Create_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingSubCategory_C_AddSetting) == 0x000008, "Wrong alignment on W_SettingSubCategory_C_AddSetting");
static_assert(sizeof(W_SettingSubCategory_C_AddSetting) == 0x0000A8, "Wrong size on W_SettingSubCategory_C_AddSetting");
static_assert(offsetof(W_SettingSubCategory_C_AddSetting, Setting) == 0x000000, "Member 'W_SettingSubCategory_C_AddSetting::Setting' has a wrong offset!");
static_assert(offsetof(W_SettingSubCategory_C_AddSetting, ReturnValue) == 0x000090, "Member 'W_SettingSubCategory_C_AddSetting::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingSubCategory_C_AddSetting, CallFunc_Create_ReturnValue) == 0x000098, "Member 'W_SettingSubCategory_C_AddSetting::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingSubCategory_C_AddSetting, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000A0, "Member 'W_SettingSubCategory_C_AddSetting::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function W_SettingSubCategory.W_SettingSubCategory_C.ExecuteUbergraph_W_SettingSubCategory
// 0x0030 (0x0030 - 0x0000)
struct W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EBC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory) == 0x000008, "Wrong alignment on W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory");
static_assert(sizeof(W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory) == 0x000030, "Wrong size on W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory");
static_assert(offsetof(W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory, EntryPoint) == 0x000000, "Member 'W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'W_SettingSubCategory_C_ExecuteUbergraph_W_SettingSubCategory::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

