#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingsMain

#include "Basic.hpp"

#include "E_SettingSubCategory_structs.hpp"
#include "S_Setting_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "S_Checkpoint_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_DialogsVolume_K2Node_ComponentBoundEvent_25_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Effects_K2Node_ComponentBoundEvent_33_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_EffectsVolume_K2Node_ComponentBoundEvent_24_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Gamma_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_InvertX_K2Node_ComponentBoundEvent_26_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_InvertY_K2Node_ComponentBoundEvent_27_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_LanguageBox_K2Node_ComponentBoundEvent_37_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MasterVolume_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MAXFPS_K2Node_ComponentBoundEvent_22_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MotionBlur_K2Node_ComponentBoundEvent_5_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_MusicVolume_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_PP_Quality_K2Node_ComponentBoundEvent_34_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Resolution_K2Node_ComponentBoundEvent_9_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ResolutionScale_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_1_K2Node_ComponentBoundEvent_16_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ShadowQuality_K2Node_ComponentBoundEvent_14_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_Sharpen_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_SSR_K2Node_ComponentBoundEvent_32_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_TextureQuality_K2Node_ComponentBoundEvent_36_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_ViewDistance_K2Node_ComponentBoundEvent_31_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_VSync_K2Node_ComponentBoundEvent_21_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_W_ComboBox_K2Node_ComponentBoundEvent_15_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_WindowedMode_K2Node_ComponentBoundEvent_10_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_XSensitivity_K2Node_ComponentBoundEvent_28_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Setting;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature, Setting) == 0x000008, "Member 'W_SettingsMain_C_BndEvt__W_SettingsMain_YSensitivity_K2Node_ComponentBoundEvent_29_OnValueChanged__DelegateSignature::Setting' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.CheckCheckpointOption
// 0x0070 (0x0070 - 0x0000)
struct W_SettingsMain_C_CheckCheckpointOption final
{
public:
	TArray<struct FS_Checkpoint>                  Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Option;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Saved;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3483[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Checkpoint                          SaveInfos;                                         // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3484[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Checkpoint                          CallFunc_Array_Get_Item;                           // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3485[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsMain_C_CheckCheckpointOption) == 0x000008, "Wrong alignment on W_SettingsMain_C_CheckCheckpointOption");
static_assert(sizeof(W_SettingsMain_C_CheckCheckpointOption) == 0x000070, "Wrong size on W_SettingsMain_C_CheckCheckpointOption");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Array) == 0x000000, "Member 'W_SettingsMain_C_CheckCheckpointOption::Array' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Option) == 0x000010, "Member 'W_SettingsMain_C_CheckCheckpointOption::Option' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Saved) == 0x000020, "Member 'W_SettingsMain_C_CheckCheckpointOption::Saved' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, SaveInfos) == 0x000028, "Member 'W_SettingsMain_C_CheckCheckpointOption::SaveInfos' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Temp_int_Array_Index_Variable) == 0x000044, "Member 'W_SettingsMain_C_CheckCheckpointOption::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'W_SettingsMain_C_CheckCheckpointOption::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_Array_Get_Item) == 0x000050, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000069, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsMain_C_CheckCheckpointOption, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'W_SettingsMain_C_CheckCheckpointOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function W_SettingsMain.W_SettingsMain_C.ExecuteUbergraph_W_SettingsMain
// 0x0900 (0x0900 - 0x0000)
struct W_SettingsMain_C_ExecuteUbergraph_W_SettingsMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3486[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGS_Game_C*                             K2Node_DynamicCast_AsGS_Game;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3487[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ResolutionConfirmation_C*            CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3488[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ConfirmQuit_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ConfirmQuit_C*                       CallFunc_Create_ReturnValue_2;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_TabCategory;                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_SelectedTab;                          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_WidgetTab_C>      K2Node_DynamicCast_AsBPI_Widget_Tab;               // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3489[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_Tab_C*>                       CallFunc_GetSettingsTabs_Array;                    // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Tab_C*                               CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_WidgetTab_C>      K2Node_DynamicCast_AsBPI_Widget_Tab_1;             // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348A[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_WidgetTab_C>      K2Node_DynamicCast_AsBPI_Widget_Tab_2;             // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
