#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Slider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Slider.W_Slider_C
// 0x0050 (0x0310 - 0x02C0)
class UW_Slider_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USlider*                                Slider_119;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_149;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        StepSize;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        MinValue;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        MaxValue;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnValueChanged;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 Identifier;                                        // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_Slider_Slider_119_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void ExecuteUbergraph_W_Slider(int32 EntryPoint);
	void OnValueChanged__DelegateSignature(double Value, const class FString& Setting);
	void PreConstruct(bool IsDesignTime);
	void Refresh_Slider_Params(const struct FS_SliderParams& Params_0, const class FString& Setting);
	void SetSliderValue(double InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Slider_C">();
	}
	static class UW_Slider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Slider_C>();
	}
};
static_assert(alignof(UW_Slider_C) == 0x000008, "Wrong alignment on UW_Slider_C");
static_assert(sizeof(UW_Slider_C) == 0x000310, "Wrong size on UW_Slider_C");
static_assert(offsetof(UW_Slider_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Slider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Slider_C, Slider_119) == 0x0002C8, "Member 'UW_Slider_C::Slider_119' has a wrong offset!");
static_assert(offsetof(UW_Slider_C, TextBlock_149) == 0x0002D0, "Member 'UW_Slider_C::TextBlock_149' has a wrong offset!");
static_assert(offsetof(UW_Slider_C, StepSize) == 0x0002D8, "Member 'UW_Slider_C::StepSize' has a wrong offset!");
static_assert(offsetof(UW_Slider_C, MinValue) == 0x0002E0, "Member 'UW_Slider_C::MinValue' has a wrong offset!");
static_assert(offsetof(UW_Slider_C, MaxValue) == 0x0002E8, "Member 'UW_Slider_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UW_Slider_C, OnValueChanged) == 0x0002F0, "Member 'UW_Slider_C::OnValueChanged' has a wrong offset!");
static_assert(offsetof(UW_Slider_C, Identifier) == 0x000300, "Member 'UW_Slider_C::Identifier' has a wrong offset!");

}

