#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SpeedrunCom

#include "Basic.hpp"

#include "Speedrun_Category_S_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Speedrun_IDAndName_structs.hpp"


namespace SDK::Params
{

// Function W_SpeedrunCom.W_SpeedrunCom_C.BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ID;                                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature) == 0x000008, "Wrong alignment on W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature");
static_assert(sizeof(W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature) == 0x000028, "Wrong size on W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature");
static_assert(offsetof(W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature, SelectType) == 0x000010, "Member 'W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature::SelectType' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature, ID) == 0x000018, "Member 'W_SpeedrunCom_C_BndEvt__W_SpeedrunCom_W_ComboBox_Leaderboard_K2Node_ComponentBoundEvent_2_OnComboSettingChange__DelegateSignature::ID' has a wrong offset!");

// Function W_SpeedrunCom.W_SpeedrunCom_C.ConstructSearchURL
// 0x00A0 (0x00A0 - 0x0000)
struct W_SpeedrunCom_C_ConstructSearchURL final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_C_ConstructSearchURL) == 0x000008, "Wrong alignment on W_SpeedrunCom_C_ConstructSearchURL");
static_assert(sizeof(W_SpeedrunCom_C_ConstructSearchURL) == 0x0000A0, "Wrong size on W_SpeedrunCom_C_ConstructSearchURL");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, ReturnValue) == 0x000000, "Member 'W_SpeedrunCom_C_ConstructSearchURL::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000020, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000030, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000040, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000050, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000060, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000070, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000080, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ConstructSearchURL, CallFunc_SelectString_ReturnValue) == 0x000090, "Member 'W_SpeedrunCom_C_ConstructSearchURL::CallFunc_SelectString_ReturnValue' has a wrong offset!");

// Function W_SpeedrunCom.W_SpeedrunCom_C.CustomEvent
// 0x0020 (0x0020 - 0x0000)
struct W_SpeedrunCom_C_CustomEvent final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ID;                                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_C_CustomEvent) == 0x000008, "Wrong alignment on W_SpeedrunCom_C_CustomEvent");
static_assert(sizeof(W_SpeedrunCom_C_CustomEvent) == 0x000020, "Wrong size on W_SpeedrunCom_C_CustomEvent");
static_assert(offsetof(W_SpeedrunCom_C_CustomEvent, NewSelection) == 0x000000, "Member 'W_SpeedrunCom_C_CustomEvent::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_CustomEvent, ID) == 0x000010, "Member 'W_SpeedrunCom_C_CustomEvent::ID' has a wrong offset!");

// Function W_SpeedrunCom.W_SpeedrunCom_C.CustomEvent_0
// 0x0010 (0x0010 - 0x0000)
struct W_SpeedrunCom_C_CustomEvent_0 final
{
public:
	class FString                                 DefaultID;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_C_CustomEvent_0) == 0x000008, "Wrong alignment on W_SpeedrunCom_C_CustomEvent_0");
static_assert(sizeof(W_SpeedrunCom_C_CustomEvent_0) == 0x000010, "Wrong size on W_SpeedrunCom_C_CustomEvent_0");
static_assert(offsetof(W_SpeedrunCom_C_CustomEvent_0, DefaultID) == 0x000000, "Member 'W_SpeedrunCom_C_CustomEvent_0::DefaultID' has a wrong offset!");

// Function W_SpeedrunCom.W_SpeedrunCom_C.CustomEvent_1
// 0x0020 (0x0020 - 0x0000)
struct W_SpeedrunCom_C_CustomEvent_1 final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ID;                                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_C_CustomEvent_1) == 0x000008, "Wrong alignment on W_SpeedrunCom_C_CustomEvent_1");
static_assert(sizeof(W_SpeedrunCom_C_CustomEvent_1) == 0x000020, "Wrong size on W_SpeedrunCom_C_CustomEvent_1");
static_assert(offsetof(W_SpeedrunCom_C_CustomEvent_1, NewSelection) == 0x000000, "Member 'W_SpeedrunCom_C_CustomEvent_1::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_CustomEvent_1, ID) == 0x000010, "Member 'W_SpeedrunCom_C_CustomEvent_1::ID' has a wrong offset!");

// Function W_SpeedrunCom.W_SpeedrunCom_C.CustomEvent_2
// 0x0010 (0x0010 - 0x0000)
struct W_SpeedrunCom_C_CustomEvent_2 final
{
public:
	class FString                                 DefaultID;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_C_CustomEvent_2) == 0x000008, "Wrong alignment on W_SpeedrunCom_C_CustomEvent_2");
static_assert(sizeof(W_SpeedrunCom_C_CustomEvent_2) == 0x000010, "Wrong size on W_SpeedrunCom_C_CustomEvent_2");
static_assert(offsetof(W_SpeedrunCom_C_CustomEvent_2, DefaultID) == 0x000000, "Member 'W_SpeedrunCom_C_CustomEvent_2::DefaultID' has a wrong offset!");

// Function W_SpeedrunCom.W_SpeedrunCom_C.Delimiter
// 0x0010 (0x0010 - 0x0000)
struct W_SpeedrunCom_C_Delimiter final
{
public:
	class FString                                 DelimiterS;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_C_Delimiter) == 0x000008, "Wrong alignment on W_SpeedrunCom_C_Delimiter");
static_assert(sizeof(W_SpeedrunCom_C_Delimiter) == 0x000010, "Wrong size on W_SpeedrunCom_C_Delimiter");
static_assert(offsetof(W_SpeedrunCom_C_Delimiter, DelimiterS) == 0x000000, "Member 'W_SpeedrunCom_C_Delimiter::DelimiterS' has a wrong offset!");

// Function W_SpeedrunCom.W_SpeedrunCom_C.ExecuteUbergraph_W_SpeedrunCom
// 0x0590 (0x0590 - 0x0000)
struct W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UW_SpeedrunSettings_C*                  CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& NewSelection, const class FString& ID)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const class FString& DefaultID)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_SpeedrunSettings_C*                  CallFunc_Create_ReturnValue_1;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& NewSelection, const class FString& ID)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& DefaultID)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_ConstructVaRestJsonObject_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const class FString& NewSelection, const class FString& ID)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_SpeedrunSettings_C*                  CallFunc_Create_ReturnValue_2;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_ConstructVaRestJsonObject_ReturnValue_1;  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_3;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVaRestRequestJSON* Request)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestRequestJSON*                     K2Node_CustomEvent_Request_3;                      // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_GetResponseObject_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Level_ID;                       // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue;                     // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UVaRestJsonValue*>               CallFunc_GetArrayField_ReturnValue;                // 0x0178(0x0010)(ReferenceParm)
	class UVaRestJsonValue*                       CallFunc_Array_Get_Item;                           // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_1;                   // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_4;         // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_ConstructVaRestJsonObject_ReturnValue_2;  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_5;         // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestRequestJSON*                     K2Node_CustomEvent_Request_2;                      // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_GetResponseObject_ReturnValue_1;          // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UVaRestJsonValue*>               CallFunc_GetArrayField_ReturnValue_1;              // 0x01F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpeedrun_IDAndName>            CallFunc_Map_Values_Values;                        // 0x0210(0x0010)(ReferenceParm)
	class UVaRestJsonValue*                       CallFunc_Array_Get_Item_1;                         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_2;                   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_3;             // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSpeedrun_IDAndName                    K2Node_MakeStruct_Speedrun_IDAndName;              // 0x0258(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_NewSelection;           // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectType;             // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_ID;                     // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_CategoryID;                     // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestRequestJSON*                     K2Node_CustomEvent_Request_1;                      // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_GetResponseObject_ReturnValue_2;          // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UVaRestJsonValue*>               CallFunc_GetArrayField_ReturnValue_2;              // 0x02F0(0x0010)(ReferenceParm)
	class UVaRestJsonValue*                       CallFunc_Array_Get_Item_2;                         // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_3;                   // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVaRestJsonValue*>               CallFunc_GetArrayField_ReturnValue_3;              // 0x0320(0x0010)(ReferenceParm)
	class UVaRestJsonValue*                       CallFunc_Array_Get_Item_3;                         // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_4;                   // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_4;             // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_5;             // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSpeedrun_IDAndName                    CallFunc_Array_Get_Item_4;                         // 0x0380(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendID_And_Name_String;                 // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NewSelection_2;                 // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ID_2;                           // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestRequestJSON*                     K2Node_CustomEvent_Request;                        // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_GetResponseObject_ReturnValue_3;          // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_1;                   // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_5;                   // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UVaRestJsonValue*>               CallFunc_GetArrayField_ReturnValue_4;              // 0x0408(0x0010)(ReferenceParm)
	class FString                                 CallFunc_MakeVariablesSearchString_String;         // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UVaRestRequestJSON* Request)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0428(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeVariablesSearchString_String_1;       // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ConstructSearchURL_ReturnValue;           // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatURL_CompatibleURL;                  // 0x0460(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ConstructSearchURL_ReturnValue_1;         // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatURL_CompatibleURL_1;                // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UW_NewSpeedrunSlot_C*                   CallFunc_Create_ReturnValue_3;                     // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_Array_Get_Item_5;                         // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_6;                   // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_2;                   // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_7;                   // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_6;         // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVaRestRequestJSON* Request)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x04E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_7;         // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_ConstructVaRestJsonObject_ReturnValue_3;  // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_DefaultID_1;                    // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NewSelection_1;                 // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ID_1;                           // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x0530(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVaRestRequestJSON* Request)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0538(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_DefaultID;                      // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NewSelection;                   // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ID;                             // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_2;    // 0x0588(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom) == 0x000008, "Wrong alignment on W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom");
static_assert(sizeof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom) == 0x000590, "Wrong size on W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, EntryPoint) == 0x000000, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_MakeStruct_Margin) == 0x000010, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Create_ReturnValue) == 0x000020, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_MakeStruct_Margin_1) == 0x000038, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Create_ReturnValue_1) == 0x000058, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Array_Index_Variable) == 0x000070, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000080, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_ConstructVaRestJsonObject_ReturnValue) == 0x000098, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_ConstructVaRestJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_MakeStruct_Margin_2) == 0x0000A0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Create_ReturnValue_2) == 0x0000C0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Array_Index_Variable_1) == 0x0000C8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Loop_Counter_Variable_1) == 0x0000CC, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Array_Index_Variable_2) == 0x0000D4, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetEngineSubsystem_ReturnValue_2) == 0x0000D8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetEngineSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_ConstructVaRestJsonObject_ReturnValue_1) == 0x0000E0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_ConstructVaRestJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetEngineSubsystem_ReturnValue_3) == 0x0000E8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetEngineSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Loop_Counter_Variable_2) == 0x0000F0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000F4, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Add_IntInt_ReturnValue_2) == 0x000104, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Loop_Counter_Variable_3) == 0x000108, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Add_IntInt_ReturnValue_3) == 0x00010C, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Array_Index_Variable_3) == 0x000110, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CustomEvent_Request_3) == 0x000118, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CustomEvent_Request_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetResponseObject_ReturnValue) == 0x000128, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetResponseObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetField_ReturnValue) == 0x000130, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CustomEvent_Level_ID) == 0x000138, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CustomEvent_Level_ID' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_IsValid_ReturnValue_1) == 0x000148, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000149, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_SelectString_ReturnValue) == 0x000160, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_AsObject_ReturnValue) == 0x000170, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_AsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetArrayField_ReturnValue) == 0x000178, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Get_Item) == 0x000188, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_AsObject_ReturnValue_1) == 0x000198, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_AsObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetStringField_ReturnValue) == 0x0001A8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetStringField_ReturnValue_1) == 0x0001B8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetEngineSubsystem_ReturnValue_4) == 0x0001C8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetEngineSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0001D0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_ConstructVaRestJsonObject_ReturnValue_2) == 0x0001D8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_ConstructVaRestJsonObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetEngineSubsystem_ReturnValue_5) == 0x0001E0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetEngineSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CustomEvent_Request_2) == 0x0001E8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CustomEvent_Request_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetResponseObject_ReturnValue_1) == 0x0001F0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetResponseObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetArrayField_ReturnValue_1) == 0x0001F8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetArrayField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Length_ReturnValue_1) == 0x000208, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Array_Index_Variable_4) == 0x00020C, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Map_Values_Values) == 0x000210, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Get_Item_1) == 0x000220, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Length_ReturnValue_2) == 0x000228, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_AsObject_ReturnValue_2) == 0x000230, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_AsObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetStringField_ReturnValue_2) == 0x000238, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetStringField_ReturnValue_3) == 0x000248, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetStringField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_MakeStruct_Speedrun_IDAndName) == 0x000258, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_MakeStruct_Speedrun_IDAndName' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_ComponentBoundEvent_NewSelection) == 0x000278, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_ComponentBoundEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_ComponentBoundEvent_SelectType) == 0x000288, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_ComponentBoundEvent_SelectType' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_ComponentBoundEvent_ID) == 0x000290, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_ComponentBoundEvent_ID' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CustomEvent_CategoryID) == 0x0002A0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CustomEvent_CategoryID' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0002B0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0002C0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0002D0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, K2Node_CustomEvent_Request_1) == 0x0002E0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::K2Node_CustomEvent_Request_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetResponseObject_ReturnValue_2) == 0x0002E8, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetResponseObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetArrayField_ReturnValue_2) == 0x0002F0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetArrayField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Get_Item_2) == 0x000300, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Length_ReturnValue_3) == 0x000308, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_AsObject_ReturnValue_3) == 0x000310, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_AsObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Less_IntInt_ReturnValue_1) == 0x000318, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetArrayField_ReturnValue_3) == 0x000320, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetArrayField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Get_Item_3) == 0x000330, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Length_ReturnValue_4) == 0x000338, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_AsObject_ReturnValue_4) == 0x000340, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_AsObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Less_IntInt_ReturnValue_2) == 0x000348, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetStringField_ReturnValue_4) == 0x000350, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetStringField_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_GetStringField_ReturnValue_5) == 0x000360, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_GetStringField_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000370, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, Temp_int_Array_Index_Variable_5) == 0x000374, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000378, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_Array_Get_Item_4) == 0x000380, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom, CallFunc_AppendID_And_Name_String) == 0x0003A0, "Member 'W_SpeedrunCom_C_ExecuteUbergraph_W_SpeedrunCom::CallFunc_AppendID_And_Name_String' has a wrong offset!");
