#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SpeedrunSettings

#include "Basic.hpp"

#include "Speedrun_IDAndName_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.AddElementsToBox
// 0x0090 (0x0090 - 0x0000)
struct W_SpeedrunSettings_C_AddElementsToBox final
{
public:
	class UW_ComboBox_Leaderboard_C*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ComboBox_Leaderboard_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpeedrun_IDAndName>            CallFunc_Map_Values_Values;                        // 0x0020(0x0010)(ReferenceParm)
	struct FSpeedrun_IDAndName                    CallFunc_Array_Get_Item;                           // 0x0030(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendID_And_Name_String;                 // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_AddElementsToBox) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_AddElementsToBox");
static_assert(sizeof(W_SpeedrunSettings_C_AddElementsToBox) == 0x000090, "Wrong size on W_SpeedrunSettings_C_AddElementsToBox");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, ReturnValue) == 0x000000, "Member 'W_SpeedrunSettings_C_AddElementsToBox::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_Map_Values_Values) == 0x000020, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_Array_Get_Item) == 0x000030, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_AppendID_And_Name_String) == 0x000050, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_AppendID_And_Name_String' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_SelectString_ReturnValue) == 0x000060, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_ParseIntoArray_ReturnValue) == 0x000070, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddElementsToBox, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'W_SpeedrunSettings_C_AddElementsToBox::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.AddIdAndNameToCategoryElements
// 0x0068 (0x0068 - 0x0000)
struct W_SpeedrunSettings_C_AddIdAndNameToCategoryElements final
{
public:
	class UVaRestJsonObject*                      JSON_Object;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSpeedrun_IDAndName                    K2Node_MakeStruct_Speedrun_IDAndName;              // 0x0048(0x0020)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_AddIdAndNameToCategoryElements");
static_assert(sizeof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements) == 0x000068, "Wrong size on W_SpeedrunSettings_C_AddIdAndNameToCategoryElements");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements, JSON_Object) == 0x000000, "Member 'W_SpeedrunSettings_C_AddIdAndNameToCategoryElements::JSON_Object' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements, CallFunc_GetStringField_ReturnValue) == 0x000008, "Member 'W_SpeedrunSettings_C_AddIdAndNameToCategoryElements::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'W_SpeedrunSettings_C_AddIdAndNameToCategoryElements::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements, CallFunc_GetStringField_ReturnValue_1) == 0x000020, "Member 'W_SpeedrunSettings_C_AddIdAndNameToCategoryElements::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000030, "Member 'W_SpeedrunSettings_C_AddIdAndNameToCategoryElements::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements, CallFunc_GetStringField_ReturnValue_2) == 0x000038, "Member 'W_SpeedrunSettings_C_AddIdAndNameToCategoryElements::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToCategoryElements, K2Node_MakeStruct_Speedrun_IDAndName) == 0x000048, "Member 'W_SpeedrunSettings_C_AddIdAndNameToCategoryElements::K2Node_MakeStruct_Speedrun_IDAndName' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.AddIdAndNameToVariablesElements
// 0x0040 (0x0040 - 0x0000)
struct W_SpeedrunSettings_C_AddIdAndNameToVariablesElements final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Label;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSpeedrun_IDAndName                    K2Node_MakeStruct_Speedrun_IDAndName;              // 0x0020(0x0020)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_AddIdAndNameToVariablesElements) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_AddIdAndNameToVariablesElements");
static_assert(sizeof(W_SpeedrunSettings_C_AddIdAndNameToVariablesElements) == 0x000040, "Wrong size on W_SpeedrunSettings_C_AddIdAndNameToVariablesElements");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToVariablesElements, ID) == 0x000000, "Member 'W_SpeedrunSettings_C_AddIdAndNameToVariablesElements::ID' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToVariablesElements, Label) == 0x000010, "Member 'W_SpeedrunSettings_C_AddIdAndNameToVariablesElements::Label' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_AddIdAndNameToVariablesElements, K2Node_MakeStruct_Speedrun_IDAndName) == 0x000020, "Member 'W_SpeedrunSettings_C_AddIdAndNameToVariablesElements::K2Node_MakeStruct_Speedrun_IDAndName' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.Callback
// 0x0008 (0x0008 - 0x0000)
struct W_SpeedrunSettings_C_Callback final
{
public:
	class UVaRestRequestJSON*                     Request;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_Callback) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_Callback");
static_assert(sizeof(W_SpeedrunSettings_C_Callback) == 0x000008, "Wrong size on W_SpeedrunSettings_C_Callback");
static_assert(offsetof(W_SpeedrunSettings_C_Callback, Request) == 0x000000, "Member 'W_SpeedrunSettings_C_Callback::Request' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.ComboChange
// 0x0028 (0x0028 - 0x0000)
struct W_SpeedrunSettings_C_ComboChange final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ID;                                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_ComboChange) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_ComboChange");
static_assert(sizeof(W_SpeedrunSettings_C_ComboChange) == 0x000028, "Wrong size on W_SpeedrunSettings_C_ComboChange");
static_assert(offsetof(W_SpeedrunSettings_C_ComboChange, NewSelection) == 0x000000, "Member 'W_SpeedrunSettings_C_ComboChange::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ComboChange, SelectType) == 0x000010, "Member 'W_SpeedrunSettings_C_ComboChange::SelectType' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ComboChange, ID) == 0x000018, "Member 'W_SpeedrunSettings_C_ComboChange::ID' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.CustomEvent
// 0x0028 (0x0028 - 0x0000)
struct W_SpeedrunSettings_C_CustomEvent final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ID;                                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_CustomEvent) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_CustomEvent");
static_assert(sizeof(W_SpeedrunSettings_C_CustomEvent) == 0x000028, "Wrong size on W_SpeedrunSettings_C_CustomEvent");
static_assert(offsetof(W_SpeedrunSettings_C_CustomEvent, NewSelection) == 0x000000, "Member 'W_SpeedrunSettings_C_CustomEvent::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_CustomEvent, SelectType) == 0x000010, "Member 'W_SpeedrunSettings_C_CustomEvent::SelectType' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_CustomEvent, ID) == 0x000018, "Member 'W_SpeedrunSettings_C_CustomEvent::ID' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.ExecuteUbergraph_W_SpeedrunSettings
// 0x0108 (0x0108 - 0x0000)
struct W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& NewSelection, ESelectInfo SelectType, const class FString& ID)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& NewSelection, ESelectInfo SelectType, const class FString& ID)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVaRestRequestJSON* Request)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_ConstructVaRestJsonObject_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestRequestJSON*                     K2Node_CustomEvent_Request;                        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_GetResponseObject_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_GetVariableField_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVaRestJsonValue*>               CallFunc_GetArrayField_ReturnValue;                // 0x0078(0x0010)(ReferenceParm)
	class FString                                 K2Node_CustomEvent_NewSelection_1;                 // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectType_1;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ID_1;                           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ComboBox_Leaderboard_C*              CallFunc_AddElementsToBox_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NewSelection;                   // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectType;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ID;                             // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UW_ComboBox_Leaderboard_C*              CallFunc_AddElementsToBox_ReturnValue_1;           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings");
static_assert(sizeof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings) == 0x000108, "Wrong size on W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, EntryPoint) == 0x000000, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, Temp_int_Array_Index_Variable) == 0x000024, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000038, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_ConstructVaRestJsonObject_ReturnValue) == 0x000040, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_ConstructVaRestJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000048, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CustomEvent_Request) == 0x000050, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CustomEvent_Request' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_GetResponseObject_ReturnValue) == 0x000058, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_GetResponseObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_GetVariableField_ReturnValue) == 0x000068, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_GetVariableField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_GetArrayField_ReturnValue) == 0x000078, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_GetArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CustomEvent_NewSelection_1) == 0x000088, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CustomEvent_NewSelection_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CustomEvent_SelectType_1) == 0x000098, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CustomEvent_SelectType_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CustomEvent_ID_1) == 0x0000A0, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CustomEvent_ID_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_AsObject_ReturnValue) == 0x0000B8, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_AsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_AddElementsToBox_ReturnValue) == 0x0000C8, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_AddElementsToBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CustomEvent_NewSelection) == 0x0000D0, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CustomEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CustomEvent_SelectType) == 0x0000E0, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CustomEvent_SelectType' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, K2Node_CustomEvent_ID) == 0x0000E8, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::K2Node_CustomEvent_ID' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_AddElementsToBox_ReturnValue_1) == 0x0000F8, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_AddElementsToBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'W_SpeedrunSettings_C_ExecuteUbergraph_W_SpeedrunSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.GetVariableField
// 0x00F0 (0x00F0 - 0x0000)
struct W_SpeedrunSettings_C_GetVariableField final
{
public:
	class UVaRestJsonObject*                      Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_1;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_2;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_2;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_3;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_3;                   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_3;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSpeedrun_IDAndName                    K2Node_MakeStruct_Speedrun_IDAndName;              // 0x00C0(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendID_And_Name_String;                 // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_GetVariableField) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_GetVariableField");
static_assert(sizeof(W_SpeedrunSettings_C_GetVariableField) == 0x0000F0, "Wrong size on W_SpeedrunSettings_C_GetVariableField");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, Self2) == 0x000000, "Member 'W_SpeedrunSettings_C_GetVariableField::Self2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, ReturnValue) == 0x000008, "Member 'W_SpeedrunSettings_C_GetVariableField::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetField_ReturnValue) == 0x000010, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_AsObject_ReturnValue) == 0x000018, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_AsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetBoolField_ReturnValue) == 0x000020, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetStringField_ReturnValue) == 0x000028, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetStringField_ReturnValue_1) == 0x000038, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetField_ReturnValue_1) == 0x000048, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000050, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_AsObject_ReturnValue_1) == 0x000058, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_AsObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetStringField_ReturnValue_2) == 0x000060, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetField_ReturnValue_2) == 0x000070, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_AsObject_ReturnValue_2) == 0x000078, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_AsObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetField_ReturnValue_3) == 0x000080, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_AsObject_ReturnValue_3) == 0x0000A0, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_AsObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_GetStringField_ReturnValue_3) == 0x0000B0, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_GetStringField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, K2Node_MakeStruct_Speedrun_IDAndName) == 0x0000C0, "Member 'W_SpeedrunSettings_C_GetVariableField::K2Node_MakeStruct_Speedrun_IDAndName' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_GetVariableField, CallFunc_AppendID_And_Name_String) == 0x0000E0, "Member 'W_SpeedrunSettings_C_GetVariableField::CallFunc_AppendID_And_Name_String' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.OnChoiceChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature final
{
public:
	class FString                                 NewSelection;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ID;                                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature");
static_assert(sizeof(W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature) == 0x000020, "Wrong size on W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature");
static_assert(offsetof(W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature, NewSelection) == 0x000000, "Member 'W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature::NewSelection' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature, ID) == 0x000010, "Member 'W_SpeedrunSettings_C_OnChoiceChanged__DelegateSignature::ID' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.OnSettingsGenerated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_SpeedrunSettings_C_OnSettingsGenerated__DelegateSignature final
{
public:
	class FString                                 DefaultID;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_OnSettingsGenerated__DelegateSignature) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_OnSettingsGenerated__DelegateSignature");
static_assert(sizeof(W_SpeedrunSettings_C_OnSettingsGenerated__DelegateSignature) == 0x000010, "Wrong size on W_SpeedrunSettings_C_OnSettingsGenerated__DelegateSignature");
static_assert(offsetof(W_SpeedrunSettings_C_OnSettingsGenerated__DelegateSignature, DefaultID) == 0x000000, "Member 'W_SpeedrunSettings_C_OnSettingsGenerated__DelegateSignature::DefaultID' has a wrong offset!");

// Function W_SpeedrunSettings.W_SpeedrunSettings_C.UpdateVariableElements
// 0x0078 (0x0078 - 0x0000)
struct W_SpeedrunSettings_C_UpdateVariableElements final
{
public:
	class UVaRestJsonObject*                      VariableField;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetFieldNames_ReturnValue;                // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunSettings_C_UpdateVariableElements) == 0x000008, "Wrong alignment on W_SpeedrunSettings_C_UpdateVariableElements");
static_assert(sizeof(W_SpeedrunSettings_C_UpdateVariableElements) == 0x000078, "Wrong size on W_SpeedrunSettings_C_UpdateVariableElements");
static_assert(offsetof(W_SpeedrunSettings_C_UpdateVariableElements, VariableField) == 0x000000, "Member 'W_SpeedrunSettings_C_UpdateVariableElements::VariableField' has a wrong offset!");
static_assert(offsetof(W_SpeedrunSettings_C_UpdateVariableElements, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'W_SpeedrunSettings_C_UpdateVariableElements::CallFunc_IsValid_ReturnValue' has a wrong offset!");
