#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SpeedrunPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SpeedrunPlayer.W_SpeedrunPlayer_C
// 0x0040 (0x0300 - 0x02C0)
class UW_SpeedrunPlayer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Region;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserName_1;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 API_Link;                                          // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Guest;                                             // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GuestName;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent(class UVaRestRequestJSON* Request);
	void ExecuteUbergraph_W_SpeedrunPlayer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SpeedrunPlayer_C">();
	}
	static class UW_SpeedrunPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SpeedrunPlayer_C>();
	}
};
static_assert(alignof(UW_SpeedrunPlayer_C) == 0x000008, "Wrong alignment on UW_SpeedrunPlayer_C");
static_assert(sizeof(UW_SpeedrunPlayer_C) == 0x000300, "Wrong size on UW_SpeedrunPlayer_C");
static_assert(offsetof(UW_SpeedrunPlayer_C, UberGraphFrame) == 0x0002C0, "Member 'UW_SpeedrunPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunPlayer_C, Region) == 0x0002C8, "Member 'UW_SpeedrunPlayer_C::Region' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunPlayer_C, UserName_1) == 0x0002D0, "Member 'UW_SpeedrunPlayer_C::UserName_1' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunPlayer_C, API_Link) == 0x0002D8, "Member 'UW_SpeedrunPlayer_C::API_Link' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunPlayer_C, Guest) == 0x0002E8, "Member 'UW_SpeedrunPlayer_C::Guest' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunPlayer_C, GuestName) == 0x0002F0, "Member 'UW_SpeedrunPlayer_C::GuestName' has a wrong offset!");

}

