#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SpeedRun_PlayerName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SpeedRun_PlayerName.W_SpeedRun_PlayerName_C
// 0x0020 (0x02E0 - 0x02C0)
class UW_SpeedRun_PlayerName_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             UserName;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 PlayerName;                                        // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_SpeedRun_PlayerName(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SpeedRun_PlayerName_C">();
	}
	static class UW_SpeedRun_PlayerName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SpeedRun_PlayerName_C>();
	}
};
static_assert(alignof(UW_SpeedRun_PlayerName_C) == 0x000008, "Wrong alignment on UW_SpeedRun_PlayerName_C");
static_assert(sizeof(UW_SpeedRun_PlayerName_C) == 0x0002E0, "Wrong size on UW_SpeedRun_PlayerName_C");
static_assert(offsetof(UW_SpeedRun_PlayerName_C, UberGraphFrame) == 0x0002C0, "Member 'UW_SpeedRun_PlayerName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SpeedRun_PlayerName_C, UserName) == 0x0002C8, "Member 'UW_SpeedRun_PlayerName_C::UserName' has a wrong offset!");
static_assert(offsetof(UW_SpeedRun_PlayerName_C, PlayerName) == 0x0002D0, "Member 'UW_SpeedRun_PlayerName_C::PlayerName' has a wrong offset!");

}

