#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SpeedrunCom_RunSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_SpeedrunCom_RunSlot.W_SpeedrunCom_RunSlot_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct W_SpeedrunCom_RunSlot_C_CustomEvent final
{
public:
	class UVaRestRequestJSON*                     Request;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_RunSlot_C_CustomEvent) == 0x000008, "Wrong alignment on W_SpeedrunCom_RunSlot_C_CustomEvent");
static_assert(sizeof(W_SpeedrunCom_RunSlot_C_CustomEvent) == 0x000008, "Wrong size on W_SpeedrunCom_RunSlot_C_CustomEvent");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_CustomEvent, Request) == 0x000000, "Member 'W_SpeedrunCom_RunSlot_C_CustomEvent::Request' has a wrong offset!");

// Function W_SpeedrunCom_RunSlot.W_SpeedrunCom_RunSlot_C.ExecuteUbergraph_W_SpeedrunCom_RunSlot
// 0x02B8 (0x02B8 - 0x0000)
struct W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3306[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVaRestRequestJSON* Request)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_ConstructVaRestJsonObject_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestRequestJSON*                     K2Node_CustomEvent_Request_1;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_GetResponseObject_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3307[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3308[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3309[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_SpeedRun_PlayerName_C*               CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_1;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_330A[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_1;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_2;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_3;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_330B[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_AsString_ReturnValue;                     // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AsString_ReturnValue_1;                   // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UW_SpeedRun_PlayerName_C*               CallFunc_Create_ReturnValue_1;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UW_SpeedRun_PlayerName_C*               CallFunc_Create_ReturnValue_2;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVaRestRequestJSON*                     K2Node_CustomEvent_Request;                        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_GetResponseObject_ReturnValue_1;          // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_4;                   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_330C[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_2;                   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_5;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_330D[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_3;                   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_6;                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonValue*                       CallFunc_GetField_ReturnValue_7;                   // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_330E[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_4;                   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_AsObject_ReturnValue_5;                   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0190(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01A8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01C0(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_330F[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ConvertTimeToTextFormat_ReturnValue;      // 0x01E0(0x0018)()
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0208(0x0010)(ReferenceParm)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3310[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3311[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UVaRestRequestJSON* Request)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0248(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_SpeedRun_PlayerName_C*               CallFunc_Create_ReturnValue_3;                     // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0280(0x0018)()
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_ConstructVaRestJsonObject_ReturnValue_1;  // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVaRestSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_3;         // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot) == 0x000008, "Wrong alignment on W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot");
static_assert(sizeof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot) == 0x0002B8, "Wrong size on W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, EntryPoint) == 0x000000, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_ConstructVaRestJsonObject_ReturnValue) == 0x000020, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_ConstructVaRestJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000028, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, K2Node_CustomEvent_Request_1) == 0x000030, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::K2Node_CustomEvent_Request_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetResponseObject_ReturnValue) == 0x000038, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetResponseObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetField_ReturnValue) == 0x000048, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AsObject_ReturnValue) == 0x000060, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Create_ReturnValue) == 0x000068, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetField_ReturnValue_1) == 0x000070, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AsObject_ReturnValue_1) == 0x000080, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AsObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetField_ReturnValue_2) == 0x000088, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetField_ReturnValue_3) == 0x000090, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_IsValid_ReturnValue_3) == 0x000099, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AsString_ReturnValue) == 0x0000A0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AsString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AsString_ReturnValue_1) == 0x0000B0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AsString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Create_ReturnValue_1) == 0x0000C0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AddChild_ReturnValue) == 0x0000C8, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AddChild_ReturnValue_1) == 0x0000D0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Create_ReturnValue_2) == 0x0000E8, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AddChild_ReturnValue_2) == 0x000100, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, K2Node_CustomEvent_Request) == 0x000108, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::K2Node_CustomEvent_Request' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetResponseObject_ReturnValue_1) == 0x000110, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetResponseObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetField_ReturnValue_4) == 0x000118, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetField_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_IsValid_ReturnValue_4) == 0x000120, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AsObject_ReturnValue_2) == 0x000128, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AsObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetField_ReturnValue_5) == 0x000130, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetField_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_IsValid_ReturnValue_5) == 0x000138, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AsObject_ReturnValue_3) == 0x000140, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AsObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetField_ReturnValue_6) == 0x000148, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetField_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetField_ReturnValue_7) == 0x000150, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetField_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_IsValid_ReturnValue_6) == 0x000158, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_IsValid_ReturnValue_7) == 0x000159, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AsObject_ReturnValue_4) == 0x000160, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AsObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AsObject_ReturnValue_5) == 0x000168, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AsObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetStringField_ReturnValue) == 0x000170, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetStringField_ReturnValue_1) == 0x000180, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Conv_StringToText_ReturnValue) == 0x000190, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001A8, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001C0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, Temp_int_Array_Index_Variable) == 0x0001D8, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_ConvertTimeToTextFormat_ReturnValue) == 0x0001E0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_ConvertTimeToTextFormat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Array_Get_Item_1) == 0x0001F8, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_ParseIntoArray_ReturnValue) == 0x000208, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_FindSubstring_ReturnValue) == 0x000218, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Array_Get_Item_2) == 0x000220, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000230, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000238, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000248, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Create_ReturnValue_3) == 0x000258, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Conv_IntToString_ReturnValue) == 0x000260, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000270, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000280, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_AddChild_ReturnValue_3) == 0x000298, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetEngineSubsystem_ReturnValue_2) == 0x0002A0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetEngineSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_ConstructVaRestJsonObject_ReturnValue_1) == 0x0002A8, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_ConstructVaRestJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot, CallFunc_GetEngineSubsystem_ReturnValue_3) == 0x0002B0, "Member 'W_SpeedrunCom_RunSlot_C_ExecuteUbergraph_W_SpeedrunCom_RunSlot::CallFunc_GetEngineSubsystem_ReturnValue_3' has a wrong offset!");

// Function W_SpeedrunCom_RunSlot.W_SpeedrunCom_RunSlot_C.OnCategoriesCallback
// 0x0008 (0x0008 - 0x0000)
struct W_SpeedrunCom_RunSlot_C_OnCategoriesCallback final
{
public:
	class UVaRestRequestJSON*                     Request;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SpeedrunCom_RunSlot_C_OnCategoriesCallback) == 0x000008, "Wrong alignment on W_SpeedrunCom_RunSlot_C_OnCategoriesCallback");
static_assert(sizeof(W_SpeedrunCom_RunSlot_C_OnCategoriesCallback) == 0x000008, "Wrong size on W_SpeedrunCom_RunSlot_C_OnCategoriesCallback");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_OnCategoriesCallback, Request) == 0x000000, "Member 'W_SpeedrunCom_RunSlot_C_OnCategoriesCallback::Request' has a wrong offset!");

// Function W_SpeedrunCom_RunSlot.W_SpeedrunCom_RunSlot_C.UpdateTime
// 0x0018 (0x0018 - 0x0000)
struct W_SpeedrunCom_RunSlot_C_UpdateTime final
{
public:
	class FText                                   CallFunc_ConvertTimeToTextFormat_ReturnValue;      // 0x0000(0x0018)()
};
static_assert(alignof(W_SpeedrunCom_RunSlot_C_UpdateTime) == 0x000008, "Wrong alignment on W_SpeedrunCom_RunSlot_C_UpdateTime");
static_assert(sizeof(W_SpeedrunCom_RunSlot_C_UpdateTime) == 0x000018, "Wrong size on W_SpeedrunCom_RunSlot_C_UpdateTime");
static_assert(offsetof(W_SpeedrunCom_RunSlot_C_UpdateTime, CallFunc_ConvertTimeToTextFormat_ReturnValue) == 0x000000, "Member 'W_SpeedrunCom_RunSlot_C_UpdateTime::CallFunc_ConvertTimeToTextFormat_ReturnValue' has a wrong offset!");

}

