#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SpeedrunCom

#include "Basic.hpp"

#include "Categories_S_structs.hpp"
#include "Engine_structs.hpp"
#include "Runs_S_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SpeedrunCom.W_SpeedrunCom_C
// 0x00A8 (0x0368 - 0x02C0)
class UW_SpeedrunCom_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      CircularThrobber_127;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_69;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_40;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_118;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LeaderBoardSlot_C*                   W_LeaderBoardSlot;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FCategories_S>                  Categories;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuns_S>                        Runs;                                              // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRuns_S                                RunsTemp;                                          // 0x0318(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_SpeedrunCom(int32 EntryPoint);
	void GetAllPlayers();
	void GetCategories();
	void OnCategorieCallback(class UVaRestRequestJSON* Request);
	void OnCategoriesCallback(class UVaRestRequestJSON* Request);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SpeedrunCom_C">();
	}
	static class UW_SpeedrunCom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SpeedrunCom_C>();
	}
};
static_assert(alignof(UW_SpeedrunCom_C) == 0x000008, "Wrong alignment on UW_SpeedrunCom_C");
static_assert(sizeof(UW_SpeedrunCom_C) == 0x000368, "Wrong size on UW_SpeedrunCom_C");
static_assert(offsetof(UW_SpeedrunCom_C, UberGraphFrame) == 0x0002C0, "Member 'UW_SpeedrunCom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, CircularThrobber_127) == 0x0002C8, "Member 'UW_SpeedrunCom_C::CircularThrobber_127' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, HorizontalBox_69) == 0x0002D0, "Member 'UW_SpeedrunCom_C::HorizontalBox_69' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, ScrollBox_0) == 0x0002D8, "Member 'UW_SpeedrunCom_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, VerticalBox_40) == 0x0002E0, "Member 'UW_SpeedrunCom_C::VerticalBox_40' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, VerticalBox_118) == 0x0002E8, "Member 'UW_SpeedrunCom_C::VerticalBox_118' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, W_LeaderBoardSlot) == 0x0002F0, "Member 'UW_SpeedrunCom_C::W_LeaderBoardSlot' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, Categories) == 0x0002F8, "Member 'UW_SpeedrunCom_C::Categories' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, Runs) == 0x000308, "Member 'UW_SpeedrunCom_C::Runs' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_C, RunsTemp) == 0x000318, "Member 'UW_SpeedrunCom_C::RunsTemp' has a wrong offset!");

}

