#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SpeedrunCom_RunSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SpeedrunCom_RunSlot.W_SpeedrunCom_RunSlot_C
// 0x0088 (0x0348 - 0x02C0)
class UW_SpeedrunCom_RunSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Date;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Location;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Order;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Time;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserName;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserName_1;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserName_2;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserName_3;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         PlayersID;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Classement;                                        // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerTime;                                        // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 DateSpeedrun;                                      // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FString>                         PlayerNames;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void CustomEvent(class UVaRestRequestJSON* Request);
	void ExecuteUbergraph_W_SpeedrunCom_RunSlot(int32 EntryPoint);
	void OnCategoriesCallback(class UVaRestRequestJSON* Request);
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SpeedrunCom_RunSlot_C">();
	}
	static class UW_SpeedrunCom_RunSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SpeedrunCom_RunSlot_C>();
	}
};
static_assert(alignof(UW_SpeedrunCom_RunSlot_C) == 0x000008, "Wrong alignment on UW_SpeedrunCom_RunSlot_C");
static_assert(sizeof(UW_SpeedrunCom_RunSlot_C) == 0x000348, "Wrong size on UW_SpeedrunCom_RunSlot_C");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, UberGraphFrame) == 0x0002C0, "Member 'UW_SpeedrunCom_RunSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, Date) == 0x0002C8, "Member 'UW_SpeedrunCom_RunSlot_C::Date' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, Location) == 0x0002D0, "Member 'UW_SpeedrunCom_RunSlot_C::Location' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, Order) == 0x0002D8, "Member 'UW_SpeedrunCom_RunSlot_C::Order' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, Time) == 0x0002E0, "Member 'UW_SpeedrunCom_RunSlot_C::Time' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, UserName) == 0x0002E8, "Member 'UW_SpeedrunCom_RunSlot_C::UserName' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, UserName_1) == 0x0002F0, "Member 'UW_SpeedrunCom_RunSlot_C::UserName_1' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, UserName_2) == 0x0002F8, "Member 'UW_SpeedrunCom_RunSlot_C::UserName_2' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, UserName_3) == 0x000300, "Member 'UW_SpeedrunCom_RunSlot_C::UserName_3' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, VerticalBox_0) == 0x000308, "Member 'UW_SpeedrunCom_RunSlot_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, PlayersID) == 0x000310, "Member 'UW_SpeedrunCom_RunSlot_C::PlayersID' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, Classement) == 0x000320, "Member 'UW_SpeedrunCom_RunSlot_C::Classement' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, PlayerTime) == 0x000324, "Member 'UW_SpeedrunCom_RunSlot_C::PlayerTime' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, DateSpeedrun) == 0x000328, "Member 'UW_SpeedrunCom_RunSlot_C::DateSpeedrun' has a wrong offset!");
static_assert(offsetof(UW_SpeedrunCom_RunSlot_C, PlayerNames) == 0x000338, "Member 'UW_SpeedrunCom_RunSlot_C::PlayerNames' has a wrong offset!");

}

