#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Subtitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Subtitle.W_Subtitle_C
// 0x0038 (0x02F8 - 0x02C0)
class UW_Subtitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_45;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        Duration;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_Subtitle(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Subtitle_C">();
	}
	static class UW_Subtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Subtitle_C>();
	}
};
static_assert(alignof(UW_Subtitle_C) == 0x000008, "Wrong alignment on UW_Subtitle_C");
static_assert(sizeof(UW_Subtitle_C) == 0x0002F8, "Wrong size on UW_Subtitle_C");
static_assert(offsetof(UW_Subtitle_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Subtitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Subtitle_C, NewAnimation) == 0x0002C8, "Member 'UW_Subtitle_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_Subtitle_C, TextBlock_45) == 0x0002D0, "Member 'UW_Subtitle_C::TextBlock_45' has a wrong offset!");
static_assert(offsetof(UW_Subtitle_C, Text) == 0x0002D8, "Member 'UW_Subtitle_C::Text' has a wrong offset!");
static_assert(offsetof(UW_Subtitle_C, Duration) == 0x0002F0, "Member 'UW_Subtitle_C::Duration' has a wrong offset!");

}

