#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TchatElement

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_TchatElement.W_TchatElement_C.ExecuteUbergraph_W_TchatElement
// 0x0070 (0x0070 - 0x0000)
struct W_TchatElement_C_ExecuteUbergraph_W_TchatElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3069[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0040(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0014)()
};
static_assert(alignof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement) == 0x000008, "Wrong alignment on W_TchatElement_C_ExecuteUbergraph_W_TchatElement");
static_assert(sizeof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement) == 0x000070, "Wrong size on W_TchatElement_C_ExecuteUbergraph_W_TchatElement");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, EntryPoint) == 0x000000, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, CallFunc_BreakColor_R) == 0x000004, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, CallFunc_BreakColor_G) == 0x000008, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, CallFunc_BreakColor_B) == 0x00000C, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, CallFunc_BreakColor_A) == 0x000010, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000040, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TchatElement_C_ExecuteUbergraph_W_TchatElement, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'W_TchatElement_C_ExecuteUbergraph_W_TchatElement::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

