#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Teleport

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Teleport.W_Teleport_C.ExecuteUbergraph_W_Teleport
// 0x0018 (0x0018 - 0x0000)
struct W_Teleport_C_ExecuteUbergraph_W_Teleport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DEF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Teleport_C_ExecuteUbergraph_W_Teleport) == 0x000008, "Wrong alignment on W_Teleport_C_ExecuteUbergraph_W_Teleport");
static_assert(sizeof(W_Teleport_C_ExecuteUbergraph_W_Teleport) == 0x000018, "Wrong size on W_Teleport_C_ExecuteUbergraph_W_Teleport");
static_assert(offsetof(W_Teleport_C_ExecuteUbergraph_W_Teleport, EntryPoint) == 0x000000, "Member 'W_Teleport_C_ExecuteUbergraph_W_Teleport::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Teleport_C_ExecuteUbergraph_W_Teleport, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_Teleport_C_ExecuteUbergraph_W_Teleport::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Teleport_C_ExecuteUbergraph_W_Teleport, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'W_Teleport_C_ExecuteUbergraph_W_Teleport::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

