#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Timer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Timer.W_Timer_C
// 0x0018 (0x02D8 - 0x02C0)
class UW_Timer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           ProgressBar_12;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Time;                                              // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_Timer(int32 EntryPoint);
	void UpdateProgress(double Alpha);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Timer_C">();
	}
	static class UW_Timer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Timer_C>();
	}
};
static_assert(alignof(UW_Timer_C) == 0x000008, "Wrong alignment on UW_Timer_C");
static_assert(sizeof(UW_Timer_C) == 0x0002D8, "Wrong size on UW_Timer_C");
static_assert(offsetof(UW_Timer_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Timer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Timer_C, ProgressBar_12) == 0x0002C8, "Member 'UW_Timer_C::ProgressBar_12' has a wrong offset!");
static_assert(offsetof(UW_Timer_C, Time) == 0x0002D0, "Member 'UW_Timer_C::Time' has a wrong offset!");

}

