#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Timer

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Timer.W_Timer_C.ExecuteUbergraph_W_Timer
// 0x0018 (0x0018 - 0x0000)
struct W_Timer_C_ExecuteUbergraph_W_Timer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Alpha;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Timer_C_ExecuteUbergraph_W_Timer) == 0x000008, "Wrong alignment on W_Timer_C_ExecuteUbergraph_W_Timer");
static_assert(sizeof(W_Timer_C_ExecuteUbergraph_W_Timer) == 0x000018, "Wrong size on W_Timer_C_ExecuteUbergraph_W_Timer");
static_assert(offsetof(W_Timer_C_ExecuteUbergraph_W_Timer, EntryPoint) == 0x000000, "Member 'W_Timer_C_ExecuteUbergraph_W_Timer::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Timer_C_ExecuteUbergraph_W_Timer, K2Node_CustomEvent_Alpha) == 0x000008, "Member 'W_Timer_C_ExecuteUbergraph_W_Timer::K2Node_CustomEvent_Alpha' has a wrong offset!");
static_assert(offsetof(W_Timer_C_ExecuteUbergraph_W_Timer, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000010, "Member 'W_Timer_C_ExecuteUbergraph_W_Timer::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Timer_C_ExecuteUbergraph_W_Timer, CallFunc_Delay_Duration_ImplicitCast) == 0x000014, "Member 'W_Timer_C_ExecuteUbergraph_W_Timer::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function W_Timer.W_Timer_C.UpdateProgress
// 0x0008 (0x0008 - 0x0000)
struct W_Timer_C_UpdateProgress final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Timer_C_UpdateProgress) == 0x000008, "Wrong alignment on W_Timer_C_UpdateProgress");
static_assert(sizeof(W_Timer_C_UpdateProgress) == 0x000008, "Wrong size on W_Timer_C_UpdateProgress");
static_assert(offsetof(W_Timer_C_UpdateProgress, Alpha) == 0x000000, "Member 'W_Timer_C_UpdateProgress::Alpha' has a wrong offset!");

}

