#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Water_no_sides_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass water_no_sides_BP.water_no_sides_BP_C
// 0x0018 (0x02B0 - 0x0298)
class AWater_no_sides_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Water_tile_1x2;                                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Water_tile_1x1;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"water_no_sides_BP_C">();
	}
	static class AWater_no_sides_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWater_no_sides_BP_C>();
	}
};
static_assert(alignof(AWater_no_sides_BP_C) == 0x000008, "Wrong alignment on AWater_no_sides_BP_C");
static_assert(sizeof(AWater_no_sides_BP_C) == 0x0002B0, "Wrong size on AWater_no_sides_BP_C");
static_assert(offsetof(AWater_no_sides_BP_C, Water_tile_1x2) == 0x000298, "Member 'AWater_no_sides_BP_C::Water_tile_1x2' has a wrong offset!");
static_assert(offsetof(AWater_no_sides_BP_C, Water_tile_1x1) == 0x0002A0, "Member 'AWater_no_sides_BP_C::Water_tile_1x1' has a wrong offset!");
static_assert(offsetof(AWater_no_sides_BP_C, DefaultSceneRoot) == 0x0002A8, "Member 'AWater_no_sides_BP_C::DefaultSceneRoot' has a wrong offset!");

}

