#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Waterfall_narrow_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass waterfall_narrow_BP.waterfall_narrow_BP_C
// 0x00B8 (0x0350 - 0x0298)
class AWaterfall_narrow_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Waterfall_ripple;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Waterfall_roller_high;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_straight5;                                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown6;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown5;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown4;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown3;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_straight4;                                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_straight3;                                    // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown_end1;                                   // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Square_pillar1;                                    // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown2;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_straight2;                                    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown1;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_straight1;                                    // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown_end;                                    // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Square_pillar;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall_straight;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Water_2_sides;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Waterfall;                                         // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowRipples;                                       // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"waterfall_narrow_BP_C">();
	}
	static class AWaterfall_narrow_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterfall_narrow_BP_C>();
	}
};
static_assert(alignof(AWaterfall_narrow_BP_C) == 0x000008, "Wrong alignment on AWaterfall_narrow_BP_C");
static_assert(sizeof(AWaterfall_narrow_BP_C) == 0x000350, "Wrong size on AWaterfall_narrow_BP_C");
static_assert(offsetof(AWaterfall_narrow_BP_C, Waterfall_ripple) == 0x000298, "Member 'AWaterfall_narrow_BP_C::Waterfall_ripple' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Waterfall_roller_high) == 0x0002A0, "Member 'AWaterfall_narrow_BP_C::Waterfall_roller_high' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Wall_straight5) == 0x0002A8, "Member 'AWaterfall_narrow_BP_C::Wall_straight5' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown6) == 0x0002B0, "Member 'AWaterfall_narrow_BP_C::Trim_crown6' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown5) == 0x0002B8, "Member 'AWaterfall_narrow_BP_C::Trim_crown5' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown4) == 0x0002C0, "Member 'AWaterfall_narrow_BP_C::Trim_crown4' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown3) == 0x0002C8, "Member 'AWaterfall_narrow_BP_C::Trim_crown3' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Wall_straight4) == 0x0002D0, "Member 'AWaterfall_narrow_BP_C::Wall_straight4' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Wall_straight3) == 0x0002D8, "Member 'AWaterfall_narrow_BP_C::Wall_straight3' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown_end1) == 0x0002E0, "Member 'AWaterfall_narrow_BP_C::Trim_crown_end1' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Square_pillar1) == 0x0002E8, "Member 'AWaterfall_narrow_BP_C::Square_pillar1' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown2) == 0x0002F0, "Member 'AWaterfall_narrow_BP_C::Trim_crown2' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Wall_straight2) == 0x0002F8, "Member 'AWaterfall_narrow_BP_C::Wall_straight2' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown1) == 0x000300, "Member 'AWaterfall_narrow_BP_C::Trim_crown1' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Wall_straight1) == 0x000308, "Member 'AWaterfall_narrow_BP_C::Wall_straight1' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown_end) == 0x000310, "Member 'AWaterfall_narrow_BP_C::Trim_crown_end' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Square_pillar) == 0x000318, "Member 'AWaterfall_narrow_BP_C::Square_pillar' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Trim_crown) == 0x000320, "Member 'AWaterfall_narrow_BP_C::Trim_crown' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Wall_straight) == 0x000328, "Member 'AWaterfall_narrow_BP_C::Wall_straight' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Water_2_sides) == 0x000330, "Member 'AWaterfall_narrow_BP_C::Water_2_sides' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, Waterfall) == 0x000338, "Member 'AWaterfall_narrow_BP_C::Waterfall' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, DefaultSceneRoot) == 0x000340, "Member 'AWaterfall_narrow_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AWaterfall_narrow_BP_C, ShowRipples) == 0x000348, "Member 'AWaterfall_narrow_BP_C::ShowRipples' has a wrong offset!");

}

