#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Water_2_side_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass water_2_side_BP.water_2_side_BP_C
// 0x0038 (0x02D0 - 0x0298)
class AWater_2_side_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Trim_crown1;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trim_crown;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   W1;                                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   W;                                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Water_tile_1x1;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Water_2_sides;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"water_2_side_BP_C">();
	}
	static class AWater_2_side_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWater_2_side_BP_C>();
	}
};
static_assert(alignof(AWater_2_side_BP_C) == 0x000008, "Wrong alignment on AWater_2_side_BP_C");
static_assert(sizeof(AWater_2_side_BP_C) == 0x0002D0, "Wrong size on AWater_2_side_BP_C");
static_assert(offsetof(AWater_2_side_BP_C, Trim_crown1) == 0x000298, "Member 'AWater_2_side_BP_C::Trim_crown1' has a wrong offset!");
static_assert(offsetof(AWater_2_side_BP_C, Trim_crown) == 0x0002A0, "Member 'AWater_2_side_BP_C::Trim_crown' has a wrong offset!");
static_assert(offsetof(AWater_2_side_BP_C, W1) == 0x0002A8, "Member 'AWater_2_side_BP_C::W1' has a wrong offset!");
static_assert(offsetof(AWater_2_side_BP_C, W) == 0x0002B0, "Member 'AWater_2_side_BP_C::W' has a wrong offset!");
static_assert(offsetof(AWater_2_side_BP_C, Water_tile_1x1) == 0x0002B8, "Member 'AWater_2_side_BP_C::Water_tile_1x1' has a wrong offset!");
static_assert(offsetof(AWater_2_side_BP_C, Water_2_sides) == 0x0002C0, "Member 'AWater_2_side_BP_C::Water_2_sides' has a wrong offset!");
static_assert(offsetof(AWater_2_side_BP_C, DefaultSceneRoot) == 0x0002C8, "Member 'AWater_2_side_BP_C::DefaultSceneRoot' has a wrong offset!");

}

