#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WayWall_03_BPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WayWall_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WayWall_03_BPC.WayWall_03_BPC_C
// 0x0080 (0x0370 - 0x02F0)
class AWayWall_03_BPC_C : public AWayWall_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WayWall_03_BPC_C;                   // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Doors03;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Doors02;                                           // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Doors01;                                           // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Panel;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Code;                                              // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<bool>                                  RightDoor;                                         // 0x0340(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class FString>                         Symbols;                                           // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABP_DoorChoice_C*>               Doors;                                             // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void AddDoorChoice(int32 Param_Index);
	void ExecuteUbergraph_WayWall_03_BPC(int32 EntryPoint);
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WayWall_03_BPC_C">();
	}
	static class AWayWall_03_BPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWayWall_03_BPC_C>();
	}
};
static_assert(alignof(AWayWall_03_BPC_C) == 0x000008, "Wrong alignment on AWayWall_03_BPC_C");
static_assert(sizeof(AWayWall_03_BPC_C) == 0x000370, "Wrong size on AWayWall_03_BPC_C");
static_assert(offsetof(AWayWall_03_BPC_C, UberGraphFrame_WayWall_03_BPC_C) == 0x0002F0, "Member 'AWayWall_03_BPC_C::UberGraphFrame_WayWall_03_BPC_C' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Doors03) == 0x0002F8, "Member 'AWayWall_03_BPC_C::Doors03' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Doors02) == 0x000300, "Member 'AWayWall_03_BPC_C::Doors02' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Doors01) == 0x000308, "Member 'AWayWall_03_BPC_C::Doors01' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Cube) == 0x000310, "Member 'AWayWall_03_BPC_C::Cube' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Widget) == 0x000318, "Member 'AWayWall_03_BPC_C::Widget' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, StaticMesh1) == 0x000320, "Member 'AWayWall_03_BPC_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Panel) == 0x000328, "Member 'AWayWall_03_BPC_C::Panel' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Code) == 0x000330, "Member 'AWayWall_03_BPC_C::Code' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, RightDoor) == 0x000340, "Member 'AWayWall_03_BPC_C::RightDoor' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Symbols) == 0x000350, "Member 'AWayWall_03_BPC_C::Symbols' has a wrong offset!");
static_assert(offsetof(AWayWall_03_BPC_C, Doors) == 0x000360, "Member 'AWayWall_03_BPC_C::Doors' has a wrong offset!");

}

