#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WayWall_03_BPC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WayWall_03_BPC.WayWall_03_BPC_C.AddDoorChoice
// 0x00C0 (0x00C0 - 0x0000)
struct WayWall_03_BPC_C_AddDoorChoice final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDC[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DoorChoice_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDD[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USphereComponent*>               K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_2;                         // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WayWall_03_BPC_C_AddDoorChoice) == 0x000010, "Wrong alignment on WayWall_03_BPC_C_AddDoorChoice");
static_assert(sizeof(WayWall_03_BPC_C_AddDoorChoice) == 0x0000C0, "Wrong size on WayWall_03_BPC_C_AddDoorChoice");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, Param_Index) == 0x000000, "Member 'WayWall_03_BPC_C_AddDoorChoice::Param_Index' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'WayWall_03_BPC_C_AddDoorChoice::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'WayWall_03_BPC_C_AddDoorChoice::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'WayWall_03_BPC_C_AddDoorChoice::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'WayWall_03_BPC_C_AddDoorChoice::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, K2Node_MakeArray_Array) == 0x000088, "Member 'WayWall_03_BPC_C_AddDoorChoice::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, CallFunc_Array_Get_Item) == 0x000098, "Member 'WayWall_03_BPC_C_AddDoorChoice::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'WayWall_03_BPC_C_AddDoorChoice::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000B0, "Member 'WayWall_03_BPC_C_AddDoorChoice::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_AddDoorChoice, CallFunc_Array_Get_Item_2) == 0x0000B1, "Member 'WayWall_03_BPC_C_AddDoorChoice::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function WayWall_03_BPC.WayWall_03_BPC_C.ExecuteUbergraph_WayWall_03_BPC
// 0x0080 (0x0080 - 0x0000)
struct WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanel_Widget_C*                        CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDE[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DoorChoice_C*                       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDF[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CE0[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC) == 0x000008, "Wrong alignment on WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC");
static_assert(sizeof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC) == 0x000080, "Wrong size on WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, EntryPoint) == 0x000000, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_Max_ReturnValue) == 0x00001C, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00002C, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_Array_Get_Item) == 0x000038, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, Temp_int_Variable) == 0x000040, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000048, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC, K2Node_CustomEvent_DestroyedActor) == 0x000078, "Member 'WayWall_03_BPC_C_ExecuteUbergraph_WayWall_03_BPC::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");

// Function WayWall_03_BPC.WayWall_03_BPC_C.OnDestroyed_Event
// 0x0008 (0x0008 - 0x0000)
struct WayWall_03_BPC_C_OnDestroyed_Event final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WayWall_03_BPC_C_OnDestroyed_Event) == 0x000008, "Wrong alignment on WayWall_03_BPC_C_OnDestroyed_Event");
static_assert(sizeof(WayWall_03_BPC_C_OnDestroyed_Event) == 0x000008, "Wrong size on WayWall_03_BPC_C_OnDestroyed_Event");
static_assert(offsetof(WayWall_03_BPC_C_OnDestroyed_Event, DestroyedActor) == 0x000000, "Member 'WayWall_03_BPC_C_OnDestroyed_Event::DestroyedActor' has a wrong offset!");

}

