#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WayWall_05_BPC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "WayWall_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WayWall_05_BPC.WayWall_05_BPC_C
// 0x0038 (0x0328 - 0x02F0)
class AWayWall_05_BPC_C : public AWayWall_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WayWall_05_BPC_C;                   // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RepRot;                                            // 0x0308(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	double                                        Speed;                                             // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WayWall_05_BPC(int32 EntryPoint);
	void OnRep_RepRot();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WayWall_05_BPC_C">();
	}
	static class AWayWall_05_BPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWayWall_05_BPC_C>();
	}
};
static_assert(alignof(AWayWall_05_BPC_C) == 0x000008, "Wrong alignment on AWayWall_05_BPC_C");
static_assert(sizeof(AWayWall_05_BPC_C) == 0x000328, "Wrong size on AWayWall_05_BPC_C");
static_assert(offsetof(AWayWall_05_BPC_C, UberGraphFrame_WayWall_05_BPC_C) == 0x0002F0, "Member 'AWayWall_05_BPC_C::UberGraphFrame_WayWall_05_BPC_C' has a wrong offset!");
static_assert(offsetof(AWayWall_05_BPC_C, Cube) == 0x0002F8, "Member 'AWayWall_05_BPC_C::Cube' has a wrong offset!");
static_assert(offsetof(AWayWall_05_BPC_C, Cylinder) == 0x000300, "Member 'AWayWall_05_BPC_C::Cylinder' has a wrong offset!");
static_assert(offsetof(AWayWall_05_BPC_C, RepRot) == 0x000308, "Member 'AWayWall_05_BPC_C::RepRot' has a wrong offset!");
static_assert(offsetof(AWayWall_05_BPC_C, Speed) == 0x000320, "Member 'AWayWall_05_BPC_C::Speed' has a wrong offset!");

}

