#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wings_W

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Wings_W.Wings_W_C
// 0x0028 (0x02E8 - 0x02C0)
class UWings_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_28;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 WingsNumber;                                       // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Wings_W(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Wings_W_C">();
	}
	static class UWings_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWings_W_C>();
	}
};
static_assert(alignof(UWings_W_C) == 0x000008, "Wrong alignment on UWings_W_C");
static_assert(sizeof(UWings_W_C) == 0x0002E8, "Wrong size on UWings_W_C");
static_assert(offsetof(UWings_W_C, UberGraphFrame) == 0x0002C0, "Member 'UWings_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWings_W_C, FadeIn) == 0x0002C8, "Member 'UWings_W_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWings_W_C, TextBlock_28) == 0x0002D0, "Member 'UWings_W_C::TextBlock_28' has a wrong offset!");
static_assert(offsetof(UWings_W_C, WingsNumber) == 0x0002D8, "Member 'UWings_W_C::WingsNumber' has a wrong offset!");

}

