#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkshopItem_W

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SteamCorePro_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WorkshopItem_W.WorkshopItem_W_C
// 0x01B0 (0x0470 - 0x02C0)
class UWorkshopItem_W_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Download;                                          // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Download_Image;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Follow_Border;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Follow_Button;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Follow_HorizontalBox;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Follow_Text;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemPreview_Image;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemTitle_Text;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RatingAp_test;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                UGC_Button;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Unfollow_Button;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Unfollow_Text;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Update_HorizontalBox;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                UploadUpdate_Button;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UploadUpdateText;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteBorder;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSteamUGCDetails                       Details;                                           // 0x0348(0x00A8)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Note;                                              // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviewURL;                                        // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UploadUpdate;                                      // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamUGCHandle                        ItemFile;                                          // 0x0410(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UUpdateWorkshopLevelList_W_C*           Parent;                                            // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 ItemTitle;                                         // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Item_Description;                                  // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FPublishedFileID                       Published_File_ID;                                 // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FUGCUpdateHandle                       ItemToUpdate;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          SelectUGCMode;                                     // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Followed;                                          // 0x0452(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Needs_Update;                                      // 0x0453(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRemoteStorageSubscribePublishedFileResult DataItem;                                          // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UCustomGI_C*                            CustomGI;                                          // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WorkshopItem_W_Follow_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WorkshopItem_W_UGC_Button_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WorkshopItem_W_Unfollow_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WorkshopItem_W_Update_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ChangeFollowButtonState(bool Followed_0, bool NeedsUpdate);
	bool Check_State(const struct FSteamUGCDetails& SteamUGCDetails, const class FString& State_String);
	void CheckLevelSelected(class ULocalLevelSlot_W_C** Array_Element, bool* Selected_0);
	void Construct();
	void EnableUploadUpdateButton(bool Is_Enabled);
	void ExecuteUbergraph_WorkshopItem_W(int32 EntryPoint);
	class UWidget* Get_UGC_Button_ToolTipWidget();
	void Get_UGC_Local_Time_ID_FromSaveGame(const struct FPublishedFileID& Published_File_ID_0, int32* Time, bool* UGCFound);
	void OnCallback_5B35D9754FB9BA08EA69EBA9CF5620B7(const struct FDownloadItemResult& Data, bool bWasSuccessful);
	void OnCallback_7FBD2C4047119D1196C2779353CEB8C3(const struct FSubmitItemUpdateResult& Data, bool bWasSuccessful);
	void OnCallback_976BAB9B4F3C0234431E4EA05DB4DB24(const struct FRemoteStorageSubscribePublishedFileResult& Data, bool bWasSuccessful);
	void OnCallback_F6B1E62C484A168C33B4BFB39F0D6CA3(const struct FRemoteStorageSubscribePublishedFileResult& Data, bool bWasSuccessful);
	void OnFail_9727B2D240CDA1B47F4EFABB5DDEA722(class UTexture2DDynamic* Texture);
	void OnSuccess_9727B2D240CDA1B47F4EFABB5DDEA722(class UTexture2DDynamic* Texture);
	void SelectUGC(bool SetSelected);
	void SetNoteAndImage();
	void SetTitle();
	void SwitchSelectUGCMode(bool SelectUGCMode_0, bool* UGC_MODE);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorkshopItem_W_C">();
	}
	static class UWorkshopItem_W_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorkshopItem_W_C>();
	}
};
static_assert(alignof(UWorkshopItem_W_C) == 0x000008, "Wrong alignment on UWorkshopItem_W_C");
static_assert(sizeof(UWorkshopItem_W_C) == 0x000470, "Wrong size on UWorkshopItem_W_C");
static_assert(offsetof(UWorkshopItem_W_C, UberGraphFrame) == 0x0002C0, "Member 'UWorkshopItem_W_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Download) == 0x0002C8, "Member 'UWorkshopItem_W_C::Download' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Download_Image) == 0x0002D0, "Member 'UWorkshopItem_W_C::Download_Image' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Follow_Border) == 0x0002D8, "Member 'UWorkshopItem_W_C::Follow_Border' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Follow_Button) == 0x0002E0, "Member 'UWorkshopItem_W_C::Follow_Button' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Follow_HorizontalBox) == 0x0002E8, "Member 'UWorkshopItem_W_C::Follow_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Follow_Text) == 0x0002F0, "Member 'UWorkshopItem_W_C::Follow_Text' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, ItemPreview_Image) == 0x0002F8, "Member 'UWorkshopItem_W_C::ItemPreview_Image' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, ItemTitle_Text) == 0x000300, "Member 'UWorkshopItem_W_C::ItemTitle_Text' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, RatingAp_test) == 0x000308, "Member 'UWorkshopItem_W_C::RatingAp_test' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, UGC_Button) == 0x000310, "Member 'UWorkshopItem_W_C::UGC_Button' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Unfollow_Button) == 0x000318, "Member 'UWorkshopItem_W_C::Unfollow_Button' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Unfollow_Text) == 0x000320, "Member 'UWorkshopItem_W_C::Unfollow_Text' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Update_HorizontalBox) == 0x000328, "Member 'UWorkshopItem_W_C::Update_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, UploadUpdate_Button) == 0x000330, "Member 'UWorkshopItem_W_C::UploadUpdate_Button' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, UploadUpdateText) == 0x000338, "Member 'UWorkshopItem_W_C::UploadUpdateText' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, WhiteBorder) == 0x000340, "Member 'UWorkshopItem_W_C::WhiteBorder' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Details) == 0x000348, "Member 'UWorkshopItem_W_C::Details' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Note) == 0x0003F0, "Member 'UWorkshopItem_W_C::Note' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, PreviewURL) == 0x0003F8, "Member 'UWorkshopItem_W_C::PreviewURL' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, UploadUpdate) == 0x000408, "Member 'UWorkshopItem_W_C::UploadUpdate' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, ItemFile) == 0x000410, "Member 'UWorkshopItem_W_C::ItemFile' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Parent) == 0x000418, "Member 'UWorkshopItem_W_C::Parent' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, ItemTitle) == 0x000420, "Member 'UWorkshopItem_W_C::ItemTitle' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Item_Description) == 0x000430, "Member 'UWorkshopItem_W_C::Item_Description' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Published_File_ID) == 0x000440, "Member 'UWorkshopItem_W_C::Published_File_ID' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, ItemToUpdate) == 0x000448, "Member 'UWorkshopItem_W_C::ItemToUpdate' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, SelectUGCMode) == 0x000450, "Member 'UWorkshopItem_W_C::SelectUGCMode' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Selected) == 0x000451, "Member 'UWorkshopItem_W_C::Selected' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Followed) == 0x000452, "Member 'UWorkshopItem_W_C::Followed' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, Needs_Update) == 0x000453, "Member 'UWorkshopItem_W_C::Needs_Update' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, DataItem) == 0x000458, "Member 'UWorkshopItem_W_C::DataItem' has a wrong offset!");
static_assert(offsetof(UWorkshopItem_W_C, CustomGI) == 0x000468, "Member 'UWorkshopItem_W_C::CustomGI' has a wrong offset!");

}

