#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkShop_W

#include "Basic.hpp"

#include "IGLE_ST_GlobalSettings_structs.hpp"


namespace SDK::Params
{

// Function WorkShop_W.WorkShop_W_C.ExecuteUbergraph_WorkShop_W
// 0x00B0 (0x00B0 - 0x0000)
struct WorkShop_W_C_ExecuteUbergraph_WorkShop_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_W_C*                          CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIGLE_ST_GlobalSettings                CallFunc_IGLE_GetGlobalSettings_Settings;          // 0x0028(0x0088)(HasGetValueTypeHash)
};
static_assert(alignof(WorkShop_W_C_ExecuteUbergraph_WorkShop_W) == 0x000008, "Wrong alignment on WorkShop_W_C_ExecuteUbergraph_WorkShop_W");
static_assert(sizeof(WorkShop_W_C_ExecuteUbergraph_WorkShop_W) == 0x0000B0, "Wrong size on WorkShop_W_C_ExecuteUbergraph_WorkShop_W");
static_assert(offsetof(WorkShop_W_C_ExecuteUbergraph_WorkShop_W, EntryPoint) == 0x000000, "Member 'WorkShop_W_C_ExecuteUbergraph_WorkShop_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(WorkShop_W_C_ExecuteUbergraph_WorkShop_W, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WorkShop_W_C_ExecuteUbergraph_WorkShop_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkShop_W_C_ExecuteUbergraph_WorkShop_W, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'WorkShop_W_C_ExecuteUbergraph_WorkShop_W::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkShop_W_C_ExecuteUbergraph_WorkShop_W, K2Node_DynamicCast_AsCustom_GI) == 0x000018, "Member 'WorkShop_W_C_ExecuteUbergraph_WorkShop_W::K2Node_DynamicCast_AsCustom_GI' has a wrong offset!");
static_assert(offsetof(WorkShop_W_C_ExecuteUbergraph_WorkShop_W, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WorkShop_W_C_ExecuteUbergraph_WorkShop_W::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WorkShop_W_C_ExecuteUbergraph_WorkShop_W, CallFunc_IGLE_GetGlobalSettings_Settings) == 0x000028, "Member 'WorkShop_W_C_ExecuteUbergraph_WorkShop_W::CallFunc_IGLE_GetGlobalSettings_Settings' has a wrong offset!");

}

