#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkshopItem_W

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SteamCorePro_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WorkshopItem_W.WorkshopItem_W_C.ChangeFollowButtonState
// 0x0230 (0x0230 - 0x0000)
struct WorkshopItem_W_C_ChangeFollowButtonState final
{
public:
	bool                                          Followed_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedsUpdate;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedsUpdate_Local;                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Followed_Local;                                    // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  K2Node_Select_Default_1;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  Temp_byte_Variable_4;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  Temp_byte_Variable_5;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0044(0x0014)()
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0060(0x00D0)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0130(0x0014)()
	uint8                                         Pad_144[0xC];                                      // 0x0144(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0150(0x00D0)()
	bool                                          Temp_bool_Variable_3;                              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  K2Node_Select_Default_2;                           // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseCursor                                  K2Node_Select_Default_3;                           // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223[0x1];                                      // 0x0223(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorkshopItem_W_C_ChangeFollowButtonState) == 0x000010, "Wrong alignment on WorkshopItem_W_C_ChangeFollowButtonState");
static_assert(sizeof(WorkshopItem_W_C_ChangeFollowButtonState) == 0x000230, "Wrong size on WorkshopItem_W_C_ChangeFollowButtonState");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Followed_0) == 0x000000, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Followed_0' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, NeedsUpdate) == 0x000001, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::NeedsUpdate' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, NeedsUpdate_Local) == 0x000002, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::NeedsUpdate_Local' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Followed_Local) == 0x000003, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Followed_Local' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_bool_Variable) == 0x000004, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_byte_Variable) == 0x000005, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_byte_Variable_1) == 0x000006, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_bool_Variable_1) == 0x000007, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_byte_Variable_2) == 0x000008, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_bool_Variable_2) == 0x000009, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_byte_Variable_3) == 0x00000A, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, CallFunc_SelectFloat_ReturnValue_1) == 0x000018, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, K2Node_Select_Default) == 0x000020, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, CallFunc_SelectFloat_ReturnValue_2) == 0x000028, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, K2Node_Select_Default_1) == 0x000030, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, CallFunc_SelectFloat_ReturnValue_3) == 0x000038, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_byte_Variable_4) == 0x000040, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_byte_Variable_5) == 0x000041, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, CallFunc_Not_PreBool_ReturnValue_1) == 0x000042, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, K2Node_MakeStruct_SlateColor) == 0x000044, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, K2Node_MakeStruct_SlateBrush) == 0x000060, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, K2Node_MakeStruct_SlateColor_1) == 0x000130, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, K2Node_MakeStruct_SlateBrush_1) == 0x000150, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, Temp_bool_Variable_3) == 0x000220, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, K2Node_Select_Default_2) == 0x000221, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, K2Node_Select_Default_3) == 0x000222, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000224, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ChangeFollowButtonState, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x000228, "Member 'WorkshopItem_W_C_ChangeFollowButtonState::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");

// Function WorkshopItem_W.WorkshopItem_W_C.Check State
// 0x0150 (0x0150 - 0x0000)
struct WorkshopItem_W_C_Check_State final
{
public:
	struct FSteamUGCDetails                       SteamUGCDetails;                                   // 0x0000(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 State_String;                                      // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UGC_Timestamp_Local;                               // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Install_Timestamp_Local;                           // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESteamItemState>                       CallFunc_GetItemState_States;                      // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetItemState_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamItemState                               CallFunc_Array_Get_Item;                           // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorkshopItem_W_C_Check_State) == 0x000008, "Wrong alignment on WorkshopItem_W_C_Check_State");
static_assert(sizeof(WorkshopItem_W_C_Check_State) == 0x000150, "Wrong size on WorkshopItem_W_C_Check_State");
static_assert(offsetof(WorkshopItem_W_C_Check_State, SteamUGCDetails) == 0x000000, "Member 'WorkshopItem_W_C_Check_State::SteamUGCDetails' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, State_String) == 0x0000A8, "Member 'WorkshopItem_W_C_Check_State::State_String' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, ReturnValue) == 0x0000B8, "Member 'WorkshopItem_W_C_Check_State::ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, UGC_Timestamp_Local) == 0x0000BC, "Member 'WorkshopItem_W_C_Check_State::UGC_Timestamp_Local' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, Install_Timestamp_Local) == 0x0000C0, "Member 'WorkshopItem_W_C_Check_State::Install_Timestamp_Local' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_GetItemState_States) == 0x0000C8, "Member 'WorkshopItem_W_C_Check_State::CallFunc_GetItemState_States' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_GetItemState_ReturnValue) == 0x0000D8, "Member 'WorkshopItem_W_C_Check_State::CallFunc_GetItemState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, Temp_int_Array_Index_Variable) == 0x0000DC, "Member 'WorkshopItem_W_C_Check_State::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'WorkshopItem_W_C_Check_State::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_Array_Get_Item) == 0x0000E4, "Member 'WorkshopItem_W_C_Check_State::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000E8, "Member 'WorkshopItem_W_C_Check_State::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'WorkshopItem_W_C_Check_State::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_Concat_StrStr_ReturnValue) == 0x000100, "Member 'WorkshopItem_W_C_Check_State::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000110, "Member 'WorkshopItem_W_C_Check_State::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_Less_IntInt_ReturnValue) == 0x000120, "Member 'WorkshopItem_W_C_Check_State::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000128, "Member 'WorkshopItem_W_C_Check_State::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000138, "Member 'WorkshopItem_W_C_Check_State::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_Add_IntInt_ReturnValue) == 0x000148, "Member 'WorkshopItem_W_C_Check_State::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_Check_State, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00014C, "Member 'WorkshopItem_W_C_Check_State::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function WorkshopItem_W.WorkshopItem_W_C.CheckLevelSelected
// 0x0040 (0x0040 - 0x0000)
struct WorkshopItem_W_C_CheckLevelSelected final
{
public:
	class ULocalLevelSlot_W_C*                    Array_Element;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected_0;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULocalLevelSlot_W_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalLevelSlot_W_C*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorkshopItem_W_C_CheckLevelSelected) == 0x000008, "Wrong alignment on WorkshopItem_W_C_CheckLevelSelected");
static_assert(sizeof(WorkshopItem_W_C_CheckLevelSelected) == 0x000040, "Wrong size on WorkshopItem_W_C_CheckLevelSelected");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, Array_Element) == 0x000000, "Member 'WorkshopItem_W_C_CheckLevelSelected::Array_Element' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, Selected_0) == 0x000008, "Member 'WorkshopItem_W_C_CheckLevelSelected::Selected_0' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WorkshopItem_W_C_CheckLevelSelected::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WorkshopItem_W_C_CheckLevelSelected::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WorkshopItem_W_C_CheckLevelSelected::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000018, "Member 'WorkshopItem_W_C_CheckLevelSelected::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WorkshopItem_W_C_CheckLevelSelected::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, CallFunc_Array_Get_Item) == 0x000030, "Member 'WorkshopItem_W_C_CheckLevelSelected::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_CheckLevelSelected, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WorkshopItem_W_C_CheckLevelSelected::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WorkshopItem_W.WorkshopItem_W_C.EnableUploadUpdateButton
// 0x0001 (0x0001 - 0x0000)
struct WorkshopItem_W_C_EnableUploadUpdateButton final
{
public:
	bool                                          Is_Enabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorkshopItem_W_C_EnableUploadUpdateButton) == 0x000001, "Wrong alignment on WorkshopItem_W_C_EnableUploadUpdateButton");
static_assert(sizeof(WorkshopItem_W_C_EnableUploadUpdateButton) == 0x000001, "Wrong size on WorkshopItem_W_C_EnableUploadUpdateButton");
static_assert(offsetof(WorkshopItem_W_C_EnableUploadUpdateButton, Is_Enabled) == 0x000000, "Member 'WorkshopItem_W_C_EnableUploadUpdateButton::Is_Enabled' has a wrong offset!");

// Function WorkshopItem_W.WorkshopItem_W_C.ExecuteUbergraph_WorkshopItem_W
// 0x0450 (0x0450 - 0x0000)
struct WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture_1;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FDownloadItemResult& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDownloadItemResult                    K2Node_CustomEvent_Data_1;                         // 0x0050(0x0018)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful_1;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDownloadItemResult                    Temp_struct_Variable;                              // 0x0070(0x0018)(NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamRemoteStoragePublishedFileVisibility    Temp_byte_Variable;                                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamRemoteStoragePublishedFileVisibility    Temp_byte_Variable_1;                              // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamRemoteStoragePublishedFileVisibility    Temp_byte_Variable_2;                              // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FSubmitItemUpdateResult& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSubmitItemUpdateResult                K2Node_CustomEvent_Data;                           // 0x00A0(0x0010)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmitItemUpdateResult                Temp_struct_Variable_1;                            // 0x00B8(0x0010)(NoDestructor)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadSubscribedWorkshop_W_C*        CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BreakPublishedFileID_ReturnValue;         // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRemoteStorageSubscribePublishedFileResult Temp_struct_Variable_2;                            // 0x0110(0x0010)(NoDestructor)
	class FString                                 CallFunc_BreakPublishedFileID_ReturnValue_1;       // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FRemoteStorageSubscribePublishedFileResult& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncTaskDownloadImage*                CallFunc_DownloadImage_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USteamCoreProUGCAsyncActionSubscribeItem* CallFunc_SubscribeItemAsync_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUGCUpdateHandle                       CallFunc_StartItemUpdate_ReturnValue;              // 0x0160(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0168(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0188(0x0018)()
	struct FRemoteStorageSubscribePublishedFileResult K2Node_CustomEvent_Data_2;                         // 0x01A0(0x0010)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful_2;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemTitle_ReturnValue;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x01D0(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x01E8(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemDescription_ReturnValue;           // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FRemoteStorageSubscribePublishedFileResult& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x021C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalLevelSlot_W_C*                    CallFunc_CheckLevelSelected_Array_Element;         // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLevelSelected_Selected;              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamRemoteStoragePublishedFileVisibility    K2Node_Select_Default;                             // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPath_ReturnValue;                      // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemVisibility_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemContent_ReturnValue;               // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Is_Enabled;                     // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_4;                    // 0x0258(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_5;                    // 0x0278(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_3;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x02A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetText_ReturnValue_6;                    // 0x02B8(0x0018)()
	bool                                          CallFunc_SetItemTags_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetItemPreview_ReturnValue;               // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_7;                    // 0x02F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USteamCoreProUGCAsyncActionSubmitItemUpdate* CallFunc_SubmitItemUpdateAsync_ReturnValue;        // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWorkshopItem_W_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0328(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SetSelected;                    // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SwitchSelectUGCMode_UGC_MODE;             // 0x033E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F[0x1];                                      // 0x033F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0340(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWorkshopItem_W_C*                      CallFunc_Array_Get_Item;                           // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCustomGI_C*                            K2Node_DynamicCast_AsCustom_GI;                    // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreProUGCAsyncActionDownloadItem* CallFunc_DownloadItemAsync_ReturnValue;            // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USteamCoreProUGCAsyncActionUnsubscribeItem* CallFunc_UnsubscribeItemAsync_ReturnValue;         // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameInstanceWithSave_C> CallFunc_GetSaveGameObject_self_CastInput;         // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UV_SaveGame_C*                          CallFunc_GetSaveGameObject_SaveGame;               // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameInstanceWithSave_C> CallFunc_SaveGame_self_CastInput;                  // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRemoteStorageSubscribePublishedFileResult Temp_struct_Variable_3;                            // 0x03C8(0x0010)(NoDestructor)
	bool                                          CallFunc_Check_State_ReturnValue;                  // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x2];                                      // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_State_ReturnValue_1;                // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x0400(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CreatingGameMenu_C> K2Node_DynamicCast_AsBPI_Creating_Game_Menu;       // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRemoteStorageSubscribePublishedFileResult K2Node_CustomEvent_Data_3;                         // 0x0430(0x0010)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful_3;               // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W) == 0x000008, "Wrong alignment on WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W");
static_assert(sizeof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W) == 0x000450, "Wrong size on WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, EntryPoint) == 0x000000, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::EntryPoint' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CustomEvent_Texture_1) == 0x000008, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CustomEvent_Texture_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CustomEvent_Texture) == 0x000020, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_object_Variable) == 0x000038, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CustomEvent_Data_1) == 0x000050, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CustomEvent_Data_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CustomEvent_bWasSuccessful_1) == 0x000068, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CustomEvent_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_bool_Variable) == 0x000069, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_struct_Variable) == 0x000070, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_int_Variable) == 0x000088, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_byte_Variable) == 0x00008C, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_byte_Variable_1) == 0x00008D, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_byte_Variable_2) == 0x00008E, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CreateDelegate_OutputDelegate_3) == 0x000090, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CustomEvent_Data) == 0x0000A0, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CustomEvent_bWasSuccessful) == 0x0000B0, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CustomEvent_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_bool_Variable_1) == 0x0000B1, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_struct_Variable_1) == 0x0000B8, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000C8, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_bool_Variable_2) == 0x0000F1, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_byte_Variable_3) == 0x0000F2, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_byte_Variable_4) == 0x0000F3, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_BreakPublishedFileID_ReturnValue) == 0x000100, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_BreakPublishedFileID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_struct_Variable_2) == 0x000110, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_BreakPublishedFileID_ReturnValue_1) == 0x000120, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_BreakPublishedFileID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, Temp_bool_Variable_3) == 0x000131, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_Less_IntInt_ReturnValue_1) == 0x000132, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000133, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_Less_IntInt_ReturnValue_2) == 0x000134, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, K2Node_CreateDelegate_OutputDelegate_4) == 0x000138, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_DownloadImage_ReturnValue) == 0x000148, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_DownloadImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_SubscribeItemAsync_ReturnValue) == 0x000150, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_SubscribeItemAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W, CallFunc_IsValid_ReturnValue_1) == 0x000159, "Member 'WorkshopItem_W_C_ExecuteUbergraph_WorkshopItem_W::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
